Repository: xobs/debian-installer
Catalog: doc/manual/po/*/administrivia.po
Languages: ko, pt, zh_cn

source: Administrivia
ko: 관리
zh_cn: 文案

source: About This Document
ko: 문서 정보
pt: Acerca deste Documento
zh_cn: 关于本文档

source: This manual was created for Sarge's debian-installer, based on the Woody installation manual for boot-floppies, which was based on earlier Debian installation manuals, and on the Progeny distribution manual which was released under GPL in 2003.
ko: 이 설명서는 사지의 데비안 설치 프로그램을 위해 만들어졌으며 이는 부트-플로피를 위한 우디 설치 설명서에 기반하고 있습니다. 또한 기반 설명서는 이전 데비안 설치 설명서와 2003년에 발표된 Progeny 배포본 설명서에 기반합니다.
pt: Este manual foi criado para o debian-installer do Sarge, baseado no manual de instalação do Woody para boot-floppies, que foi baseado em manuais de instalação anteriores, e no manual da distribuição Progeny, que foi lançado sob a GPL em 2003.
zh_cn: 本手册为 Sarge 版 debian-installer 创建，基于 Woody 版的软盘安装手册，而那份手册又是基于更早版本的 Debian 安装手册和 2003 年 GPL 协议下的 Progeny 分发手册。

source: This document is written in DocBook XML. Output formats are generated by various programs using information from the <classname>docbook-xml</classname> and <classname>docbook-xsl</classname> packages.
ko: 이 문서는 DocBook XML로 쓰여졌습니다. 출력 형식은 <classname>docbook-xml</classname>과 <classname>docbook-xsl</classname> 패키지에 있는 정보를 이용하는 다양한 프로그램에 의해 생성됩니다.
pt: Este Documento é escrito em DocBook XML. Os formatos exportados são gerados por vários programas que utilizam informação dos pacotes <classname>docbook-xml</classname> e <classname>docbook-xsl</classname>.
zh_cn: 本文档由 DocBook XML 写成。有很多程序可以使用 <classname>docbook-xml</classname> 和 <classname>docbook-xsl</classname> 包中的信息得到各种输出格式。

source: In order to increase the maintainability of this document, we use a number of XML features, such as entities and profiling attributes. These play a role akin to variables and conditionals in programming languages. The XML source to this document contains information for each different architecture &mdash; profiling attributes are used to isolate certain bits of text as architecture-specific.
ko: 이 문서의 유지보수성을 증가시키기 위하여 엔티티와 프로파일 속성과 같은 많은 XML 특성을 사용합니다. 이들은 프로그래밍 언어의 변수와 상수들과 유사한 역할을 합니다. 이 문서의 XML소스는 아키텍쳐 특정적인 몇몇의 텍스트를 분리하는데 사용하는 각기 다른 아키텍처 &mdash; 프로파일링 속성에 관한 정보를 담고 있습니다.
pt: Para aumentar a facilidade de manter este documento, usamos um número de capacidades do XML, tais como atributos de identidades e perfis. Estes últimos têm o papel semelhante a variáveis e condicionantes em linguagens de programação. A fonte em XML deste documento contém informação para cada arquitectura diferente &mdash; são utilizados perfis de atributos para isolar certas partes de texto que são específicos de cada arquitectura.
zh_cn: 为了提升本文档的可维护性，我们使用了一些 XML 的特性，比如 entities 和 profiling 属性。它们充当类似于编程语言中变量与条件的角色。本文档的 XML 源文件包含了各种硬件体系的信息 &mdash; profiling 属性用于分开体系相关的文档碎片。

source: Contributing to This Document
ko: 이 문서에 기여하기
pt: Contribuir para este documento
zh_cn: 帮助本文档

source: If you have problems or suggestions regarding this document, you should probably submit them as a bug report against the package <classname>debian-installer-manual</classname>. See the <classname>reportbug</classname> package or read the online documentation of the <ulink url="&url-bts;">Debian Bug Tracking System</ulink>. It would be nice if you could check the <ulink url="&url-bts;debian-installer-manual">open bugs against debian-installer-manual</ulink> to see whether your problem has already been reported. If so, you can supply additional corroboration or helpful information to <email><replaceable>XXXX</replaceable>@bugs.debian.org</email>, where <replaceable>XXXX</replaceable> is the number for the already-reported bug.
ko: 이 문서와 관련된 문제점이나 제안이 있다면 <classname>debian-installer-manual</classname>패키지를 이용한 버그리포트를 우리에게 보내주십시오. <classname>reportbug</classname> 패키지나 <ulink url="&url-bts;">Debian Bug Tracking System</ulink>의 온라인 문서를 보십시오. 당신의 문제점이 이미 보고되었는지를 보기 위해 <ulink url="&url-bts;debian-installer-manual">open bugs against debian-installer-manual</ulink>를 검토해 보시는 것도 좋습니다. 그러면 <email><replaceable>XXXX</replaceable>@bugs.debian.org</email>으로 추가적인 확증이나 유익한 정보를 제공할 수 있습니다. 여기서 <replaceable>XXXX</replaceable>는 이미 보고된 버그의 숫자입니다.
pt: Se tem problemas ou sugestões relacionadas com este documento, deverá submeter um relatório de erro deste pacote <classname>debian-installer-manual</classname>. Veja o pacote <classname>reportbug</classname> ou leia a documentação online do <ulink url="&url-bts;">Debian Bug Tracking System</ulink>. Seria melhor se primeiro pudesse verificar os <ulink url="&url-bts;debian-installer-manual"> relatórios de erro existentes acerca do debian-installer-manual</ulink> para verificar se o seu problema já foi detectado. Caso seja o caso, poderá fornecer informação adicional de confirmação ou ajuda para <email><replaceable>XXXX</replaceable>@bugs.debian.org</email>, onde <replaceable>XXXX</replaceable> é o numero para o erro já comunicado.
zh_cn: 对于本文档，如果您有问题或者建议，您该提交关于包 <classname>debian-installer-manual</classname>的 bug 报告。参见 <classname>reportbug</classname>包或者阅读<ulink url="&url-bts;">Debian Bug Tracking System</ulink>的在线文档。良好的习惯做法是先检查 <ulink url="&url-bts;debian-installer-manual">关于 debian-installer-manual 处于 open 状态的 bug</ulink>了解是否您遇到 的问题已经被其他人报告。如果有，您可以提供确认或者帮助信息到 <email><replaceable>XXXX</replaceable>@bugs.debian.org</email>, 其中 <replaceable>XXXX</replaceable>代表已报告的 bug 号码。

source: Better yet, get a copy of the DocBook source for this document, and produce patches against it. The DocBook source can be found at the <ulink url="&url-d-i-websvn;">debian-installer WebSVN</ulink>. If you're not familiar with DocBook, don't worry: there is a simple cheatsheet in the manuals directory that will get you started. It's like html, but oriented towards the meaning of the text rather than the presentation. Patches submitted to the debian-boot mailing list (see below) are welcomed. For instructions on how to check out the sources via SVN, see <ulink url="&url-d-i-readme;">README</ulink> from the source root directory.
ko: 이 문서의 Docbook소스의 사본을 얻어 패치를 생성합니다. Docbook 소스는 <ulink url="&url-d-i-websvn;">debian-installer WebSVN</ulink>에서 발견할 수 있습니다. Docbook이 익숙하지 않더라도 걱정하지 마십시오. 메뉴얼 디렉토리에 간단한 쪽지가 있습니다. HTML와 마찬가지로 화면표시보다 텍스트의 의미에 중심을 두고 있습니다.패치는 아래 나와있는 debian-boot 메일링 리스트로 보내주십시오. SVN을 이용하여 소스를 가져오는 방법에 대한 설명은 소스가 있는 최상위디렉토리에서 <ulink url="&url-d-i-readme;">README</ulink>를 보십시오.
pt: Melhor ainda, obtenha uma cópia da fonte do DocBook deste documento, e produza patches para ele. A fonte em DocBook deste documento pode ser encontrada no <ulink url="&url-d-i-websvn;">WebSVN do debian-installer</ulink>. Se não está familiarizado com o DocBook, não se preocupe: existe um simples texto no directório manual que o irá ajudar a começar. É como html, mas orientado para o significado do texto mais do que a sua apresentação. Patches submetidos para a mailing list debian-boot (veja abaixo) são bem-vindos. Para instruções de como descarregar as fontes via SVN, veja o <ulink url="&url-d-i-readme;">README</ulink> do directório da fonte.
zh_cn: 更佳的途径是取得一份本文档的 DocBook 源文件拷贝，给它打一个补丁。DocBook 的 源文件位于 <ulink url="&url-d-i-websvn;">debian-installer WebSVN</ulink>。如果您不熟悉 DocBook，别发愁：在 manuals 目录下有一个简单的 cheatsheet 文件 可以帮您开始。它像 html 文件，但更侧重于文字的含义而不是显示。欢迎将补丁提交到 debian-boot 邮件列表(见下)。关于如何从 SVN 检出(check out) 源文件，请参考源文件目录中的 <ulink url="&url-d-i-readme;">README</ulink> 。

source: Please do <emphasis>not</emphasis> contact the authors of this document directly. There is also a discussion list for &d-i;, which includes discussions of this manual. The mailing list is <email>debian-boot@lists.debian.org</email>. Instructions for subscribing to this list can be found at the <ulink url="&url-debian-lists-subscribe;">Debian Mailing List Subscription</ulink> page; or you can browse the <ulink url="&url-debian-list-archives;">Debian Mailing List Archives</ulink> online.
ko: 절대로 이 문서의 저자에게 직접 <emphasis>접촉하지 마십시오</emphasis>이 메뉴얼에 대한 토론을 하고 있는 &d-i; 토론 리스트가 있습니다.이 메일링 리스트는 <email>debian-boot@lists.debian.org</email>입니다.이 리스트에 가입하는 절차는 <ulink url="&url-debian-lists-subscribe;">Debian Mailing List Subscription</ulink> 페이지에서 볼 수 있으며,<ulink url="&url-debian-list-archives;">Debian Mailing List Archives</ulink>를 온라인으로 볼 수 있습니다.
pt: Por favor <emphasis>não</emphasis> contacte os autores deste documento directamente. Existe também uma lista de discussão para o &d-i;, que inclui discussões sobre este manual. A mailing list é <email>debian-boot@lists.debian.org</email>. Instruções para a subscrição desta lista podem ser encontradas na página de <ulink url="&url-debian-lists-subscribe;">Subscrições de Mailing Lists da Debian</ulink>; ou então, pode navegar o <ulink url="&url-debian-list-archives;">Arquivo de Mailing List da Debian</ulink> online.
zh_cn: 请 <emphasis>勿</emphasis> 直接联系本文档的作者。还有一个关于 &d-i; 的邮件列表，它包含本手册的讨论。这个邮件列表是 <email>debian-boot@lists.debian.org</email>。订阅此邮件列表的指引在 <ulink url="&url-debian-lists-subscribe;">Debian Mailing List Subscription</ulink>页面；您也可以在线浏览<ulink url="&url-debian-list-archives;">Debian Mailing List Archives</ulink> 。

source: Major Contributions
ko: 중요 기부자들
pt: Maiores Contribuições
zh_cn: 主要贡献人员

source: This document was originally written by Bruce Perens, Sven Rudolph, Igor Grobman, James Treacy, and Adam Di Carlo. Sebastian Ley wrote the Installation Howto. Many, many Debian users and developers contributed to this document. Particular note must be made of Michael Schmitz (m68k support), Frank Neumann (original author of the <ulink url="&url-m68k-old-amiga-install;">Amiga install manual</ulink>), Arto Astala, Eric Delaunay/Ben Collins (SPARC information), Tapio Lehtonen, and Stéphane Bortzmeyer for numerous edits and text. We have to thank Pascal Le Bail for useful information about booting from USB memory sticks. Miroslav Kuře has documented a lot of the new functionality in Sarge's debian-installer.
ko: 이 문서는 설치 하우투를 작성한 Bruce Perens, Sven Rudolph, Igor Grobman, James Treacy, and Adam Di Carlo. Sebastian Ley가 작성하였습니다. 매우 많은 데비안 사용자와 개발자가 이 문서에 기여를 하였습니다. 특수한 노트는 Michael Schmitz (m68k support), Frank Neumann (<ulink url="&url-m68k-old-amiga-install;">Amiga install manual</ulink>의 원래 저자), Arto Astala, Eric Delaunay/Ben Collins (SPARC information), Tapio Lehtonen, and Stéphane Bortzmeyer가 만들어야 하였습니다.우리는 USB메모리 스틱에서 부팅하는 것에 대한 유용한 정보를 보내준 Pascal Le Bail에 감사합니다.Miroslav Kuře는 Sarge의 데비안 설치자의 많은 새로운 기능성에 대한 문서화를 해주었습니다.
pt: Este Documento foi escrito originalmente por Bruce Perens, Sven Rudolph, Igor Grobman, James Treacy, e Adam Di carlo. Sebastian Ley escreveu o Howto de Instalação. Muitos, muitos utilizadores e programadores de Debian contribuíram para este documento. Deve ser feita uma nota especial para Michael Schimtz (suporte para m68k), Frank Neummann (Autor original do <ulink url="&url-m68k-old-amiga-install;">manual de instalação para Amiga</ulink>), Arto Astala, Eric Delaunay/Ben Collins (informação sobre SPARC), Tapio Lehtonen, e Stéphane Bortzmeyer pelas numerosas edições e textos. Nós temos que agradecer a Pascal Le Bail que informação útil sobre como iniciar a partir de drives USB. Miroslav Kuře documentou muitas das novas funcionalidades do debian-installer do Sarge.
zh_cn: 本文档最初版本由 Bruce Perens, Sven Rudolph, Igor Grobman, James Treacy 和 Adam Di Carlo 撰写。Sebastian Ley 撰写了 Installation Howto。有许许多多的 Debian 用户和开发人员给本文档提供帮助。特别是 Michael Schmitz (m68k 支持)，Frank Neumann ( <ulink url="&url-m68k-old-amiga-install;">Amiga 安装手册</ulink>的最初作者)，Arto Astala, Eric Delaunay/Ben Collins (SPARC 信息)，Tapio Lehtonen 和 Stéphane Bortzmeyer 做了大量的编辑与文稿。我们还要感谢 Pascal Le Bail 提供有关从 USB 内存盘上启动的相关信息。Miroslav Kuře 为 Sarge 版 debian-installer 的大量新功能编写文档。

source: Extremely helpful text and information was found in Jim Mintha's HOWTO for network booting (no URL available), the <ulink url="&url-debian-faq;">Debian FAQ</ulink>, the <ulink url="&url-m68k-faq;">Linux/m68k FAQ</ulink>, the <ulink url="&url-sparc-linux-faq;">Linux for SPARC Processors FAQ</ulink>, the <ulink url="&url-alpha-faq;">Linux/Alpha FAQ</ulink>, amongst others. The maintainers of these freely available and rich sources of information must be recognized.
ko: 가장 유용한 텍스트와 정보는 Jim Mintha의 네트워크 부팅에 관한 HOWTO문서(URL없음)와 the <ulink url="&url-debian-faq;">Debian FAQ</ulink>, the <ulink url="&url-m68k-faq;">Linux/m68k FAQ</ulink>, the <ulink url="&url-sparc-linux-faq;">Linux for SPARC Processors FAQ</ulink>, the <ulink url="&url-alpha-faq;">Linux/Alpha FAQ</ulink>에서 발견할 수 있습니다.이 자유롭게 사용가능하고 많은 정보 소스의 메인테이너는 인정될 필요가 있습니다.
pt: Textos e informação extremamente útil foi encontrada no HOWTO de Jim Mintha para iniciar utilizando a rede (URL não disponível), no <ulink url="&url-debian-faq;">Debian FAQ</ulink>, no <ulink url="&url-m68k-faq;">Linux/m68k FAQ</ulink>, no <ulink url="&url-sparc-linux-faq;">Linux for SPARC Processors FAQ</ulink>, no <ulink url="&url-alpha-faq;">Linux/Alpha FAQ</ulink>, entre outros. Os maintainers destes recursos disponíveis livremente e ricas fontes de informação devem ser reconhecidos.
zh_cn: 我们还从下列文档中获得了非常有用的文稿和信息，它们是 Jim Mintha's 的网络启动 HOWTO(没有有效的URL)，<ulink url="&url-debian-faq;">Debian FAQ</ulink>，<ulink url="&url-m68k-faq;">Linux/m68k FAQ</ulink>，<ulink url="&url-sparc-linux-faq;">Linux for SPARC Processors FAQ</ulink>，<ulink url="&url-alpha-faq;">Linux/Alpha FAQ</ulink>，以及其他。这些文档的维护者们提供了丰富的信息源必须要说明。

source: The section on chrooted installations in this manual (<xref linkend="linux-upgrade"/>) was derived in part from documents copyright Karsten M. Self.
ko: 이 메뉴얼에서 격리된 설치에 관한 장<xref linkend="linux-upgrade" />은 Karsten M.Self가 저작권을 가진 문서에서 가져왔습니다.
pt: Neste manual a secção de instalações chrooted (<xref linkend="linux-upgrade"/>) derivou em parte de documentos com copyright de Karsten M. Self.
zh_cn: 本手册中有关 chroot 安装的内容(<xref linkend="linux-upgrade"/>)来源于 Karsten M. Self 版权所有的文档。

source: The section on installations over plip in this manual (<xref linkend="plip"/>) was based on the <ulink url="&url-plip-install-howto;">PLIP-Install-HOWTO</ulink> by Gilles Lamiral.
ko: 이 메뉴얼에서 PLIP 기반 설치에 관한 장<xref linkend="plip" />은 Gilles Lamiral이 쓴 <ulink url="&url-plip-install-howto;">PLIP-Install-HOWTO</ulink>에 기반합니다.
pt: Neste manual a secção de instalações através de plip (<xref linkend="plip"/> foi baseada no <ulink url="&url-plip-install-howto;">PLIP-Install-HOWTO</ulink> por Gilles Lamiral.
zh_cn: 手册里面的使用 plip 安装一节 (<xref linkend="plip"/>) 基于 Gilles Lamiral 的 <ulink url="&url-plip-install-howto;">PLIP-Install-HOWTO</ulink>。

source: Trademark Acknowledgement
ko: 상표권 표시
pt: Reconhecimento de Marcas Registadas
zh_cn: 商标确认

source: All trademarks are property of their respective trademark owners.
ko: 모든 상표는 각각의 상표 소유자의 자산입니다.
pt: Todas as marcas registadas são propriedade dos seus respectivos donos.
zh_cn: 所有商标的所有权归各自的商标所有者。
