Repository: xobs/debian-installer
Catalog: doc/manual/po/*/boot-installer.po
Languages: ko, pt, zh_tw

source: Not yet written.
pt: Ainda não escrito.
zh_tw: 還沒有完成

source: Booting OldWorld PowerMacs from MacOS
ko: MacOS에서 OldWorld PowerMac 부팅하기
pt: Iniciando OldWorld PowerMacs a partir de MacOS
zh_tw: 從 OldWorld PowerMacs 的 MacOS 上開機

source: If you set up BootX in <xref linkend="files-oldworld"/>, you can use it to boot into the installation system. Double click the <guiicon>BootX</guiicon> application icon. Click on the <guibutton>Options</guibutton> button and select <guilabel>Use Specified RAM Disk</guilabel>. This will give you the chance to select the <filename>ramdisk.image.gz</filename> file. You may need to select the <guilabel>No Video Driver</guilabel> checkbox, depending on your hardware. Then click the <guibutton>Linux</guibutton> button to shut down MacOS and launch the installer.
ko: <xref linkend="files-oldworld"/>의 BootX를 설정하는 경우, BootX를 이용해 설치 시스템을 부팅할 수 있습니다. <guiicon>BootX</guiicon> 애플리케이션 아이콘을 더블 클릭하십시오. <guibutton>Options</guibutton> 단추를 클릭해 <guilabel>Use Specified RAM Disk</guilabel>를 선택하십시오. 그러면 <filename>ramdisk.image.gz</filename> 파일을 선택할 수 있습니다. 하드웨어에 따라서는 <guilabel>No Video Driver</guilabel> 체크박스를 선택해야 할 수도 있습니다. 그리고 <guibutton>Linux</guibutton> 단추를 눌러 MacOS를 끝내고 설치 프로그램을 시작하십시오.
pt: Se configurar BootX na <xref linkend="files-oldworld"/>, pode utilizá-lo para iniciar o sistema de instalação. Fça duplo clique no ícone da aplicação <guiicon>BootX</guiicon>. Clique no botão das opções <guibutton>Options</guibutton> e seleccione a checkbox <guilabel>No Video Driver</guilabel>, dependendo do seu hardware. Clique então no botão <guibutton>Linux</guibutton> para desligar o MacOS e o instalador iniciar.
zh_tw: 如果您在 <xref linkend="files-oldworld"/> 中設定好了 BootX，您可以使用它啟動並進入安裝系統。雙擊 <guiicon>BootX</guiicon> 應用程式圖示。點擊 <guibutton>Options</guibutton> 按鈕並且選擇 <guilabel>Use Specified RAM Disk</guilabel>。這將可以讓您選擇 <filename>ramdisk.image.gz</filename> 檔案。也許根據您的硬體情況需要選擇 <guilabel>No Video Driver</guilabel> 選擇框。然後點擊 <guibutton>Linux</guibutton> 按鈕，來關閉 MacOS 以及啟動安裝程序。

source: Booting NewWorld Macs from OpenFirmware
ko: OpenFirmware에서 NewWorld Mac 부팅하기
pt: Iniciando Macs NewWorld a partir de OpenFirmware
zh_tw: 從 NewWorld Macs 的 OpenFirmware 開機

source: You will have already placed the <filename>vmlinux</filename>, <filename>initrd.gz</filename>, <filename>yaboot</filename>, and <filename>yaboot.conf</filename> files at the root level of your HFS partition in <xref linkend="files-newworld"/>. Restart the computer, and immediately (during the chime) hold down the <keycap>Option</keycap>, <keycap>Command (cloverleaf/Apple)</keycap>, <keycap>o</keycap>, and <keycap>f</keycap> keys all together. After a few seconds you will be presented with the Open Firmware prompt. At the prompt, type <informalexample><screen> 0 &gt; boot hd:<replaceable>x</replaceable>,yaboot </screen></informalexample> replacing <replaceable>x</replaceable> with the partition number of the HFS partition where the kernel and yaboot files were placed, followed by a &enterkey;. On some machines, you may need to use <userinput>ide0:</userinput> instead of <userinput>hd:</userinput>. In a few more seconds you will see a yaboot prompt <informalexample><screen> boot: </screen></informalexample> At yaboot's <prompt>boot:</prompt> prompt, type either <userinput>install</userinput> or <userinput>install video=ofonly</userinput> followed by a &enterkey;. The <userinput>video=ofonly</userinput> argument is for maximum compatibility; you can try it if <userinput>install</userinput> doesn't work. The Debian installation program should start.
ko: <xref linkend="files-newworld"/>의 <filename>vmlinux</filename>, <filename>initrd.gz</filename>, <filename>yaboot</filename>, <filename>yaboot.conf</filename> 파일을 HFS 파티션의 맨 위에 저장해 놓으십시오. 컴퓨터를 다시 시작하고, 즉시 (삐 소리가 날 때) <keycap>Option</keycap>, <keycap>Command (클로버잎/Apple)</keycap>, <keycap>o</keycap>, <keycap>f</keycap> 키를 동시에 누르고 있으십시오. 몇 초 후에 Open Firmware 프롬프트가 나타납니다. 프롬프트에서 다음을 입력하십시오: <informalexample><screen> 0 &gt; boot hd:<replaceable>x</replaceable>,yaboot </screen></informalexample> 여기서 <replaceable>x</replaceable>를 커널과 yaboot 파일이 들어 있는 HFS 파티션의 파티션 번호로 바꾸시고, &enterkey;를 누르십시오. 일부 시스템에서는, <userinput>hd:</userinput> 대신에 <userinput>ide0:</userinput>을 써야 할 수도 있습니다. 몇 초 안에 yaboot 프롬프트를 볼 수 있을 겁니다 <informalexample><screen> boot: </screen></informalexample> yaboot의 <prompt>boot:</prompt> 프롬프트에서 <userinput>install</userinput> 혹은 <userinput>install video=ofonly</userinput> 명령을 입력하고 &enterkey;를 누르십시오. <userinput>video=ofonly</userinput> 인수는 <userinput>install</userinput>이 동작하지 않을 때에 호환성을 최대화하기 위해 시도해 볼 수 있습니다. 그러면 데비안 설치 프로그램이 시작합니다.
pt: Já terá colocado os ficheiros <filename>vmlinux</filename>, <filename>initrd.gz</filename>, <filename>yaboot</filename>, e <filename>yaboot.conf</filename> ao nível da raiz da sua partição HFS na <xref linkend="files-newworld"/>. Reinicie o computador, e (durante o apito) pressione em simultâneo o conjunto de teclas constituído por <keycap>Option</keycap>, <keycap>Command (cloverleaf/Apple)</keycap>, <keycap>o</keycap>, e <keycap>f</keycap>. Após alguns segundos surgirá uma prompt de Open Firmware. No prompt, digite <informalexample><screen> 0 &gt; boot hd:<replaceable>x</replaceable>,yaboot </screen></informalexample> substituindo <replaceable>x</replaceable> pelo número da partição HFS onde os ficheiros do kernel e do yaboot foram colocados, pressione &enterkey; em seguida. Em algumas máquinas , poderá precisar de utilizar <userinput>ide0:</userinput> em vez de <userinput>hd:</userinput>. Em alguns segundos visualizará o prompt do yaboot <informalexample><screen> boot: </screen></informalexample> No prompt do yaboot <prompt>boot:</prompt>, digite o <userinput>install</userinput> ou <userinput>install video=ofonly</userinput>, seguindo da tecla &enterkey;. O argumento <userinput>video=ofonly</userinput> é para um máximo de compatibilidade; poderá tentar utiliza-lo se <userinput>install</userinput> não funcionar.
zh_tw: 您也許已經按照 <filename>vmlinux</filename>, <filename>initrd.gz</filename>, <filename>yaboot</filename> 和 <filename>yaboot.conf</filename> 在 HFS 分割區的根層次放置好了 <xref linkend="files-newworld"/> 檔案。請重新啟動電腦，並且立即 (在發聲時) 同時按住 <keycap>Option</keycap>, <keycap>Command (cloverleaf/Apple)</keycap>, <keycap>o</keycap>, 和 <keycap>f</keycap> 鍵。過幾秒鐘後，將進入 Open Firmware 提示符號。在提示符號下，輸入： <informalexample><screen> 0 &gt; boot hd:<replaceable>x</replaceable>,yaboot </screen></informalexample> 以放置核心和 yaboot 檔案的 HFS 分割區號來代替 <replaceable>x</replaceable> 然後按下 &enterkey;。在某些機器上，您也許需要時用 <userinput>ide0:</userinput> 來代替 <userinput>hd:</userinput>，在接下來的幾秒鐘內，將會看到一個提示符號 <informalexample><screen> boot: </screen></informalexample> 在 yaboot 的 <prompt>boot:</prompt> 提示符號下，輸入 <userinput>install</userinput> 或者 <userinput>install video=ofonly</userinput> 然後點擊 &enterkey;。 <userinput>video=ofonly</userinput> 參數是用於最大可能的相容性﹔您可以在 <userinput>install</userinput> 無法運作的情況下嘗試使用它。Debian 安裝程式應該立刻啟動。

source: Booting from USB memory stick
ko: USB 메모리 스틱에서 부팅하기
pt: Iniciar a partir de um stick de memória USB
zh_tw: 從 USB 隨身碟開機

source: Currently, NewWorld PowerMac systems are known to support USB booting.
ko: 현재 NewWorld PowerMacs 시스템은 USB 부팅을 지원한다고 알려져 있습니다.
pt: Actualmente, os sistemas NewWorld PowerMac são conhecidos por suportarem iniciar de USB.
zh_tw: 目前，New World PowerMac 系統支援從 USB 開機。

source: Make sure you have prepared everything from <xref linkend="boot-usb-files"/>. To boot a Macintosh system from a USB stick, you will need to use the Open Firmware prompt, since Open Firmware does not search USB storage devices by default. To get to the prompt, hold down <keycombo><keycap>Command</keycap> <keycap>Option</keycap> <keycap>o</keycap> <keycap>f</keycap></keycombo> all together while booting (see <xref linkend="invoking-openfirmware"/>).
ko: <xref linkend="boot-usb-files"/>에 있는 모든 걸 준비해야 합니다. Macintosh 시스템을 USB 스틱에서 부팅하려면, Open Firmware는 USB 저장 장치를 검색하지 않기 때문에 프롬프트를 직접 사용해야 합니다. 프롬프트가 나오게 하려면, <keycombo><keycap>Command</keycap> <keycap>Option</keycap> <keycap>o</keycap> <keycap>f</keycap></keycombo> 키를 부팅하는 동안 동시에 누르고 계십시오. (<xref linkend="invoking-openfirmware"/> 참고)
pt: Certifique-se de que preparou tudo a partir da <xref linkend="boot-usb-files"/>. Para iniciar um sistema Macintosh a partir de um stick USB, vai precisar de utilizar o prompt de Open Firmware, desde que o Open Firmware não procure dispositivo de armazenamento USB por omissão. Para chegar à prompt, pressione em conjunto a seguinte combinação de teclas <keycombo><keycap>Command</keycap> <keycap>Option</keycap> <keycap>o</keycap> <keycap>f</keycap></keycombo> enquanto inicia (veja a <xref linkend="invoking-openfirmware"/>).
zh_tw: 確認您已經準備就緒 <xref linkend="boot-usb-files"/>。要從 USB 隨身碟開機 Macintosh 系統，即使 Open Firmware 預設不搜索 USB 隨身碟設備，您也需要使用 Open Firmware 提示符號。要得到提示符號，在啟動時按住 <keycombo><keycap>Command</keycap> <keycap>Option</keycap> <keycap>o</keycap> <keycap>f</keycap></keycombo> (請參閱 <xref linkend="invoking-openfirmware"/>)。

source: You will need to work out where the USB storage device appears in the device tree, since at the moment <command>ofpath</command> cannot work that out automatically. Type <userinput>dev / ls</userinput> and <userinput>devalias</userinput> at the Open Firmware prompt to get a list of all known devices and device aliases. On the author's system with various types of USB stick, paths such as <filename>usb0/disk</filename>, <filename>usb0/hub/disk</filename>, <filename>/pci@f2000000/usb@1b,1/disk@1</filename>, and <filename>/pci@f2000000/usb@1b,1/hub@1/disk@1</filename> work.
ko: 장치 트리에서 USB 저장 장치가 나타나는 위치를 조정할 필요가 있습니다. 현재는 <command>ofpath</command>에서 자동으로 조정하지 못하기 때문입니다. Open Firmware 프롬프트에서 <userinput>dev / ls</userinput> 및 <userinput>devalias</userinput> 명령으로 모든 장치와 장치 별명의 목록을 보십시오. 예를 들어 문서 저자의 시스템에는 <filename>usb0/disk</filename>, <filename>usb0/hub/disk</filename>, <filename>/pci@f2000000/usb@1b,1/disk@1</filename>, 그리고 <filename>/pci@f2000000/usb@1b,1/hub@1/disk@1</filename>이 동작하고 있습니다.
pt: Terá de utilizar onde aparece o dispositivo de armazenamento USB na árvore de dispositivos, dado que no momento <command>ofpath</command> não o consegue utilizar de uma maneira automática. Digite no prompt de OpenFirmware <userinput>dev / ls</userinput> e <userinput>devalias</userinput> para conseguir a lista de todos os dispositivos e respectivos alias conhecidos. No sistema autor com vários stick USB, localizações como <filename>usb0/disk</filename>, <filename>usb0/hub/disk</filename>, <filename>/pci@f2000000/usb@1b,1/disk@1</filename>, e <filename>/pci@f2000000/usb@1b,1/hub@1/disk@1</filename> funcionam.
zh_tw: 您還需要算出 USB 隨身碟設備在設備樹上的位置，因為現在 <command>ofpath</command> 無法自動計算。鍵入 <userinput>dev / ls</userinput> 和 <userinput>devalias</userinput> 到 Open Firmware 提示符號下，得到所有的已知設備和設備別名。在筆者的系統上有各種 USB 隨身碟，路徑諸如 <filename>usb0/disk</filename>, <filename>usb0/hub/disk</filename>, <filename>/pci@f2000000/usb@1b,1/disk@1</filename>，和 <filename>/pci@f2000000/usb@1b,1/hub@1/disk@1</filename> 。

source: Having worked out the device path, use a command like this to boot the installer: <informalexample><screen> boot <replaceable>usb0/disk</replaceable>:<replaceable>2</replaceable>,\\:tbxi </screen></informalexample> The <replaceable>2</replaceable> matches the Apple_HFS or Apple_Bootstrap partition onto which you copied the boot image earlier, and the <userinput>,\\:tbxi</userinput> part instructs Open Firmware to boot from the file with an HFS file type of "tbxi" (i.e. <command>yaboot</command>) in the directory previously blessed with <command>hattrib -b</command>.
ko: 장치 경로를 조정하고 나면, 다음과 같은 명령으로 설치 프로그램을 시작하십시오: <informalexample><screen> boot <replaceable>usb0/disk</replaceable>:<replaceable>2</replaceable>,\\:tbxi </screen></informalexample> 여기서 <replaceable>2</replaceable>는 앞에서 부트 이미지를 복사해 놓은 Apple_HFS 혹은 Apple_Bootstrap 파티션이고, <userinput>,\\:tbxi</userinput> 부분은 전에 <command>hattrib -b</command> 해 놓은 디렉토리에 있는 "tbxi" 타입의 HFS 파일에서 (예를 들어 <command>yaboot</command>) 부팅하도록 Open Firmware에 알려 주는 역할을 합니다.
pt: Tendo retirado a localização do dispositivo, utilize um comando como este para iniciar o instalador: <informalexample><screen> boot <replaceable>usb0/disk</replaceable>:<replaceable>2</replaceable>,\\:tbxi </screen></informalexample> O <replaceable>2</replaceable> coincide com a partição Apple_HFS ou Apple_Bootstrap para onde anteriormente copiou a imagem de arranque, e o <userinput>,\\:tbxi</userinput> parte que instrui o Open Firmware a iniciar a partir do ficheiro com um ficheiro HFS do tipo "tbxi" (ex.: <command>yaboot</command>) numa directoria anteriormente abençoada com <command>hattrib -b</command>.
zh_tw: 得到設備路徑之後，用類似下面的指令啟動安裝程式： <informalexample><screen> boot <replaceable>usb0/disk</replaceable>:<replaceable>2</replaceable>,\\:tbxi </screen></informalexample> <replaceable>2</replaceable> 吻合 Apple_HFS 或 Apple_Bootstrap 分割區上，之前所複製啟動映像，<userinput>,\\:tbxi</userinput> 部分指示 Open Firmware 從具有 ``tbxi'' 類型的 HFS 檔案開機(如 <command>yaboot</command>) 位於前面使用 bless 目錄 <command>hattrib -b</command>。

source: The system should now boot up, and you should be presented with the <prompt>boot:</prompt> prompt. Here you can enter optional boot arguments, or just hit &enterkey;.
ko: 시스템이 부팅하고, <prompt>boot:</prompt> 프롬프트가 나타납니다. 여기서 다른 부팅 파라미터가 필요하면 입력하고, 아니면 그냥 &enterkey;를 누르십시오.
pt: O sistema deve agora iniciar, e deve lhe ser apresentado o prompt <prompt>boot:</prompt>. Aqui pode inserir opcionalmente parâmetros de arranque. Aqui pode inserir parâmetros de arranque opcionais.
zh_tw: 系統應該可以開機，然後您會看到 <prompt>boot:</prompt> 提示符號。這裡您可以輸入啟動參數，或者只按下 &enterkey;。

source: This boot method is new, and may be difficult to get to work on some NewWorld systems. If you have problems, please file an installation report, as explained in <xref linkend="submit-bug"/>.
ko: 이 부팅 방법은 새로운 방법으로, 일부 NewWorld 시스템에서는 어려울 수도 있습니다. 문제가 있으면 설치 보고서를 <xref linkend="submit-bug"/>에 설명되어 있는 대로 제출해 주십시오.
pt: Este método de arranque é novo, e poderá ser difícil de o colocar a funcionar em alguns sistemas NewWorld. Se tiver dificuldades, por favor envie um ficheiro com o relatório de instalação, como é explicado na <xref linkend="submit-bug"/>.
zh_tw: 這個是新的啟動方法，可能無法在一些 NewWorld 系統上工作。如果您遇到問題，請寫下安裝報告，請參閱 <xref linkend="submit-bug"/>。

source: Currently, PReP and New World PowerMac systems support netbooting.
ko: 현재, PReP 및 New World PowerMac 시스템은 네트부팅을 지원합니다.
pt: Actualmente, sistemas PReP e NewWorld PowerMac suportam netbooting.
zh_tw: 目前來說，PReP 以及 New World PowerMac 系統支援網路開機。

source: On machines with Open Firmware, such as NewWorld Power Macs, enter the boot monitor (see <xref linkend="invoking-openfirmware"/>) and use the command <command>boot enet:0</command>. PReP and CHRP boxes may have different ways of addressing the network. On a PReP machine, you should try <userinput>boot <replaceable>server_ipaddr</replaceable>,<replaceable>file</replaceable>,<replaceable>client_ipaddr</replaceable></userinput>.
ko: NewWorld Power Mac과 같은 Open Firmware 기계에서는, 부트 모니터로 들어가서 (<xref linkend="invoking-openfirmware"/> 참고) <command>boot enet:0</command> 명령을 사용하십시오. PReP 및 CHRP 컴퓨터는 네트워크 위치를 지정하는 방법이 다릅니다. PReP 기계에서는, <userinput>boot <replaceable>server_ipaddr</replaceable>,<replaceable>file</replaceable>,<replaceable>client_ipaddr</replaceable></userinput>라고 시도해 보십시오.
pt: Em máquinas com Open Firmware, como as Mac NewWorld Power, entre no monitor de arranque (veja a <xref linkend="invoking-openfirmware"/>) e utilize o comando <command>boot enet:0</command>. As máquinas PReP and CHRP podem ter diferentes maneiras de endereçar a rede. Numa máquina PReP, deve tentar <userinput>boot <replaceable>server_ipaddr</replaceable>,<replaceable>file</replaceable>,<replaceable>client_ipaddr</replaceable></userinput>.
zh_tw: 在 Open Firmware 機器上，例如 NewWorld Power Macs，進入開機監視器 (請參閱 <xref linkend="invoking-openfirmware"/>) 並且使用指令 <command>boot enet:0</command>。PReP 以及 CHRP 可能使用不同的途徑來確認網路。在一台 PReP 機器上，您應該嘗試 <userinput>boot <replaceable>server_ipaddr</replaceable>,<replaceable>file</replaceable>,<replaceable>client_ipaddr</replaceable></userinput>。

source: Booting from floppies is supported for &arch-title;, although it is generally only applicable for OldWorld systems. NewWorld systems are not equipped with floppy drives, and attached USB floppy drives are not supported for booting.
ko: 플로피 부팅은 &arch-title;에서 지원하지만, 보통 OldWorld 시스템에서만 사용 가능합니다. NewWorld 시스템에는 플로피 드라이브가 없고, 부팅을 지원하지 않는 USB 플로피 드라이브만 붙어 있습니다.
pt: Arrancar a partir de disquetes é suportado para &arch-title;,·embora geralmente apenas aplicável a sistemas OldWorld. Sistemas NewWorld não são equipados com drives de disquetes, e drives de disquetes USB não são suportadas para arranque.
zh_tw: &arch-title; 支援從軟碟開機，儘管它本來只適合 OldWorld 系統。NewWorld 系統並沒有安裝軟碟機，而且加裝的 USB 軟碟並不支援開機。

source: To boot from the <filename>boot-floppy-hfs.img</filename> floppy, place it in floppy drive after shutting the system down, and before pressing the power-on button.
ko: <filename>boot-floppy-hfs.img</filename> 플로피에서 부팅하려면, 시스템을 끄고 전원 단추를 누르기 전에 플로피 드라이브에 넣으십시오.
pt: Para arrancar a partir de disquete <filename>boot-floppy-hfs.img</filename>, coloque-a no dispositivo de disquetes após ter desligado o sistema, e antes de o voltar a ligar.
zh_tw: 若需要從 <filename>boot-floppy-hfs.img</filename> 軟碟開機，請在關閉系統後、按下電源開關前把它放到軟碟機內。

source: For those not familiar with Macintosh floppy operations: a floppy placed in the machine prior to boot will be the first priority for the system to boot from. A floppy without a valid boot system will be ejected, and the machine will then check for bootable hard disk partitions.
ko: Macintosh 플로피 작업에 익숙하지 않은 분들을 위해: 부팅하기 전에 넣은 플로피가 첫 번째 부팅 우선 순위를 가집니다. 부팅 시스템이 없는 플로피는 튀어 나오게 되고, 부팅 가능한 하드 디스크 파티션을 찾게 됩니다.
pt: Para aqueles que não estão familiarizados com operações de disquetes em Macintosh: uma disquete colocada na máquina antes do arranque será a primeira prioridade para o sistema arrancar. Uma disquete sem um sistema de boot válido será ejectada e a máquina irá procurar por partições do disco rígido pelas quais possa arrancar.
zh_tw: 對於不熟悉 Macintosh 軟碟操作的人來說：一個放在軟碟機的軟碟將取得第一優先開機順序。一個沒有有效開機系統的軟碟將會被退出，並且機器將檢查硬碟分割區。

source: After booting, the <filename>root.bin</filename> floppy is requested. Insert the root floppy and press &enterkey;. The installer program is automatically launched after the root system has been loaded into memory.
ko: 부팅한 다음, <filename>root.bin</filename> 플로피를 요청합니다. 루트 플로피를 넣고 &enterkey;를 누르십시오. 루트 시스템을 메모리에 읽어들이면 설치 프로그램을 자동으로 시작합니다.
pt: Após re-iniciar, é pedida a disquete <filename>root.bin</filename>. Insira a disquete root e carregue em &enterkey;.O programa instalador é automaticamente lançado após o sistema root ter sido carregado para a memória.
zh_tw: 開機之後需要含有 <filename>root.bin</filename> 的軟碟。插入開機軟碟並且按下 &enterkey;。安裝程式將在根系統被裝入記憶體後自動啟動。

source: PowerPC Boot Parameters
ko: PowerPC 부팅 파라미터
pt: PowerPC parâmetros de arranque
zh_tw: PowerPC 開機參數

source: Many older Apple monitors used a 640x480 67Hz mode. If your video appears skewed on an older Apple monitor, try appending the boot argument <userinput>video=atyfb:vmode:6</userinput> , which will select that mode for most Mach64 and Rage video hardware. For Rage 128 hardware, this changes to <userinput>video=aty128fb:vmode:6</userinput> .
ko: 오래된 Apple 모니터는 다수가 640x480 67Hz 모드를 사용합니다. 오래된 Apple 모니터에서 화면이 찌그러진다면, <userinput>video=atyfb:vmode:6</userinput> 부팅 파라미터를 추가해 보십시오. 그러면 대부분의 Mach64와 Rage 비디오 하드웨어에 맞는 비디오 모드를 선택합니다. Rage 128 하드웨어의 경우에는, <userinput>video=aty128fb:videomode:6</userinput>이라고 하십시오.
pt: Muitos monitores antigos Apple utilizam o modo 640x480 67Hz. Se a sua imagem aparece enviesada num monitor Apple antigo, tente adicionar o argumento de arranque <userinput>video=atyfb:vmode:6</userinput>, que irá seleccionar esse modo para a maioria do hardware Mach64 e Rage. No hardware Rage 128, isto altera para <userinput>video=aty128fb:vmode:6</userinput> .
zh_tw: 許多比較老的 Apple 顯示器使用 640x480 67Hz 模式。如果您的畫面在這些老 Apple 顯示器上是扭曲的，請嘗試加入開機參數 <userinput>video=atyfb:vmode:6</userinput> 。它將為大多數 Mach64 和 Rage 顯示設備選擇合適的模式。對於 Rage 128 來說，請改變其值為 <userinput>video=aty128fb:vmode:6</userinput> 。

source: On machines with OpenBoot, simply enter the boot monitor on the machine which is being installed (see <xref linkend="invoking-openboot"/>). Use the command <userinput>boot net</userinput> to boot from a TFTP and RARP server, or try <userinput>boot net:bootp</userinput> or <userinput>boot net:dhcp</userinput> to boot from a TFTP and BOOTP or DHCP server. Some older OpenBoot revisions require using the device name, such as <userinput>boot le()</userinput>; these probably don't support BOOTP nor DHCP.
ko: OpenBoot 기계의 경우, 설치하려는 기계의 부트 모니터로 들어가십시오 (<xref linkend="invoking-openboot"/>). <userinput>boot net</userinput> 명령으로 TFTP 및 RARP 서버에서 부팅하거나 <userinput>boot net:bootp</userinput>나 <userinput>boot net:dhcp</userinput> 명령으로 TFTP와 BOOTP 혹은 DHCP 서버에서 부팅하십시오. 일부 오래된 OpenBoot 버전에서는 <userinput>boot le()</userinput>처럼 장치 이름을 써야 합니다; 그러한 버전에서는 BOOTP나 DHCP를 지원하지 않을 것입니다.
pt: Em máquinas com OpenBoot, entre simplesmente no monitor de arranque da máquina que está a ser instalada (veja a <xref linkend="invoking-openboot"/>). Utilize o comando <userinput>boot net</userinput> para iniciar a partir do servidor TFTP e RARP, ou tente <userinput>boot net:bootp</userinput> ou <userinput>boot net:dhcp</userinput> para iniciar a partir de um servidor TFTP e BOOTP ou DHCP. Algumas revisões antigas do OpenBoot requerem o nome do dispositivo, tal como <userinput>boot le()</userinput>; Estas, provavelmente, não suportam BOOTP nem DHCP.
zh_tw: 在有 OpenBoot 的機器上，簡單地進入安裝機器的開機監視器，(請參閱 <xref linkend="invoking-openboot"/>)。請使用指令 <userinput>boot net</userinput> 來從 TFTP 和 RARP 伺服器開機，或者也可以用 <userinput>boot net:bootp</userinput> 或 <userinput>boot net:dhcp</userinput> 來從 TFTP 和 DHCP 服務器開機。一些比較老的 OpenBoot 版本需要使用設備名稱， 例如 <userinput>boot le()</userinput>﹔這些可能不支援 DHCP。

source: Most OpenBoot versions support the <userinput>boot cdrom</userinput> command which is simply an alias to boot from the SCSI device on ID 6 (or the secondary master for IDE based systems). You may have to use the actual device name for older OpenBoot versions that don't support this special command. Note that some problems have been reported on Sun4m (e.g., Sparc 10s and Sparc 20s) systems booting from CD-ROM.
ko: 대부분의 OpenBoot 버전은 <userinput>boot cdrom</userinput> 명령을 지원합니다. 그러면 SCSI 장치의 6번 ID에서 (아니면 IDE 기반 시스템의 경우 secondary master에서) 부팅합니다. 이 명령을 지원하지 않는 옛날 OpenBoot 버전에서는 실제 장치 이름을 써야 할 수도 있습니다. Sun4m에서 (예를 들어 Sparc 10s 및 Sparc 20s) CD-ROM에서 부팅할 때 문제가 발견되었습니다.
pt: A maioria das versões OpenBoot suportam o comando <userinput>boot cdrom</userinput> que é simplesmente um alias para iniciar a partir de um dispositivo SCSI num ID6 (ou o master secundário para sistemas IDE). Você pode ter de utilizar o nome do dispositivo actual para versões antigas do OpenBoot que não suportam este especial comando. Note que têm sido reportadas algumas dificuldades em sistemas de arranque a partir de CD-ROM em Sun4m (e.g., Sparc 10s and Sparc 20s).
zh_tw: 大多數 OpenBoot 版本支援 <userinput>boot cdrom</userinput> 指令。它其實是從 ID 為 6 的 SCSI 設備進行開機的一個別名。(對於 IDE 系統來說，它是第二個主硬碟)。在較早的 OpenBoot 版本上，您可能必須使用實際的設備名稱，因為它們不支援這個特殊的指令。注意據說在 Sun4m (例如 Sparc 10s 和 Sparc 20s) 系統上用光碟開機有些問題。
