Repository: xobs/debian-installer
Catalog: doc/manual/po/*/boot-installer.po
Languages: ko, pt, zh_tw

source: Information on available boot methods and on boot parameters which might be useful can be found by pressing <keycap>F2</keycap> through <phrase condition="sarge"><keycap>F7</keycap></phrase><phrase condition="etch"><keycap>F8</keycap></phrase>. If you add any parameters to the boot command line, be sure to type the boot method (the default is <userinput>linux</userinput>) and a space before the first parameter (e.g., <userinput>linux debconf/priority=medium</userinput>).
ko: <keycap>F2</keycap>에서 <phrase condition="sarge"><keycap>F7</keycap></phrase><phrase condition="etch"><keycap>F8</keycap></phrase>까지 누르다 보면 유용한 부팅 방법과 부팅 파라미터에 대한 정보를 볼 수 있습니다. 부팅 명령행에 파라미터를 넣으려면, 부팅 방법을 입력하는 걸 잊지 마시고 (기본값은 <userinput>linux</userinput>), 첫 번째 파라미터 앞에 공백을 넣으십시오 (예를 들어, <userinput>linux debconf/priority=medium</userinput>).
pt: A informação nos parâmetros de arranque disponíveis que podem ser úteis, podem ser encontrados ao pressionar <keycap>F2</keycap> até <phrase condition="sarge"><keycap>F7</keycap></phrase><phrase condition="etch"><keycap>F8</keycap></phrase>. Se adicionar algum parâmetro à linha de comandos do arranque, garanta que escreve o método de boot (o pré-definido é <userinput>linux</userinput>) e um espaço antes do primeiro parâmetro (e.g., <userinput>linux debconf/priority=medium</userinput>).
zh_tw: 有關開機參數的資訊可能會很有用。它可以透過 <keycap>F3</keycap> 到 <phrase condition="sarge"><keycap>F7</keycap></phrase><phrase condition="etch"><keycap>F8</keycap></phrase> 來得知。如果您加入任何參數至開機命令列，請確保在開機方法 (預設是 <userinput>linux</userinput>) 和第一個參數之間有一個空格 (例如 <userinput>linux floppy=thinkpad</userinput>)。如果您只鍵入 &enterkey;，這等同於輸入 <userinput>linux</userinput> 不附帶任何參數。

source: If you are installing the system via a remote management device that provides a text interface to the VGA console, you may not be able to see the initial graphical splash screen upon booting the installer; you may even not see the boot prompt. Examples of these devices include the text console of Compaq's <quote>integrated Lights Out</quote> (iLO) and HP's <quote>Integrated Remote Assistant</quote> (IRA). You can blindly press F1<footnote> <para> In some cases these devices will require special escape sequences to enact this keypress, for example the IRA uses <keycombo> <keycap>Ctrl</keycap> <keycap>F</keycap> </keycombo>,&nbsp;<keycap>1</keycap>. </para> </footnote> to bypass this screen and view the help text. Once you are past the splash screen and at the help text your keystrokes will be echoed at the prompt as expected. To prevent the installer from using the framebuffer for the rest of the installation, you will also want to add <userinput>debian-installer/framebuffer=false</userinput> to the boot prompt, as described in the help text.
ko: VGA 콘솔 텍스트 인터페이스 기능이 들어 있는 원격 관리 장치를 이용해 시스템을 설치하는 경우에는, 설치 프로그램이 부팅할 때 나타나는 최초의 그래픽 스플래시 화면을 볼 수 없을 수도 있습니다. 부팅 프롬프트조차 볼 수 없을 수도 있습니다. 그러한 장치는 Compaq의 <quote>integrated Lights Out</quote> (iLO) 및 HP의 <quote>integrated Remote Assistant</quote>가 있습니다. 화면을 보지 못하더라도 F1<footnote> <para> 어떤 경우 이스케이프 시퀀스를 이용해야 이 키를 누를 수 있습니다. 예를 들어 IRA는 <keycombo> <keycap>Ctrl</keycap> <keycap>F</keycap> </keycombo>,&nbsp;<keycap>1</keycap>을 사용합니다. </para> </footnote>을 누르면 그래픽 화면을 넘어가고 도움말 텍스트를 볼 수 있습니다. 스플래시 스크린이 넘어가면 도움말 텍스트에서 키를 누르면 그 키가 프롬프트에 쓰여집니다. 설치할 때 프레임버퍼를 사용하지 않으려면 도움말 텍스트에 표시된 것처럼 <userinput>debian-installer/framebuffer=false</userinput> 옵션을 부팅 프롬프트에 넘깁니다.
pt: Se está a instalar o sistema via um dispositivo de gestão remota que disponibiliza um interface de texto na consola VGA, você pode não conseguir ver o ecrã inicial quando iniciar o instalador; pode mesmo não ver a linha de comandos gráfica. Exemplos destes dispositivos incluem a consola de texto <quote>integrated Lights Out</quote> (iLO) da Compaq e <quote>Integrated Remote Assistant</quote> (IRA) da HP. Você pode às cegas carregar em F1 <footnote> <para>Em alguns casos estes dispositivos podem necessitar de sequências de escape especiais para fingir este pressionar de tecla, por exemplo a IRA utiliza <keycombo> <keycap>Ctrl</keycap> <keycap>F</keycap> </keycombo>,&nbsp;<keycap>1</keycap>. </para> </footnote> para ultrapassar este ecrã e ver o texto de ajuda. Uma vez ultrapassado o ecrã inicial e estando no ecrã de ajuda as suas tecla serão ecoados para a linha de comandos como é de esperar. Para prevenir o instalador de utilizar o framebuffer para o resto da instalação, você também vai querer adicionar à linha de comandos de arranque <userinput>debian-installer/framebuffer=false</userinput>, conforme é descrito no texto de ajuda.
zh_tw: 如果您透過提供 VGA 文字介面的遠端遙控設備來安裝系統，您可能無法看到安裝程式一開始顯示的版權圖形；您甚至可能看不到啟動提示號。這些設備例如康柏的 <quote>integrated Lights Out</quote> (iLO) 和 <quote>Integrated Remote Assistant</quote> (IRA) 的文字控制台。您可以直接按下 F1<footnote> <para> 在某些狀況下，這些設備需要特殊的跳脫字串來啟用這個按鍵，例如 IRA 使用 <keycombo> <keycap>Ctrl</keycap> <keycap>F</keycap> </keycombo>,&nbsp;<keycap>1</keycap>. </para> </footnote> 來跳過這個畫面，並且顯示說明畫面。只要您離開了圖標畫面並進入了說明文字畫面，您的按下的按鍵就會顯示在螢幕上。為了防止安裝程式在之後的安裝步驟中使用 framebuffer，您可能會加入 <userinput>debian-installer/framebuffer=false</userinput> 到啟動參數中，如同說明文字中描述的。

source: CD Contents
ko: CD 내용
pt: Conteúdo do CD
zh_tw: 光碟的內容

source: There are three basic variations of Debian Install CDs. The <emphasis>Business Card</emphasis> CD has a minimal installation that will fit on the small form factor CD media. It requires a network connection in order to install the rest of the base installation and make a usable system. The <emphasis>Network Install</emphasis> CD has all of the packages for a base install but requires a network connection to a Debian mirror site in order to install the extra packages one would want for a complete system . The set of Debian CDs can install a complete system from the wide range of packages without needing access to the network.
ko: 세 가지 종류의 데비안 설치 CD가 있습니다. <emphasis>Business Card</emphasis> CD는 작은 CD 미디어에 맞도록 만든 최소한의 설치 미디어입니다. 베이스를 설치하고 쓸만한 시스템을 만들려면 네트워크 연결이 필요합니다. <emphasis>Network Install</emphasis> CD는 베이스 설치에 필요한 모든 꾸러미가 들어 있지만 완전한 시스템에 필요한 추가 꾸러미를 설치하려면 데비안 미러 사이트에 네트워크 연결이 필요합니다. 데비안 CD 세트는 네트워크 접근 없이 여러 가지 꾸러미들을 완전히 설치할 수 있습니다.
pt: Há três variações básicas dos CDs de Instalação Debian. O CD <emphasis>Business Card</emphasis> tem a instalação mínima que irá caber nos mini-CDs. Requer uma ligação à rede, por forma a instalar o resto da instalação base e fazer um sistema utilizável. O CD <emphasis>Network Install</emphasis> tem todos os pacotes necessários para a instalação base, mas requer uma ligação à rede para um mirror Debian, por forma a instalar os pacotes extra que deseje para ter um sistema Debian completo. O conjunto de CDs Debian pode instalar o sistema completo a partir de uma variedade de pacotes sem necessitar de aceder à rede.
zh_tw: 有三種基本的 Debian 安裝光碟衍生品：<emphasis>名片式</emphasis>光碟具有最少量的安裝程式並且可以裝在一小張光碟上。它的安裝需要網路連接來安裝其他部分的基本安裝程式以建立一個可用的系統。<emphasis>網路安裝</emphasis>光碟具有所有基礎安裝所需要的套件但是它還是需要一個能連接到 Debian 鏡像網站的網路連接來安裝其他的軟體套件來建立一個完全的系統。Debian 光碟套件則可以不透過網路就可以安裝一個具有各種範圍軟體套件的完全系統。

source: The IA-64 architecture uses the next generation Extensible Firmware Interface (EFI) from Intel. Unlike the traditional x86 BIOS which knows little about the boot device other than the partition table and Master Boot Record (MBR), EFI can read and write files from FAT16 or FAT32 formatted disk partitions. This simplifies the often arcane process of starting a system. The system boot loader and the EFI firmware that supports it have a full filesystem to store the files necessary for booting the machine. This means that the system disk on an IA-64 system has an additional disk partition dedicated to EFI instead of the simple MBR or boot block on more conventional systems.
ko: IA-64 아키텍쳐에는 인텔에서 나온 차세대 Extensible Firmware Interface가 (EFI) 들어 있습니다. 전통적인 x86 BIOS는 파티션 테이블과 Master Boot Record (MBR) 외에는 부팅 장치에 대해 거의 아무것도 모르지만, EFI는 FAT16 혹은 FAT32 포맷된 디스크 파티션에 파일을 읽고 쓸 수 있습니다. 이 기능때문에 아주 복잡한 방법으로 시스템을 시작하는 과정도 단순하게 할 수 있습니다. EFI를 지원하는 시스템 부트 로더 및 EFI 펌웨어는 기계를 부팅하는 데 필요한 파일들을 저장하는 완전한 파일 시스템이 따로 있습니다. 즉 IA-64 시스템의 시스템 디스크에는 전통적인 시스템에서 쓰는 단순한 MBR이나 부트 블록이 아닌 EFI만 사용하는 전용 디스크 파티션이 있습니다.
pt: A arquitectura IA-64 usa a nova geração de Extensible Firmware Interface (EFI) da Intel. Ao contrário das BIOS dos x86 tradicionais, que conhece pouco acerca do dispositivo de arranque que não seja a tabela de partições e o Master Boot Record (MBR), EFI pode ler e escrever ficheiros a partir de partições de disco em FAT16 ou FAT32. Isto simplifica os arcaicos processos de iniciar um sistema mais comuns. O sistema de arranque e o firmware EFI que o suporta tem um sistema de ficheiros completo para guardar os ficheiros necessários ao arranque da máquina. Isto significa que o sistema de discos num sistema IA-64 tem uma partição de disco adicional dedicado ao EFI em vez do simples MBR ou do bloco de arranque em sistemas mais convencionais.
zh_tw: IA-64 使用 Intel 最新的可拓展韌體界面 (Extensible Firmware Interface, EFI)。與傳統的 x86 BIOS 只瞭解分割區表和主開機記錄 (MBR) 而不知道其他開機設備的特點不同，EFI 可以 對 FAT16 和 FAT32 格式的硬碟分割區進行讀寫操作。這個特點簡化了通常很難以理解的系統啟動過程。系統的 boot-loader 以及 EFI 韌體支援一個完全的檔案系統來保存啟動機器所需要的所有檔案。這意味著在一個 IA-64 系統上的系統磁碟具有一個附加的專門為 EFI 服務的磁碟分割區而不是像傳統系統上只是簡單的 MBR 或者開機塊記錄。

source: The Debian Installer CD contains a small EFI partition where the <command>ELILO</command> bootloader, its configuration file, the installer's kernel, and initial filesystem (initrd) are located. The running system also contains an EFI partition where the necessary files for booting the system reside. These files are readable from the EFI Shell as described below.
ko: 데비안 설치 CD에는 작은 EFI 파티션이 들어 있어서, 거기에 <command>ELILO</command> 부트로더, 그 설정 파일, 설치 프로그램 커널, 파일 시스템(initrd)이 들어 있습니다. 시스템에도 부팅하는 데 필요한 파일들이 들어 있는 EFI 파티션이 들어 있습니다. 이 파일은 아래에 설명한 방법으로 EFI Shell에서 읽을 수 있습니다.
pt: O Debian Installer CD contém uma partição EFI pequena, onde o gestor de arranque<command>ELILO</command> , o seu ficheiro de configuração, o kernel do instalador e o sistema de ficheiros iniciar (initrd) estão localizados. O sistema em execução também contém uma partição EFI onde os ficheiros necessários são lidos a partir da shell EFI descrita em baixo.
zh_tw: Debian CD 包含了一個小型版本的 EFI 分割區來放置其設定檔<command>ELILO</command>、安裝程式核心以及初始的檔案系統 (initrd)。運行的系統同時也包含了一個 EFI 分割區用於放置開機系統所需要的必要檔案。這些檔案可以從 EFI Shell 讀出，描述如下。

source: Most of the details of how <command>ELILO</command> actually loads and starts a system are transparent to the system installer. However, the installer must set up an EFI partition prior to installing the base system. Otherwise, the installation of <command>ELILO</command> will fail, rendering the system un-bootable. The EFI partition is allocated and formatted in the partitioning step of the installation prior to loading any packages on the system disk. The partitioning task also verifies that a suitable EFI partition is present before allowing the installation to proceed.
ko: <command>ELILO</command>에서 실제로 어떻게 시스템을 읽어들여서 시작하는 지에 대한 것들은 시스템 설치 프로그램과는 관련이 없습니다. 하지만 설치 프로그램에서는 베이스 시스템을 설치하기 전에 EFI 파티션을 설정해야 합니다. 그렇지 않으면 <command>ELILO</command> 설치가 실패해서, 시스템을 부팅할 수 없게 됩니다. 설치할 때 꾸러미를 설치하기 전에 파티션하는 단계에서 EFI 파티션을 만들고 포맷하게 됩니다. 설치를 계속하기 전에 파티션 작업에서 EFI 파티션이 있는 지 검사도 합니다.
pt: A maioria dos detalhes de como o <command>ELILO</command> carrega e inicia um sistema são transparentes para o instalador do sistema. No entanto, o instalador terá de configurar uma partição EFI antes de instalar o sistema base, De outra forma, a instalação do <command>ELILO</command> irá falhar, criando um sistema incapaz de arrancar. A partição EFI está alocada e formatada no passo relativo à partição da instalação anterior ao carregamento de quaisquer pacotes do disco de sistema. A tarefa de particionamento também verifica que uma partição EFI apropriada está presente antes de autorizar a continuação da instalação.
zh_tw: 大部分有關 <command>ELILO</command> 如何實際裝入和啟動系統的細節對系統安裝程式是透明的。但是，安裝程式必須設置 EFI 分割區優先級來安裝基本系統。否則 <command>ELILO</command> 的安裝將會失敗並且導致系統不可開機。EFI 分割區是是在分割步驟中被分割出來且格式化的，之後安裝程式就會宰入系統磁碟的所有軟體套件。分割步驟也會在繼續安裝步驟前檢查 EFI 分割區是否合適。

source: The EFI Boot Manager is presented as the last step of the firmware initialization. It displays a menu list from which the user can select an option. Depending on the model of system and what other software has been loaded on the system, this menu may be different from one system to another. There should be at least two menu items displayed, <command>Boot Option Maintenance Menu</command> and <command>EFI Shell (Built-in)</command>. Using the first option is preferred, however, if that option is not available or the CD for some reason does not boot with it, use the second option.
ko: 펌웨어 초기화의 마지막 단계에서 EFI 부트 매니저가 나타납니다. 메뉴 목록이 나와서 사용자가 그 중의 하나를 선택합니다. 시스템의 모델과 어떤 소프트웨어를 읽어들였느냐에 따라, 이 메뉴는 시스템마다 다릅니다. 최소한 두 개의 메뉴 항목이 있어야 합니다. <command>Boot Option Maintenance Menu</command> 및 <command>EFI Shell (Built-in)</command>입니다. 첫 번째 옵션을 사용하는 게 좋지만, 그 옵션이 없거나 CD가 부팅하지 않는다면 두 번째 옵션을 사용하십시오.
pt: O gestor de arranque EFI está presente como o último passo da inicialização do firmware. Mostra uma lista sob a forma de menu a partir da qual o utilizador pode seleccionar uma opção. Dependendo do modelo do sistema e qual o software carregado no sistema, este menu pode ser diferente de sistema para sistema. Deverá haver pelo menos dois itens mostrados, <command>Boot Option Maintenance Menu</command> e <command>EFI Shell (Built-in)</command>. O uso da primeira opção é preferível, no entanto, se tal opção não estiver disponível ou o CD, por alguma razão não a iniciar, use a segunda opção.
zh_tw: EFI Boot Manager 在韌體初始化的最後一步會被啟動。它顯示一個選單列表供使用者選擇。取決於系統的型號並且是否有其他的軟體已經被裝入系統，這個選單在不同系統上可能會不同。在每一個系統上，至少會有兩個選單項，<command>Boot Option Maintenance Menu</command> 與 <command>EFI Shell (Built-in)</command>。建議使用第一個，當然，若該選項不可用或者 CD 由於某種原因沒法啟動，使用第二個。

source: IMPORTANT
ko: 중요
pt: IMPORTANTE
zh_tw: 重要

source: The EFI Boot Manager will select a default boot action, typically the first menu choice, within a pre-set number of seconds. This is indicated by a countdown at the bottom of the screen. Once the timer expires and the systems starts the default action, you may have to reboot the machine in order to continue the installation. If the default action is the EFI Shell, you can return to the Boot Manager by running <command>exit</command> at the shell prompt.
ko: EFI Boot Manager에서 정해진 몇 초가 지나면 기본 부팅 동작을 (보통 메뉴에서 첫 번째) 선택합니다. 화면 아래의 카운트다운을 보면 알 수 있습니다. 타이머가 다 되면 기본 동작을 시작하고, 그러면 설치를 계속하기 위해 기계를 다시 부팅해야 할 수도 있습니다. 기본 액션이 EFI Shell인 경우 쉘 프롬프트에서 <command>exit</command> 명령을 실행해 Boot Manager로 돌아오십시오.
pt: O gestor de arranque EFI irá seleccionar uma acção de arranque por pré-definição, tipicamente a primeira escolha do menu, dentro de um tempo pré-determinado. Isto é indicado por uma contagem decrescente no fundo do ecrã. Mal o temporizador expire e o sistema inicia a acção pré-definida, poderá ter de reiniciar a máquina por forma a continuar a instalação. Se a acção por omissão for a shell EFI, poderá voltar ao gesto de arranque, se executar <command>exit</command> na prompt da shell.
zh_tw: EFI Boot Manager 會在預設的幾秒鐘之後選擇預設的啟動方式，一般是第一選單項。在螢幕底部會有倒計時顯示。時間一到，系統按預設方式啟動，這樣您也許需要重新啟動才能繼續安裝。如果預設是 EFI Shell，您可在提示符號下執行 <command>exit</command> 以返回 Boot Manager。

source: Option 1: Booting from the Boot Option Maintenance Menu
ko: 방법 1: Boot Option Maintenance Menu에서 부팅
pt: Opção 1: Iniciar a partir do Menu de Manutenção das Opções de Arranque
zh_tw: 選項 1: 從 Boot Option Maintenance Menu 啟動

source: Insert the CD in the DVD/CD drive and reboot the machine. The firmware will display the EFI Boot Manager page and menu after it completes its system initialization.
ko: CD를 DVD/CD 드라이브에 넣고 기계를 다시 부팅하십시오. 펌웨어가 시스템 초기화를 마치면 EFI Boot Manager 페이지와 메뉴를 표시합니다.
pt: Insira o CD na drive CD/DVD e reinicie a máquina. O firmware irá mostrar a página e menu do gestor de arranque EFI após completar o seu sistema de inicialização.
zh_tw: 插入光碟到 DVD/CD 光碟機，然後重啟機器。韌體在完成系統初始化後會顯示 EFI Boot Manager 頁面和選單。

source: Select <command>Boot Maintenance Menu</command> from the menu with the arrow keys and press <command>ENTER</command>. This will display a new menu.
ko: 메뉴에서 화살표로 <command>Boot Maintenance Menu</command>를 선택해 <command>ENTER</command>를 누르십시오. 그러면 다른 메뉴가 나타납니다.
pt: Seleccione <command>Boot Maintenance Menu</command> a partir do menu, usando as setas do seu teclado e pressionando <command>ENTER</command>. Isto irá mostrar um novo menu.
zh_tw: 透過方向鍵選擇 <command>Boot Maintenance Menu</command> 然後按下 <command>ENTER</command>。會顯示一個新選單。

source: Select <command>Boot From a File</command> from the menu with the arrow keys and press <command>ENTER</command>. This will display a list of devices probed by the firmware. You should see two menu lines containing either the label <command>Debian Inst [Acpi ...</command> or <command>Removable Media Boot</command>. If you examine the rest of the menu line, you will notice that the device and controller information should be the same.
ko: 메뉴에서 화살표로 <command>Boot From a File</command>을 선택해 <command>ENTER</command>를 누르십시오. 그러면 펌웨어가 찾은 장치의 목록이 나옵니다. 메뉴에서 <command>Debian Inst [Acpi ...</command> 혹은 <command>Removable Media Boot</command>라고 되어 있는 두 줄이 나옵니다. 그 메뉴 항목의 나머지를 보면, 장치와 컨트롤러 정보가 같은 지 알 수 있습니다.
pt: Seleccione <command>Boot From a File</command> a partir do menu, usando as setas do seu teclado e pressione <command>ENTER</command>. Isto irá listar os dispositivos testados pelo firmware. Deverá conseguir ver duas linhas do menu, contendo ou a etiqueta <command>Debian Inst [Acpi ...</command> ou a etiqueta <command>Removable Media Boot</command>. Se examinar o resto das linhas do menu, deverá notar que a informação do dispositivo e do controlador deverá ser a mesma.
zh_tw: 透過方向鍵選擇 <command>Boot From a File</command>，然後按下 <command>ENTER</command>。將顯示韌體檢測到的設備列表。您會看到兩個選單行，它們包括 <command>Debian Inst [Acpi ...</command> 或 <command>Removable Media Boot</command>標籤。如果您檢查選單行其他部分，會看到對應的設備和控制器資訊。

source: You can choose either of the entries that refer to the CD/DVD drive. Select your choice with the arrow keys and press <command>ENTER</command>. If you choose <command>Removable Media Boot</command> the machine will immediately start the boot load sequence. If you choose <command>Debian Inst [Acpi ...</command> instead, it will display a directory listing of the bootable portion of the CD, requiring you to proceed to the next (additional) step.
ko: CD/DVD 드라이브를 가리키는 어떤 항목이든 선택할 수 있습니다. 화살표 키로 선택해서 <command>ENTER</command>를 누릅니다. <command>Removable Media Boot</command>를 선택한 경우 기계가 즉시 부팅 단계로 들어갑니다. 그게 아니라 <command>Debian Inst [Acpi ...</command>를 선택한 경우, CD의 부팅 가능 영역 디렉토리의 내용을 표시하고, 다음 단계로 진행할 수 있습니다.
pt: Poderá escolher qualquer uma das entradas que se referem à drive de CD/DVD. Seleccione a sua escolha com as setas do seu teclado e pressione <command>ENTER</command>. Se escolher <command>Removable Media Boot</command>, a máquina irá imediatamente iniciar a sequência de carregamento no arranque. Se em vez disso escolher <command>Debian Inst [Acpi ...</command>, irá mostrar uma lista de directórios da parte de arranque do CD, requerendo que proceda para o próximo passo (adicional).
zh_tw: 您可選擇指向 CD/DVD 光碟機的項目。透過方向鍵選擇並按下 <command>ENTER</command>。如果您選擇 <command>Removable Media Boot</command> 機器將進入啟動步驟。如果您選擇 <command>Debian Inst [Acpi ...</command>，它會顯示一個可啟動的光碟目錄列表，要求您進行 (額外的) 下一步。

source: You will only need this step if you chose <command>Debian Inst [Acpi ...</command>. The directory listing will also show <command>[Treat like Removable Media Boot]</command> on the next to the last line. Select this line with the arrow keys and press <command>ENTER</command>. This will start the boot load sequence.
ko: 이 단계는 <command>Debian Inst [Acpi ...</command>를 선택한 경우에만 필요합니다. 디렉토리 목록에서는 마지막 줄 다음에 <command>[Treat like Removable Media Boot]</command>도 표시합니다. 이 줄을 화살표로 선택해 <command>ENTER</command>를 누르십시오. 그러면 부팅 과정을 시작합니다.
pt: Apenas irá necessitar deste passo se escolher <command>Debian Inst [Acpi ...</command>. A lista de directorias irá também mostrar <command>[Treat like Removable Media Boot]</command> ao lado da linha a seguir à última. Seleccione esta linha com as setas do seu teclado e pressione<command>ENTER</command>. Isto irá iniciar a sequência de arranque.
zh_tw: 您只在選擇 <command>Debian Inst [Acpi ...</command> 時需要這個。目錄列表還會顯示 <command>[Treat like Removable Media Boot]</command> 至最後一行。用方向鍵選擇，並按下 <command>ENTER</command>。這將進入啟動步驟。

source: These steps start the Debian boot loader which will display a menu page for you to select a boot kernel and options. Proceed to selecting the boot kernel and options.
ko: 데비안 부트 로더가 시작하고 부팅 커널과 옵션을 선택하는 메뉴 페이지를 표시합니다. 계속해서 부팅 커널과 옵션을 선택하십시오.
pt: Estas etapas iniciam o gestor de arranque de Debian que irá mostrar uma página de menu, para você escolher um kernel e opções para arranque. Continue com a selecção do kernel e opções de arranque.
zh_tw: 這些步驟啟動的 Debian boot-loader 會顯示一個選單頁以選擇啟動核心和選項。進入選擇啟動核心和選項。

source: Option 2: Booting from the EFI Shell
ko: 방법 2: EFI Shell에서 부팅
pt: Opção 2: Iniciar a partir de uma Shell EFI
zh_tw: 選項 2: 從 EFI Shell 啟動

source: If, for some reason, option 1 is not successful, reboot the machine and when the EFI Boot Manager screen appears there should be one option called <command>EFI Shell [Built-in]</command>. Boot the Debian Installer CD with the following steps:
ko: 어떤 이유에서든 방법 1이 실패하면, 기계를 다시 부팅하십시오. EFI Boot Manager 화면에서 <command>EFI Shell [Built-in]</command>이라는 옵션이 있습니다. 다음 과정을 통해 데비안 설치 CD를 부팅하십시오:
pt: Se, por alguma razão, a opção 1 não for bem sucedida, reinicie a máquina e quando aparecer o ecrã de EFI Boot Manager deve haver uma opção chamada <command>EFI Shell [Built-in]</command>. Inicie o CD do Instalador Debian com as seguintes etapas:
zh_tw: 某些情況下，選項 1 無法成功，重新啟動機器然後在 EFI Boot Manager 畫面出現的時候會有一個選項稱為 <command>EFI Shell [Built-in]</command>。 可以透過如下步驟來啟動 Debian 安裝程式：

source: Insert the CD in the DVD/CD drive and reboot the machine. The firmware will display the EFI Boot Manager page and menu after it completes system initialization.
ko: CD를 DVD/CD 드라이브에 넣고 기계를 다시 부팅하십시오. 펌웨어가 시스템 초기화를 마치면 EFI Boot Manager 페이지와 메뉴가 나타납니다.
pt: Insira o CD na drive de DVD/CD e reinicie a máquina. O firmware irá mostrar a página do EFI Boot Manager e o menu após completar a inicialização do sistema.
zh_tw: 把光碟放入光碟機並重新開機。系統初始化之後韌體將會顯示 EFI Boot Manager 的主頁和選單。
