Repository: xobs/debian-installer
Catalog: doc/manual/po/*/boot-installer.po
Languages: ko, pt, zh_tw

source: To boot from floppy on a Sparc, use <informalexample><screen> Stop-A -&gt; OpenBoot: "boot floppy" </screen></informalexample> Be warned that the newer Sun4u (ultra) architecture does not support floppy booting. A typical error message is <computeroutput>Bad magic number in disk label - Can't open disk label package</computeroutput>. Furthermore, a number of Sun4c models (such as the IPX) do not support the compressed images found on the disks, so also are not supported.
ko: Sparc에서 플로피에서 부팅하려면, 다음 명령을 사용하십시오: <informalexample><screen> Stop-A -&gt; OpenBoot: "boot floppy" </screen></informalexample> 단 새로운 Sun4u (ultra) 아키텍쳐의 경우 플로피 부팅을 지원하지 않습니다. 보통 오류 메세지는 <computeroutput>Bad magic number in disk label - Can't open disk label package</computeroutput>입니다. 게다가, 많은 Sun4c 모델은 (예를 들어 IPX) 압축한 이미지를 지원하지 않고, 그래서 그러한 모델들은 지원하지 않습니다.
pt: Para iniciar a partir de um disquete numa Sparc, utilize <informalexample><screen>Stop-A -&gt; OpenBoot: "boot floppy"</screen></informalexample> Fique avisado que a nova arquitectura Sun4u (ultra) não suporta iniciar de disquete. Uma mensagem de erro tipica é <computeroutput>Bad magic number in disk label - Can't open disk label package</computeroutput>. Além disso, um número de modelos Sun4c (tais como IPX) não suportam imagens comprimidas nos discos, não sendo portanto suportadas.
zh_tw: 在 SPARC 機器上用軟碟機開機，請使用 <informalexample><screen> Stop-A -&gt; OpenBoot: "boot floppy" </screen></informalexample> 注意較新的 Sun4u (ultra) 結構不支援軟碟機開機，一個標準的錯誤資訊是 <computeroutput>Bad magic number in disk label - Can't open disk label package</computeroutput>。甚至，一些 Sun4c 型號 (例如 IPX) 不支援磁碟上找到的壓縮映像，所以這些都不被支援。

source: Several Sparcs (e.g. Ultra 10) have an OBP bug that prevents them from booting (instead of not supporting booting at all). The appropriate OBP update can be downloaded as product ID 106121 from <ulink url="http://sunsolve.sun.com"></ulink>.
ko: 일부 Sparc에서는 (예를 들어 Ultra 10) OBP 버그때문에 부팅하지 못합니다. OBP 업데이트는 <ulink url="http://sunsolve.sun.com"></ulink>의 product ID 106121에서 내려받을 수 있습니다.
pt: Várias Sparcs (ex. Ultra 10) têm um bug OBP que as impede de arrancar (em vez de simplesmente não suportarem de todo arrancar). O download da actualização apropriada de OBP como produto ID 106121 poderá ser feito a partir de <ulink url="http://sunsolve.sun.com"></ulink>.
zh_tw: 不少 Sparcs (例如 Ultra 10) 有一個 OBP 缺陷。它阻止這些機器開機 (從而完全不支持開機)。合適的 OBP 更新可以從下面連接的 ID 106121 中取得，<ulink url="http://sunsolve.sun.com"></ulink>。

source: If you are booting from the floppy, and you see messages such as <informalexample><screen> Fatal error: Cannot read partition Illegal or malformed device name </screen></informalexample> then it is possible that floppy booting is simply not supported on your machine.
ko: 플로피에서 부팅하는 경우에 다음과 같은 메세지를 본다면 <informalexample><screen> Fatal error: Cannot read partition Illegal or malformed device name </screen></informalexample> 플로피 부팅을 지원하지 않는 경우일 수도 있습니다.
pt: Se está a iniciar de disquete, e vê mensagens como <informalexample><screen>Fatal error: Cannot read partition Illegal or malformed device name </screen></informalexample> então é possível que a disquete de arranque não seja simplesmente suportada na sua máquina.
zh_tw: 如果您正在從軟碟開機，並且看到如下資訊 <informalexample><screen> Fatal error: Cannot read partition Illegal or malformed device name </screen></informalexample> 那麼您的機器很可能不支援軟碟開機。

source: IDPROM Messages
ko: IDPROM 메세지
pt: Mensagens ID
zh_tw: IDPROM 訊息

source: If you cannot boot because you get messages about a problem with <quote>IDPROM</quote>, then it's possible that your NVRAM battery, which holds configuration information for you firmware, has run out. See the <ulink url="&url-sun-nvram-faq;">Sun NVRAM FAQ</ulink> for more information.
ko: <quote>IDPROM</quote> 관련된 문제에 관한 메세지가 나오면서 부팅하지 못한다면, 펌웨어의 설정 정보가 들어 있는 NVRAM의 배터리가 방전된 경우일 수 있습니다. 자세한 정보는 <ulink url="&url-sun-nvram-faq;">Sun NVRAM FAQ</ulink>를 참고하십시오.
pt: Se não consegue arrancar porque recebe mensagens sobre um problema com <quote>IDPROM</quote>, então é possível que a sua bateria NVRAM, que contém informação de configuração para o seu firmware, se tenha esgotado. Veja a <ulink url="&url-sun-nvram-faq;">Sun NVRAM FAQ</ulink> para mais informação.
zh_tw: 如果您由於得到一個有關 <quote>IDPROM</quote> 問題的消息並且不能開機，這可能是 NVRAM 電池已經用光。通常它為韌體保持設定資訊。檢查 <ulink url="&url-sun-nvram-faq;">Sun NVRAM 常見問答集</ulink> 以取得更多資訊。

source: Boot parameters are Linux kernel parameters which are generally used to make sure that peripherals are dealt with properly. For the most part, the kernel can auto-detect information about your peripherals. However, in some cases you'll have to help the kernel a bit.
ko: 부팅 파라미터는 리눅스 커널 파라미터로 보통 주변 장치를 제대로 동작하도록 제어하는 데 이용합니다. 대부분 커널에서 주변 장치에 관한 정보를 자동으로 찾아 냅니다. 하지만 몇몇 경우에는 파라미터로 커널을 조금 도와줘야 합니다.
pt: Parâmetros de arranque são parâmetros do kernel Linux que são geralmente utilizados para certificar que os periféricos são tratados devidamente. Para a maioria, o kernel pode auto detectar informação sobre os seus periféricos. Contudo, em alguns casos terá de ajudar o kernel um pouco.
zh_tw: 開機參數是 Linux 核心的參數。一般用於確保周邊設備能夠正確地運行。對於其中的大多數部分來說，核心可以自動檢查周邊設備的相關資訊。但是在某些情況下，您可能需要給核心一點小小的幫助。

source: If this is the first time you're booting the system, try the default boot parameters (i.e., don't try setting parameters) and see if it works correctly. It probably will. If not, you can reboot later and look for any special parameters that inform the system about your hardware.
ko: 시스템을 첫 번째로 부팅하는 경우라면, 기본 부팅 파라미터를 시도해 보시고 (즉 파라미터를 사용하지 않는 것) 제대로 동작하는 지 보십시오. 보통은 제대로 동작할 것입니다. 제대로 동작하지 않는 경우에 다시 부팅해서 하드웨어에 필요한 특별한 파라미터가 있는 지 찾아 보십시오.
pt: Se esta é a primeira vez que está a iniciar o sistema, tente os parâmetros de arranque por omissão (i.e., não tente alterar os parâmetros) e veja se funciona correctamente. Provavelmente sim. Se não, pode mais tarde reiniciar e procurar por parâmetros especiais que informam o sistema do seu hardware.
zh_tw: 如果這是您第一次開機系統，嘗試預設的開機參數 (即：不要輸入任何參數) 並且檢查是否工作正確。大部分情況下應該如此，如果不是，可以重新啟動，並且檢查需要告訴系統什麼樣的特定參數。

source: Information on many boot parameters can be found in the <ulink url="http://www.tldp.org/HOWTO/BootPrompt-HOWTO.html"> Linux BootPrompt HOWTO</ulink>, including tips for obscure hardware. This section contains only a sketch of the most salient parameters. Some common gotchas are included below in <xref linkend="boot-troubleshooting"/>.
ko: 부팅 파라미터에 관한 정보는 <ulink url="http://www.tldp.org/HOWTO/BootPrompt-HOWTO.html">Linux BootPrompt HOWTO</ulink>에 (여러가지 보기드문 하드웨어에 대한 정보 포함) 있습니다. 여기서는 몇 가지 많이 이용하는 파라미터에 대한 대략만 다룹니다. 많이 발생하는 문제점 몇 개는 <xref linkend="boot-troubleshooting"/>에 들어 있습니다.
pt: Informação sobre muitos parâmetros de arranque podem ser encontrados em <ulink url="http://www.tldp.org/HOWTO/BootPrompt-HOWTO.html"> Linux BootPrompt HOWTO</ulink>, incluindo dicas para hardware obscuro. Esta secção contém apenas um esboço dos parâmetros mais distintos. Alguns truques para identificar problemas estão incluídos abaixo na <xref linkend="boot-troubleshooting"/>.
zh_tw: 有關很多開機參數的資訊可以參閱 <ulink url="http://www.tldp.org/HOWTO/BootPrompt-HOWTO.html"> Linux BootPrompt HOWTO</ulink>，其中包括一些老舊硬體的解決方法。這一節只描述一些對最常用的基本參數。一些常見的問題描述見 <xref linkend="boot-troubleshooting"/>。

source: When the kernel boots, a message <informalexample><screen> Memory:<replaceable>avail</replaceable>k/<replaceable>total</replaceable>k available </screen></informalexample> should be emitted early in the process. <replaceable>total</replaceable> should match the total amount of RAM, in kilobytes. If this doesn't match the actual amount of RAM you have installed, you need to use the <userinput>mem=<replaceable>ram</replaceable></userinput> parameter, where <replaceable>ram</replaceable> is set to the amount of memory, suffixed with <quote>k</quote> for kilobytes, or <quote>m</quote> for megabytes. For example, both <userinput>mem=65536k</userinput> and <userinput>mem=64m</userinput> mean 64MB of RAM.
ko: 커널이 부팅할 때 다음과 같은 메세지가 나와야 합니다: <informalexample><screen> Memory:<replaceable>avail</replaceable>k/<replaceable>total</replaceable>k available </screen></informalexample> 여기서 <replaceable>total</replaceable>은 전체 RAM의 크기입니다(킬로바이트 단위). 이 숫자가 실제 설치한 RAM의 용량과 다르다면, <userinput>mem=<replaceable>ram</replaceable></userinput> 파라미터를 사용해야 합니다. 여기서 <replaceable>ram</replaceable>은 메모리의 양이고, 킬로바이트의 경우 ``k'', 메가바이트의 경우 ``m''을 뒤에 붙입니다. 예를 들어, <userinput>mem=65536k</userinput>나 <userinput>mem=64m</userinput>은 모두 64MB의 RAM을 뜻합니다.
pt: Quando o kernel arranca, deve ser emitida no inicio do processo <informalexample><screen> Memory:<replaceable>avail</replaceable>k/<replaceable>total</replaceable>k. available </screen></informalexample> uma mensagem. <replaceable>total</replaceable> deve coincidir com a quantidade total de RAM, em kilobytes. Se isto não coincidir com a quantidade real de RAM que tem instalado, precisa de utilizar o parâmetro <userinput>mem=<replaceable>ram</replaceable></userinput>, onde <replaceable>ram</replaceable> é substituído pela quantidade de memória, seguido de <quote>k</quote> para kilobytes, ou <quote>m</quote> para megabytes. Por exemplo<userinput>mem=65536k</userinput> e <userinput>mem=64m</userinput> significam 64MB of RAM.
zh_tw: 當核心開機的時候，一條訊息 <informalexample><screen> Memory:<replaceable>avail</replaceable>k/<replaceable>total</replaceable>k available </screen></informalexample> 應該會在開機過程的早期顯示。其中 <replaceable>total</replaceable> 應該符合您記憶體的總量，其中單位為多少 kb。如果此參數不符合您安裝的記憶體總數，需要使用 <userinput>mem=<replaceable>ram</replaceable></userinput> 參數。 這裡 <replaceable>ram</replaceable> 被設成記憶體的數量。如是 <quote>k</quote> 為位元組，<quote>m</quote> 為兆位元組。例如，<userinput>mem=65536k</userinput> 和 <userinput>mem=64m</userinput> 表示 64MB 記憶體。

source: If you are booting with a serial console, generally the kernel will autodetect this<phrase arch="mipsel"> (although not on DECstations)</phrase>. If you have a videocard (framebuffer) and a keyboard also attached to the computer which you wish to boot via serial console, you may have to pass the <userinput>console=<replaceable>device</replaceable></userinput> argument to the kernel, where <replaceable>device</replaceable> is your serial device, which is usually something like <filename>ttyS0</filename>.
ko: 시리얼 콘솔로 부팅하는 경우, 보통 자동으로 찾아냅니다. <phrase arch="mipsel">(DECstation에서는 아닙니다.)</phrase> 시리얼 콘솔로 부팅하려는 컴퓨터에 비디오 카드와 (프레임버퍼) 키보드가 붙어 있다면, <userinput>console=<replaceable>device</replaceable></userinput> 파라미터를 커널에 넘겨야 할 수 있습니다. 여기서 <replaceable>device</replaceable>는 시리얼 장치이고, <filename>ttyS0</filename>과 같이 씁니다.
pt: Se estiver a iniciar de uma consola de série, geralmente o kernel irá auto detectar isto <phrase arch="mipsel"> (embora não o faça em DECstations)</phrase>. Se tem uma placa gráfica (framebuffer) e um teclado agregados ao computador do qual quer iniciar via consola série, pode querer passar para o kernel o argumento <userinput>console=<replaceable>device</replaceable></userinput>, onde <replaceable>device</replaceable> é o seu dispositivo de série, o qual geralmente é algo parecido com <filename>ttyS0</filename>.
zh_tw: 如果您透過序列控制台開機，一般來說核心將自動檢測 <phrase arch="mipsel"> (盡管不是在一台 DECstations 上面)</phrase>。如果您有一塊顯示卡 (framebuffer) 和一塊鍵盤，透過序列埠附加於想開機的電腦上面，也許需要傳遞 <userinput>console=<replaceable>device</replaceable></userinput> 參數給核心， <replaceable>device</replaceable> 是序列埠設備。通常類似於 <filename>ttyS0</filename>。

source: For &arch-title; the serial devices are <filename>ttya</filename> or <filename>ttyb</filename>. Alternatively, set the <envar>input-device</envar> and <envar>output-device</envar> OpenPROM variables to <filename>ttya</filename>.
ko: &arch-title;에서 시리얼 장치는 <filename>ttya</filename> 혹은 <filename>ttyb</filename>입니다. 다른 방법으로, <envar>input-device</envar> 및 <envar>output-device</envar> OpenPROM 변수를 <filename>ttya</filename>로 맞출 수도 있습니다.
pt: Para &arch-title; os dispositivos de série são <filename>ttya</filename> ou <filename>ttyb</filename>. Alternativamente, ajuste as variáveis OpenPROM <envar>input-device</envar> e <envar>output-device</envar> para <filename>ttya</filename>.
zh_tw: 對於 &arch-title; 序列埠設備名稱是 <filename>ttya</filename> 或 <filename>ttyb</filename> 。或者，透過設置 <envar>input-device</envar> 和 <envar>output-device</envar> OpenPROM 變數至 <filename>ttya</filename>。

source: Debian Installer Parameters
ko: 데비안 설치 프로그램 파라미터
pt: Parâmetros de instalação Debian
zh_tw: Debian 安裝程式的參數

source: The installation system recognizes a few additional boot parameters<footnote> <para> Note that the kernel accepts a maximum of 8 command line options and 8 environment options (including any options added by default for the installer). If these numbers are exceeded, 2.4 kernels will drop any excess options and 2.6 kernels will panic. <phrase condition="etch">With kernel 2.6.9 or newer, you can use 32 command line options and 32 environment options.</phrase> </para> </footnote> which may be useful.
ko: 설치 시스템에서는 유용하게 쓸 수도 있는 부팅 파라미터 몇 개를 더 인식합니다<footnote> <para> 커널에서는 최대 8개의 명령행 옵션과 8개의 환경 옵션만 사용할 수 있습니다 (설치 프로그램에서 기본으로 사용하는 옵션 포함). 이 개수가 넘어가면 2.4 커널에서는 넘어가는 파라미터를 버리고, 2.6 커널은 멎어 버립니다. <phrase condition="etch">커널 2.6.9 이후인 경우 32개의 명령행 옵션과 32개의 환경변수를사용할 수 있습니다.</phrase></para> </footnote>.
pt: O sistema de instalação reconhece uns quantos parâmetros de arranque adicionais <footnote> <para> Note que o kernel aceita um máximo de 8 opções de comando de linha e 8 opções de ambiente (incluindo qualquer opção adicionada por omissão pelo instalador). Se este números forem excedidos, os kernel 2.4 irão retirar as opções em excesso e o kernel 2.6 pode gerar alguns erros (kernel panic) <phrase condition="etch">Com o kernel 2.6.9 ou mais recente, pode utilizar 32 opções de comando de linha e 32 opções de ambiente.</phrase> </para> </footnote> que podem ser úteis.

source: This parameter sets the lowest priority of messages to be displayed.
ko: 이보다 같거나 높은 우선순위의 메세지만 표시합니다.
pt: Este parâmetro ajusta para prioridade mínima as mensagens a serem mostradas.
zh_tw: 這些參數將顯示資訊設定為最低的級別。

source: The default installation uses <userinput>debconf/priority=high</userinput>. This means that both high and critical priority messages are shown, but medium and low priority messages are skipped. If problems are encountered, the installer adjusts the priority as needed.
ko: 기본 설치에서는 <userinput>debconf/priority=high</userinput>를 사용합니다. 즉, 높음 우선 순위와 필수 우선순위의 메세지를 표시하지만, 보통과 낮음 우선 순위 메세지는 넘어갑니다. 문제가 발생할 경우에는 설치 프로그램에서 우선순위를 필요에 따라 조정합니다.
pt: A instalação por omissão utiliza <userinput>debconf/priority=high</userinput>. Isto significa que as mensagem de prioridade alta e crítica irão ser listaas, mas não serão listadas as mensagens de média e baixa prioridade. Se forem encontrados problemas, o instalador ajusta a prioridade de acordo com o necessário.
zh_tw: 預設安裝使用 <userinput>debconf/priority=high</userinput>。這意味著高優先的和至關重要的資訊將被顯示，但是中級和低級資訊將被跳過。如果其間出現了問題，安裝程式將按照要求調整優先級別。

source: If you add <userinput>debconf/priority=medium</userinput> as boot parameter, you will be shown the installation menu and gain more control over the installation. When <userinput>debconf/priority=low</userinput> is used, all messages are shown (this is equivalent to the <emphasis>expert</emphasis> boot method). With <userinput>debconf/priority=critical</userinput>, the installation system will display only critical messages and try to do the right thing without fuss.
ko: <userinput>debconf/priority=medium</userinput>을 부팅 파라미터로 쓴 경우, 설치 메뉴에서 설치 메뉴에서 더 많은 조정을 할 수 있습니다. <userinput>debconf/priority=low</userinput>라고 쓴 경우, 모든 메세지를 볼 수 있습니다. (<emphasis>expert</emphasis> 부팅 방법과 동일합니다.) <userinput>debconf/priority=critical</userinput>의 경우, 필수 메세지만 표시하고 질문들에 신경 쓰지 않고 설치를 진행합니다.
pt: Se colocou <userinput>debconf/priority=medium</userinput> como parâmetro de arranque irá-lhe ser mostrado o menu de instalação e dessa forma vai ter mais poder sobre a instalação. Quando é utilizado <userinput>debconf/priority=low</userinput> todas as mensagens são mostradas (Isto é equivalente ao método de arranque <emphasis>avançado</emphasis>). Com <userinput>debconf/priority=critical</userinput>, o sistema de instalação irá mostrar somente as mensagens críticas e tentará optar pelas opções correctas sem grande confusão.
zh_tw: 如果您加入 <userinput>debconf/priority=medium</userinput> 作為開機參數，將看到安裝選單以及安裝過程中更多的控制選項。使用 <userinput>debconf/priority=low</userinput>，將顯示所有的訊息 (這相當於採用 <emphasis>專家級</emphasis> 開機方法)。透過 <userinput>debconf/priority=critical</userinput>，安裝系統只會顯示至關重要的資訊，並且嘗試正確無誤地執行各項事宜。

source: This boot parameter controls the type of user interface used for the installer. The current possible parameter settings are: <itemizedlist> <listitem> <para><userinput>DEBIAN_FRONTEND=noninteractive</userinput></para> </listitem><listitem> <para><userinput>DEBIAN_FRONTEND=text</userinput></para> </listitem><listitem> <para><userinput>DEBIAN_FRONTEND=newt</userinput></para> </listitem><listitem> <para><userinput>DEBIAN_FRONTEND=slang</userinput></para> </listitem><listitem> <para><userinput>DEBIAN_FRONTEND=ncurses</userinput></para> </listitem><listitem> <para><userinput>DEBIAN_FRONTEND=bogl</userinput></para> </listitem><listitem> <para><userinput>DEBIAN_FRONTEND=gtk</userinput></para> </listitem><listitem> <para><userinput>DEBIAN_FRONTEND=corba</userinput></para> </listitem> </itemizedlist> The default front end is <userinput>DEBIAN_FRONTEND=newt</userinput>. <userinput>DEBIAN_FRONTEND=text</userinput> may be preferable for serial console installs. Generally only the <userinput>newt</userinput> frontend is available on default install media, so this is not very useful right now.
ko: 이 부팅 파라미터는 설치 프로그램에서 사용할 사용자 인터페이스 종류를 설정합니다. 현재 가능한 파라미터 값은: <itemizedlist> <listitem> <para><userinput>DEBIAN_FRONTEND=noninteractive</userinput></para> </listitem><listitem> <para><userinput>DEBIAN_FRONTEND=text</userinput></para> </listitem><listitem> <para><userinput>DEBIAN_FRONTEND=newt</userinput></para> </listitem><listitem> <para><userinput>DEBIAN_FRONTEND=slang</userinput></para> </listitem><listitem> <para><userinput>DEBIAN_FRONTEND=ncurses</userinput></para> </listitem><listitem> <para><userinput>DEBIAN_FRONTEND=bogl</userinput></para> </listitem><listitem> <para><userinput>DEBIAN_FRONTEND=gtk</userinput></para> </listitem><listitem> <para><userinput>DEBIAN_FRONTEND=corba</userinput></para> </listitem> </itemizedlist> 기본 프론트엔드는 <userinput>DEBIAN_FRONTEND=newt</userinput>입니다. 시리얼 콘솔 설치의 경우 <userinput>DEBIAN_FRONTEND=text</userinput>가 더 좋을 수도 있습니다. 보통 기본 설치 미디어에서는 <userinput>newt</userinput> 프론트엔드만 사용할 수 있기 때문에, 이 파라미터는 현재 별로 쓸모가 없습니다.
pt: O parâmetro de arranque controla o tipo de interface para o utilizador que é utilizado para o instalador. Os valores actuais possíveis utilizados são: <itemizedlist> <listitem> <para><userinput>DEBIAN_FRONTEND=noninteractive</userinput></para> </listitem><listitem> <para><userinput>DEBIAN_FRONTEND=text</userinput></para> </listitem><listitem> <para><userinput>DEBIAN_FRONTEND=newt</userinput></para> </listitem><listitem> <para><userinput>DEBIAN_FRONTEND=slang</userinput></para> </listitem><listitem> <para><userinput>DEBIAN_FRONTEND=ncurses</userinput></para> </listitem><listitem> <para><userinput>DEBIAN_FRONTEND=bogl</userinput></para> </listitem><listitem> <para><userinput>DEBIAN_FRONTEND=gtk</userinput></para> </listitem><listitem> <para><userinput>DEBIAN_FRONTEND=corba</userinput></para> </listitem> </itemizedlist> O front end é <userinput>DEBIAN_FRONTEND=newt</userinput>. O <userinput>DEBIAN_FRONTEND=text</userinput> pode ser preferível utilizar para instalações de consolas série. Geralmente por omissão apenas o frontend <userinput>newt</userinput> está disponível no media de instalação, assim por ora isto não é muito útil.
zh_tw: 這個開機參數控於安裝程式的使用者界面類型。目前可能參數設置可以是：<itemizedlist> <listitem> <para><userinput>DEBIAN_FRONTEND=noninteractive</userinput></para> </listitem><listitem> <para><userinput>DEBIAN_FRONTEND=text</userinput></para> </listitem><listitem> <para><userinput>DEBIAN_FRONTEND=newt</userinput></para> </listitem><listitem> <para><userinput>DEBIAN_FRONTEND=slang</userinput></para> </listitem><listitem> <para><userinput>DEBIAN_FRONTEND=ncurses</userinput></para> </listitem><listitem> <para><userinput>DEBIAN_FRONTEND=bogl</userinput></para> </listitem><listitem> <para><userinput>DEBIAN_FRONTEND=gtk</userinput></para> </listitem><listitem> <para><userinput>DEBIAN_FRONTEND=corba</userinput></para> </listitem> </itemizedlist> 預設的前端是 <userinput>DEBIAN_FRONTEND=newt</userinput>。 <userinput>DEBIAN_FRONTEND=text</userinput> 可以用於序列埠控制台安裝。一般來說在預設安裝媒介上只有 <userinput>newt</userinput> 前端，因此目前這個並非很有用。

source: Setting this boot parameter to 2 will cause the installer's boot process to be verbosely logged. Setting it to 3 makes debug shells available at strategic points in the boot process. (Exit the shells to continue the boot process.)
pt: Definir este parâmetro de arranque para 2 irá fazer com que o processo de arranque da instalação seja feito com um registo detalhado. Defini-lo para 3 faz com que estejam disponíveis shells de debug em pontos estratégicos do processo de arranque. (Sair das shells para continuar o processo de arranque.)
zh_tw: 設定此開機參數為 2 將使得安裝程式的啟動程序寫下所有冗長的紀錄。設定為 3 使得除錯介殼在決定性的時間點上能被使用。 (離開介殼後將繼續安裝程序。)

source: This is the default.
ko: 기본값입니다.
pt: Isto é por omissão
zh_tw: 此為預設。

source: More verbose than usual.
ko: 보통때보다 많은 디버깅 정보.
pt: Mais detalhes que o habitual
zh_tw: 更多的資訊。

source: Lots of debugging information.
ko: 디버깅 정보 아주 많이.
pt: Muita informação de eliminação de erros.
zh_tw: 大量的除錯資訊。

source: Shells are run at various points in the boot process to allow detailed debugging. Exit the shell to continue the boot.
ko: 부팅 과정의 곳곳에서 쉘을 실행해서 자세히 디버깅을 할 수 있습니다. 부팅을 계속하려면 쉘을 나가면 됩니다.
pt: As shells são executadas em vários pontos do processo de arranque para permitir um debugging detalhado. Saia para a shell para continuar o arranque.
zh_tw: 介殼腳本將在開機期間執行於不同的地方以允許細節上的調整。退出介殼將繼續開機過程。

source: The value of the parameter is the path to the device to load the Debian installer from. For example, <userinput>INSTALL_MEDIA_DEV=/dev/floppy/0</userinput>
ko: 이 파라미터의 값은 데비안 설치 프로그램을 읽어들일 장치의 경로입니다. 예를 들어 <userinput>INSTALL_MEDIA_DEV=/dev/floppy/0</userinput>
pt: O valor do parâmetro é o caminho para o dispositivo por onde carregar o instalador Debian. Por exemplo, <userinput>INSTALL_MEDIA_DEV=/dev/floppy/0</userinput>
zh_tw: 此參數值是載入 Debian 安裝程式設備的路徑，例如： <userinput>INSTALL_MEDIA_DEV=/dev/floppy/0</userinput>

source: The boot floppy, which normally scans all floppies and USB storage devices it can to find the root floppy, can be overridden by this parameter to only look at the one device.
ko: 부트 플로피는 루트 플로피를 찾으면서, 검색할 수 있는 모든 플로피와 USB 저장 장치를 검색합니다. 이 파라미터를 이용해서 장치 한 개만 검색하도록 만들 수 있습니다.
pt: A disquete de arranque, que normalmente procura todos os dispositivos de disquete e de armazenamento USB pode servir para encontrar a floppy root, pode ser ultrapassada por este parâmetro para apenas olhar para um dispositivo.
zh_tw: 開機映像通常會掃瞄所有的軟碟和 USB 隨身碟設備來找到根軟碟。它也可以透過此參數只查找一個設備。
