Repository: xobs/debian-installer
Catalog: doc/manual/po/*/boot-installer.po
Languages: ko, pt, zh_tw

source: Some architectures use the kernel framebuffer to offer installation in a number of languages. If framebuffer causes a problem on your system you can disable the feature by the parameter <userinput>debian-installer/framebuffer=false</userinput>. Problem symptoms are error messages about bterm or bogl, a blank screen, or a freeze within a few minutes after starting the install.
ko: 어떤 아키텍쳐에서는 커널 프레임 버퍼를 사용해 여러 가지 언어로 설치를 지원합니다. 프레임버퍼가 문제가 있는 경우 <userinput>debian-installer/framebuffer=false</userinput> 파리미터를 통해 프레임버퍼를 끌 수 있습니다. 문제의 증상은 bterm이나 bogl 관련된 오류 메세지, 검은 화면, 설치를 시작하고 몇 분 후에 멈추는 증상입니다.
pt: Algumas arquitecturas utilizam o framebuffer para oferecer uma instalação em várias línguas. Se o framebuffer causar problemas no seu sistema pode desactivar esta característica através do parâmetro <userinput>debian-installer/framebuffer=false</userinput>. Os sintomas do problema são mensagens de erro sobre bterm ou bogl, um ecrã em branco, ou uma paragem de uns minutos após o inicio da instalação.
zh_tw: 一些架構使用核心 framebuffer 以提供不同的語言安裝。如果 framebuffer 在您的系統發生問題，您可以透過參數 <userinput>debian-installer/framebuffer=false</userinput> 關閉這個功能。這方面問題的徵兆是 bterm 或者 bogl 的錯誤資訊、一個空白的螢幕，或者在開始安裝的時候停止幾分鐘。

source: The <userinput>video=vga16:off</userinput> argument may also be used to disable the framebuffer. Such problems have been reported on a Dell Inspiron with Mobile Radeon card.
ko: <userinput>video=vga16:off</userinput> 파라미터로 프레임버퍼를 끌 수도 있습니다. 그러한 문제가 Mobile Radeon 카드를 사용하는 Dell Inspiron에서 보고되었습니다.
pt: O argumento <userinput>video=vga16:off</userinput> pode também ser utilizado para desactiva o framebuffer. Tais problemas foram reportados numa Dell Inspiron com cartões Mobile Radeon.
zh_tw: <userinput>video=vga16:off</userinput> 參數可以被用來停用 framebuffer。這類問題的報告原於使用 Mobile Radeon 卡的 Dell Inspiron 上。

source: Such problems have been reported on the Amiga 1200 and SE/30.
ko: Amiga 1200과 SE/30에서 그러한 문제가 보고되었습니다.
pt: Tais problemas foram reportados no amiga 1200 e SE/30.
zh_tw: 在 Amiga 1200 and SE/30 上面也有報告指出這方面的問題。

source: Such problems have been reported on hppa.
ko: hppa에서 그러한 문제가 보고되었습니다.
pt: Tais problemas foram reportados em hppa.
zh_tw: 在 hppa 上面報告過存在這些問題。

source: Because of display problems on some systems, framebuffer support is <emphasis>disabled by default</emphasis> for &arch-title;. This can result in ugly display on systems that do properly support the framebuffer, like those with ATI graphical cards. If you see display problems in the installer, you can try booting with parameter <userinput>debian-installer/framebuffer=true</userinput>.
ko: 일부 시스템의 화면 표시 문제때문에, &arch-title;에서는 프레임 버퍼를 <emphasis>기본으로 지원하지 않습니다</emphasis>. 그 때문에 ATI 그래픽 카드같은 게 있어서 프레임버퍼를 지원하는 시스템에서조차 화면 표시가 보기가 안 좋을 수도 있습니다. 설치 프로그램에서 화면 표시 문제가 발생하면, <userinput>debian-installer/framebuffer=true</userinput> 파라미터를 넣고 부팅해 보십시오.
pt: Devido a serem mostrados as mensagens de erro em alguns sistemas, em &arch-title; o suporte framebuffer está <emphasis>desactivo por omissão</emphasis>. Isto pode resultar numa feia disposição em sistemas que fazem um suporte apropriado, como aqueles com placas gráficas ATI. Se é no ecrã são listados problemas no instalador, pode tentar iniciar com o parâmetro <userinput>debian-installer/framebuffer=true</userinput>.
zh_tw: 由於某些系統上顯示有問題，framebuffer 在 &arch-title; 上<emphasis>預設禁止使用</emphasis>。 這將會使支援 framebuffer 良好的系統顯示很醜陋，例如採用 ATI 圖形卡的系統。 如果您在安裝程式中遇到顯示問題，可以試著採用開機參數 <userinput>debian-installer/framebuffer=true</userinput>。

source: Set to <userinput>false</userinput> to prevent probing for USB on boot, if that causes problems.
ko: 부팅할 때 USB 검색이 문제가 있는 경우, <userinput>false</userinput>로 설정해 USB 검색을 하지 않습니다.
pt: Ponha como <userinput>false</userinput> para prevenir o teste para USB durante o arranque, se isso causar problemas.
zh_tw: 設定成 <userinput>false</userinput> 可以阻止在開機的時候禁止 USB 檢查來杜絕其所引起的問題。

source: By default, the &d-i; automatically probes for network configuration via DHCP. If the probe succeeds, you won't have a chance to review and change the obtained settings. You can get to the manual network setup only in case the DHCP probe fails.
ko: 기본값으로, &d-i;는 DHCP를 통해 네트워크 설정을 검색합니다. 검색이 성공하면, 그 설정을 검사해 보거나 바꿀 기회가 없습니다. DHCP 검색이 실패할 경우에만 수동 네트워크 셋업을 할 수 있습니다.
pt: Por omissão o &d-i; sonda automaticamente a configuração de rede via DHCP. Se a sonda for bem sucedida, não terá a oportunidade de rever e alterar os ajustes obtidos. Apenas conseguirá fazer uma configuração manual da rede em caso do probe DHCP falhar.
zh_tw: 預設情況下，&d-i; 會透過 DHCP 來自動偵測網路。如果檢測成功，您將不需要審視並且改變其取得的設定。您可以在 DHCP 檢測失敗的情況下手動配置網路。

source: If you have a DHCP server on your local network, but want to avoid it because e.g. it gives wrong answers, you can use the parameter <userinput>netcfg/disable_dhcp=true</userinput> to prevent configuring the network with DHCP and to enter the information manually.
ko: 랜에 DHCP 서버가 있지만 DHCP를 사용하고 싶지 않을 때 (예를 들어 잘못된 응답을 한다든지 때문에), <userinput>netcfg/disable_dhcp=true</userinput> 파라미터를 사용하면 DHCP 네트워크 설정을 막고 수동으로 정보를 입력할 수 있습니다.
pt: Se tem um servidor DHCP na sua rede local, mas quer evitar utilizá-lo ex.: devolve respostas erradas, pode utilizar o parâmetro <userinput>netcfg/disable_dhcp=true</userinput> que previne que a rede não seja configurada por DHCP e que a informação seja inserida manualmente.
zh_tw: 如果您的網路上面具備一台 DHCP 伺服器，但是不想使用它，例如，因為它給出錯誤的答案。您可以使用參數 <userinput>netcfg/disable_dhcp=true</userinput> 來透過 DHCP 來設定網路並且手動輸入參數。

source: Set to <userinput>false</userinput> to prevent starting PCMCIA services, if that causes problems. Some laptops are well known for this misbehavior.
ko: PCMCIA에 문제가 있을 때 <userinput>false</userinput>로 하면 PCMCIA 서비스를 시작하지 않습니다. 일부 노트북 컴퓨터에서 이와 관련해 문제가 발생합니다.
pt: Ponha como <userinput>false</userinput> para prevenir que sejam iniciados serviços PCMCIA, se isso causar problemas. Alguns portáteis são bem conhecidos por este mau comportamento.
zh_tw: 設定成 <userinput>false</userinput> 來阻止啟動 PCMCIA 服務，如果其引起各種問題。有些筆記型電腦對此會有錯誤的行為。

source: Specify the url to a preconfiguration file to download and use in automating the install. See <xref linkend="automatic-install"/>.
ko: 미리 설정해 놓은 파일을 내려받을 URL을 지정합니다. 이 파일을 이용해 설치를 자동화합니다. <xref linkend="automatic-install"/> 참고.
pt: Especifique um URL para o download, de um ficheiro de pré-configuração, e utilização na instalação automatizada. Veja a <xref linkend="automatic-install"/>.
zh_tw: 指定預設參數檔案的 URL，此檔案將在安裝中自動下載、掛載和使用。請參閱 <xref linkend="automatic-install"/>。

source: Specify the path to a preconfiguration file to load to automating the install. See <xref linkend="automatic-install"/>.
ko: 미리 설정해 놓은 파일을 읽어들일 URL을 지정합니다. 이 파일을 이용해 자동 설치를 합니다. <xref linkend="automatic-install"/> 참고.
pt: Especifique um caminho para carregar um ficheiro de pré-configuração para a instalação automatizada. Veja a <xref linkend="automatic-install"/>.
zh_tw: 指定預設參數檔案的路徑，在安裝中自動掛載和使用。請參閱 <xref linkend="automatic-install"/>。

source: By default, before rebooting, &d-i; automatically ejects the optical media used during the installation. This can be unnecessary if the system does not automatically boot off the CD. In some cases it may even be undesirable, for example if the optical drive cannot reinsert the media itself and the user is not there to do it manually. Many slot loading, slim-line, and caddy style drives cannot reload media automatically.
ko: 기본적으로 &d-i;에서는 다시 시작하기 전에 설치할 때 사용했던 광학 미디어를 자동으로 뺍니다. 시스템이 CD에서 자동으로 부팅하는 경우가 아니라면 이럴 필요가 없을 수도 있습니다. 어떤 경우에는 이렇게 하지 않는 게 좋을 때도 있습니다. 예를 들어, 해당 광학 드라이브가 미디어를 다시 집어넣지 못하는 경우나 사용자가 그 자리에 없기 때문에 수동으로 미디어를 집어넣지 못하는 경우입니다. 많은 슬롯 스타일의 드라이브는 미디어를 자동으로 다시 집어넣지 못합니다.
pt: Por omissão, antes de reiniciar, o &d-i; ejecta automaticamente o media óptico utilizado durante a instalação. Isto poderá ser desnecessário se o sistema não iniciar automaticamente de CD. Em alguns casos pode até não ser desejável, por exemplo se o drive óptica não conseguir inserir novamente o media sozinha e o utilizador não estiver lá para o fazer manualmente. Muitas drives de carregamento de slots, slim-line, e caddy style não conseguem recarregar automaticamente.
zh_tw: 在重開機前，&d-i; 預設會自動退出安裝時的光學媒介。如果系統不是自動從光碟開機，這不是必要的動作。在某些情況下，這反而不便，例如，如果光碟機不能自動插入光碟片，使用者又不在旁邊操作。許多 slot loading, slim-line 和 caddy 類型的光碟機不能自動重新掛載媒介。

source: Set to <userinput>false</userinput> to disable automatic ejection, and be aware that you may need to ensure that the system does not automatically boot from the optical drive after the initial installation.
ko: 자동으로 미디어를 꺼내지 않으려면 <userinput>false</userinput>로 설정합니다. 단 설치한 후에 시스템이 광학 드라이브에서 자동으로 부팅하지 않도록 하십시오.
pt: Coloque <userinput>false</userinput> para desactivar ejecção automática, e fique atento pois pode necessitar de assegurar que o sistema não inicia automaticamente a partir da drive optical após a instalação inicial.
zh_tw: 設為 <userinput>false</userinput> 可以禁止自動退出，但要小心確保系統在安裝完後，不會自動從光碟開機。

source: If you are using a 2.2.x kernel, you may need to set &ramdisksize;.
ko: 2.2.x 커널을 사용한다면, &ramdisksize;로 설정해야 합니다.
pt: Se está a utilizar um kernel 2.2.x, você pode necessitar de definir &ramdisksize;.
zh_tw: 如果您在使用 2.2.x 核心，也許需要設定 &ramdisksize;。

source: Set to <userinput>true</userinput> to enter rescue mode rather than performing a normal installation. See <xref linkend="rescue"/>.
ko: <userinput> true</userinput> . <xref linkend="rescue"/> .
pt: Defina como <userinput>true</userinput> para entrar em modo de recuperação em vez de efectuar uma instalação normal. Veja a <xref linkend="rescue"/>.

source: Troubleshooting the Installation Process
ko: 설치 과정의 문제 해결
pt: Diagnosticar Problemas no Processo de Instalação
zh_tw: 安裝過程中的障礙排除

source: Floppy Disk Reliability
ko: 플로피 디스크 신뢰성
pt: Disquetes de confiança
zh_tw: 軟碟的可靠性

source: The biggest problem for people using floppy disks to install Debian seems to be floppy disk reliability.
ko: 플로피 디스크를 사용해 설치하는 사람이 겪는 가장 큰 문제는 플로피 디스크 신뢰성 문제일 것입니다.
pt: O maior problema para as pessoas que utilizam disquetes para instalar Debian parece ser a confiança na duração das disquetes.
zh_tw: 對於第一次安裝 Debian 的人來說，他們遇到的最大的問題很可能是軟碟的可靠性。

source: The boot floppy is the floppy with the worst problems, because it is read by the hardware directly, before Linux boots. Often, the hardware doesn't read as reliably as the Linux floppy disk driver, and may just stop without printing an error message if it reads incorrect data. There can also be failures in the Driver Floppies most of which indicate themselves with a flood of messages about disk I/O errors.
ko: 부트 플로피가 가장 문제가 많은 플로피입니다. 부트 플로피는 리눅스가 아니라 하드웨어에서 직접 읽어들이기 때문입니다. 가끔 하드웨어는 리눅스 플로피 디스크 드라이버가 하는 것 만큼 안정적으로 플로피를 읽지 못합니다. 또 잘못된 데이터를 읽은 경우에도 오류 메세지를 표시하지 않고 멈춰버리기도 합니다. 드라이버 플로피에서도 디스크 입출력 오류 메세지만 가득 나오는 문제가 발생하기도 합니다.
pt: A disquete de arranque é a disquete com os piores problemas, porque é lida directamente pelo hardware, antes do arranque do Linux. Frequentemente o hardware não lê de uma forma confiável como a drive de disquete, e em caso de lêr dados incorrectos pode simplesmente parar sem mostrar mensagens de erro. Pode também existir falhas na drive de disquetes que são indicadas por muitas mensagens de erros I/O.
zh_tw: 問題出現最嚴重的是糟糕的開機軟碟，因為他們由硬體直接讀出，然後才進入 Linux 開機程序。很多情況下，硬體的讀取並不能像 Linux 軟碟驅動讀取那樣可靠，並且對於錯誤的資料，它們只是停止執行而且沒有錯誤訊息。軟碟機也可能發生錯誤並且印出很多有關的 I/O 錯誤。

source: If you are having the installation stall at a particular floppy, the first thing you should do is re-download the floppy disk image and write it to a <emphasis>different</emphasis> floppy. Simply reformatting the old floppy may not be sufficient, even if it appears that the floppy was reformatted and written with no errors. It is sometimes useful to try writing the floppy on a different system.
ko: 설치 도중에 특정 플로피에서 멈추는 현상이 발생하면, 가장 먼저 할 일은 플로피 디스크 이미지를 다시 받아서 <emphasis>다른</emphasis> 플로피에 만들어 보는 것입니다. 기존의 플로피를 다시 포맷하는 것만으로는 (애러 없이 포맷이 되더라도) 안 됩니다. 다른 시스템에서 플로피를 만드는 게 도움이 될 수도 있습니다.
pt: Se está a enfrentar paragens da instalação numa disquete em particular, a primeira coisa que deve fazer é re-download da imagem da disquete e gravá-la para uma disquete <emphasis>diferente</emphasis>. Reformatando simplesmente a antiga disquete pode não ser suficiente, mesmo que por vezes seja útil tentar escrever a disquete num sistema diferente.
zh_tw: 如果您在特定的軟碟上遇到麻煩，第一件要做的事情，是重新下載磁碟映像並且把它寫到<emphasis>另外</emphasis>一張軟碟上。僅僅只是格式化老的軟碟是不夠的，有可能的話甚至要在別的統上重寫這些軟碟。

source: One user reports he had to write the images to floppy <emphasis>three</emphasis> times before one worked, and then everything was fine with the third floppy.
ko: 어떤 사용자는 플로피가 제대로 동작할 때까지 이미지를 무려 <emphasis>세 번</emphasis> 써야 했다고 하고, 세 번째 플로피에서 제대로 동작했다고 합니다.
pt: Um utilizador reportou que teve de gravar a imagem para a disquetes <emphasis>três</emphasis> vezes antes de funcionar, e após isso tudo ficou bem com a terceira disquete.
zh_tw: 一個使用者曾報告他不得不把映像往軟碟寫了<emphasis>三</emphasis>次，直到第四次軟碟才算工作良好。

source: Other users have reported that simply rebooting a few times with the same floppy in the floppy drive can lead to a successful boot. This is all due to buggy hardware or firmware floppy drivers.
ko: 또 어떤 사용자는 같은 플로피를 가지고 여러 번 다시 부팅하니까 성공적으로 부팅했다고 합니다. 이러한 현상은 모두 문제가 있는 하드웨어나 펌웨어의 플로피 드라이버때문입니다.
pt: Outros utilizadores reportaram que simplesmente reiniciando algumas vezes com a mesma disquete na drive de disquetes levou a um arranque bem sucedido. Tudo isto está relacionado com os erros do hardware ou os drivers de disquetes.
zh_tw: 其他一些使用者報告過用同樣的軟碟重新啟動若干次才能有一次成功的開機。這都是因為 硬體或者有缺陷的韌體軟碟驅動程式造成的。

source: Boot Configuration
ko: 부팅 설정
pt: Configuração de arranque
zh_tw: 開機設定

source: If you have problems and the kernel hangs during the boot process, doesn't recognize peripherals you actually have, or drives are not recognized properly, the first thing to check is the boot parameters, as discussed in <xref linkend="boot-parms"/>.
ko: 문제가 생겨서 커널이 부팅 과정에서 멈추거나, 주변 장치를 인식하지 못하거나, 드라이브를 제대로 인식하지 못하거나 하는 경우, 먼저 부팅 파라미터가 <xref linkend="boot-parms"/>에 쓰여 있는 것처럼 제대로 되었는 지 확인하십시오.
pt: Se tiver dificuldade e o kernel parar durante o processo de arranque, não reconhece periféricos que tem, ou os drivers não são reconhecidos devidamente, a primeira coisa a verificar são os parâmetros de arranque, como foi visto na <xref linkend="boot-parms"/>.
zh_tw: 如果在開機過程中您遇到了問題或者核心當掉、無法辨識存在的周邊設備或者辨識錯誤，首先要做的事情是檢查開機參數，如同 <xref linkend="boot-parms"/> 之中的內容。

source: If you are booting with your own kernel instead of the one supplied with the installer, be sure that <userinput>CONFIG_DEVFS</userinput> is set in your kernel. The installer requires <userinput>CONFIG_DEVFS</userinput>.
ko: 설치 프로그램에 들어 있는 커널 대신에 직접 만든 커널로 부팅하려면, <userinput>CONFIG_DEVFS</userinput>를 꼭 설정하십시오. 설치 프로그램에서 <userinput>CONFIG_DEVFS</userinput>가 필요합니다.
pt: Se está a iniciar com o seu próprio kernel em vez de um que tivesse vindo com o instalador, certifique-se que <userinput>CONFIG_DEVFS</userinput> está activo no seu kernel. O instalador requer <userinput>CONFIG_DEVFS</userinput>.
zh_tw: 如果開機時使用的是您自己的核心，而不是安裝程式提供的核心，請確定您的核心編有 <userinput>CONFIG_DEVFS</userinput> 參數。安裝程式需要 <userinput>CONFIG_DEVFS</userinput>。

source: Often, problems can be solved by removing add-ons and peripherals, and then trying booting again. <phrase arch="i386">Internal modems, sound cards, and Plug-n-Play devices can be especially problematic.</phrase>
ko: 추가 장치나 주변 기기를 없앤 다음에 다시 부팅하면 문제가 없어질 수도 있습니다. <phrase arch="i386">내장 모뎀, 사운드 카드 및 플러그앤플레이 장치들이 특히 문제가 많습니다.</phrase>
pt: Frequentemente pode ser resolvido removendo add-ons e periféricos, e tente reiniciar novamente. <phrase arch="i386"> Modem internos, placas de som e dispositivos Plug-n-Play podem ser especialmente problemáticos.</phrase>
zh_tw: 通稱，可以透過移除外掛硬體或者周邊設備來解決問題，然後再次重新開機。<phrase arch="i386"> 內建的調變解調器、音效卡以及隨插即用的設備通常很容易引起問題。</phrase>

source: If you have a large amount of memory installed in your machine, more than 512M, and the installer hangs when booting the kernel, you may need to include a boot argument to limit the amount of memory the kernel sees, such as <userinput>mem=512m</userinput>.
ko: 기계에 512M 보다 더 많은 메모리가 붙어 있는 경우에 설치 프로그램의 커널이 부팅할 때 멈춘다면, 커널에 보이는 메모리 양을 제한하는 부팅 파라미터를 써야 할 수도 있습니다. 예를 들어 <userinput>mem=512m</userinput>과 같이 씁니다.
pt: Se tem uma grande quantidade de memória instalada na sua máquina, mais que 512M, e o instalador pára quando inicia o kernel, pode necessitar de incluir um argumento de arranque para limitar a quantidade de memória que o kernel vê, tal como <userinput>mem=512m</userinput>.
zh_tw: 如果您的機器上裝有多於 512M 的大容量的記憶體，並且安裝程式在啟動核心時當住，您可能需要加入一個開機參數，來限制核心能夠看到的記憶體數量，例如 <userinput>mem=512m</userinput>。

source: Common &arch-title; Installation Problems
ko: 자주 발생하는 &arch-title; 설치 문제
pt: Problemas comuns de Instalação em &arch-title;
zh_tw: 常見的 &arch-title; 安裝問題

source: There are some common installation problems that can be solved or avoided by passing certain boot parameters to the installer.
ko: 자주 발생하는 설치 문제중에 몇 개는 설치 프로그램에 부팅 파라미터를 넘기는 방법으로 해결할 수 있습니다.
pt: Existem alguns problemas de instalação usuais que podem ser resolvidos ou evitados passar alguns parâmetros de arranque ao instalador.
zh_tw: 傳入某些啟動參數可以解決或避免一些常見的安裝問題。

source: Some systems have floppies with <quote>inverted DCLs</quote>. If you receive errors reading from the floppy, even when you know the floppy is good, try the parameter <userinput>floppy=thinkpad</userinput>.
ko: 일부 시스템에는 ``DCL이 뒤바뀐'' 플로피가 달려 있습니다. 플로피가 문제가 없는 게 분명한데도 플로피를 읽다가 오류가 발생하면, <userinput>floppy=thinkpad</userinput> 파라미터를 시도해 보십시오.
pt: Alguns sistemas têm disquetes com <quote>inverted DCLs</quote>. Se receber erros ao ler a disquete, mesmo quando tem a certeza que a disquete está boa, tente o parâmetro <userinput>floppy=thinkpad</userinput>.
zh_tw: 一些系統的軟碟會有 ``inverted DCLs''。如果您在讀軟碟時遇到錯誤資訊，並且您可以確定軟碟是好的，嘗試參數 <userinput>floppy=thinkpad</userinput>。

source: On some systems, such as the IBM PS/1 or ValuePoint (which have ST-506 disk drivers), the IDE drive may not be properly recognized. Again, try it first without the parameters and see if the IDE drive is recognized properly. If not, determine your drive geometry (cylinders, heads, and sectors), and use the parameter <userinput>hd=<replaceable>cylinders</replaceable>,<replaceable>heads</replaceable>,<replaceable>sectors</replaceable></userinput>.
ko: IBM PS/1이나 ValuePoint같은 (ST-506 디스크 드라이버가 있는) 일부 시스템에서는 IDE 드라이브를 제대로 인식하지 못하기도 합니다. 먼저 파라미터 없이 IDE 드라이버를 제대로 인식하는 지 시도해 보십시오. 제대로 인식하지 못하면, 드라이브 크기를 (실린더, 헤드, 섹터) 알아보고, <userinput>hd=<replaceable>cylinders</replaceable>,<replaceable>heads</replaceable>,<replaceable>sectors</replaceable></userinput> 파라미터를 사용하십시오.
pt: Em alguns sistemas, tal como o IBM PS/1 ou ValuePoint (que tem um driver de disco ST-506), a drive IDE poderá não ser reconhecido propriamente. Mais uma vez, tente primeiro sem nenhum parâmetro e veja se a drive IDE é reconhecida sem problemas. Senão, determine a geometria da sua drive (cilindros, cabeças e sectores) e use o parâmetro <userinput>hd=<replaceable>cylinders</replaceable>,<replaceable>heads</replaceable>,<replaceable>sectors</replaceable></userinput>.
zh_tw: 在一些系統上，例如 IBM PS/1 或者 ValuePoint (具有 ST-506 設備)，IDE 設備可能無法辨識。請首先嘗試沒有參數的開機情況下是否能夠被識別。如果不行，請確定設備的幾何參數 (柱面，磁頭還有磁區)。然後使用參數 <userinput>hd=<replaceable>cylinders</replaceable>,<replaceable>heads</replaceable>,<replaceable>sectors</replaceable></userinput>。

source: If you have a very old machine, and the kernel hangs after saying <computeroutput>Checking 'hlt' instruction...</computeroutput>, then you should try the <userinput>no-hlt</userinput> boot argument, which disables this test.
ko: 아주 오래된 기계에서 <computeroutput>Checking 'hlt' instruction...</computeroutput>라고 나오면서 커널이 멈춘다면, hlt 인스트럭션 테스트를 하지 않도록 <userinput>no-hlt</userinput> 파라미터를 시도해 보십시오.
pt: Se tem uma máquina mesmo muito velha, e o kernel pára após mostrar <computeroutput>Checking 'hlt' instruction...</computeroutput>, então deverá tentar <userinput>no-hlt</userinput> como argumento no arranque, o que desactiva este teste.
zh_tw: 如果您有一台非常老的機器，並且核心在顯示 <computeroutput>Checking 'hlt' instruction...</computeroutput> 時中斷，需要嘗試 <userinput>no-hlt</userinput> 參數來取消這個測試。

source: If your screen begins to show a weird picture while the kernel boots, eg. pure white, pure black or colored pixel garbage, your system may contain a problematic video card which does not switch to the framebuffer mode properly. Then you can use the boot parameter <userinput>debian-installer/framebuffer=false</userinput> or <userinput>video=vga16:off</userinput> to disable the framebuffer console. Only the English language will be available during the installation due to limited console features. See <xref linkend="boot-parms"/> for details.
ko: 커널이 부팅할 때 화면에 괴상한 그림이 나온다면, 예를 들어 전부 하얀 색이 되거나 전부 검은 색이 되거나 가지가지 색의 픽셀 쓰레기가 나오거나 하면, 프레임버퍼 모드로 제대로 전환하지 못하는 문제 있는 비디오 카드가 붙어 있다는 뜻입니다. 그러면 <userinput>debian-installer/framebuffer=false</userinput> 혹은 <userinput>video=vga16:off</userinput> 파라미터로 프레임버퍼 콘솔을 끌 수 있습니다. 콘솔 기능의 한계때문에 설치할 때 언어는 영어만 사용할 수 있습니다. 자세한 건 <xref linkend="boot-parms"/> 부분을 참고하십시오.
pt: Se o seu ecrã começa a mostrar uma fotografia estranha quando o seu kernel arranca, eg. toda branca, toda preta, ou com coloração estranha, o seu sistema poderá conter uma placa de vídeo problemática, o que faz com que não se faça a mudança para o modo framebuffer correctamente. Neste caso, deve usar como parâmetro de arranque <userinput>debian-installer/framebuffer=false</userinput> ou <userinput>video=vga16:off</userinput>, para desabilitar a consola com framebuffer. Apenas o idioma inglês estará disponível durante a instalação devido a características limitadas na consola. Veja a <xref linkend="boot-parms"/> para mais detalhes.
zh_tw: 如果您的螢幕在核心開機的時候顯示一個奇怪的圖片 (例如，純白，純黑或者彩色的像素塊)，則顯示卡可能有問題。它不能切換至 framebuffer 模式。您可以使用開機參數 <userinput>debian-installer/framebuffer=false</userinput> 或 <userinput>video=vga16:off</userinput> 來取消 framebuffer 控制台。在這種情況下，由於控制台的限制，在安裝過程中只能用英語，請參閱 <xref linkend="boot-parms"/> 來取得細節資訊。

source: System Freeze During the PCMCIA Configuration Phase
ko: PCMCIA 설정 단계에서 시스템 멈춤
pt: Bloqueio do Sistema Durante a Fase de Configuração de PCMCIA
zh_tw: 在 PCMCIA 段系統當機

source: Some laptop models produced by Dell are known to crash when PCMCIA device detection tries to access some hardware addresses. Other laptops may display similar problems. If you experience such a problem and you don't need PCMCIA support during the installation, you can disable PCMCIA using the <userinput>hw-detect/start_pcmcia=false</userinput> boot parameter. You can then configure PCMCIA after the installation is completed and exclude the resource range causing the problems.
ko: Dell에서 제조한 일부 노트북 모델은 PCMCIA 장치를 찾을 때 특정 하드웨어 주소에 접근하는 순간 멈춰 버립니다. 그 외의 노트북 모델도 비슷한 현상이 나타날 수 있습니다. 만약 그러한 문제가 발생하고 설치할 때 PCMCIA 기능이 필요없다면, <userinput>hw-detect/start_pcmcia=false</userinput> 부팅 파라미터로 PCMCIA를 끌 수 있습니다. 설치를 마친 다음에 PCMCIA를 설정해서 문제가 발생하는 구간을 제외할 수 있습니다.
pt: Alguns modelos de portáteis produzidos pela DELL, são conhecidos por bloquearem quando um dispositivo PCMCIA tenta aceder a alguns endereços de hardware. Outros portáteis poderão mostrar problemas similares. Se experimentou tal problema e não necessita do suporte PCMCIA durante a instalação, poderá desactivar PCMCIA usando o parâmetro de arranque <userinput>hw-detect/start_pcmcia=false</userinput>. Pode depois configurar a PCMCIA após a instalação estar concluída e excluir o recurso a causar o conflito.
zh_tw: 某些型號的 Dell 筆記型電腦會在 PCMCIA 設備檢測程式嘗試存取一些硬體位址的時候當機。其他筆記型電腦可能顯示類似的問題。如果您遇到那樣的問題，並且在安裝的時候不需要 PCMCIA 的支援，可以用 <userinput>hw-detect/start_pcmcia=false</userinput> 啟動參數來取消 PCMCIA 功能。您可以在安裝後，配定 PCMCIA 並且避開可能引起問題的資源範圍。
