Repository: xobs/debian-installer
Catalog: doc/manual/po/*/boot-new.po
Languages: el, ko, pt, ru, zh_cn, zh_tw

source: Depending on the location selected at the beginning of the installation process, you will next be shown either a single timezone or a list of timezones relevant for that location. If a single timezone is shown, choose <guibutton>Yes</guibutton> to confirm or choose <guibutton>No</guibutton> to select from the full list of timezones. If a list is shown, select your timezone from the list, or select Other for the full list.
el: Ανάλογα με την περιοχή που επιλέξατε στην αρχή της εγκατάστασης θα σας παρουσιαστεί στη συνέχεια είτε μια μοναδική χρονική ζώνη είτε μια λίστα από τέτοιες ζώνες σχετικές με την τοποθεσία αυτή. Αν σας δοθεί μια μοναδική χρονική ζώνη, επιλέξτε <guibutton>Ναι</guibutton> για επιβεβαίωση ή επιλέξτε <guibutton>No</guibutton> για να διαλέξετε από την πλήρη λίστα των χρονικών ζωνών. Αν σας δοθεί μια λίστα διαλέξτε την χρονική σας ζώνη από τη λίστα αυτή ή διαλέξτε Άλλο για να έχετε την πλήρη λίστα.
ko: 설치과정의 시작부분에서 선택된 지역에 따라 하나의 시간대 또는 여러 시간대들의 목록을 볼 것입니다. 하나의 시간대만 보여진다면 <guibutton>Yes</guibutton>를 선택해 확인하거나 <guibutton>No</guibutton>를 선택해 시간대들의 전체 목록에서 선택할 수 있습니다. 만일 시간대의 목록이 보여진다면, 목록에서 당신의 시간대를 선택하거나 전체 목록에서 다른 것을 선택할 수 있습니다.
pt: Dependendo da localização seleccionada no inicio do processo de instalação, ser-lhe-á apresentado de seguida apenas um fuso horário ou uma lista de fusos horários relevantes para essa localização. Se apenas for mostrado um fuso horário, escolha <guibutton>Yes</guibutton> para confirmar ou escolha <guibutton>No</guibutton> para escolher um fuso horário da lista completa de fusos horários. Se for mostrada uma lista, seleccione o seu fuso horário dessa lista, ou Outro para a lista completa.
ru: В зависимости от места, выбранного в начале процесса установки, вам будет показан либо один часовой пояс, либо список часовых поясов возможных в вашей географической точке. Если показан один часовой пояс, выберите <guibutton>Да</guibutton> для подтверждения или <guibutton>Нет</guibutton> для выбора из полного списка часовых поясов. Если показан список, выберите ваш часовой пояс из списка или выберите <guibutton>Другой</guibutton> для просмотра полного списка.
zh_cn: 基于安装开始时选择的地理位置，您将看到系统只列出与该位置相关的单一或者有限的时区列表。如果只列出一个时区，选择 <guibutton>是</guibutton>确认或者选择 <guibutton>否</guibutton> 从完整列表中去选择。当列表显示出来，从其中选择您的时区，或者选择其他列出完整列表。
zh_tw: 基於安裝開始時選擇的地理位置，您將看到系統只列出與該位置相關的單一或者有限的時區列表。如果只列出一個時區，選擇<guibutton>是</guibutton>確認或者選擇<guibutton>否</guibutton> 從完整列表中去選擇。當列表顯示出來，從中選擇您的時區，或者選擇其他以列出完整列表。

source: Setting Up Users And Passwords
el: Ρύθμιση των Χρηστών και των Κωδικών Πρόσβασης
ko: 사용자와 암호 설정
pt: Definir Utilizadores E Palavras Passe
ru: Добавление пользователей и паролей
zh_cn: 设置用户和密码
zh_tw: 設定使用者和密碼

source: Set the Root Password
el: Ορίστε τον κωδικό πρόσβασης για τον χρήστη Root
ko: Root 암호 설정
pt: Definir a Palavra Pass de Root
ru: Установка пароля суперпользователя (root)
zh_cn: 设置 root 密码
zh_tw: 設定 root 密碼

source: The <emphasis>root</emphasis> account is also called the <emphasis>super-user</emphasis>; it is a login that bypasses all security protection on your system. The root account should only be used to perform system administration, and only used for as short a time as possible.
el: O λογαριασμός του χρήστη <emphasis>root</emphasis> λέγεται συχνά και λογαριασμός <emphasis>root</emphasis>. Είναι ο λογαριασμός με την πρόσβαση που παρακάμπτει κάθε προστασία ασφάλειας στο σύστημά σας. Ο λογαριασμός αυτός πρέπει να χρησιμοποιείται μόνο για την εκτέλεση διαφόρων διαχειριστικών εργασιών στο σύστημα και για όσο το δυνατόν συντομότερο χρονικό διάστημα.
ko: <emphasis>root</emphasis> 계정은 또한 <emphasis>super-user</emphasis>라고도 불리웁니다. 이 계정은 당신의 시스템의 모든 보안상 보호들을 통과할 수 있습니다. root 계정은 시스템 관리를 수행하기 위해서만 사용되어야 하며, 가능한한 짧은 시간 동안만 사용되어야 합니다.
pt: A conta de root é também chamada de <emphasis>super-user</emphasis>; é um acesso ao sistema que ultrapassa qualquer protecção de segurança no seu sistema. A conta de root deve apenas ser utilizada para efectuar administração do sistema, e apenas por um período que deve ser o mais curto possível.
ru: Учётная запись <emphasis>root</emphasis> также называемая <emphasis>суперпользовательской</emphasis> &mdash; это учетная запись, для которой нет никаких преград в вашей системе. Учётная запись root должна использоваться только для администрирования системы и как можно меньшее время.
zh_cn: <emphasis>root</emphasis> 帐户也被称为 <emphasis>超级用户</emphasis>系统中的所有的安全防护措施对超级用户身份登陆者都是无效的。root 帐户应该仅用来进行系统管理，而且使用时间应该尽可能短。
zh_tw: <emphasis>root</emphasis> 帳戶也被稱為<emphasis>超級使用者</emphasis>。系統中的所有安全防護措施對以超級使用者身份登陸者都是無效的。root 帳戶應該僅用來進行系統管理，而且使用時間應該盡可能短。

source: Any password you create should contain at least 6 characters, and should contain both upper- and lower-case characters, as well as punctuation characters. Take extra care when setting your root password, since it is such a powerful account. Avoid dictionary words or use of any personal information which could be guessed.
el: Κάθε κωδικός πρόσβασης που δημιουργείτε πρέπει να έχει τουλάχιστον 6 χαρακτήρες, τόσο κεφαλαίους όσο και πεζούς καθώς και χαρακτήρες στίξης.Προσέξτε ιδιαίτερα όταν ρυθμίζετε τον κωδικό πρόσβασης για τον χρήστη root καθώς ο λογαριασμός του χρήστη αυτού είναι τόσο ισχυρός. Αποφύγετε την χρήση οποιωνδήποτε λέξεων από το λεξικό ή οποιαδήποτε προσωπική πληροφορία που θα μπορούσε κανείς να μαντέψει.
ko: 만드는 어떤 암호라도 적어도 6자이상 이고, 대문자와 소문자 특수 문자 등이 포함되는 것이 좋습니다. root 암호를 설정할 때는계정 권한이 막강하기 때문에 좀 더 주의를 기울여 주세요. 사전에 나와있는 단어나 추측할 수 있는 개인 정보의 사용은 피하시길 바랍니다.
pt: Qualquer password que criar deve conter pelo menos 6 caracteres, e deve conter tanto caracteres maíusculos como minúsculos, bem como caracteres de pontuação. Tenha especial atenção quando definir a sua password de root, uma vez que é uma conta com muitos poderes. Evite o uso de palavras que constem em dicionários ou que contenham alguma informação pessoal que facilmente possa ser adivinhada.
ru: Любой создаваемый вами пароль должен состоять как минимум из 6 символов и содержать заглавные и строчные буквы, а также знаки препинания. Уделите побольше внимания при установке пароля root, поскольку эта самая мощная учётная запись. Избегайте слов из словаря или использования любой персональной информации, которую можно угадать.
zh_cn: 您所创建的任何密码都应该包含至少 6 个字符，同时包含大小写字母，并且最好带有标点符号等特殊字符。因为超级用户具有最高权限，因此在您设置 root 密码时尤其需要小心。请避免采用能够在字典中查到的单词或者很容易猜测的个人信息。
zh_tw: 您所建立的任何密碼都應該包含至少 6 個字元，同時包含大小寫字母，並且最好帶有標點符號等特殊字元。因為超級使用者具有最高權限，因此在您設定 root 密碼時尤其要小心。請避免採用能夠在字典中查到的單詞或者很容易猜測的個人資訊。

source: If anyone ever tells you they need your root password, be extremely wary. You should normally never give your root password out, unless you are administering a machine with more than one system administrator.
el: Αν κάποιος σας πει ότι χρειάζεται τον κωδικό σας πρόσβασης σαν root να είστε εξαιρετικά επιφυλακτικοί. Δεν θα έπρεπε συνήθως να δώσετε ποτέ τον κωδικό αυτόν πρόσβασης εκτός αν διαχειρίζεστε ένα μηχάνημα με περισσότερους από έναν διαχειριστές συστήματος.
ko: 어떤 사람이 root 암호를 말해 달라고 한다면, 극히 조심하시길 바랍니다. 하나의 시스템의 관리자가 여러 명인 경우가 아니라면, 보통의 경우에 root 암호를 알려주어서는 안됩니다.
pt: Se alguma vez alguém lhe disser que precisa da sua password de root, esteja atento. Normalmente não deve dar a sua password de root, a não ser que esteja a administrar uma máquina com mais do que um administrador de sistemas.
ru: Если кто-то говорит вам, что ему нужен ваш пароль root, будьте очень осторожны. Обычно нет необходимости давать свой пароль root кому-либо, если только вы не администрируете машину вместе с другими системными администратороми.
zh_cn: 如果他人向您索取您的 root 密码，您也需要特别谨慎。除非您所管理的系统有多位管理员，否则您通常不应该将超级用户密码交给别人。
zh_tw: 如果他人向您索取您的 root 密碼，您也需要特別謹慎。除非您所管理的系統有多位管理員，否則您通常不應該將超級使用者密碼交給別人。

source: Create an Ordinary User
el: Δημιουργία ενός απλού χρήστη
ko: 일반 사용자 만들기
pt: Criar um Utilizador Normal
ru: Создание учётной записи обычного пользователя
zh_cn: 创建一个普通用户
zh_tw: 建立一個普通使用者

source: The system will ask you whether you wish to create an ordinary user account at this point. This account should be your main personal log-in. You should <emphasis>not</emphasis> use the root account for daily use or as your personal login.
el: Στο σημείο αυτό το σύστημα θα σας ρωτήσει αν θέλετε να δημιουργήσετε έναν λογαριασμό απλού χρήστη. Αυτός ο λογαριασμός θα μπορεί να είναι ο κύριος λογαριασμός προσωπικής σας πρόσβασης στο σύστημα. <emphasis>Δεν</emphasis> θα πρέπει να χρησιμοποιείτε το λογαριασμό root για την προσωπική σας είσοδο στο σύστημα.
ko: 시스템은 이 시점에서 일반 사용자 계정을 만들 것인지를 물어볼 것입니다. 이 계정은 당신이 주로 사용하는 개인 로긴 계정입니다. 일상적인 사용이나 개인 로긴에서 root 계정을 사용하면 <emphasis>안됩니다</emphasis>.
pt: Nesta fase o sistema perguntar-lhe-á se pretende criar uma conta para um utilizador normal. Esta conta deverá ser a sua conta principal de acesso. <emphasis>Não</emphasis> Deve usar a conta de root para o uso diário ou para seu o acesso pessoal.
ru: Система спросит вас, желаете ли вы сейчас создать учётную запись для обычного пользователя. Эта учётная запись должна использоваться в качестве вашей основной рабочей учётной записи. Вы <emphasis>не должны</emphasis> использовать учётную запись root в повседневной работе или в качестве персональной учетной записи.
zh_cn: 系统会询问您现在是否希望创建一个普通帐户。您将使用该帐户进行日常登陆操作。切记，平时 <emphasis>不要</emphasis> 使用 root 帐户登陆或者将其作为个人帐号使用。
zh_tw: 系統會詢問您現在是否希望建立一個普通帳戶。您將使用該帳戶進行日常登陸操作。切記，平時<emphasis>不要</emphasis>使用 root 帳戶登陸或者將其作為個人帳號使用。

source: Why not? Well, one reason to avoid using root's privileges is that it is very easy to do irreparable damage as root. Another reason is that you might be tricked into running a <emphasis>Trojan-horse</emphasis> program &mdash; that is a program that takes advantage of your super-user powers to compromise the security of your system behind your back. Any good book on Unix system administration will cover this topic in more detail &mdash; consider reading one if it is new to you.
el: Γιατί όχι; Λοιπόν, ένας καταρχήν λόγος που πρέπει να αποφύγετε τη χρήση των προνομίων του χρήστη root είναι το ότι μπορείτε πολύ εύκολα να κάνετε ανεπανόρθωτη ζημιά στο σύστημα σαν root. Ένας άλλος λόγος είναι ότι έτσι μπορεί να παρασυρθείτε ώστε να τρέξετε ένα πρόγραμμα <emphasis>Δούρειο Ίππο</emphasis>, δηλ. ένα πρόγραμμα που εκμεταλλεύεται τις δυνατότητες του λογαριασμού root σαν υπερ-χρήστη ώστε να παραβιάσει την ασφάλεια του συστήματός σας πίσω από την πλάτη σας.Οποιοδήποτε καλό βιβλίο πάνω στην διαχείριση Unix συστημάτων καλύπτει αυτό το θέμα με λεπτομέρειες. &mdash; σκεφτείτε σοβαρά να διαβάσετε ένα από αυτά τα βιβλία αν δεν είστε εξοικειωμένοι με τα θέματα αυτά.
ko: root 권한의 사용을 피하는 이유 중 하나는 root로는 복구하기 힘든 손상을 주기가 매우 쉽기 때문입니다. 다른 이유로는 수퍼유저의 권한을 이용해 숨어서 당신 시스템의 보안을 침해할 수 있는 프로그램인 <emphasis>트로이목마</emphasis> 프로그램을 실행하도록 속을 수 있기 때문입니다. 유닉스 시스템 관리에 대한 좋은 책들은 이 주제에 대해 좀 더 자세하게 다룰 것입니다. 만일 처음 접하는 것이라면 이에 대한 책을 한 권 정도 읽어 보세요.
pt: Porque não? Bem, uma das razões para evitar usar os privilégios de root é porque é muito fácil fazer estragos irreparáveis como root. Outra razão é porque poderá ser levado a correr um programa <emphasis>Cavalo de Tróia</emphasis> &mdash; que é um programa que tira vantagens de poderes de um super-utilizador para comprometer a segurança do seu sistema sem dar por isso. Qualquer bom livro de administração de sistemas Unix cobrirá este tópico com mais detalhe &mdash; considere a leitura de um se este assunto for novo para si.
ru: Почему не должны? Одна из причин, по которой следует избегать использования привилегий root это то, что в качестве root можно очень легко сделать необратимые повреждения. Другая причина: вас могут обманом заставить запустить программу <emphasis>троянского коня</emphasis> &mdash; это программа, которая воспользуется преимуществами ваших возможностей суперпользователя, чтобы скомпрометировать систему. В любой хорошей книге по системному администрированию Unix эта тема рассматривается подробно &mdash; прочтите одну из них, если это для вас в новинку.
zh_cn: 为什么呢？避免使用 root 特权帐户的一个原因是，它很容易对系统造成无法挽回的破坏。另一个原因是，您有可能被恶意诱使运行 <emphasis>特洛伊木马</emphasis> 程序 &mdash; 这是一种利用您的超级用户权限在您未知的情况下损害您的系统安全的程序。任何合格的 Unix 系统管理书籍中都会涉及到这一主题 &mdash; 如果您不是很了解这方面的内容，建议您找一本进行学习。
zh_tw: 為什麼呢？避免使用 root 特權帳戶的一個原因是，它很容易對系統造成無法挽回的破壞。另一個原因是，您有可能被惡意誘使執行<emphasis>特洛伊木馬</emphasis>程式 &mdash; 這是一種在您未知的情況下利用超級使用者權限損害系統安全的程式。任何合格的 Unix 系統管理書籍中都會涉及到這一主題 &mdash; 如果您不是很瞭解這方面的內容，建議您找一本書進行學習。

source: You will first be prompted for the user's full name. Then you'll be asked for a name for the user account; generally your first name or something similar will suffice and indeed will be the default. Finally, you will be prompted for a password for this account.
el: Αρχικά θα παροτρυνθείτε για το πλήρες όνομα του χρήστη, Μετά θα σας ζητηθεί να δώσετε ένα όνομα χρήστη για τον λογαριασμό; γενικά το μικρό σας όνομα ή κάτι ανάλογο θα είναι αρκετό και πραγματικά αυτό είναι η προεπιλογή. Τέλος θα σας ζητηθεί να δώσετε ένα κωδικό πρόσβασης για τον λογαριασμό.
ko: 먼저 전체 이름을 입력하고, 사용자 계정으로 사용할 이름을 입력합니다. 사용자 계정으로 일반적으로 성이나 이와 유사한 어떤 것을 사용하면 충분하고, 실제로 성이 기본 값이 될 것 입니다. 마지막으로 이 계정에 대한 암호를 입력하세요.
pt: Ser-lhe-á perguntado inicialmente o nome completo do utilizador. Seguidamente ser-lhe-á perguntado por um nome para a conta de utilizador; geralmente o seu primeiro nome ou algo similar será suficiente e será esse o valor por defeito. Finalmente, ser-lhe-á perguntado a password para esta conta.
ru: Сначала вас попросят ввести полное имя пользователя. Затем спросят имя пользовательской учётной записи; в общем случае, ваше имя или что-то похожее вполне подойдёт. И, наконец, вас попросят ввести пароль учётной записи.
zh_cn: 您首先会被要求输入用户的全名。然后要求输入用户帐号名； 通常名或者类似的便满足要求，并为缺省值。最后，您将要求输入该帐号的密码。
zh_tw: 您首先會被要求輸入使用者的全名。然後要求輸入使用者帳號名﹔通常為姓之類的即可，並且會成為預設值。最後，您將要求輸入該帳號的密碼。

source: If at any point after installation you would like to create another account, use the <command>adduser</command> command.
el: Αν σε οποιαδήποτε άλλη φάση μετά την εγκατάσταση θελήσετε να δημιουργήσετε έναν άλλο λογαριασμό χρησιμοποιήσετε την εντολή <command>adduser</command>.
ko: 설치 후 어느 때에 다른 계정을 만들기를 원한다면, <command>adduser</command> 명령을 사용하세요.
pt: Se em qualquer ponto depois da instalação pretender criar outra conta, utilize o comando <command>adduser</command>.
ru: Если в любой момент после установки вы захотите создать ещё одну учётную запись, воспользуйтесь командой <command>adduser</command>.
zh_cn: 如果在安装完毕后您还希望建立其它新帐户，请使用 <command>adduser</command> 命令。
zh_tw: 如果在安裝完畢後您還希望建立其它新帳戶，請使用 <command>adduser</command> 命令。

source: Setting Up PPP
el: Ρύθμιση του PPP
ko: PPP 설정
pt: A Configurar o PPP
ru: Настройка PPP
zh_cn: 设置 PPP
zh_tw: 設定 PPP

source: If no network was configured during the first stage of the installation, you will next be asked whether you wish to install the rest of the system using PPP. PPP is a protocol used to establish dialup connections with modems. If you configure the modem at this point, the installation system will be able to download additional packages or security updates from the Internet during the next steps of the installation. If you don't have a modem in your computer or if you prefer to configure your modem after the installation, you can skip this step.
el: Αν δεν ρυθμίσατε κάποιο δίκτυο κατά την πρώτη φάση της εγκατάστασης θα ερωτηθείτε στην συνέχεια για το αν θέλετε να εγκαταστήσετε το υπόλοιπο σύστημα χρησιμοποιώντας PPP. To PPP είναι ένα πρωτόκολλο που χρησιμοποιείται για την θεμελίωση συνδέσεων dialup με modem. Αν κάνετε την ρύθμιση του modem στη φάση αυτή τότε το σύστημα εγκατάστασης θα έχει την δυνατότητα να κατεβάσει επιπρόσθετα πακέτα ή αναβαθμίσεις ασφαλείας από το Διαδίκτυο στα επόμενα βήματα της εγκατάστασης. Αν δεν έχετε ένα modem στον υπολογιστή σας ή αν προτιμάτε να ρυθμίσετε το modem σας μετά την εγκατάσταση παραλείψτε αυτό το βήμα.
ko: 설치의 첫 단계에서 네트워크를 설정하지 않았다면, 시스템의 나머지 설치를 PPP를 사용할 것인지를 물어볼 것입니다. PPP는 모뎀을 사용하여 전화 연결을 만드는 데 사용되는 프로토콜입니다. 이 단계에서 모뎀을 설정한다면, 설치 시스템은 설치의 다음 단계 동안 인터넷을 통해 추가 패키지들이나 보안 업데이트들을 다운로드 할 수 있습니다. 만일 당신의 컴퓨터에 모뎀이 없거나 설치 후에 모뎀을 설정하길 원한다면, 이 단계를 건너 뛸 수 있습니다.
pt: Se nenhuma rede tiver sido configurada durante a primeira fase da instalação, ser-lhe-á perguntado de seguida se pretende instalar o resto do sistema usando o PPP. O PPP é um protocolo utilizado para estabelecer ligações por telefone entre modems. Se configurar o modem agora, a instalação do sistema será capaz de fazer download dos pacotes adicionais ou actualizações de segurança da Internet nos próximos passos da instalação. Se não tiver um modem no seu computador ou se preferir configurar o seu modem depois da instalação, pode saltar este passo.
ru: Если на первом этапе установки не было настроено подключение к сети, то далее вас спросят, хотите ли вы установить оставшуюся часть системы через PPP соединение. PPP &mdash; это протокол, используемый для установления удалённого соединения через модем. Если вы настроите модем сейчас, то программа установки сможет загрузить дополнительные пакеты и обновления безопасности из Интернет на следующих этапах установки. Если у вас нет модема или если вы хотите настроить модем после установки, то можете пропустить этот шаг.
zh_cn: 如果您的计算机没有连上网络，接下来您将会被问到是否希望使用 PPP 安装其余的系统。PPP 是通过调制解调器建立拨号连接的协议。如果您现在需要配置调制解调器，安装系统将下载一些额外的软件包，或者在安装的下一阶段从互联网安全更新。如果您的计算机没有调制解调器，或者希望安装完之后再配置调制解调器，您可以跳过这一节。
zh_tw: 如果您的電腦沒有連上網路，接下來您將會被問到是否希望使用 PPP 安裝其餘的系統。PPP 是透過調變解調器建立撥號連接的通訊協定。如果您現在需要設定調變解調器，安裝系統將下載一些額外的軟體套件，或者在安裝的下一階段從網際網路安全更新。如果您的電腦沒有調變解調器，或者希望安裝完之後再設定調變解調器，您可以跳過這一節。

source: In order to configure your PPP connection, you will need some information from your Internet Service Provider (ISP), including phone number, username, password and DNS servers (optional). Some ISPs provide installation guidelines for Linux distributions. You can use that information even if they don't specifically target Debian since most of the configuration parameters (and software) is similar amongst Linux distributions.
el: Για να ρυθμίσετε την σύνδεση PPP θα χρειαστείτε κάποια στοιχεία από τον Παροχέα της Υπηρεσίας Διαδικτύου (ISP) μεταξύ άλλων τηλεφωνικό αριθμό, όνομα χρήστη, κωδικό πρόσβασης και DNS server (προαιρετικά). Μερικοί ISP προσφέρουν οδηγίες εγκατάστασης για διανομές Linux. Μπορείτε να χρησιμοποιήσετε αυτές τις οδηγίες ακόμα κι αν δεν απευθύνονται συγκεκριμένα στο Debian μιας και οι περισσότερες παράμετροι των ρυθμίσεων είναι παρόμοιες ανάμεσα στις διανομές Linux.
ko: PPP 연결을 설정하기 위해 당신의 인터넷 서비스 제공자(ISP)로 부터 전화번호, 사용자이름, 암호, DNS 서버 (선택적) 에 대한 정보를 필요로 합니다. 몇몇 ISP들은 리눅스 배포판을 위한 설치 안내를 제공합니다. 대부분의 리눅스 배포판들의 설정 인자 값들이나 소프트웨어들이 유사하기 때문에 그들이 데비안에 설치하는 것을 목적으로 하지 않는 다 하더라도 이 정보들을 사용할 수 있습니다.
pt: Para configurar a sua ligação PPP, irá precisar de alguma informação do seu fornecedor de Internet (ISP), incluindo o número de telefone, nome de utilizador, password e servidores de DNS (opcional). Alguns ISPs fornecem guias de instalação para distribuições Linux. Pode usar essa informação mesmo que não seja específica para Debian uma vez que a maior parte dos parâmetros de configuração (e software) é semelhante em todas as distribuições de Linux.
ru: Чтобы настроить PPP соединение, вам потребуется некоторая информация от провайдера услуг Интернет (ISP): номер телефона, имя пользователя, пароль и IP адреса DNS серверов (необязательно). Некоторые ISP рассказывают как настроить соединение в Linux для какого-то дистрибутива. Вы можете использовать эту информацию даже если она не относится именно к Debian, так как большинство параметров настройки (и программного обеспечения) одинаковы для всех дистрибутивов Linux.
zh_cn: 为了配置 PPP 连接，您需要从互联网服务器提供商(ISP)那里了解一些信息，包括电话号码，用户名，口令和 DNS 服务器(可选)。一些 ISP 为 Linux 发行版提供安装指引。您可以使用这些信息，即使他们并不是针对 Debian，这是因为在 Linux 发行版之间，大多数的配置参数(和软件)都类似。
zh_tw: 為了設定 PPP 連線，您需要從網際網路伺服器供應商 (ISP) 那裡瞭解一些資訊，包括電話號碼，使用者名稱，密碼和 DNS 伺服器 (非必要)。一些 ISP 為 Linux 發行版提供安裝指引。即使他們並不是針對 Debian，您也可以使用這些資訊，這是因為在 Linux 發行版之間，大多數的設定參數 (和軟體) 都類似。

source: If you do choose to configure PPP at this point, a program named <command>pppconfig</command> will be run. This program helps you configure your PPP connection. <emphasis>Make sure, when it asks you for the name of your dialup connection, that you name it <userinput>provider</userinput>.</emphasis>
el: Αν επιλέξετε να ρυθμίσετε το PPP σε αυτό το σημείο θα τρέξετε το πρόγραμμα <command>pppconfig</command>, που σας βοηθήσει να ρυθμίσετε την σύνδεσή σας με PPP. <emphasis>Βεβαιωθείτε όταν σας ρωτήσει για το όνομα της dialup σύνδεσής σας ότι της δίνετε το όνομα <userinput>provider</userinput>.</emphasis>
ko: 이 단계에서 당신이 PPP를 설정하도록 선택했다면, <command>pppconfig</command>라는 프로그램을 실행할 수 있습니다. 이 프로그램은 당신의 PPP 연결을 설정하는데 도움을 줍니다. <emphasis>전화 연결의 이름을 물어 볼 때 <userinput>provider</userinput>로 이름 짓는 것을 확실히 합니다.</emphasis>
pt: Se pretender configurar o PPP agora, um programa chamado <command>pppconfig</command> será executado. Este programa ajuda-o a configurar a sua ligação PPP. <emphasis>Certifique-se que, quando perguntar pelo nome da sua ligação telefónica, que lhe chama <userinput>provider</userinput>.</emphasis>
ru: Если вы сейчас выберете настройку PPP, запустится программа <command>pppconfig</command>. Она поможет вам настроить PPP соединение. <emphasis>Когда она спросит имя удалённого соединения, укажите имя <userinput>provider</userinput>.</emphasis>
zh_cn: 如果您选择在现在配置PPP，应用程序 <command>pppconfig</command> 将帮助您完成后续工作。<emphasis>记住，当程序提示您输入拨号连接名称时，您应该输入 <userinput>provider</userinput>。</emphasis>
zh_tw: 如果您選擇在現在設定PPP，應用程式 <command>pppconfig</command> 將幫助您完成後續工作。<emphasis>記住，當程式提示您輸入撥號連接名稱時，您應該輸入 <userinput>供應商名稱</userinput>。</emphasis>

source: Hopefully, the <command>pppconfig</command> program will walk you through a trouble-free PPP connection setup. However, if it does not work for you, see below for detailed instructions.
el: Αν όλα πάνε καλά, όπως ελπίζουμε, το πρόγραμμα <command>pppconfig</command> θα σας οδηγήσει σε μια χωρίς προβλήματα ρύθμιση της σύνδεσης PPP. Αν παρόλα αυτά, δεν δουλέψει για σας κοιτάξτε στην συνέχεια για πιο λεπτομερείς οδηγίες.
ko: <command>pppconfig</command> 프로그램이 문제가 발생하지 않는 PPP 연결을 설정하길 바랍니다. 만일 설정이 동작하지 않는 다면, 아래의 자세한 설명을 보세요.
pt: Se tudo correr bem, o programa <command>pppconfig</command> irá guiá-lo a uma configuração da ligação PPP sem problemas. No entanto, se não funcionar, veja abaixo instruções detalhadas.
ru: Надеемся, программа <command>pppconfig</command> проведёт вас через настройку PPP соединения без проблем. Однако, если что-то не получится, обратитесь к описанию ниже.
zh_cn: 如果顺利，<command>pppconfig</command> 能够引导您快速完成设置。否则，您需要继续查看下面的具体命令介绍。
zh_tw: 如果順利，<command>pppconfig</command> 能夠帶領您快速完成設定。否則，您需要繼續查看下面的具體指令介紹。
