Repository: xobs/debian-installer
Catalog: doc/manual/po/*/boot-new.po
Languages: el, ko, pt, ru, zh_cn, zh_tw

source: Booting Into Your New Debian System
el: Μπαίνοντας στο καινούριο Debian Σύστημά σας
ko: 새로운 데비안 시스템으로 부팅하기
pt: A Iniciar O Seu Novo Sistema Debian
ru: Загрузка только что установленной системы Debian
zh_cn: 启动进入新 Debian 系统
zh_tw: 啟動新 Debian 系統

source: The Moment of Truth
el: Η στιγμή της αλήθειας
ko: 진실의 시간
pt: O Momento da Verdade
ru: Момент истины
zh_cn: 关键时刻
zh_tw: 關鍵時刻

source: Your system's first boot on its own power is what electrical engineers call the <quote>smoke test</quote>.
el: Η πρώτη εκκίνηση του συστήματός σας με το δικό του ρεύμα είναι αυτό που οι ηλεκτρολόγοι μηχανικοί ονομάζουν <quote>smoke test</quote>.
ko: 자체 전원으로 당신의 시스템을 처음 부팅하는 것을 전기 기술자들은 <quote>smoke test</quote> 라고 부릅니다.
pt: A primeira inicialização do seu sistema no seu todo é o que os engenheiros eléctricos chamam de <quote>teste de fumo</quote>
ru: Первую самостоятельную загрузку системы инженеры-электрики называют <quote>smoke test</quote>.
zh_cn: 当您系统首次依靠自己启动，这在电子工程师圈子里面称为 <quote>冒烟测试</quote>。
zh_tw: 當您的系統首次自行啟動，這在電子工程師圈子裡面稱為 <quote>冒煙測試</quote>。

source: If you are booting directly into Debian, and the system doesn't start up, either use your original installation boot media, or insert the custom boot floppy if you have one, and reset your system. This way, you will probably need to add some boot arguments like <userinput>root=<replaceable>root</replaceable></userinput>, where <replaceable>root</replaceable> is your root partition, such as <filename>/dev/sda1</filename>. <phrase condition="etch"> Alternatively, see <xref linkend="rescue"/> for instructions on using the installer's built-in rescue mode. </phrase>
el: Αν εκκινείτε κατευθείαν στο Debian και το σύστημά σας δεν ξεκινάει χρησιμοποιήστε είτε το αρχικό μέσο εκκίνησης και εγκατάστασης ή βάλτε την δισκέττα που πιθανόν έχετε φτιάξει σύμφωνα με τις προτιμήσεις σας και επανεκκινήστε το μηχάνημά σας. Με αυτόν τον τρόπο ίσως χρειαστεί να προσθέσετε μερικές παραμέτρους εκκίνησης όπως η <userinput>root=<replaceable>root</replaceable></userinput>, όπου <replaceable>root</replaceable> είναι η ριζική κατάτμησή σας, όπως για παράδειγμα η <filename>/dev/sda1</filename>.<phrase condition="etch"> Εναλλακτικά, δείτε την ενότητα <xref linkend="rescue"/> για οδηγίες σχετικά με την χρήση της ενσωματωμένης στον εγκαταστάτη κατάσταση διάσωσης </phrase>
ko: 만일 직접 데비안으로 부팅 했지만, 시스템이 시작하지 않는 경우, 원래 설치에 사용한 부트 미디어를 사용하거나 직접 제작한 부트 플로피를 넣고 시스템을 재부팅합니다. 이 방법을 사용하면 아마도 <userinput>root=<replaceable>root</replaceable></userinput>과 같은 부트 인자를 필요로 할 것입니다. 여기의 <replaceable>root</replaceable>은 <filename>/dev/sda1</filename>과 같은 당신 시스템의 루트 파티션입니다. <phrase condition="etch">다른 방법으로는 설치관리자에 들어있는 rescue 모드를 사용할 수 있습니다. 이 방법은 <xref linkend="rescue"/>의 설명을 참조 하세요. </phrase>
pt: Se está a iniciar directamente para o Debian, e o sistema não inicia, utilize o seu sistema de instalação original ou, se tiver, insira uma disquete de arranque e reinicie o sistema. Desta forma, irá provavelmente necessitar de adicionar alguns argumentos de inicialização tais como <userinput>root=<replaceable>root</replaceable></userinput>, onde <replaceable>root</replaceable> é a sua partição de raiz, como por exemplo <filename>/dev/sda1</filename>. <phrase condition="etch"> Alternativamente, leia o <xref linkend="rescue"/> para instruções em como usar o modo de recuperação do instalador. </phrase>
ru: Если вы загружаете непосредственно Debian и система не стартует, то вставьте загрузочный носитель с программой установки, или специально созданную дискету, если она у вас есть и перезагрузите систему. Вероятно, вам придётся указать некоторые параметры загрузки, например <userinput>root=<replaceable>root</replaceable></userinput>, где <replaceable>root</replaceable> &mdash; корневой раздел, например <filename>/dev/sda1</filename>. <phrase condition="etch"> Или же смотрите <xref linkend="rescue"/> инструкции по использованию режима восстановления, имеющегося в программе установки. </phrase>
zh_cn: 如果您直接从 Debian 启动，但系统没有起来，这时要么使用原来的安装启动媒介，要么用您拥有的自定义启动软盘，然后重新启动系统。这种情况下，您也许需要添加一些启动参数，像 <userinput>root=<replaceable>root</replaceable></userinput>，其中 <replaceable>root</replaceable> 是您的根分区，例如 <filename>/dev/sda1</filename>。<phrase condition="etch"> 此外，参阅 <xref linkend="rescue"/> 了解如何使用安装程序内嵌的 rescue 模式。</phrase>
zh_tw: 如果您直接從 Debian 啟動，但系統沒有起來，那麼請使用原來的安裝媒介，或是使用您自製的開機磁片，然後重新啟動系統。這種情況下，您也許需要添加一些啟動參數，像 <userinput>root=<replaceable>root</replaceable></userinput>，其中 <replaceable>root</replaceable> 是您的根分割區，例如 <filename>/dev/sda1</filename>。<phrase condition="etch"> 或者，請參閱 <xref linkend="rescue"/>以得知安裝程式內建的救援模式中的指令。</phrase>

source: BVME 6000 Booting
el: Εκκίνηση συστήματος BVME 6000
ko: BVME 6000 부팅
pt: A iniciar BVME 6000
ru: Загрузка BVME 6000
zh_cn: BVME 6000 启动
zh_tw: 啟動 BVME 6000

source: If you have just performed a diskless install on a BVM or Motorola VMEbus machine: once the system has loaded the <command>tftplilo</command> program from the TFTP server, from the <prompt>LILO Boot:</prompt> prompt enter one of:
el: Αν έχετε κάνει εγκατάσταση χωρίς δισκέττα σε ένα σύστημα BVM ή Motorola VMEbus εισάγετε ένα από τα ακόλουθα στο προτρεπτικό <prompt>LILO Boot:</prompt> μετά τη στιγμή της φόρτωσης του προγράμματος <command>tftplilo</command> από τον TFTP server:
ko: 만일 BVM 또는 모토로라 VMEbus 기계에 디스크 없이 설치를 수행한 직후라면, TFTP 서버에서 <command>tftplilo</command> 프로그램이 로드된 후에 <prompt>LILO Boot:</prompt> 프롬프트에서 다음 중 하나를 입력합니다:
pt: Se apenas efectuou uma instalação sem disco em um BVM ou uma máquina Motorola VMDbus: assim que o sistema tiver lido o programa <command>tftplilo</command> do servidor de TFTP, do <prompt>LILO Boot:</prompt> introduza um dos seguintes:
ru: Если вы только что закончили бездисковую установку на машину BVM или Motorola VMEbus: после загрузки системой программы <command>tftplilo</command> с TFTP сервера, в строке приглашения <prompt>LILO Boot:</prompt> введите одно из:
zh_cn: 如果您是采用无盘方式安装到 BVM 或 Motorola VMEbus 机器上： 一旦系统从 TFTP 服务器加载 <command>tftplilo</command> 程序，在 <prompt>LILO Boot:</prompt> 提示符下输入：
zh_tw: 如果您採用無硬碟方式安裝到 BVM 或 Motorola VMEbus 機器，一旦系統從 TFTP 伺服器載入 <command>tftplilo</command> 程式，在 <prompt>LILO Boot:</prompt> 提示符下輸入：

source: <userinput>b6000</userinput> followed by &enterkey; to boot a BVME 4000/6000
el: <userinput>b6000</userinput> και στη συνέχεια το &enterkey; για την εκκίνηση ενός συστήματος BVME 4000/6000
ko: BVME 4000/6000 에서 부팅하려면, <userinput>b6000</userinput> 와 &enterkey;를 입력합니다.
pt: <userinput>b6000</userinput> seguido de &enterkey; para iniciar o BVME 4000/6000
ru: <userinput>b6000</userinput> и нажмите &enterkey;, чтобы загрузить BVME 4000/6000
zh_cn: <userinput>b6000</userinput> 然后按 &enterkey; 启动 BVME 4000/6000
zh_tw: <userinput>b6000</userinput> 然後按 &enterkey; 啟動 BVME 4000/6000

source: <userinput>b162</userinput> followed by &enterkey; to boot an MVME162
el: <userinput>b162</userinput> και στη συνέχεια το &enterkey; για την εκκίνηση ενός συστήματος MVME162
ko: MVME162 에서 부팅하려면, <userinput>b162</userinput> 와 &enterkey;를 입력합니다.
pt: <userinput>b162</userinput> seguido de &enterkey; para iniciar o MVME162
ru: <userinput>b162</userinput> и нажмите &enterkey;, чтобы загрузить MVME162
zh_cn: <userinput>b162</userinput> 然后按 &enterkey; 启动 MVME162
zh_tw: <userinput>b162</userinput> 然後按 &enterkey; 啟動 MVME162

source: <userinput>b167</userinput> followed by &enterkey; to boot an MVME166/167
el: <userinput>b167</userinput> και στη συνέχεια το &enterkey; για την εκκίνηση ενός συστήματος MVME166/167
ko: MVME166/167 에서 부팅하려면, <userinput>b167</userinput> 와 &enterkey;를 입력합니다.
pt: <userinput>b167</userinput> seguido de &enterkey; para iniciar o MVME166/167
ru: <userinput>b167</userinput> и нажмите &enterkey;, чтобы загрузить MVME166/167
zh_cn: <userinput>b167</userinput> 然后按 &enterkey; 启动 MVME166/167
zh_tw: <userinput>b167</userinput> 然後按 &enterkey; 啟動 MVME166/167

source: Macintosh Booting
el: Εκκίνηση ενός Macintosh
ko: 매킨토쉬 부팅
pt: A iniciar Macintosh
ru: Загрузка Macintosh
zh_cn: Macintosh 启动
zh_tw: 啟動 Macintosh

source: Go to the directory containing the installation files and start up the <command>Penguin</command> booter, holding down the <keycap>command</keycap> key. Go to the <userinput>Settings</userinput> dialogue (<keycombo> <keycap>command</keycap> <keycap>T</keycap> </keycombo>), and locate the kernel options line which should look like <userinput>root=/dev/ram video=font:VGA8x16</userinput> or similar.
el: Πηγαίνετε στον κατάλογο που περιέχει τα αρχεία εγκατάστασης και ξεκινήστε την εφαρμογή εκκίνησης <command>Penguin</command> κρατώντας κάτω το πλήκτρο <keycap>command</keycap>. Πηγαίνετε στο διάλογο των ρυθμίσεων <userinput>Settings</userinput> (με το συνδυασμό πλήκτρων <keycombo> <keycap>command</keycap> <keycap>T</keycap> </keycombo>) και εντοπίστε τη γραμμή των επιλογών του πυρήνα που μοιάζει κάπως έτσι: <userinput>root=/dev/ram video=font:VGA8x16</userinput>.
ko: 설치 파일들이 있는 디렉토리로 이동하여, <keycap>command</keycap>을 누른채로 <command>Penguin</command> booter를 시작합니다. <userinput>Settings</userinput> 다이얼로그로 이동하여 (<keycombo> <keycap>command</keycap> <keycap>T</keycap> </keycombo>), <userinput>root=/dev/ram video=font:VGA8x16</userinput> 과 유사한 커널 옵션을 입력합니다.
pt: Vá para a directoria que contém os ficheiros de instalação e inicie o <command>Penguin</command>, pressionando a tecla <keycap>command</keycap>. Vá para <userinput>Settings</userinput> (<keycombo> <keycap>command</keycap> <keycap>T</keycap> </keycombo>), e localize a linha de opções do kernel que deverá ser parecido com <userinput>root=/dev/ram video=font:VGA8x16</userinput> ou similar.
ru: Перейдите в каталог с файлами установки и запустите загрузчик <command>Penguin</command>, нажав клавишу <keycap>command</keycap>. Перейдите в диалоговое меню <userinput>Settings</userinput> (<keycombo> <keycap>command</keycap> <keycap>T</keycap> </keycombo>), и найдите строку с опциями ядра, которая выглядит как <userinput>root=/dev/ram video=font:VGA8x16</userinput> или чуть иначе.
zh_cn: 进入包含安装文件的目录，然后启动 <command>Penguin</command> 引导器，按住 <keycap>command</keycap> 键。进入 <userinput>设置</userinput>对话框(<keycombo> <keycap>command</keycap> <keycap>T</keycap> </keycombo>)，然后定位到内核选项那行，如 <userinput>root=/dev/ram video=font:VGA8x16</userinput> 或近似的。
zh_tw: 進入包含安裝檔案的目錄，然後啟動 <command>Penguin</command> boot-loader，按住 <keycap>command</keycap> 鍵。進入<userinput>設定</userinput>對話框 (<keycombo> <keycap>command</keycap> <keycap>T</keycap> </keycombo>)，然後找到核心選項那行，如 <userinput>root=/dev/ram video=font:VGA8x16</userinput> 或類似提示。

source: You need to change the entry to <userinput>root=/dev/<replaceable>yyyy</replaceable></userinput>. Replace the <replaceable>yyyy</replaceable> with the Linux name of the partition onto which you installed the system (e.g. <filename>/dev/sda1</filename>); you wrote this down earlier. The <userinput>video=font:VGA8x8</userinput> is recommended especially for users with tiny screens. The kernel would pick a prettier (6x11) font but the console driver for this font can hang the machine, so using 8x16 or 8x8 is safer at this stage. You can change this at any time.
el: Θα πρέπει να αλλάξετε την επιλογή σε κάτι όπως <userinput>root=/dev/<replaceable>yyyy</replaceable></userinput>, αντικαθιστώντας το <replaceable>yyyy</replaceable> με το όνομα του τμήματος του δίσκου όπου έχετε εγκαταστήσει το σύστημά σας και το οποίο έχετε ήδη σημειώσει κάπου από πριν (πχ. <filename>/dev/sda1</filename>). Η επιλογή <userinput>video=font:VGA8x8</userinput> συνίσταται ιδιαίτερα για χρήστες με μικρές οθόνες. Ο πυρήνας πιθανόν να επέλεγε μια ομορφότερη γραμματοσειρά αλλά ο οδηγός της κονσόλας μπορεί να προκαλέσει το "πάγωμα" του μηχανήματος οπότε η χρήση ενός από τα μεγέθη γραμματοσειρών 8x16 ή 8x8 είναι ασφαλέστερη στο στάδιο αυτό. Έτσι κι αλλιώς μπορείτε να αλλάξετε το μέγεθος αυτό σε οποιαδήποτε στιγμή θέλετε.
ko: 해당 엔트리를 <userinput>root=/dev/<replaceable>yyyy</replaceable></userinput>로 바꿀 필요가 있습니다. <replaceable>yyyy</replaceable>을 설치된 시스템의 파티션의 리눅스 이름으로 변경합니다 (예 <filename>/dev/sda1</filename>). 당신은 이 이름을 이전에 기록해 두었습니다. <userinput>video=font:VGA8x8</userinput>은 특별히 작은 스크린을 가진 사용자들을 위해 추천합니다. 커널은 더 예쁜 (6x11) 폰트를 사용할 수 있지만, 이 폰트를 사용하는 콘솔 드라이버는 기계를 멈추게 할 수 있습니다. 따라서, 8x16 또는 8x8 을 사용하는 것이 이 단계에서는 더 안전할 것입니다. 당신은 언제든 이 폰트를 변경 할 수 있습니다.
pt: Necessita mudar a entrada para <userinput>root=/dev/<replaceable>yyyy</replaceable></userinput>. Altere o <replaceable>yyyy</replaceable> com o nome Linux da partição na qual instalou o sistema (p.e. <filename>/dev/sda1</filename>); que apontou anteriormente. O <userinput>video=font:VGA8x8</userinput> é recomendado especialmente para utilizadores com ecrãs pequenos. O kernel escolherá uma fonte mais bonita (6x11) mas o driver da consola para esta fonte pode bloquear a máquina, por isso utilizar 8x16 ou 8x8 é mais seguro nesta fase. Isto pode ser alterado a qualquer altura.
ru: Вам нужно изменить <userinput>root=/dev/<replaceable>yyyy</replaceable></userinput>. Замените <replaceable>yyyy</replaceable> на название корневого раздела Linux установленной системы (например, <filename>/dev/sda1</filename>). Опция <userinput>video=font:VGA8x8</userinput> рекомендуется для пользователей с крошечными экранами. Ядро выберет более приятный шрифт (6x11), но драйвер консоли с этим шрифтом может повесить машину, поэтому на этой стадии для безопасности используется 8x16 или 8x8. Вы можете изменить шрифт в любое время.
zh_cn: 您需要修改入口为 <userinput>root=/dev/<replaceable>yyyy</replaceable></userinput>。替换 <replaceable>yyyy</replaceable> 为您安装分区的 Linux 名称(例如，<filename>/dev/sda1</filename>); 早先记下的内容。<userinput>video=font:VGA8x8</userinput> 特别建议小屏幕的用户使用。内核会选择较美观的 (6x11) 字体，但该字体的控制台驱动会造成宕机，因此使用 8x16 或 8x8 对于该阶段较安全。您可以随时修改它。
zh_tw: 您需要修改該項目為 <userinput>root=/dev/<replaceable>yyyy</replaceable></userinput>。替換 <replaceable>yyyy</replaceable> 為您安裝分割區的 Linux 名稱 (例如，<filename>/dev/sda1</filename>);也就是之前記下的內容。<userinput>video=font:VGA8x8</userinput> 特別建議小螢幕的使用者使用。核心會選擇較美觀的 (6x11) 字體，但該字體可能會造成控制台驅動程式當機，因此使用 8x16 或 8x8 對於該階段較安全。您可以隨時修改它。

source: If you don't want to start GNU/Linux immediately each time you start, uncheck the <userinput>Auto Boot</userinput> option. Save your settings in the <filename>Prefs</filename> file using the <userinput>Save Settings As Default</userinput> option.
el: Αν δεν επιθυμείτε την αυτόματη εκκίνηση του συστήματος GNU/Linux κάθε φορά που ξεκινάτε το μηχάνημά σας, μπορείτε να απενεργοποιήσετε την επιλογή <userinput>Auto Boot</userinput>. Σώστε τις ρυθμίσεις σας στο αρχείο <filename>Prefs</filename> χρησιμοποιώντας την επιλογή <userinput>Save Settings As Default</userinput>.
ko: 만일 매번 부팅 할 때마다 GNU/Linux로 시작하기를 원하지 않는 다면, <userinput>Auto Boot</userinput> 옵션을 체크하지 마세요. <userinput>Save Settings As Default</userinput> 옵션을 사용해 설정을 <filename>Prefs</filename> 파일에 저장하세요.
pt: Se não pretender iniciar o GNU/Linux imediatamente de cada vez que iniciar, desseleccione a opção <userinput>Auto Boot</userinput>. Guarde as definições no ficheiro <filename>Prefs</filename> usando a opção <userinput>Save Settings As Default</userinput>.
ru: Если вы не хотите запускать GNU/Linux каждый раз при включении питания, то снимите флажок <userinput>Auto Boot</userinput>. Сохраните настройки в файле <filename>Prefs</filename> выбрав опцию <userinput>Save Settings As Default</userinput>.
zh_cn: 如果您不想每次启动时立即启动 GNU/Linux，去除 <userinput>Auto Boot</userinput> 选项。保存设置到 <filename>Prefs</filename> 文件，使用 <userinput>Save Settings As Default</userinput> 选项。
zh_tw: 如果您不想每次開機時立即啟動 GNU/Linux，移除 <userinput>Auto Boot</userinput> 選項。儲存設定到 <filename>Prefs</filename> 檔案，使用 <userinput>Save Settings As Default</userinput> 選項。

source: Now select <userinput>Boot Now</userinput> (<keycombo> <keycap>command</keycap> <keycap>B</keycap> </keycombo>) to start your freshly installed GNU/Linux instead of the RAMdisk installer system.
el: Επιλέξτε τώρα <userinput>Boot Now</userinput> (με τον συνδυασμό πλήκτρων <keycombo> <keycap>command</keycap> <keycap>B</keycap> </keycombo>) για να ξεκινήσετε το μόλις εγκατεστημένο σύστημα GNU/Linux αντί του συστήματος εγκατάστασης στην RAMdisk .
ko: 이제 <userinput>Boot Now</userinput> (<keycombo> <keycap>command</keycap> <keycap>B</keycap> </keycombo>)를 선택해 램디스크 설치 시스템 대신 새롭게 설치된 GNU/Linux를 시작합니다.
pt: Agora seleccione <userinput>Boot Now</userinput> (<keycombo> <keycap>command</keycap> <keycap>B</keycap> </keycombo>) para iniciar o seu GNU/Linuxrecentemente instalado em vez do sistema de instalação RAMdisk.
ru: Теперь выберите <userinput>Boot Now</userinput> (<keycombo> <keycap>command</keycap> <keycap>B</keycap> </keycombo>), чтобы запустить установленую GNU/Linux, вместо установщика системы RAMdisk.
zh_cn: 现在选择 <userinput>Boot Now</userinput> (<keycombo> <keycap>command</keycap> <keycap>B</keycap> </keycombo>) 启动新安装的 GNU/Linux，而不是 RAMdisk 安装系统。
zh_tw: 現在選擇 <userinput>Boot Now</userinput> (<keycombo> <keycap>command</keycap> <keycap>B</keycap> </keycombo>) 以啟動新安裝的 GNU/Linux，而不是 RAMdisk 安裝系統。

source: Debian should boot, and you should see the same messages as when you first booted the installation system, followed by some new messages.
el: Το Debian σύστημα θα ξεκινήσει τώρα και θα πρέπει να δείτε τα ίδια μηνύματα που είδατε και κατά την αρχική εκκίνηση του συστήματος εγκατάστασης ακολουθούμενα από κάποια καινούρια μηνύματα.
ko: 데비안이 부팅하고, 당신은 처음 설치 시스템이 부팅할 때와 같은 메시지를 보고, 이어서 몇몇 새로운 메시지들을 볼 것입니다.
pt: O Debian deverá iniciar, e deverá ver as mesmas mensagens como viu na primeira vez que iniciou o sistema de instalação, seguido de algumas mensagens novas.
ru: Debian начнёт загружаться и вы увидите несколько сообщений, как при первой загрузке системы установки, а затем новые сообщения.
zh_cn: Debian 应该启动，然后您将看到与安装系统同样的讯息，跟着是一些新讯息。
zh_tw: Debian 應該啟動，然後您將看到與安裝系統同樣的訊息，跟著是一些新訊息。

source: OldWorld PowerMacs
el: Συστήματα OldWorld PowerMac
ko: 구세대의 파워맥

source: If the machine fails to boot after completing the installation, and stops with a <prompt>boot:</prompt> prompt, try typing <userinput>Linux</userinput> followed by &enterkey;. (The default boot configuration in <filename>quik.conf</filename> is labeled Linux). The labels defined in <filename>quik.conf</filename> will be displayed if you press the <keycap>Tab</keycap> key at the <prompt>boot:</prompt> prompt. You can also try booting back into the installer, and editing the <filename>/target/etc/quik.conf</filename> placed there by the <guimenuitem>Install Quik on a Hard Disk</guimenuitem> step. Clues for dealing with <command>quik</command> are available at <ulink url="&url-powerpc-quik-faq;"></ulink>.
el: Αν το μηχάνημά σας δεν ξεκινά μετά την ολοκλήρωση της εγκατάστασης και σταματά με την εμφάνιση του προτρεπτικού <prompt>boot:</prompt>, προσπαθήστε να πληκτρολογήσετε <userinput>Linux</userinput> και στη συνέχεια πατώντας &enterkey;. (η προκαθορισμένη επιλογή για την εκκίνηση στο αρχείο ρυθμίσεων <filename>quik.conf</filename> είναι η επιλογή Linux). Οι επιλογές στο αρχείο αυτό φαίνονται αν πατήσετε το πλήκτρο <keycap>Tab</keycap> ενώ είσαστε στο προτρεπτικό <prompt>boot:</prompt>. Μπορείτε ακόμα να προσπαθήσετε να ξαναμπείτε στον εγκαταστάτη και να αλλάξετε το αρχείο <filename>/target/etc/quik.conf</filename> που θα δείτε εκεί μετά το βήμα <guimenuitem>Install Quik on a Hard Disk</guimenuitem>. Υποδείξεις για το χειρισμό της εντολής <command>quik</command> είναι διαθέσιμες στο <ulink url="&url-powerpc-quik-faq;"></ulink>.
ko: 만일 설치를 끝낸 후에 부팅에 실패하면, <prompt>boot:</prompt> 프롬프트에서 멈추고, <userinput>Linux</userinput>을 입력해보세요. (<filename>quik.conf</filename> 안에 기본 부트 설정이 Linux 라는 레이블로 설정되어 있습니다.) <filename>quik.conf</filename>에 정의된 레이블들은 <prompt>boot:</prompt> 프롬프트에서 <keycap>Tab</keycap> 키를 누르면 보여질 것입니다. 당신은 설치관리자로 돌아가 <guimenuitem>Install Quik on a Hard Disk</guimenuitem> 단계에서 설정된 <filename>/target/etc/quik.conf</filename>을 수정하여 부팅할 수도 있습니다. <command>quik</command>를 다루는 힌트는 <ulink url="&url-powerpc-quik-faq;"></ulink>에서 얻을 수 있습니다.
pt: Se a máquina falhar ao iniciar após a instalação estar completa, e parar com o prompt <prompt>boot:</prompt>, tente escrever <userinput>Linux</userinput> seguido de &enterkey;. (A configuração de inicialização padrão no <filename>quik.conf</filename> está definido como Linux). As definições no <filename>quik.conf</filename> serão apresentadas se pressionar a tecla <keycap>Tab</keycap> quando aparecer <prompt>boot:</prompt>. Pode tentar iniciar de novo para o instalador, e editar o <filename>/target/etc/quik.conf</filename> colocado pelo item <guimenuitem>Install Quik on a Hard Disk</guimenuitem>. Mais documentação sobre o <command>quik</command> encontra-se disponível em <ulink url="&url-powerpc-quik-faq;"></ulink>.
ru: Если машина не загружается после завершения установки и останавливается с подсказкой <prompt>boot:</prompt>, попробуйте набрать <userinput>Linux</userinput> и нажать &enterkey;. (Конфигурация загрузки по умолчанию в <filename>quik.conf</filename> имеет метку Linux). Посмотреть возможные метки, заданные в <filename>quik.conf</filename>, если нажать клавишу <keycap>Tab</keycap> в строке с приглашением <prompt>boot:</prompt>. Также вы можете попробовать загрузиться обратно в программу установки и отредактировать <filename>/target/etc/quik.conf</filename>, который создаётся в шаге <guimenuitem>Установить Quik на жёсткий диск</guimenuitem>. Подсказки по работе с <command>quik</command> находятся здесь <ulink url="&url-powerpc-quik-faq;"></ulink>.
zh_cn: 如果机器在完成安装后启动失败，并停在 <prompt>boot:</prompt> 提示符，试着键入 <userinput>Linux</userinput> 然后是 &enterkey;。(默认的启动配置在 <filename>quik.conf</filename> 标签是 Linux)。标签定义在 <filename>quik.conf</filename> 如果您按 <keycap>Tab</keycap> 键在 <prompt>boot:</prompt> 提示符下。您也可以启动回到安装程序，并编辑 <filename>/target/etc/quik.conf</filename> 然后回到 <guimenuitem>到硬盘</guimenuitem> 步骤。处理 <command>quik</command> 的细节位于 <ulink url="&url-powerpc-quik-faq;"></ulink>。
zh_tw: 如果機器在完成安裝後啟動失敗，並停在 <prompt>boot:</prompt> 提示符號，試著鍵入 <userinput>Linux</userinput> 然後按 &enterkey;。(<filename>quik.conf</filename> 中預設的啟動設定標籤是 Linux)。如果您在 <prompt>boot:</prompt> 提示符號下按 <keycap>Tab</keycap> 鍵，定義在 <filename>quik.conf</filename> 中的標籤將會被顯示出來。您也可以重新啟動安裝程式，並編輯 <filename>/target/etc/quik.conf</filename> 然後回到 <guimenuitem>安裝 Quik 到硬碟</guimenuitem> 步驟。處理 <command>quik</command> 的細節位於 <ulink url="&url-powerpc-quik-faq;"></ulink>。
