Repository: xobs/debian-installer
Catalog: doc/manual/po/*/boot-new.po
Languages: el, ko, pt, ru, zh_cn, zh_tw

source: After you have selected a mirror, you will be asked if a proxy server should be used. A proxy server is a server that will forward all your HTTP and/or FTP requests to the Internet and is most often used to regulate and optimize access to the Internet on corporate networks. In some networks only the proxy server is allowed access to the Internet, in which case you will have to enter the name of the proxy server. You may also have to include an user name and password. Most home users will not need to specify a proxy server, although some ISPs may provide proxy servers for their users.
el: Μετά την επιλογή ενός καθρέφτη θα ερωτηθείτε για την χρήση ή όχι ενός proxy. Ο proxy server είναι ένας server που θα προωθήσει όλες τις αιτήσεις σας για HTTP ή/και FTP στο Διαδίκτυο και συνήθως χρησιμοποιείται για την βελτιστοποίηση και την ομαλή ρύθμιση της πρόσβασης στο Διαδίκτυο σε μεγάλα εταιρικά δίκτυα. Σε μερικά δίκτυα η πρόσβαση στο Διαδίκτυο είναι επιτρεπτή μόνο για τον proxy server οπότε στην περίπτωση αυτή θα πρέπει να βάλετε συγκεκριμένα το όνομα του server αυτού.Πιθανόν ακόμα να πρέπει να βάλετε ένα όνομα χρήστη και έναν κωδικό πρόσβασης. Οι περισσότεροι χρήστες από το σπίτι δεν θα χρειαστεί να προσδιορίσουν κάποιον proxy server αν και κάποιοι ISP πιθανόν παρέχουν μια τέτοια υπηρεσία στους χρήστες τους.
ko: 미러를 선택한 후에 프록시 서버를 사용하는 지 물어볼 것입니다. 프록시 서버는 당신의 HTTP 또는 FTP 요청을 인터넷으로 전달하고 네트워크의 인터넷 접근을 최적화하고 일정하게 하기 위해 사용하는 서버입니다. 어떤 네트워크에서는 프록시 서버의 인터넷 연결만 허용하는 경우가 있습니다. 그러한 경우에는 프록시 서버의 이름을 입력해야 합니다. 사용자 이름과 암호 역시 입력해야 할 것입니다. 비록 몇몇 ISP들이 프록시 서버를 제공하기는 하지만, 집에서 사용하는 일반 사용자들은 프록시 서버의 설정이 필요 없을 것입니다.
pt: Depois de ter escolhido o repositório, ser-lhe-á perguntado se um servidor de proxy deve ser usado. Um servidor de proxy é um servidor que encaminha todos os seus pedidos de HTTP e/ou FTP para a Internet e é maioritariamente utilizado para regular e optimizar o acesso à Internet em redes empresariais. Em alguma redes apenas o servidor de proxy está autorizado a aceder à Internet, em qualquer dos casos terá que introduzir o nome do servidor de proxy. Poderá também ter de incluir o nome de um utilizador e uma password. A maioria dos utilizadores domésticos não necessitará de especificar um servidor de proxy, no entanto alguns ISPs podem fornecer servidores de proxy para os seus utilizadores.
ru: После выбора сервера-зеркала, вас спросят хотите ли вы использовать прокси сервер. Прокси сервер &mdash; это сервер, который будет направлять все ваши HTTP и/или FTP запросы в Интернет и наиболее часто используется для упорядоченного и оптимизированного доступа в Интернет из корпоративных сетей. В некоторых сетях только прокси серверу разрешён доступ в Интернет. Также, вам может потребоваться имя и пароль. Большинству домашних пользователей не нужно указывать прокси сервер, хотя некоторые провайдеры Интернет предоставляют прокси сервера для своих пользователей.
zh_cn: 选择镜像之后，您将会被问到是否需要使用代理服务器。代理服务器是用来转发您通过 HTTP 和/或 FTP 访问互联网的服务器，通常在公司网络里用来调节和优化访问互联网。在一些网络中只能通过代理服务器访问互联网，因此您不得不输入代理服务器名称。您也可能还要输入用户名和口令。大多数的家庭用户毋须设置代理服务器，这是因为一些 ISP 会提供。
zh_tw: 選擇鏡像站之後，您將會被詢問是否需要使用代理伺服器。代理伺服器是用來轉送您以 HTTP 和/或 FTP 要求存取網際網路的伺服器，通常在公司網路裡用來調節和最佳化網際網路的使用效率。在某些網路中只能透過代理伺服器存取網際網路，因此您不得不輸入代理伺服器名稱。您可能還要輸入使用者名稱和密碼。大多數的家庭使用者不需設定代理伺服器，這是因為一些 ISP 會提供。

source: After you select a mirror, your new network package source will be tested. If all goes well, you will be prompted whether you want to add another package source. If you have any problems using the package source you selected, try using a different mirror (either from your country list or from the global list), or try using a different network package source.
el: Μετά την επιλογή του καθρέφτη θα γίνει ο έλεγχος της καινούριας δικτυακής πηγής για τα πακέτα. Αν όλα πάνε καλά, θα ερωτηθείτε για το αν θέλετε να προσθέσετε κάποια επιπλέον πηγή πακέτων. Αν έχετε πρόβλημα να χρησιμοποιήσετε την πηγή πακέτων που επιλέξατε, δοκιμάστε έναν άλλο καθρέφτη (είτε από τη λίστα που είναι διαθέσιμη για τ η χώρα σας είτε από την διεθνή λίστα) ή δοκιμάστε να χρησιμοποιήσετε μια άλλη δικτυακή πηγή πακέτων.
ko: 미러 선택이 끝난 후에 새로운 네트워크 패키지 소스가 테스트 됩니다. 잘 된다면 다른 패키지 소스를 추가할 것인지를 물어볼 것입니다. 만일 해당 패키지 소스를 사용하는 데 문제가 있다면, 당신의 나라 또는 세계의 목록에서 다른 미러를 사용해 보거나 다른 네트워크 패키지 소스를 사용해 보세요.
pt: Depois de escolher o repositório, a sua nova fonte de pacotes de rede irá ser testada. Se tudo correr bem, ser-lhe-á perguntado se pretende adicionar outra fonte de pacotes. Se tiver algum problema na utilização da fonte de pacotes que escolheu, tente utilizar um repositório diferente (seja da lista do seu país ou da lista global), ou tente utilizar uma fonte de pacotes de rede diferente.
ru: После выбора сервера-зеркала будет произведена проверка данного сетевого источника пакетов. Если всё нормально, вам будет предложено добавить другой сетевой источник. Если у вас возникли какие-то проблемы с источником пакетов, попробуйте задействовать другой сервер-зеркало (из списка для вашей страны или из глобального списка) или попробуйте перейти на другой сетевой источник пакетов.
zh_cn: 选择镜像之后，系统会测试您的网络软件包源。一切正常的话，程序会提示您是否想要配置其它的网络源。如果您的软件包源有问题，可以尝试不同的镜像站点(从您的国家列表中 或者全体列表)或者使用不同的网络软件包源。
zh_tw: 選擇鏡像之後，系統會測試您的網路軟體套件來源。一切正常的話，程式會提示您是否想要設定其它的網路來源。如果您的軟體套件源有問題，可以嘗試不同的鏡像網站 (從您的國家列表中或者全體列表) 或者使用不同的網路軟體套件來源。

source: Package Installation
el: Εγκατάσταση πακέτων
ko: 패키지 설치
pt: Instalação de Pacotes
ru: Установка пакетов
zh_cn: 软件包安装
zh_tw: 安裝軟體套件

source: Next you will be offered a number of pre-rolled software configurations offered by Debian. You could always choose, package by package, what you want to install on your new machine. This is the purpose of the <command>aptitude</command> program, described below. But this can be a long task with around &num-of-distrib-pkgs; packages available in Debian!
el: Στη συνέχεια θα σας δοθεί ένας αριθμός από προκαθορισμένες συλλογές λογισμικού που προσφέρει το Debian. Μπορείτε πάντα βέβαια να διαλέξετε πακέτο προς πακέτο τι θέλετε να εγκαταστήσετε στο καινούριο σας μηχάνημα. Αυτός είναι ο σκοπός του προγράμματος <command>aptitude</command> που περιγράφεται παρακάτω. Αλλά αυτή μπορεί να είναι μια πολύ χρονοβόρα διαδικασία με τα &num-of-distrib-pkgs;πακέτα που είναι διαθέσιμα αυτή τη στιγμή στο Debian!
ko: 다음으로 몇개의 데비안에서 제공되는 소프트웨어 설정들을 제공 받을 것입니다. 항상 패키지 별로 당신의 새로운 시스템에 원하는 패키지를 설치할 수 있다는 것을 기억하세요. 이 것이 다음에 설명되는 <command>aptitude</command> 프로그램의 목적입니다. 하지만, 이것은 데비안의 &num-of-distrib-pkgs; 패키지들과 함께하는 긴 작업이 될 것 입니다.
pt: De seguida ser-lhe-á oferecido um conjunto de configurações de software pré-definidas oferecidas pelo Debian. Poderá sempre escolher, pacote a pacote, o que pretender instalar na sua nova máquina. Esta é a função do programa <command>aptitude</command>, descrito abaixo. Mas este pode ser uma tarefa longa com cerca de &num-of-distrib-pkgs; pacotes disponíveis no Debian!
ru: Далее вам будет предложено несколько предопределённых компоновок программного обеспечения, предлагаемого Debian. Вы всегда можете выбрать требуемые для установки на машину пакеты по отдельности. Для этого предназначена программа <command>aptitude</command>, описанная ниже. Но это может занять много времени, так как в Debian сейчас включено &num-of-distrib-pkgs; пакетов!
zh_cn: 接下来，您将看到 Debain 事先配置好的一些软件包。您可以逐个选择哪些需要安装到您的新系统上。这是 <command>aptitude</command> 程序的目的，后面会说明。但这可能是一项艰巨的任务，因为有 &num-of-distrib-pkgs; 个软件包存在于 Debian 中。
zh_tw: 接下來，您將看到 Debain 事先選擇好的一些軟體套件。您可以逐個選擇哪些需要安裝到您的新系統上。這是 <command>aptitude</command> 程式的目的，後面會說明。但這可能是一項困難的任務，因為 Debian 有 &num-of-distrib-pkgs; 個軟體套件。

source: So, you have the ability to choose <emphasis>tasks</emphasis> first, and then add on more individual packages later. These tasks loosely represent a number of different jobs or things you want to do with your computer, such as <quote>desktop environment</quote>, <quote>web server</quote>, or <quote>print server</quote><footnote> <para> You should know that to present this list, <command>base-config</command> is merely invoking the <command>tasksel</command> program. For manual package selection, the <command>aptitude</command> program is being run. Any of these can be run at any time after installation to install (or remove) more packages. If you are looking for a specific single package, after installation is complete, simply run <userinput>aptitude install <replaceable>package</replaceable></userinput>, where <replaceable>package</replaceable> is the name of the package you are looking for. </para> </footnote>. <xref linkend="tasksel-size-list"/> lists the space requirements for the available tasks.
el: Έχετε λοιπόν την δυνατότητα να επιλέξετε αρχικά διάφορα <emphasis>tasks</emphasis> και στη συνέχεια να προσθέσετε περισσότερα μεμονωμένα πακέτα. Τα "καθήκοντα" αυτά αντιπροσωπεύουν χονδρικά έναν αριθμό από διαφορετικά πράγματα ή λειτουργίες που θέλετε να πραγματοποιήσετε με τον υπολογιστή σας, όπως <quote>περιβάλλον γραφείου</quote>, <quote>web server</quote>, ή <quote>server εκτυπώσεων</quote><footnote><para>Πρέπει να ξέρετε ότι για να εμφανίσει αυτή τη λίστα καθηκόντων το <command>base-config</command> απλά καλεί το πρόγραμμα <command>tasksel</command>. Για την χειροκίνητη επιλογή πακέτων εκτελείται το πρόγραμμα <command>aptitude</command> . Οποιοδήποτε από αυτά τα προγράμματα μπορεί να εκτελεστεί σε οποιαδήποτε στιγμή μετά την εγκατάσταση για να εγκαταστήσετε (ή να απεγκαταστήσετε) περισσότερα πακέτα. Αν ψάχνετε για ένα συγκεκριμένο πακέτο μετά την ολοκλήρωση της εγκατάστασης τρέξτε απλά <userinput>aptitude install <replaceable>package</replaceable></userinput>, όπου <replaceable>package</replaceable> είναι το όνομα του συγκεκριμένου πακέτου που θέλετε.</para> </footnote>.Η εντολή <xref linkend="tasksel-size-list"/> αναγράφει τις απαιτήσεις σε χώρο δίσκου των διαθέσιμων καθηκόντων.
ko: 그래서 <emphasis>태스크</emphasis>들을 먼저 선택하고 다음으로 더 많은 개별 패키지들을 추가할 수 있게 되어 있습니다. <quote>desktop environment</quote>, <quote>web server</quote>, <quote>print server</quote>와 같은 태스크들은 당신의 컴퓨터를 사용해 하고자하는 많은 일이나 작업들을 나타냅니다. <footnote> <para> 이 목록을 보여주기 위해 <command>base-config</command>는 단지 <command>tasksel</command> 프로그램을 실행 시킨 다는 것을 알아두세요. 다른 패키지들을 설치, 제거 하기 위해 설치 후 언제든지 실행 시킬 수 있습니다. 설치가 완료된 후에 특성 패키지 하나를 설치 하려면 <userinput>aptitude install <replaceable>package</replaceable></userinput>을 실행 하세요. <replaceable>package</replaceable>은 당신이 찾는 패키지의 이름입니다. </para> </footnote> <xref linkend="tasksel-size-list"/> 는 가능한 태스크들을 설치하기 위해 필요한 공간을 보여줍니다.
pt: Assim, tem a capacidade de primeiramente escolher as <emphasis>tasks</emphasis>, e mais tarde adicionar pacotes individuais. Estas tarefas representam um conjunto de diferentes trabalhos ou coisas que pretende fazer com o seu computador, tais como <quote>computador de trabalho</quote>, <quote>servidor de web</quote>, ou <quote>servidor de impressão</quote><footnote> <para> Deverá saber que para apresentar esta lista, o <command>base-config</command> está meramente a invocar o programa <command>tasksel</command>. Para uma selecção de pacotes manual, o programa <command>aptitude</command> está a ser executado. Qualquer um destes pode ser executado a qualquer altura depois da instalação para instalar (ou remover) mais pacotes. Se está à procura de um pacote específico, depois da instalação estar concluída, simplesmente execute <userinput>aptitude install <replaceable>package</replaceable></userinput>, onde <replaceable>package</replaceable> é o nome do pacote que procura. </para> </footnote>. <xref linkend="tasksel-size-list"/> lista o espaço necessário para as tarefas disponíveis.
ru: Поэтому, сначала вы можете выбрать <emphasis>задачи</emphasis>, а позже установить дополнительно какие-то определённые пакеты. В общем, под задачей подразумевается какая-то работа или вещь, которую по вашему требованию должен выполнять компьютер, например предоставлять <quote>среду рабочего стола</quote>, служить в качестве <quote>веб сервера</quote> или <quote>сервера печати</quote> <footnote> <para> Вы должны знать, что для предоставления этого списка <command>base-config</command> просто вызывает программу <command>tasksel</command>. Для ручного выбора пакетов запускается программа <command>aptitude</command>. Также, их можно запускать в любое время после установки, чтобы установить (или удалить) некоторые пакеты. Если вам нужен какой-то определённый пакет, то после завершения установки просто запустите <userinput>apt-get install <replaceable>пакет</replaceable></userinput>, где <replaceable>пакет</replaceable> &mdash; это имя требуемого пакета. </para> </footnote>. В таблице <xref linkend="tasksel-size-list"/> показано необходимое для имеющихся задач пространство.
zh_cn: 所以，您可以先选择 <emphasis>tasks</emphasis> ，然后再单独添加软件包。task 松散地代表了您要在计算机上从事的一系列工作，比如 <quote>desktop environment</quote>, <quote>web server</quote>或者 <quote>print server</quote><footnote> <para> 您应该知道，代表这个列表，<command>base-config</command> 仅是执行 <command>tasksel</command> 程序。手动选择安装软件包，<command>aptitude</command> 程序被调用。安装之后的任何时候，只要需要安装(或者删除)更多的软件包，它都被调用。如果您寻找特定的软件包，当安装完成后，只需执行 <userinput>aptitude install <replaceable>package</replaceable></userinput>, 其中 <replaceable>package</replaceable> 是您需要的软件包名。</para> </footnote>。<xref linkend="tasksel-size-list"/> 列出各任务所需的空间。
zh_tw: 所以，您可以先選擇 <emphasis>tasks</emphasis>，然後再單獨添加軟體套件。軟體集約略表示您要在電腦上從事的各類工作，例如 <quote>desktop environment</quote>、<quote>web server</quote> 或者 <quote>print server</quote><footnote> <para> 您應該知道顯示這個列表，<command>base-config</command> 僅是執行 <command>tasksel</command> 程式。手動選擇安裝軟體套件時，<command>aptitude</command> 程式則被呼叫。安裝程序之後的任何時候，一旦需要安裝 (或者刪除) 更多的軟體套件，它都被使用。如果您在尋找特定的軟體套件，當安裝完成後，只需執行 <userinput>aptitude install <replaceable>package</replaceable></userinput>, 其中 <replaceable>package</replaceable> 是您需要的軟體套件名稱。</para> </footnote>。<xref linkend="tasksel-size-list"/> 列出各 task 所需的空間。

source: Once you've selected your tasks, select <guibutton>Ok</guibutton>. At this point, <command>aptitude</command> will install the packages you've selected.
el: Όταν έχετε επιλέξει τα "καθήκοντα" που θέλετε πατήστε το κουμπί <guibutton>Ok</guibutton>. Στο σημείο αυτό το <command>aptitude</command> θα εγκαταστήσει τα πακέτα που έχετε διαλέξει.
ko: 태스크들을 선택했다면, <guibutton>Ok</guibutton>을 선택하세요. 그러면 <command>aptitude</command>는 선택된 패키지들을 설치할 것입니다.
pt: Assim que tiver seleccionado as suas tarefas, seleccione <guibutton>Ok</guibutton>. Neste ponto, o <command>aptitude</command> irá instalar os pacotes que seleccionou.
ru: После выделения задач выберите <guibutton>Ok</guibutton>. Теперь <command>aptitude</command> начнёт установку выбранных пакетов.
zh_cn: 一旦您选择了任务，选择 <guibutton>Ok</guibutton>。此时，<command>aptitude</command> 将安装您选中的软件包。
zh_tw: 當您選擇了軟體集之後，選擇 <guibutton>確定</guibutton>。此時，<command>aptitude</command> 將安裝您選中的軟體套件。

source: Even if you did not select any tasks at all, any standard, important, or required priority packages that are not yet present on your system will be installed. This functionality is the same as running <userinput>tasksel -ris</userinput> at the command line, and currently involves a download of about 37M of archives. You will be shown the number of packages to be installed, and how many kilobytes of packages, if any, need to be downloaded.
el: Ακόμα κι αν δεν έχετε διαλέξει κάποια καθήκοντα, οποιαδήποτε βασικά. απαραίτητα ή προαπαιτούμενης προτεραιότητας πακέτα που δεν υπάρχουν ήδη στο σύστημά σας θα εγκατασταθούν. Αυτή η λειτουργία είναι ισοδύναμη του να τρέξει κανείς την εντολή <userinput>tasksel-ris</userinput> στη γραμμή εντολών και προς το παρόν αντιστοιχεί στο κατέβασμα περίπου 37M αρχείων. Θα δείτε τον αριθμό των πακέτων που πρόκειται να εγκατασταθούν και πόσα kilobytes πακέτων χρειάζεται να κατέβουν.
ko: 아무런 태스크를 선택하지 않았더라도, 시스템에 없는 standard, important, required prioritoy 패키지들은 설치될 것입니다. 이 기능은 명령창에서 <userinput>tasksel -ris</userinput>을 실행 하는 것과 같고, 현재 약 37M의 아카이브를 다운로드할 것입니다. 설치되는 패키지들의 숫자와 다운로드가 필요하다면 얼마 만큼 받았는 지를 보여줄 것입니다.
pt: Mesmo que não escolha qualquer tarefa, qualquer pacote normal, importante ou prioritariamente necessário que ainda não esteja presente no seu sistema irá ser instalado. Esta funcionalidade é a mesma que executar <userinput>tasksel -ris</userinput> na linha de comandos, e actualmente transfere cerca de 37M de ficheiros. Ser-lhe-á mostrado o número de pacotes para serem instalados, e quantos kilobytes de pacotes, se existirem, necessitam de ser transferidos.
ru: Даже если вы не выбрали ни одной задачи, будут установлены все пакеты со стандартным, важным или требуемым приоритетом, которых ещё нет в системе. Это то же самое, что запуск в командной строке <userinput>tasksel -ris</userinput>, и в настоящий момент вызывает загрузку приблизительно 37МБ архивов. Вам будет показано число устанавливаемых пакетов и сколько килобайт пакетов нужно загрузить.
zh_cn: 注意，即使您没有选择任何任务，但标准的、重要的，或者系统优先级要求的软件包将被安装。该功能相当于执行 <userinput>tasksel -ris</userinput> 在命令行下，当前包括下载一个大约 37M 的包。您会看到将要安装的一系列软件包，以及软件包的大小，在需要时它们会被下载。
zh_tw: 注意，即使您沒有選擇任何軟體集，但標準的、重要的，或者系統優先要求的軟體套件將被安裝。該功能相當於在命令列下執行 <userinput>tasksel -ris</userinput>，目前包括下載一個大約 37M 的套件。您會看到將要安裝的軟體套件，若套件需要被下載，您也會看見軟體套件的檔案大小。

source: If you do want to choose what to install on a package by package basis, select the <quote>manual package selection</quote> option in <command>tasksel</command>. If you select one or more tasks alongside this option, <command>aptitude</command> will be called with the <command>--visual-preview</command> option. This means you will be able to review<footnote> <para> You can also change the default selections. If you would like to select any additional package, use <menuchoice> <guimenu>View</guimenu> <guimenuitem>New Package View</guimenuitem> </menuchoice>. </para> </footnote> the packages that are to be installed. If you do not select any tasks, the normal <command>aptitude</command> screen will be displayed. After making your selections you should press <quote><userinput>g</userinput></quote> to start the download and installation of packages.
el: Αν θέλετε να διαλέξετε τι θα εγκαταστήσετε στη βάση μεμονωμένων πακέτων, τότε κάντε την επιλογή <quote>manual package selection</quote> στην εντολή <command>tasksel</command>. Αν παράλληλα με την επιλογή αυτή διαλέξετε και ένα ή περισσότερα από τα καθήκοντα, τότε θα κληθεί η εντολή <command>aptitude</command> με την επιλογή <command>-- visual-preview</command>. Αυτό σημαίνει ότι μπορείτε να αναθεωρήσετε <footnote> <para> Μπορείτε επίσης να αλλάξετε τις προκαθορισμένες συλλογές πακέτων. Αν θέλετε να διαλέξετε κάποιο επιπλέον πακέτο, χρησιμοποιήστε την επιλογή <menuchoice> <guimenu>View</guimenu> <guimenuitem>New Package View</guimenuitem> </menuchoice>.</para></footnote> τα πακέτα που πρόκειται να εγκατασταθούν. Αν δεν διαλέξετε κανένα από τα καθήκοντα, η συνηθισμένη οθόνη του <command>aptitude</command> θα εμφανιστεί. Αφού κάνετε τις επιλογές σας θα πρέπει να πιέσετε <quote><userinput>g</userinput></quote> για να ξεκινήσετε το κατέβασμα και την εγκατάσταση των πακέτων.
ko: 당신이 정말로 패키지 별로 설치하기를 원한다면 <command>tasksel</command>에서 <quote>manual package selection</quote> 옵션을 선택하세요. 이 옵션과 함께 하나 이상의 태스크를 선택했다면, <command>aptitude</command>가 <command>--visual-preview</command> 옵션과 함께 실행 될 것입니다. 이 것은 설치될 패키지들을 확인 할 수 있다는 것을 의미합니다. <footnote> <para> 당신은 default 섹션 역시 바꿀 수 있습니다. 다른 추가적인 패키지를 선택하길 원한다면 <menuchoice> <guimenu>View</guimenu> <guimenuitem>New Package View</guimenuitem> </menuchoice>를 사용하세요. </para> </footnote> 아무런 태스크도 선택하지 않았다면, 일반 <command>aptitude</command> 화면이 보여질 것입니다. 선택이 끝난 후에 <quote><userinput>g</userinput></quote>를 눌러야 패키지들의 다운로드와 설치가 시작 됩니다.
pt: Se pretender escolher o que instalar numa base de pacote a pacote, seleccione a opção <quote>selecção manual de pacotes</quote> no <command>tasksel</command>. Se seleccionar uma ou mais tarefas além desta opção, o <command>aptitude</command> irá ser chamado com a opção <command>--visual-preview</command>. Isto significa que poderá rever<footnote> <para> Pode sempre modificar as selecções padrão. Se pretender seleccionar qualquer pacote adicional, use <menuchoice> <guimenu>Ver</guimenu> <guimenuitem>Nova Vista de Pacotes</guimenuitem> </menuchoice>. </para> </footnote> os pacotes que estão para ser instalados. Se não seleccionar qualquer tarefa, o ecrã normal do <command>aptitude</command> será apresentado. Depois de fazer as suas selecções deverá carregar em <quote><userinput>g</userinput></quote> para iniciar a transferência e a instalação dos pacotes.
ru: Если вы хотите выбирать устанавливаемые пакеты из списка пакетов, в <command>tasksel</command> выберите <quote>выбор пакетов вручную</quote>. Если вы выбрали одну или более задач помимо этого, то <command>aptitude</command> будет вызвана с параметром <command>--visual-preview</command>. То есть вы сможете просмотреть<footnote> <para> Также вы можете изменить выбор по умолчанию. Если вы хотите выбрать какой-то пакет, в меню выберите <menuchoice> <guimenu>View</guimenu> <guimenuitem>New Package View</guimenuitem> </menuchoice>. </para> </footnote> список пакетов, которые будут установлены. Если вы не выбрали ни одной задачи, то будет показан обычный экран <command>aptitude</command>. После выбора всех пакетов вы должны нажать <quote><userinput>g</userinput></quote>, чтобы запустить процесс загрузки и установки пакетов.
zh_cn: 如果您想基于软件包安装软件包，选择位于 <command>tasksel</command> 的 <quote>manual package selection</quote> 选项。 如果您选择该选项旁的一个或多项任务，aptitude 将以 <command>--visual-preview</command> 选项执行。 意思是您可以检查<footnote> <para> 您可以修改这项默认选择。如果您希望选择额外的软件包， 使用 <menuchoice> <guimenu>View</guimenu> <guimenuitem>New Package View</guimenuitem> </menuchoice>. </para> </footnote> 那些将要安装的软件包。如果您不选择任何任务， 通常 <command>aptitude</command> 画面会打开。 作出选择之后，您按下 <quote><userinput>g</userinput></quote> 开始下载安装软件包。
zh_tw: 如果您想基於軟體套件安裝軟體，選擇位於 <command>tasksel</command> 的 <quote>手動選取套件</quote> 選項。如果您選擇該選項旁的一個或多項軟體集，aptitude 將以 <command>--visual-preview</command> 選項執行。這表示您可以檢查<footnote> <para> 您可以修改這項預設選擇。如果您希望選擇額外的軟體套件，使用 <menuchoice> <guimenu>瀏覽</guimenu> <guimenuitem>瀏覽新套件</guimenuitem> </menuchoice>。</para> </footnote> 那些將要安裝的軟體套件。如果您不選擇任何軟體集，則一般的 <command>aptitude</command> 畫面被顯示。選擇完畢，請按下 <quote><userinput>g</userinput></quote> 開始下載和安裝軟體套件。
