Repository: xobs/debian-installer
Catalog: doc/manual/po/*/boot-new.po
Languages: el, ko, pt, ru, zh_cn, zh_tw

source: So on the first screen you will be presented with several common mail scenarios. Choose the one that most closely resembles your needs:
el: Στην πρώτη οθόνη της ρύθμισης, θα σας παρουσιαστούν μερικά συνηθισμένα σενάρια για τη χρήση του ταχυδρομείου. Διαλέξτε αυτό που ταιριάζει πιο κοντά στις δικές σας ανάγκες:
ko: 그래서 첫 번째 화면에서 몇 개의 일반적인 메일 사용 시나리오들이 보여질 것입니다. 가장 당신의 환경과 유사한 것을 선택합니다.
pt: Assim no primeiro ecrã ser-lhe-á apresentado um conjunto de cenários comuns de mail. Escolha o que mais se adequa às suas necessidades:
ru: На первом экране вам будет предложено несколько общих почтовых сценариев. Выберите тот, который подходит вам больше всего:
zh_cn: 所以，在第一个屏幕上您可以看到几个常见的邮件配置方案。请选择一个最适合您需求的。
zh_tw: 所以，在第一個螢幕上您可以看到幾個常見的郵件設定方案。請選擇一個最適合您需求的。

source: internet site
el: Διαδικτυακός τόπος
ko: 인터넷 사이트
pt: site de internet
ru: интернет-сайт
zh_cn: 互联网站
zh_tw: 網際網路站

source: Your system is connected to a network and your mail is sent and received directly using SMTP. On the following screens you will be asked a few basic questions, like your machine's mail name, or a list of domains for which you accept or relay mail.
el: Το σύστημά σας είναι συνδεδεμένο σε ένα δίκτυο και η αλληλογραφία σας αποστέλλεται και λαμβάνεται απευθείας με χρήση του SMTP. Στις επόμενες οθόνες θα δείτε μερικές βασικές ερωτήσεις, όπως το όνομα αλληλογραφίας του μηχανήματός σας, ή μια λίστα από ονόματα τομέων για τους οποίους δέχεστε ή μεταβιβάζετε αλληλογραφία.
ko: 당신의 시스템이 네트워크에 연결되어 있고 메일은 SMTP를 사용해 직접 보내고 받게 됩니다. 다음 화면에서 당신 시스템의 메일이름이나 사용할 도메인들의 목록 등 기본적인 질문을 물어볼 것입니다.
pt: O seu sistema está ligado a uma rede e o seu correio é enviado e recebido directamente usando o SMTP. Nos ecrãs seguinte ser-lhe-á perguntado algumas questões básicas, como o nome para o correio da sua máquina, ou uma lista de domínios para os quais deseja aceitar e encaminhar o correio.
ru: Ваша система подключена к сети, почта отправляется и получается напрямую по протоколу SMTP. На следующих экранах вам зададут несколько основных вопросов, таких как почтовое имя вашей машины или список доменов, для которых вы принимаете или передаёте почту.
zh_cn: 您的系统被连接到网络上，并且您通过 SMTP 直接收发邮件。在接下来的几页中，程序会询问您一些基本问题，如：您的机器的邮件名称、您接受或转发邮件的域等等。
zh_tw: 您的系統連接到網路上，並且您透過 SMTP 直接收發郵件。在接下來的幾頁中，程式會詢問您一些基本問題，如：您的機器的郵件名稱、您接受或轉發郵件的網域名稱等等。

source: mail sent by smarthost
el: αλληλογραφία που αποστέλλεται μέσω smarthost
ko: 스마트호스트에 의한 메일 보내기
pt: correio enviado por smarthost
ru: отправка почты через компьютер-шлюз (smarthost)
zh_cn: 用 smarthost 发信
zh_tw: 用 smarthost 發信

source: In this scenario is your outgoing mail forwarded to another machine, called a <quote>smarthost</quote>, which does the actual job for you. Smarthost also usually stores incoming mail addressed to your computer, so you don't need to be permanently online. That also means you have to download your mail from the smarthost via programs like fetchmail. This option is suitable for dial-up users.
el: Στο σενάριο αυτό. η εξερχόμενη αλληλογραφία σας προωθείται σε ένα άλλο μηχάνημα που ονομάζεται <quote>smarthost</quote>, που κάνει την πραγματική δουλειά για σας. Ένας smarthost αποθηκεύει συνήθως επίσης την εισερχόμενη αλληλογραφία που απευθύνεται στο σύστημά σας, οπότε δεν είναι απαραίτητο να είστε διαρκώς συνδεδεμένοι. Αυτό βέβαια σημαίνει ότι πρέπει να κατεβάζετε την αλληλογραφία σας από τον smarthost με προγράμματα όπως το fetchmail. Η επιλογή αυτή είναι κατάλληλη για χρήστες dial-up.
ko: 이 시나리오에서는 당신의 나가는 메일은 <quote>smarthost</quote>라고 불리는 다른 머신으로 전달 되고 실제 작업은 여기에서 이루어 집니다. 스마트호스트는 보통 당신의 컴퓨터로 들어오는 메일도 저장합니다. 그래서 당신은 계속 온라인 상태일 필요가 없습니다. 이 것은 fetchmail 등과 같은 프로그램을 통해 스마트호스트에서 메일을 다운로드해야 한다는 것을 의미합니다. 이 옵션은 dial-up 사용자들에게 적합합니다.
pt: Neste cenário o seu mail de saída é encaminhado para outra máquina, chamada de <quote>smarthost</quote>, que irá fazer o trabalho por si. O smarthost normalmente também guarda correio direccionado para o seu computador, assim não é preciso que esteja permanentemente online. O que também significa que tem que transferir o seu correio do smarthost através de programas tal como o fetchmail. Esta opção é aconselhável para utilizadores de acesso telefónico.
ru: По этому сценарию ваша исходящая почта переправляется на другую машину, называемую <quote>smarthost</quote>, которая и выполняет всю работу за вас. Smarthost обычно ещё и хранит входящую почту, адресованную вашему компьютеру, так что вам не надо постоянно находиться в сети. Это также означает, что вам нужно загружать почту со smarthost с помощью программ типа fetchmail. Этот вариант подходит пользователям, которые используют модемное подключение по телефонной линии.
zh_cn: 在这个方案中，您的外发邮件将被另一台我们称之为 <quote>smarthost</quote>主机转发，由它来完成实际的邮件发送工作。Smarthost 通常也能存放将要投递到您的电脑上的邮件，因此您并不需要永远在线。也就是说，您必须通过诸如 fetchmail 之类的程序将邮件从 smarthost 下载回来。这一选项通常适合拨号用户。
zh_tw: 在這個方案中，您的外送郵件將被另一台我們稱之為 <quote>smarthost</quote> 的主機轉發，由它來完成實際的郵件發送工作。Smarthost 通常也能存放將要投遞到您的電腦上的郵件，因此您並不需要永遠連線。也就是說，您必須透過諸如 fetchmail 之類的程式將郵件從 smarthost 下載回來。這一選項通常適合撥號使用者。

source: local delivery only
el: Μόνο τοπική παράδοση
ko: 로컬 배달
pt: distribuição local apenas
ru: доставка только локальной почты
zh_cn: 仅在本地投递
zh_tw: 僅在本地發送

source: Your system is not on a network and mail is sent or received only between local users. Even if you don't plan to send any messages, this option is highly recommended, because some system utilities may send you various alerts from time to time (e.g. beloved <quote>Disk quota exceeded</quote>). This option is also convenient for new users, because it doesn't ask any further questions.
el: Το σύστημά σας δεν είναι συνδεδεμένο σε κάποιο δίκτυο και αλληλογραφία στέλνεται και λαμβάνεται μόνο μεταξύ τοπικών χρηστών. Ακόμα και αν δεν σχεδιάζετε να στέλνετε οποιαδήποτε μηνύματα, αυτή η επιλογή προτείνεται ανεπιφύλακτα γιατί μερικά βοηθητικά προγράμματα στο σύστημά σας πιθανόν να πρέπει να σας στέλνουν κατά διαστήματα προειδοποιήσεις (πχ. το αγαπημένο μήνυμα <quote>Disk quota exceeded</quote>)! Η επιλογή αυτή είναι επίσης βολική για νέους χρήστες καθώς δεν συνοδεύεται από άλλες επιπλέον ερωτήσεις.
ko: 당신의 시스템이 네트워크에 있지 않고 메일은 단지 로컬 사용자들 사이에서만 보내고 받아집니다. 어떤 메시지도 보낼 계획이 없는 경우에도 이 옵션이 적극 추천됩니다. 몇몇 시스템 유틸리티들은 때때로 다양한 알림 메시지를 보냅니다. (e.g. <quote>Disk quota exceeded</quote>) 이 옵션은 더이상 물어보는 것이 없기 때문에 새로운 사용자에게도 편리합니다.
pt: O seu sistema não está numa rede e o correio apenas é enviado ou recebido entre utilizadores locais. Mesmo que não tenha a intenção de enviar quaisquer mensagens, esta opção é altamente recomendável, porque algumas ferramentas do sistema podem enviar-lhe vários alertas de tempos a tempos (p.e. o adorado <quote>Disk quota exceeded</quote>). Esta opção é também conveniente para novos utilizadores, porque não irá fazer mais nenhuma pergunta.
ru: Ваша система не в сети, почта отправляется и принимается только между локальным пользователями. Даже если вы не планируете отправку сообщений, этот вариант настоятельно рекомендуется, потому что различные системные утилиты смогут отправлять вам предупреждения (например, любимое: <quote>Превышена дисковая квота</quote>). Этот вариант подходит новым пользователям, потому что далее не задаётся больше никаких вопросов.
zh_cn: 您的系统并未连接网络，而且邮件仅仅在本地用户间传递时。即使您不打算发送任何邮件，我们也建议您选择此选项，因为部份系统工具可能随时会发送一些警告信息(比如：可爱的 <quote>Disk quota exceeded</quote>)。由于选择此项后不需要回答任何问题，因此这一选项也非常适合新手。
zh_tw: 您的系統並未連接網路，則郵件僅僅在本地使用者間傳遞。即使您不打算發送任何郵件，我們也建議您選擇此選項，因為部份系統工具可能隨時會發送一些警告資訊 (例如：可愛的 <quote>Disk quota exceeded</quote>)。由於選擇此項後不需要回答任何問題，因此這一選項也非常適合新手。

source: no configuration at this time
el: όχι ρύθμιση αυτή τη φορά
ko: 지금 설정 안함
pt: sem configuração neste momento
ru: в данный момент конфигурация отсутствует
zh_cn: 现在不进行配置
zh_tw: 現在不進行設定

source: Choose this if you are absolutely convinced you know what you are doing. This will leave you with an unconfigured mail system &mdash; until you configure it, you won't be able to send or receive any mail and you may miss some important messages from your system utilities.
el: Διαλέξτε αυτό αν είστε απόλυτα σίγουροι ότι ξέρετε τι κάνετε! Αυτή η επιλογή θα σας αφήσει με ένα αρρύθμιστο σύστημα αλληλογραφίας &mdash; μέχρι να κάνετε κάποια ρύθμιση, δεν θα μπορείτε να στείλετε ή να πάρετε μηνύματα και πιθανόν να χάσετε κάποια σημαντικά μηνύματα από βοηθητικά προγράμματα του συστήματός σας.
ko: 당신이 하는 것에 대해 절대적으로 확신할 수 있는 경우에만 선택합니다. 이 옵션은 당신에게 설정되지 않은 메일 시스템을 남겨 놓습니다. &mdash; 당신이 설정하기 전까지는 메일을 보내거나 받을 수 없을 뿐만아니라 시스템 유틸리티들에게서 오는 중요한 메시지들을 놓칠 수 있습니다.
pt: Escolha esta opção se está absolutamente convencido de que sabe o que está a fazer. Esta opção irá deixar-lhe com o sistema de correio desconfigurado &mdash; até que o configure, não será capaz de enviar ou receber qualquer mail e pode perder algumas mensagens importantes dos utilitários do seu sistema.
ru: Выберите этот вариант, если вы абсолютно уверены в том, что делаете. Это оставит вас с ненастроенной почтовой системой; до тех пор пока вы не настроите её, вы не сможете отправлять или получать почту и вы можете пропустить некоторые важные сообщения от ваших системных утилит.
zh_cn: 除非您真的知道这是在干什么，否则请不要选择这一选项。这会留下一个未配置的邮件系统 &mdash; 在您再次配置它之前，您都无法收发任何邮件，并且可能会错过一些系统工具发来的重要信息。
zh_tw: 除非您真的知道您在做什麼，否則請不要選擇這一選項。這會留下一個未設定的郵件系統 &mdash; 在您再次設定它之前，您都無法收發任何郵件，並且可能會錯過一些系統工具發出的重要資訊。

source: If none of these scenarios suits your needs, or if you need a finer setup, you will need to edit configuration files under the <filename>/etc/exim4</filename> directory after the installation is complete. More information about <command>exim4</command> may be found under <filename>/usr/share/doc/exim4</filename>.
el: Αν κανένα από τα σενάρια αυτά δεν ταιριάζει στις ανάγκες σας, ή αν θέλετε να κάνετε πιο εξειδικευμένες ρυθμίσεις, θα πρέπει να επεξεργαστείτε τα αρχεία στον κατάλογο <filename>/etc/exim4</filename> μετά την ολοκλήρωση της εγκατάστασης. Περισσότερες πληροφορίες για το <command>exim4</command> μπορούν να βρεθούν στον κατάλογο <filename>/usr/share/doc/exim4</filename>.
ko: 이 시나리오들 중에서 당신에게 적합한 것이 없거나 좀 더 세밀한 설정을 원한다면, 설치가 완료된 후에 <filename>/etc/exim4</filename> 디렉토리의 설정파일을 편집해야합니다. <command>exim4</command>에 대해 더 많은 정보는 <filename>/usr/share/doc/exim4</filename>에서 찾을 수 있습니다.
pt: Se nenhum destes cenários serve as suas necessidades, ou se necessita de uma configuração mais detalhada. irá necessitar de editar os ficheiros de configuração na directoria <filename>/etc/exim4</filename> depois da instalação estar completa. Poderá encontrar mais informação sobre o <command>exim4</command> em <filename>/usr/share/doc/exim4</filename>.
ru: Если ни один из этих сценариев не подходит или нужна более тонкая настройка, то после завершения установки вам нужно отредактировать файлы конфигурации в каталоге <filename>/etc/exim4</filename>. Дополнительную информацию про <command>exim4</command> можно найти в <filename>/usr/share/doc/exim4</filename>.
zh_cn: 如果以上的方案都不适合您的需求，或者您需要一个更好的配置，在安装完毕后，您可以编辑 <filename>/etc/exim4</filename> 目录下的配置文件。您还可以在 <command>exim4</command>下找到更多关于 <filename>/usr/share/doc/exim4</filename> 的资料。
zh_tw: 如果以上的方案都不適合您的需求，或者您需要一個更好的設定，在安裝完畢後，您可以編輯 <filename>/etc/exim4</filename> 目錄下的設定檔。您還可以在 <filename>/usr/share/doc/exim4</filename> 下找到更多關於 <command>exim4</command> 的資料。

source: Log In
el: Είσοδος στο Σύστημα
ko: 로긴
ru: Вход в систему
zh_cn: 登录
zh_tw: 登入

source: After you've installed packages, you'll be presented with the login prompt. Log in using the personal login and password you selected. Your system is now ready to use.
el: Αφού έχετε εγκαταστήσει τα πακέτα που θέλετε, θα βρεθείτε μπροστά στο προτρεπτικό της εισόδου στο σύστημα. Μπείτε στο σύστημα με το προσωπικό σας όνομα χρήστη και κωδικό πρόσβασης που έχετε επιλέξει. Το σύστημά σας είναι έτοιμο για να το χρησιμοποιήσετε.
ko: 패키지들의 설치가 끝난 뒤에 로긴 프롬프트가 보여질 것입니다. 선택한 개인 로긴 계정과 암호를 사용해 로긴합니다. 당신의 시스템은 이제 사용할 준비가 되었습니다.
pt: Depois de ter instalado os pacotes, ser-lhe-á apresentado o comando de login. Entre no sistema utilizando o seu nome de utilizador pessoal e a password que escolheu. O seu sistema está pronto a ser utilizado.
ru: После установки пакетов вам предложат войти в систему. Для входа используйте заданный ранее персональный логин и пароль. Система готова к работе.
zh_cn: 安装完软件包以后，您会看到登录提示符。使用您选择的登录用户名和密码。您的系统现在就能使用了。
zh_tw: 安裝完軟體套件以後，您會看到登入提示符號。使用您選擇的登入使用者名稱和密碼。您的系統就能使用了。

source: If you are a new user, you may want to explore the documentation which is already installed on your system as you start to use it. There are currently several documentation systems, work is proceeding on integrating the different types of documentation. Here are a few starting points.
el: Αν είστε ένας νέος χρήστης, πιθανόν να θέλετε να εξερευνήσετε την τεκμηρίωση που είναι ήδη εγκατεστημένη στο σύστημα καθώς ξεκινάτε να το χρησιμοποιείτε. Υπάρχουν αυτή τη στιγμή αρκετά συστήματα τεκμηρίωσης ενώ βρίσκεται σε εξέλιξη η δουλειά της ολοκλήρωσης αυτών των διαφορετικών τύπων τεκμηρίωσης. Εδώ είναι μερικά σημεία αφετηρίας.
ko: 새로운 사용자라면 시스템 사용을 시작 할 때 이미 설치되어 있는 문서들을 보기를 원할 것입니다. 현재 몇 개의 문서 시스템들이 있고, 다른 타입의 문서들을 통합하는 작업이 진행 중입니다. 이 문서 역시 몇 개의 시작 지점입니다.
pt: Se é um novo utilizador, poderá querer explorar a documentação que já se encontra instalada no seu sistema à medida que começa a utiliza-lo. Existem presentemente diversos sistemas de documentação, estão sendo feitos esforços no sentido de integrar os diferentes tipo de documentação. Aqui estão alguns pontos de partida.
ru: Если вы новичок, то начните с просмотра документации, которая уже установлена в системе. Есть несколько систем документации, продолжается работа над их объединением. Вот несколько мест, откуда можно начать.
zh_cn: 如果您是新用户，您也许希望开始使用后可以浏览已经安装到系统上的文档。当前多个文档系统，由不同类型的文档组成。这里是一些出发点。
zh_tw: 如果您是新使用者，您也許希望瀏覽已經安裝到系統上的文件。目前有多個文件系統，由不同類型的文件組成。接下來將做簡略介紹。

source: Documentation accompanying programs you have installed is in <filename>/usr/share/doc/</filename>, under a subdirectory named after the program. For example, the APT User's Guide for using <command>apt</command> to install other programs on your system, is located in <filename>/usr/share/doc/apt/guide.html/index.html</filename>.
el: Τεκμηρίωση που συνοδεύει τα προγράμματα που έχετε εγκαταστήσει βρίσκεται στον κατάλογο <filename>/usr/share/doc/</filename> και κάτω από τον υποκατάλογο με το όνομα του προγράμματος αυτού. Για παράδειγμα, ο οδηγός χρήσης του APT για τη χρήση του <command>apt</command> για την εγκατάσταση άλλων προγραμμάτων στο σύστημά σας βρίσκεται στον κατάλογο <filename>/usr/share/doc/apt/guide.html/index.html</filename>.
ko: 설치된 프로그램들에 따라오는 문서는 <filename>/usr/share/doc/</filename> 안의 프로그램의 이름을 따른 하위 디렉토리에 있습니다. 예를 들면 당신의 시스템에 다른 프로그램을 설치하기 위한 <command>apt</command>를 사용하기 위한 APT 사용자 가이드는 <filename>/usr/share/doc/guide.html/index.html</filename> 안에 위치해 있습니다.
pt: A documentação que acompanha os programas que instalou estão em <filename>/usr/share/doc/</filename>, dentro de uma subdirectoria com o mesmo nome do programa. Por exemplo, o Guia dos Utilizadores do APT utilize o <command>apt</command> para instalar outros programas no seu sistema, que está localizado em <filename>/usr/share/doc/apt/guide.html/index.html</filename>.
ru: Документация на установленные программы находится в <filename>/usr/share/doc/</filename> в подкаталоге с именем этой программы. Например, руководство пользователя APT, описывающее использование <command>apt</command> для установки других программ, находится в <filename>/usr/share/doc/apt/guide.html/index.html</filename>.
zh_cn: 伴随程序的文档安装在 <filename>/usr/share/doc/</filename>，并在程序名命名的子目录下。例如，APT 用户指南是关于 <command>apt</command> 安装其他的程序到系统，位于 <filename>/usr/share/doc/apt/guide.html/index.html</filename>。
zh_tw: 伴隨程式的文件安裝在 <filename>/usr/share/doc/</filename> 之下，並存在於以程式名稱命名的子目錄下。例如，APT 使用者指南是關於使用 <command>apt</command> 安裝其他程式的說明，位於 <filename>/usr/share/doc/apt/guide.html/index.html</filename>。

source: In addition, there are some special folders within the <filename>/usr/share/doc/</filename> hierarchy. Linux HOWTOs are installed in <emphasis>.gz</emphasis> format, in <filename>/usr/share/doc/HOWTO/en-txt/</filename>. After installing <command>dhelp</command> you will find a browse-able index of documentation in <filename>/usr/share/doc/HTML/index.html</filename>.
el: Επιπρόσθετα, υπάρχουν μερικοί ειδικοί κατάλογοι μέσα στην ιεραρχία του καταλόγου <filename>/usr/share/doc/</filename>. Οδηγοί του Linux (Linux HOWTOs) είναι εγκατεστημένοι σε μορφή <emphasis>.gz</emphasis>, στον κατάλογο <filename>/usr/share/doc/HOWTO/en-txt/</filename>. Μετά την εγκατάσταση του προγράμματος <command>dhelp</command> θα βρείτε έναν φυλλομετρήσιμο δείκτη της τεκμηρίωσης στο αρχείο <filename>/usr/share/doc/HTML/index.html</filename>.
ko: 추가적으로 <filename>/usr/share/doc/</filename> 계층에는 몇몇 특별한 폴더들이 있습니다. 리눅스 HOWTO들이 <filename>/usr/share/doc/HOWTO/en-txt/</filename> 안에 <emphasis>.gz</emphasis> 형식으로 설치되어 있습니다. <command>dhelp</command>를 설치하면 <filename>/usr/share/doc/HTML/index.html</filename> 안에 브라우징 할 수 있는 색인된 문서를 볼 수 있을 것입니다.
pt: Adicionalmente, existem algumas directorias especiais dentro da hierarquia <filename>/usr/share/doc/</filename>. Os Linux HOWTOs estão instalados no formato <emphasis>.gz</emphasis>,em <filename>/usr/share/doc/HOWTO/en-txt/</filename>. O <filename>/usr/share/doc/HTML/index.html</filename> contém índices navegáveis da documentação instalada pelo <command>dhelp</command>.
ru: Также, <filename>/usr/share/doc/</filename> содержит несколько специальных каталогов. Linux HOWTO установлены в формате <emphasis>.gz</emphasis> в каталог <filename>/usr/share/doc/HOWTO/en-txt/</filename>. После установки <command>dhelp</command> появляется файл <filename>/usr/share/doc/HTML/index.html</filename> со ссылками на документацию.
zh_cn: 另外，还有一些特殊的目录位于 <filename>/usr/share/doc/</filename> 组织里。 Linux HOWTOs 以 <emphasis>.gz</emphasis> 格式安装，放在 <filename>/usr/share/doc/HOWTO/en-txt/</filename>。 安装 <command>dhelp</command>之后，可以浏览 <filename>/usr/share/doc/HTML/index.html</filename> 文档索引。
zh_tw: 另外，還有一些特殊的目錄位於 <filename>/usr/share/doc/</filename> 目錄結構裡。Linux HOWTOs 以 <emphasis>.gz</emphasis> 格式安裝，放在 <filename>/usr/share/doc/HOWTO/en-txt/</filename>。安裝 <command>dhelp</command>之後，可以瀏覽 <filename>/usr/share/doc/HTML/index.html</filename> 文件索引。

source: One easy way to view these documents is to <userinput>cd /usr/share/doc/</userinput>, and type <userinput>lynx</userinput> followed by a space and a dot (the dot stands for the current directory).
el: Ένας άλλος εύκολος τρόπος να δείτε αυτά τα κείμενα είναι να κάνετε <userinput>cd /usr/share/doc/</userinput>, και να τυπώστε <userinput>lynx</userinput> ακολουθούμενο από ένα κενό διάστημα και μια τελεία (η τελεία παριστάνει τον τρέχοντα κατάλογο).
ko: 이 문서들을 보기위한 쉬운 방법 중 하나는 <userinput>cd /usr/share/doc/</userinput> 한 뒤에 <userinput>lynx</userinput> 과 공백 그리고 점(점은 현재 디렉토리를 의미합니다.)을 입력하세요.
pt: Uma maneira fácil de ver estes documentos é fazer <userinput>cd /usr/share/doc/</userinput> e escrever <userinput>lynx</userinput> seguido de um espaço e um ponto (o ponto significa a directoria actual).
ru: Простой способ просмотра этих документов: зайдите <userinput>cd /usr/share/doc/</userinput> и наберите <userinput>lynx</userinput>, пробел и точку (точка означает текущий каталог).
zh_cn: 一种查看文档简易的方法是 <userinput>cd /usr/share/doc/</userinput>，然后键入 <userinput>lynx</userinput> 后面是空格加一个点(点是指当前目录)。
zh_tw: 一種查看文件的簡易方法是 <userinput>cd /usr/share/doc/</userinput>，然後鍵入 <userinput>lynx</userinput> 後面加上空格和一個點 (點是指目前目錄)。

source: You can also type <userinput>info <replaceable>command</replaceable></userinput> or <userinput>man <replaceable>command</replaceable></userinput> to see documentation on most commands available at the command prompt. Typing <userinput>help</userinput> will display help on shell commands. And typing a command followed by <userinput>--help</userinput> will usually display a short summary of the command's usage. If a command's results scroll past the top of the screen, type <userinput>| more</userinput> after the command to cause the results to pause before scrolling past the top of the screen. To see a list of all commands available which begin with a certain letter, type the letter and then two tabs.
el: Μπορείτε επίσης να τυπώσετε <userinput>info <replaceable>command</replaceable></userinput> ή <userinput>man <replaceable>command</replaceable></userinput> για να δείτε την τεκμηρίωση για τις περισσότερες εντολές που παρέχει η γραμμή εντολών. Τυπώνοντας <userinput>help</userinput> θα εμφανίσει βοήθεια στις εντολές του κελύφους. Και τυπώνοντας μια εντολή ακολουθούμενη από <userinput>--help</userinput> θα εμφανίσει συνήθως μια σύντομη περίληψη της χρήσης της εντολής αυτής. Αν το αποτέλεσμα μιας εντολής συνεχίζουν μετά την κορυφή της οθόνης, τυπώστε <userinput>| more</userinput> μετά την εντολή για να σταματήσετε την μετακύλιση των αποτελεσμάτων στην κορυφή της οθόνης Για να δείτε μια λίστα με όλες τις διαθέσιμες εντολές που αρχίζουν από ένα συγκεκριμένο γράμμα. τυπώστε το γράμμα αυτό και στη συνέχεια δυο φορές το tab.
ko: <userinput>info <replaceable>command</replaceable></userinput> 또는 <userinput>man <replaceable>command</replaceable></userinput>을 명령창에 입력해서 대부분의 명령에 대한 문서를 볼 수 있습니다. <userinput>help></userinput>을 입력해서 쉘 명령에 대한 도움말을 볼 수 있습니다. 명령의 결과가 화면 위로 지나가 버린 경우에는 <userinput>| more</userinput>을 명령 뒤에 입력해서 화면 위로 스크롤 되어 지나가기 전에 결과를 멈출 수 있습니다. 특정 문자로 시작되는 모든 명령들의 목록을 보기 원한다면 특정 문자를 입력하고 탭을 두번 누릅니다.
pt: Poderá também escrever <userinput>info <replaceable>command</replaceable></userinput> ou <userinput>man <replaceable>command</replaceable></userinput> para ver a documentação na maioria dos comandos disponíveis na linha de comandos. Escrever <userinput>help</userinput> irá apresentar uma ajuda nos comandos de shell. E escrever um comando seguido de <userinput>--help</userinput> irá normalmente apresentar um resumo da forma de utilização desse comando. Se o resultado de um comando passar o topo do ecrã, escreva <userinput>| more</userinput> depois do comando para fazer com que os resultados parem depois de passar o topo do ecrã. Para ver uma lista de todos os comandos necessários que começam com uma determinada letra, escreva a letra seguido de dois tabs.
ru: Также вы можете набрать <userinput>info <replaceable>команда</replaceable></userinput> или <userinput>man <replaceable>команда</replaceable></userinput>, чтобы посмотреть документацию по большинству доступных команд в командной строке. Набрав <userinput>help</userinput>, вы увидите помощь по командам интерпретатора командной строки. А при вводе имени команды, пробел, <userinput>--help</userinput> обычно выдаётся короткая справка по использованию программы. Если начало результата выполнения команды уехало за пределы экрана, добавьте <userinput>| more</userinput> после команды, и это включит паузу при заполнении всего экрана. Чтобы увидеть список всех доступных команд, начинающихся с определённого символа, введите символ и нажмите клавишу табуляции два раза.
zh_cn: 您也可以键入 <userinput>info <replaceable>command</replaceable></userinput> 或 <userinput>man <replaceable>command</replaceable></userinput> 在去查看大多数的命令行下的命令。键入 <userinput>help</userinput> 将显示 shell 命令的帮助。键入命令后面加上 <userinput>--help</userinput> 通常会显示命令用法的简短摘要。如果命令的结果滚动超出屏幕顶端，键入 <userinput>| more</userinput> 于命令之后，可以让输出暂停在滚出顶端屏幕。查看某子母开始的所有可用命令，键入该子母，再是两个 tab。
zh_tw: 您也可以鍵入 <userinput>info <replaceable>command</replaceable></userinput> 或 <userinput>man <replaceable>command</replaceable></userinput> 在去查看大多數命令列下的指令。鍵入 <userinput>help</userinput> 將顯示介殼指令的說明。鍵入指令後加上 <userinput>--help</userinput> 通常會顯示指令用法的簡短摘要。如果指令的結果捲動超出螢幕頂端，鍵入 <userinput>| more</userinput> 於指令之後，可以讓輸出暫停在頂端螢幕。查看某字母開始的所有可用指令，鍵入該字母，再按兩次 tab 鍵。
