Repository: xobs/debian-installer
Catalog: doc/manual/po/*/boot-installer.po
Languages: ko, pt, zh_tw

source: You must retain the original Mac system and boot from it. It is <emphasis>essential</emphasis> that, when booting MacOS in preparation for booting the Penguin linux loader, you hold the <keycap>shift</keycap> key down to prevent extensions from loading. If you don't use MacOS except for loading linux, you can accomplish the same thing by removing all extensions and control panels from the Mac's System Folder. Otherwise extensions may be left running and cause random problems with the running linux kernel.
ko: 원래 Mac 시스템을 유지하면서 그 시스템에서 부팅해야 합니다. MacOS가 부팅하면서 Penguin 리눅스 로더 부팅 준비를 할 때, <keycap>shift</keycap> 키를 눌러 확장 기능을 읽어들이지 않도록 해야 하는 게 <emphasis>중요합니다</emphasis>. 리눅스를 읽어들이는 것 이외에 MacOS를 사용하지 않는다면, Mac의 시스템 폴더에서 모든 확장 기능과 컨트롤 패널을 지우면 됩니다. 그렇지 않으면 확장 기능을 실행해서 리눅스 커널 실행에 여러 가지 문제가 발생할 수 있습니다.
pt: Deve manter o sistema original do Mac e iniciar a partir dele. É <emphasis>essencial</emphasis> que, quando arrancar em MacOS em preparação para iniciar o instalador de linux Penguin, pressione a tecla <keycap>shift</keycap> para prevenir extensões no arranque. Se apenas utiliza MacOS para iniciar o linux, pode conseguir o mesmo removendo todas as extensões e a pasta do painel de controle do sistema Mac. Caso contrário as extensões podem ser deixadas correr e causar problemas aleatórios com o kernel linux que está a ser executado.
zh_tw: 您必須有原來的 Mac 系統，並從它啟動。它是 <emphasis>必要的</emphasis>，當啟動 MacOS 準備啟動 Penguin linux loder 時，按住 <keycap>shift</keycap> 鍵阻止擴充套件繼續動作。如果您除了載入 linux 之外不使用 MacOS，您可以從 Mac 的系統目錄下清除所有的擴充套件和控制面板來達到同樣的目的。否則擴充套件會使 linux 核心參數隨機出錯。

source: Macs require the <command>Penguin</command> bootloader. If you do not have the tools to handle a <command>Stuffit</command> archive, &penguin19.hfs; is an hfs disk image with <command>Penguin</command> unpacked. <xref linkend="create-floppy"/> describes how to copy this image to a floppy.
ko: Mac에서는 <command>Penguin</command> 부트로더가 필요합니다. <command>Stuffit</command> 아카이브를 다루는 도구가 없다면, &penguin19.hfs;가 <command>Penguin</command>이 들어 있는 HFS 디스크 이미지입니다. <xref linkend="create-floppy"/>에서 이미지를 플로피로 복사하는 방법을 설명합니다.
pt: Os Macs requerem o gestor de arranque <command>Penguin</command>. Se não tem ferramentas para lidar com um arquivo <command>Stuffit</command>, &penguin19.hfs; é uma imagem de disco hfs com <command>Penguin</command> descompactado. A <xref linkend="create-floppy"/> descreve como copiar esta imagem para uma disquete.
zh_tw: Mac 需要 <command>Penguin</command> 這個 boot-loader。如果您沒有這個工具處理 <command>Stuffit</command> 檔案，&penguin19.hfs; 是一個 hfs 磁碟映像，含有 <command>Penguin</command> 壓縮檔。<xref linkend="create-floppy"/> 說明如何將該映像複製到軟碟。

source: At the MacOS desktop, start the Linux installation process by double-clicking on the <guiicon>Penguin Prefs</guiicon> icon in the <filename>Penguin</filename> directory. The <command>Penguin</command> booter will start up. Go to the <guimenuitem>Settings</guimenuitem> item in the <guimenu>File</guimenu> menu, click the <guilabel>Kernel</guilabel> tab. Select the kernel (<filename>vmlinuz</filename>) and ramdisk (<filename>initrd.gz</filename>) images in the <filename>install</filename> directory by clicking on the corresponding buttons in the upper right corner, and navigating the file select dialogs to locate the files.
ko: MacOS 데스크탑에서는 <filename>Penguin</filename> 디렉토리 안의 <guiicon>Penguin Prefs</guiicon> 아이콘을 더블클릭해 리눅스 설치를 시작하십시오. <command>Penguin</command> 부팅 프로그램이 시작합니다. <guimenu>File</guimenu> 메뉴에서 <guimenuitem>Settings</guimenuitem> 항목으로 가서, <guilabel>Kernel</guilabel> 탭을 클릭하십시오. 커널과 (<filename>vmlinuz</filename>) 램디스크 (<filename>initrd.gz</filename>) 이미지를 <filename>install</filename> 디렉토리에서 위의 오른쪽의 해당 단추를 클릭해 선택하십시오. 그리고 파일 선택 대화 상자를 이용해 파일을 찾으십시오.
pt: No desktop do MacOS inicie o processo de instalação do Linux fazendo duplo clique no ícone <guiicon>Penguin Prefs</guiicon> na directoria <filename>Penguin</filename>. O instalador <command>Penguin</command> irá iniciar. Vá até ao item <guimenuitem>Settings</guimenuitem> no menu <guimenu>File</guimenu> clicando no tab <guilabel>Kernel</guilabel>. Seleccione o Kernel (<filename>vmlinuz</filename>) e a imagem de ramdisk (<filename>initrd.gz</filename>) na directoria <filename>install</filename> clicando no botão correspondente no canto superior direito, e navegue nas caixas de diálogo de selecção para localizar os ficheiros.
zh_tw: 在 MacOS 桌面，啟動 Linux 安裝進行需要雙擊 <guiicon>Penguin Prefs</guiicon> 圖示，它位於 <filename>Penguin</filename> 目錄。<command>Penguin</command> 啟動將開始。進入到 <guimenuitem>Settings</guimenuitem> 項，它位於 <guimenu>File</guimenu>選單，點擊 <guilabel>Kernel</guilabel> 選項。選擇核心 (<filename>vmlinuz</filename>) 和 ramdisk (<filename>initrd.gz</filename>) 映象，它位於 <filename>install</filename> 目錄，點擊右上角對應的按鈕，並在對話框中選擇檔案。

source: To set the boot parameters in Penguin, choose <guimenu>File</guimenu> -&gt; <guimenuitem>Settings...</guimenuitem>, then switch to the <guilabel>Options</guilabel> tab. Boot parameters may be typed in to the text entry area. If you will always want to use these settings, select <guimenu>File</guimenu> -&gt; <guimenuitem>Save Settings as Default</guimenuitem>.
ko: Penguin에서 부팅 파라미터를 설정하려면, <guimenu>File</guimenu> -&gt; <guimenuitem>Settings...</guimenuitem>을 선택하시고, <guilabel>Options</guilabel> 탭으로 바꾸십시오. 텍스트 입력 창에서 부팅 파라미터를 입력할 수 있습니다. 항상 그 설정을 이용하려면, <guimenu>File</guimenu> -&gt; <guimenuitem>Save Settings as Default</guimenuitem>를 선택하십시오.
pt: Para ajustar os parâmetros de arranque no Penguin, escolha <guimenu>File</guimenu> -&gt; <guimenuitem>Settings...</guimenuitem>, troque em seguida para o tab <guilabel>Options</guilabel>. Os parâmetros de arranque podem ser digitados na área de entrada de texto. Se quer utilizar sempre estes valores para os parâmetros deverá seleccionar <guimenu>File</guimenu> -&gt; <guimenuitem>Save Settings as Default</guimenuitem>.
zh_tw: 要為 Penguin 設定啟動參數，請選擇 <guimenu>File</guimenu> -&gt; <guimenuitem>Settings...</guimenuitem>，然後切換到 <guilabel>Options</guilabel> 選項卡。啟動參數可以寫到文字區域。如果您要一直採用這些設置，選擇 <guimenu>File</guimenu> -&gt; <guimenuitem>儲存設定為預設</guimenuitem>。

source: Close the <guilabel>Settings</guilabel> dialog, save the settings and start the bootstrap using the <guimenuitem>Boot Now</guimenuitem> item in the <guimenu>File</guimenu> menu.
ko: <guilabel>Settings</guilabel> 대화 상자를 닫고, 설정을 저장하고 <guimenu>File</guimenu> 메뉴의 <guimenuitem>Boot Now</guimenuitem> 항목을 이용해 부팅을 시작하십시오.
pt: Feche o diálogo das <guilabel>Settings</guilabel>, guarde e inicie o bootstrap utilizando o item <guimenuitem>Boot Now</guimenuitem> no menu <guimenu>File</guimenu>.
zh_tw: 關閉 <guilabel>Settings</guilabel> 對話框，儲存設定然後用位於 <guimenu>File</guimenu> 選單的 <guimenuitem>Boot Now</guimenuitem> 選項開機。

source: The <command>Penguin</command> booter will output some debugging information into a window. After this, the screen will go grey, there will be a few seconds' delay. Next, a black screen with white text should come up, displaying all kinds of kernel debugging information. These messages may scroll by too fast for you to read, but that's OK. After a couple of seconds, the installation program should start automatically, so you can continue below at <xref linkend="d-i-intro"/>.
ko: <command>Penguin</command> 부팅 프로그램에서 디버깅 정보를 창에 출력합니다. 그 다음에 화면이 회색으로 변하고, 몇 초간 딜레이가 있을 것입니다. 그 다음에 흰 글자의 검은 화면이 나타나고, 커널 디버깅 정보를 표시합니다. 이 메세지는 읽기에는 너무 빠르게 스크롤 되겠지만, 상관없습니다. 몇 초 후에, 설치 프로그램이 자동으로 시작하고, <xref linkend="d-i-intro"/> 부분으로 넘어가실 수 있습니다.
pt: O instalador <command>Penguin</command> irá gerar para o ecrã alguma informação de debugging. Após isto, o ecrã tornar-se-á cinzento, haverá alguns segundos de atraso. Em seguida surgirá um ecrã preto com texto branco indicando todos os tipo de informação de debugging do kernel. Estas mensagens poderão passar demasiado rápido de modo que não as consiga lêr, mas não tem importância. Após alguns segundos, o programa de instalação irá iniciar automaticamente, poderá portanto continuar para baixo na <xref linkend="d-i-intro"/>.
zh_tw: <command>Penguin</command> 啟動將輸出一些除錯資訊到視窗。然後，螢幕變灰，會有數秒延遲。接著，帶有文字的黑底畫面出現，顯示各種核心除錯資訊。這些資訊可能捲動很快無法閱讀，這是正常的。再過一段時間，安裝程式就會自動執行，您可以按照下面步驟繼續 <xref linkend="d-i-intro"/>。

source: Booting from Q40/Q60
ko: Q40/Q60에서 부팅하기
pt: Iniciar a partir de Q40/Q60
zh_tw: 從 Q40/Q60 啟動

source: The installation program should start automatically, so you can continue below at <xref linkend="d-i-intro"/>.
ko: 설치 프로그램이 자동으로 시작합니다. <xref linkend="d-i-intro"/> 부분으로 넘어가실 수 있습니다.
pt: O programa de instalação deverá iniciar automaticamente, assim poderá continuar abaixo na <xref linkend="d-i-intro"/>.
zh_tw: 安裝程式就會自動執行，您可以按下面步驟繼續 <xref linkend="d-i-intro"/>。

source: Currently, the only &arch-title; subarchitecture that supports CD-ROM booting is the BVME6000.
ko: 현재 CD-ROM 부팅을 지원하는 &arch-title; 서브 아키텍쳐는 BVME6000뿐입니다.
pt: Actualmente, a única Sub-arquitectura &arch-title; que suporta iniciar de CD-ROM é a BVME6000.
zh_tw: 目前唯一 &arch-title; 子架構支援光碟開機的是 BVME6000。

source: After booting the VMEbus systems you will be presented with the LILO <prompt>Boot:</prompt> prompt. At that prompt enter one of the following to boot Linux and begin installation proper of the Debian software using vt102 terminal emulation:
ko: VMEbus 시스템이 부팅하면, LILO <prompt>Boot:</prompt> 프롬프트가 나타납니다. 프롬프트에서 다음 중의 하나를 입력하면 리눅스를 부팅하고 vt102 터미널 에뮬레이션을 이용해 데비안 설치를 시작합니다.
pt: Após iniciar o sistema VMEbus ser-lhe-á apresentado o prompt do LILO <prompt>Boot:</prompt>. Nesse prompt insira um dos seguintes para iniciar o Linux e iniciar a instalação apropriada do software Debian utilizando o emulador de terminal vt102.
zh_tw: 在起動 VMEbus 系統後您應該看到 LILO <prompt>Boot:</prompt> 提示符號。在提示符號下輸入以下一種方法來啟動 Linux，並開始在一個 vt102 模擬終端下面安裝普通的 Debian 軟體。

source: type <screen>i6000 &enterkey;</screen> to install a BVME4000/6000
ko: BVME4000/6000에 설치하려면 <screen>i6000 &enterkey;</screen>라고 입력하십시오
pt: digite <screen>i6000 &enterkey;</screen> para instalar uma BVME4000/6000
zh_tw: 輸入 <screen>i6000 &enterkey;</screen> 來安裝 BVME4000/6000

source: type <screen>i162 &enterkey;</screen> to install an MVME162
ko: MVME162에 설치하려면 <screen>i162 &enterkey;</screen>라고 입력하십시오
pt: digite <screen>i162 &enterkey;</screen> para instalar uma MVME162
zh_tw: 輸入 <screen>i162 &enterkey;</screen> 來安裝 MVME162

source: type <screen>i167 &enterkey;</screen> to install an MVME166/167
ko: MVME166/167에 설치하려면 <screen>i167 &enterkey;</screen>라고 입력하십시오
pt: digite <screen>i167 &enterkey;</screen> para instalar uma MVME166/167
zh_tw: 輸入 <screen>i167 &enterkey;</screen> 來安裝 MVME166/167

source: You may additionally append the string <screen>TERM=vt100</screen> to use vt100 terminal emulation, e.g., <screen>i6000 TERM=vt100 &enterkey;</screen>.
ko: vt100 터미널 에뮬레이션을 이용하려면 <screen>TERM=vt100</screen> 파라미터를 붙일 수 있습니다. 예를 들어, <screen>i6000 TERM=vt100 &enterkey;</screen>.
pt: Pode adicionalmente acrescentar a string <screen>TERM=vt100</screen> para utilizar o emulador de terminal vt100, ex., <screen>i6000 TERM=vt100 &enterkey;</screen>.
zh_tw: 您也可以附加一個字串 <screen>TERM=vt100</screen> 來使用 vt100 終端模擬。比如,<screen>i6000 TERM=vt100 &enterkey;</screen>。

source: For most &arch-title; architectures, booting from a local filesystem is the recommended method.
ko: 대부분의 &arch-title; 아키텍쳐의 경우, 로컬 파일시스템에서 부팅하는 게 가장 권장하는 방법입니다.
pt: Para a maioria das arquitecturas &arch-title;, iniciar a partir de um sistema de ficheiros local é o método recomendado.
zh_tw: 對於大多數 m68k 架構來說，推薦方法是從一個本地檔案系統開機安裝程式。

source: Booting from the boot floppy is supported only for Atari and VME (with a SCSI floppy drive on VME) at this time.
ko: 부트 플로피에서 부팅은 현재 Atari와 VMW에서만 (VME의 경우 SCSI 플로피 드라이브가 있으면) 동작합니다.
pt: Iniciar a partir da disquete de arranque é suportado apenas, neste momento, por Atari e VME (com um drive de disquetes SCSI no VME).
zh_tw: 從軟碟開機的方法目前只支援 Atari 以及 VME (VME 有一個 SCSI 軟碟機)。

source: SGI Indys TFTP Booting
ko: SGI Indy TFTP 부팅
pt: Iniciar de TFTP em SGI Indys
zh_tw: SGI Indy 透過 TFTP 開機

source: After entering the command monitor use <informalexample><screen> bootp(): </screen></informalexample> on SGI Indys to boot linux and to begin installation of the Debian Software. In order to make this work you may have to unset the <envar>netaddr</envar> environment variable. Type <informalexample><screen> unsetenv netaddr </screen></informalexample> in the command monitor to do this.
ko: SGI Indy에서 리눅스를 부팅하고 설치를 시작하려면 커맨드 모니터로 들어간 다음 다음 명령을 사용하십시오: <informalexample><screen> bootp(): </screen></informalexample> 이렇게 하려면, <envar>netaddr</envar> 환경 변수를 지워야 할 수도 있습니다. 지우려면 커맨드 모니터에서 다음 명령을 타이프하십시오: <informalexample><screen> unsetenv netaddr </screen></informalexample>
pt: Após ter entrado na consola utilize <informalexample><screen> bootp(): </screen></informalexample> em SGI Indys para iniciar o Linux e para começar a instalação do software Debian. Com o intuito de fazer com que isto funcione deve ter de retirar a variável de ambiente <envar>netaddr</envar>. Para fazer isto digite na consola<informalexample><screen> unsetenv netaddr </screen></informalexample>.
zh_tw: 在進入指令監視器後使用 <informalexample><screen> bootp(): </screen></informalexample> 在 SGI Indys 上啟動 Linux 及 Debian 軟體的安裝。為了正常執行，您可能必須取消設定 <envar>netaddr</envar> 環境變數。輸入 <informalexample><screen> unsetenv netaddr </screen></informalexample> 到指令監視器。

source: Broadcom BCM91250A TFTP Booting
ko: Broadcom BCM91250A TFTP 부팅
pt: Iniciar por TFTP em BCM91250A
zh_tw: Broadcom BCM91250A TFTP 的啟動

source: On the Broadcom BCM91250A evaluation board, you have to load the SiByl boot loader via TFTP which will then load and start the Debian installer. In most cases, you will first obtain an IP address via DHCP but it is also possible to configure a static address. In order to use DHCP, you can enter the following command on the CFE prompt: <informalexample><screen> ifconfig eth0 -auto </screen></informalexample> Once you have obtained an IP address, you can load SiByl with the following command: <informalexample><screen> boot 192.168.1.1:/boot/sibyl </screen></informalexample> You need to substitute the IP address listed in this example with either the name or the IP address of your TFTP server. Once you issue this command, the installer will be loaded automatically.
ko: Broadcom BCM91250A 평가보드에서는 TFTP를 통해 SiByl 부트 로더를 읽어들여야 합니다. 그러면 데비안 설치 프로그램을 읽어들여서 시작합니다. 대부분의 경우 DHCP를 통해 IP 주소를 받지만 고정 주소를 설정할 수도 있습니다. DHCP를 사용하려면, CFE 프롬프트에서 다음 명령을 입력하십시오: <informalexample><screen> ifconfig eth0 -auto </screen></informalexample> IP 주소를 받으면, 다음 명령으로 SiByl을 읽어들일 수 있습니다: <informalexample><screen> boot 192.168.1.1:/boot/sibyl </screen></informalexample> 위의 예에서 IP 주소는 TFTP 주소의 이름 혹은 IP 주소로 바꿔야 합니다. 일단 이 명령을 실행하면, 설치 프로그램을 자동으로 읽어들입니다.
pt: Na placa de avaliação BCM91250A Broadcom, tem ser carregado o gestor de arranque SiByl via TFTP que irá então carregar e iniciar o instalador Debian. Na maioria dos casos, primeiro terá de adquirir um endereço IP via DHCP mas também é possível configurar um endereço do estático. Com o intuito de utilizar DHCP, pode executar o seguinte comando no prompt CFE: <informalexample><screen> ifconfig eth0 -auto </screen></informalexample> Um vez o endereço IP obtido, pode iniciar SiByl com o seguinte comando: <informalexample><screen> boot 192.168.1.1:/boot/sibyl </screen></informalexample> Precisa de substituir o endereço IP listado neste exemplo seja com o nome ou o endereço IP do seu servidor TFTP. Uma vez este comando emitido, o instalador irá iniciar automaticamente.
zh_tw: 在 Broadcom BCM91250A 試用主機板上，您不得不透過 TFTP 加載 SiByl 開機程式，它接著將載入和啟動 Debian 安裝程式。大多數情況下，您透過 DHCP 取得 IP 位址，當然也可以指定靜態位址。要使用 DHCP，您可以在下面 CFE 提示符號下輸入指令： <informalexample><screen> ifconfig eth0 -auto </screen></informalexample> 一旦得到 IP 位址，就可以使用下面指令載入 SiByl： <informalexample><screen> boot 192.168.1.1:/boot/sibyl </screen></informalexample> 您必須以網域名稱或從 TFTP 伺服器上取得的 IP 位址替換上例中的 IP 位址。完成之後，安裝程式就會自動載入。

source: Boot Parameters
ko: 부팅 파라미터
pt: Parâmetros de Arranque
zh_tw: 開機參數

source: On SGI Indys you can append boot parameters to the <command>bootp():</command> command in the command monitor.
ko: SGI Indy에서는 커맨드 모니터에서 부팅 파라미터를 <command>bootp():</command> 명령어 뒤에 붙일 수 있습니다.
pt: Em Indy SGI pode adicionar na consola parâmetros de arranque ao comando <command>bootp():</command>.
zh_tw: 在 SGI Indys 上您可以在指令監視器下透過 <command>bootp():</command> 來附加開機參數。

source: Following the <command>bootp():</command> command you can give the path and name of the file to boot if you did not give an explicit name via your bootp/dhcp server. Example: <informalexample><screen> bootp():/boot/tftpboot.img </screen></informalexample> Further kernel parameters can be passed via <command>append</command>:
ko: bootp/dhcp 서버에서 부팅할 파일을 지정하지 않았다면, <command>bootp():</command> 명령 뒤에 부팅할 파일의 경로와 이름을 지정할 수 있습니다. 예를 들어: <informalexample><screen> bootp():/boot/tftpboot.img </screen></informalexample> 그 외의 커널 파라미터는 <command>append</command>를 통해 넘길 수 있습니다:
pt: A seguir ao comando <command>bootp():</command> você pode indicar a path e o nome do ficheiro para arrancar se não deu um nome explícito através do seu servidor bootp/dhcp. Exemplo: <informalexample><screen> bootp():/boot/tftpboot.img </screen></informalexample> Parâmetros de kernel adicionais podem ser passados via <command>append</command>:
zh_tw: 如果您沒有透過 bootp/dhcp 伺服器提供清楚的名字檔名，在 <command>bootp():</command> 指令之後您可以給提供徑和檔案名稱來開機。例如 <informalexample><screen> bootp():/boot/tftpboot.img </screen></informalexample> 還有更多的核心參數傳遞可以用 <command>append</command>:

source: You cannot pass any boot parameters directly from the CFE prompt. Instead, you have to edit the <filename>/boot/sibyl.conf</filename> file on the TFTP server and add your parameters to the <replaceable>extra_args</replaceable> variable.
ko: CFE 프롬프트에서는 부트 파라미터를 직접 넘길 수 없습니다. 대신에 TFTP 서버에 있는 <filename>/boot/sibyl.conf</filename> 파일을 편집해서 <replaceable>extra_args</replaceable> 변수에 파라미터를 추가해야 합니다.
pt: Não pode passar qualquer parâmetro de arranque directamente do prompt CFE. Em vez de ter de editar o ficheiro no servidor TFTP e adicionar os seus parâmetros à variável <replaceable>extra_args</replaceable>.
zh_tw: 您不能從 CFE 提示符號直接傳遞啟動參數。而是編輯 TFTP 伺服器上的 <filename>/boot/sibyl.conf</filename> 文件並添加參數到 <replaceable>extra_args</replaceable> 變數。

source: s390 Limitations
ko: s390 한계
pt: Limitações de s390
zh_tw: s390 的限制

source: In order to run the installation system a working network setup and ssh session is needed on S/390.
ko: S/390에서 설치 시스템을 실행하려면 제대로 동작하는 네트워크 설정이 있어야 하고 SSH 세션이 필요합니다.
pt: Com o intuito de executar o sistema de instalação num S/390 é necessário uma rede funcional e uma sessão de ssh.
zh_tw: 為了在 S/390 上安裝系統，需要網路來和 ssh 連線。

source: The booting process starts with a network setup that prompts you for several network parameters. If the setup is successful, you will login to the system by starting a ssh session which will launch the standard installation system.
ko: 부팅 과정은 몇 가지 네트워크 파라미터를 설정하는 네트워크 설정으로 시작합니다. 설정이 성공하면, SSH 세션으로 로그인해서 거기에서 표준 설치 시스템을 시작합니다.
pt: O processo de arranque começa com a configuração da rede que o alerta para vários parâmetros de rede. Se a configuração for bem sucedida, irá fazer login no sistema iniciando uma sessão de ssh que irá lançar o sistema de instalação standard.
zh_tw: 開機過程開始時候會要求一些參數來進行網路設定。如果設定成功，您將會透過ssh 連線登錄進入系統，並且開始標準系統安裝。

source: s390 Boot Parameters
ko: s390 부팅 파라미터
pt: Parâmetros de Arranque de s390
zh_tw: s390 開機參數

source: On S/390 you can append boot parameters in the parm file. This file can either be in ASCII or EBCDIC format. Please read <ulink url="&url-s390-devices;">Device Drivers and Installation Commands</ulink> for more information about S/390-specific boot parameters.
ko: S/390에서는 parm 파일에 부팅 파라미터를 추가할 수 있습니다. ASCII나 EBCDIC 형식을 쓸 수 있습니다. S/390 관련 부팅 파라미터에 관한 더 자세한 정보는 <ulink url="&url-s390-devices;">Device Drivers and Installation Commands</ulink>를 읽어 보십시오.
pt: Em S/390 pode adicionar parâmetros de arranque no ficheiro parm. Este ficheiro pode estar tanto em formato ASCII como EBCDIC. Leia por favor <ulink url="&url-s390-devices;">Device Drivers e Comandos de instalação</ulink> para mais informação sobre a especificação dos parâmteros de arranque em S/390.
zh_tw: 在 S/390 上您可以在參數檔案下面附加一些開機參數。這個檔案可以是 ASCII 或者 EBCDIC 編碼。請閱讀 <ulink url="&url-s390-devices;"> 設備驅動程式以及安裝命令</ulink> 來取得更多有關 S/390 特定的開機參數。

source: Currently, the only &arch-title; subarchitectures that support CD-ROM booting are PReP and New World PowerMacs. On PowerMacs, hold the <keycap>c</keycap> key, or else the combination of <keycap>Command</keycap>, <keycap>Option</keycap>, <keycap>Shift</keycap>, and <keycap>Delete</keycap> keys together while booting to boot from the CD-ROM.
ko: 현재, &arch-title; 서브 아키텍쳐중에서 CD-ROM 부팅을 지원하는 경우는 PReP 및 New World PowerMac뿐입니다. PowerMac에서 CD-ROM 부팅을 하려면, <keycap>c</keycap> 키를 누르고 있거나, <keycap>Command</keycap>, <keycap>Option</keycap>, <keycap>Shift</keycap>, <keycap>Delete</keycap> 키를 동시에 누르고 있으십시오.
pt: Actualmente, a única sub-arquitectura &arch-title; que suporta iniciar de CD-ROM é PReP e New World PowerMacs. Nos PowerMacs, segure a tecla <keycap>c</keycap>, ou então a combinação conjunta das teclas <keycap>Command</keycap>, <keycap>Option</keycap>, <keycap>Shift</keycap>, e <keycap>Delete</keycap> enquanto se inicia o arranque do CD-ROM.
zh_tw: 目前來說，&arch-title; 下的子架構只有 PReP 和 New World PowerMacs 支援光碟開機。在 PowerMacs 下從光碟上開機時，按住 <keycap>c</keycap> 鍵，或者組合鍵 <keycap>Command</keycap>, <keycap>Option</keycap>, <keycap>Shift</keycap>, 和 <keycap>Delete</keycap> 。

source: OldWorld PowerMacs will not boot a Debian CD, because OldWorld computers relied on a Mac OS ROM CD boot driver to be present on the CD, and a free-software version of this driver is not available. All OldWorld systems have floppy drives, so use the floppy drive to launch the installer, and then point the installer to the CD for the needed files.
ko: OldWorld PowerMacs은 데비안 CD를 부팅하지 못합니다. OldWorld 컴퓨터는 CD에 있는 Mac OS ROM CD 부트 드라이버에 의존하기 때문입니다. 그리고 이 드라이버는 자유 소프트웨어 버전이 없습니다. 모든 OldWorld 시스템에는 플로피 드라이브가 있으므로, 이 플로피 드라이브로 설치 프로그램을 실행하십시오. 그 다음에 설치 프로그램에서 필요한 파일이 있으면 CD를 지정하십시오.
pt: OldWorld PowerMacs não irão arrancar de um CD Debian, porque os computadores OldWorld baseiam-se num driver de arranque Mac OS ROM CD que esteja presento no CD, e não está disponível uma versão de free-software. Todos os sistemas OldWorld têm drives de disquete, utilize portanto a drive de disquetes para iniciar o instalador, e aponte o instalador para os ficheiros necessários do CD.
zh_tw: OldWorld Powermacs 不能從 Debian 光碟開機，因為 OldWorld 電腦要求光碟片上存有 MacOSROM CD 開機驅動程式，但是目前還沒有自由的版本。所有的 OldWorld 系統具有軟碟驅動程式，因此可以使用軟碟驅動程式來啟動安裝程式，然後讓安裝程式從 CD 上選擇所需要的文件。

source: If your system doesn't boot directly from CD-ROM, you can still use the CD-ROM to install the system. On NewWorlds, you can also use an OpenFirmware command to boot from the CD-ROM manually. Follow the instructions in <xref linkend="boot-newworld"/> for booting from the hard disk, except use the path to <command>yaboot</command> on the CD at the OF prompt, such as
ko: 시스템이 CD-ROM에서 직접 부팅하지 못하는 경우에도, CD-ROM을 사용해 시스템을 설치할 수 있습니다. NewWorld에서는 OpenFirmware 명령을 이용해 CD-ROM을 수동으로 부팅할 수 있습니다. 하드디스크에 부팅하려면 <xref linkend="boot-newworld"/>에 있는 설명을 따라하십시오. 단 다음과 같이 CD에 있는 <command>yaboot</command> 경로를 사용하십시오
pt: Se o seu sistema não arranca directamente de CD-ROM, pode continuar a utilizar o CD-ROM para instalar o sistema. Em NewWorlds, pode também utilizar um comando OpenFirmware para iniciar manualmente de um CD-ROM. Siga as instruções na <xref linkend="boot-newworld"/> para iniciar de disco rígido, excepto o uso da localização do <command>yaboot</command> do CD no prompt OF, tal como
zh_tw: 如果您的系統不支援直接從光碟啟動，仍然可以採用光碟來安裝系統。在 NewWorlds 上面，可以使用一個 OpenFirmware 指令來手動光碟開機。除了在 OF 提示符號下使用光碟上的 <command>yaboot</command>，按照 <xref linkend="boot-newworld"/> 的方法從硬碟來進行開機，例如：

source: Booting from Hard Disk
ko: 하드 디스크에서 부팅하기
pt: Iniciar a partir de Disco Rígido
zh_tw: 從硬碟開機

source: Booting CHRP from OpenFirmware
ko: OpenFirmware에서 CHRP 부팅하기
pt: Iniciando CHRP a partir de OpenFirmware
zh_tw: 從 OpenFirmware 開機 CHRP
