Repository: xobs/debian-installer
Catalog: doc/manual/po/*/boot-new.po
Languages: el, ko, pt, ru, zh_cn, zh_tw

source: To boot back into MacOS without resetting the nvram, type <userinput>bye</userinput> at the OpenFirmware prompt (assuming MacOS has not been removed from the machine). To obtain an OpenFirmware prompt, hold down the <keycombo> <keycap>command</keycap> <keycap>option</keycap> <keycap>o</keycap> <keycap>f</keycap> </keycombo> keys while cold booting the machine. If you need to reset the OpenFirmware nvram changes to the MacOS default in order to boot back to MacOS, hold down the <keycombo> <keycap>command</keycap> <keycap>option</keycap> <keycap>p</keycap> <keycap>r</keycap> </keycombo> keys while cold booting the machine.
el: Για να μπείτε πάλι στο σύστημα MacOS χωρίς να επαναμηδενίσετε την μνήμη nvram, τυπώστε <userinput>bye</userinput> στο προτρεπτικό του OpenFirmware (εφόσον βέβαια δεν έχετε αφαιρέσει το MacOS από το μηχάνημά σας).Για να βγείτε σε ένα προτρεπτικό OpenFirmware κρατήστε κάτω τα πλήκτρα <keycombo> <keycap>command</keycap> <keycap>option</keycap> <keycap>o</keycap> <keycap>f</keycap> </keycombo> ενώ ξεκινάτε το μηχάνημα. Αν πρέπει να επαναφέρετε τις αλλαγές στην nvram του OpenFirmware στην προκαθορισμένη επιλογή της εκκίνησης του MacOS για να επανεκκινήσετε στο MacOS, κρατήστε πατημένα τα πλήκτρα <keycombo> <keycap>command</keycap> <keycap>option</keycap> <keycap>p</keycap> <keycap>r</keycap> </keycombo> κατά τη στιγμή της "ψυχρής" εκκίνησης του μηχανήματος.
ko: nvram을 리셋하지 않고 MacOS로 다시 부팅하기위해, <userinput>bye</userinput>을 OpenFirmware 프롬프트에서 입력합니다. (MacOS가 기계에서 제거되지 않은 것을 가정합니다.) <keycombo> <keycap>command</keycap> <keycap>option</keycap> <keycap>o</keycap> <keycap>f</keycap> </keycombo> 키들을 cold 부팅 하는 동안 누르고 있으면 OpenFirmware 프롬프트를 얻을 수 있습니다. 만일 MacOS로 다시 부팅하기 위해 OpenFirmware nvram을 리셋하여 MacOS 기본을 변경할 필요가 있다면, <keycombo> <keycap>command</keycap> <keycap>option</keycap> <keycap>p</keycap> <keycap>r</keycap> </keycombo> 키들을 cold 부팅하는 동안 누르고 있으세요.
pt: Para iniciar o MacOS sem reinicializar a nvram, escreva <userinput>bye</userinput> no OpenFirmware (assume-se que o MacOS não foi retirado da máquina). Para obter o OpenFirmware, pressione as teclas <keycombo> <keycap>command</keycap> <keycap>option</keycap> <keycap>o</keycap> <keycap>f</keycap> </keycombo> enquanto reinicia a máquina. Se precisar de reinicializar a nvram do OpenFirmware para o MacOS por omissão para que possa iniciar directamente em MacOS, pressione as teclas <keycombo> <keycap>command</keycap> <keycap>option</keycap> <keycap>p</keycap> <keycap>r</keycap> </keycombo> enquanto reinicia a máquina.
ru: Чтобы загрузиться обратно в MacOS без сброса nvram, наберите <userinput>bye</userinput> в подсказке OpenFirmware (подразумевается, что MacOS не была удалена с машины). Чтобы получить подсказку OpenFirmware, нажмите клавиши<keycombo> <keycap>command</keycap> <keycap>option</keycap> <keycap>o</keycap> <keycap>f</keycap> </keycombo> во время холодного старта машины. Если вам надо сбросить изменения в OpenFirmware nvram по умолчанию MacOS, чтобы загрузиться обратно в MacOS, нажмите клавиши <keycombo> <keycap>command</keycap> <keycap>option</keycap> <keycap>p</keycap> <keycap>r</keycap> </keycombo> во время холодного старта машины.
zh_cn: 启动会 MacOS 而不重设 nvram，键入 <userinput>bye</userinput> 在 OpenFirmware 提示符下(假设 MacOS 没有从机器里面删除)。要得到 OpenFirmware 提示，按住 <keycombo> <keycap>command</keycap> <keycap>option</keycap> <keycap>o</keycap> <keycap>f</keycap> </keycombo> 健，在启动机器的时候。如果您需要重置 OpenFirmware nvram 改变默认为 MacOS 以启动 回到 MacOS，按下 <keycombo> <keycap>command</keycap> <keycap>option</keycap> <keycap>p</keycap> <keycap>r</keycap> </keycombo> 键，在启动机器的时候。
zh_tw: 想要啟動回 MacOS 而不重設 nvram，請在 OpenFirmware 提示符號下鍵入 <userinput>bye</userinput> (假設 MacOS 沒有從機器裡面刪除)。要顯示 OpenFirmware 提示符號，按住 <keycombo> <keycap>command</keycap> <keycap>option</keycap> <keycap>o</keycap> <keycap>f</keycap> </keycombo> 鍵，在啟動機器的時候。如果您需要重新設定 OpenFirmware nvram 預設以 MacOS 啟動回到 MacOS，在開機的時候按下 <keycombo> <keycap>command</keycap> <keycap>option</keycap> <keycap>p</keycap> <keycap>r</keycap> </keycombo> 鍵。

source: If you use <command>BootX</command> to boot into the installed system, just select your desired kernel in the <filename>Linux Kernels</filename> folder, un-choose the ramdisk option, and add a root device corresponding to your installation; e.g. <userinput>/dev/hda8</userinput>.
el: Αν χρησιμοποιείτε το <command>BootX</command> για να μπείτε στο εγκατεστημένο σύστημά σας απλά επιλέξτε τον πυρήνα της επιθυμίας σας στον κατάλογο <filename>Linux Kernels</filename>, απεπιλέξτε την επιλογή ramdisk και προσθέστε τη συσκευή για το ριζικό σύστημα που να αντιστοιχεί στην εγκατάστασή σας, πχ <userinput>/dev/hda8</userinput>.
ko: 설치된 시스템으로 부팅하기위해 <command>BootX</command>를 사용한다면, 단지 <filename>Linux Kernels</filename> 폴더에서 원하는 커널을 선택하고, 램디스크 옵션의 선택을 해제한 뒤에 설치와 관련된 루트 디바이스를 추가하세요. 예 <userinput>/dev/hda8</userinput>
pt: Se utiliza o <command>BootX</command> para iniciar para o sistema instalado, seleccione apenas o kernel pretendido na directoria <filename>Linux Kernels</filename>, desseleccionando a opção ramdisk, e adicionando o dispositivo de raiz correspondente à sua instalação; p.e. <userinput>/dev/hda8</userinput>.
ru: Если вы используете <command>BootX</command> для загрузки в вашу установленную систему, просто выберите желаемое ядро в папке <filename>Linux Kernels</filename>, отмените выбор опции ramdisk и добавьте корневое устройство, соответствующее ваше установке; например <userinput>/dev/hda8</userinput>.
zh_cn: 假如您使用 <command>BootX</command> 启动到安装的系统，只需选择需要的内核，位于 <filename>Linux Kernels</filename> 目录，去掉 ramdisk 选项，并添加与您安装对应的根设备；如 <userinput>/dev/hda8</userinput>。
zh_tw: 假如您使用 <command>BootX</command> 啟動安裝好的系統，只需選擇位於 <filename>Linux Kernels</filename> 目錄中需要的核心，去掉 ramdisk 選項，並加上與您的系統相對應的根設備﹔如 <userinput>/dev/hda8</userinput>。

source: NewWorld PowerMacs
el: Συστήματα NewWorld PowerMac
ko: 신세대의 파워맥

source: On G4 machines and iBooks, you can hold down the <keycap>option</keycap> key and get a graphical screen with a button for each bootable OS, &debian; will be a button with a small penguin icon.
el: Σε μηχανήματα G4 και iBook, μπορείτε να κρατήσετε κάτω το πλήκτρο <keycap>option</keycap> για να βρεθείτε σε μια γραφική οθόνη με ένα κουμπί για κάθε εκκινήσιμο λειτουργικό σύστημα &debian; Το Debian θα είναι το πλήκτρο με το εικονίδιο ενός μικρού πιγκουίνου.
ko: G4 와 iBooks에서 <keycap>option</keycap> 키를 누르고 있으면, 부팅할 수 있는 OS들의 버튼을 가진 그래픽 스크린이 나타납니다. &debian;은 작은 펭귄 아이콘을 가진 버튼입니다.
pt: Nas máquinas G4 e iBooks, pode pressionar a tecla <keycap>option</keycap> e obter um ecrã gráfico com um botão para cada um dos SO que podem arrancar, o &debian; será um botão com um icon contendo um pequeno pinguim.
ru: На машинах G4 и iBook, вы может нажать клавишу <keycap>option</keycap> и получить графический экран с кнопкой для каждой загружаемой ОС, &debian; будет кнопкой с иконкой маленького пингвина.
zh_cn: 在 G4 机器和 iBooks 上，您可以按住 <keycap>option</keycap> 键，得到一个图形界面，每个可以启动的系统对应一个按钮，&debian; 将是一个企鹅图标的按钮。
zh_tw: 在 G4 機器和 iBooks 上，您可以按住 <keycap>option</keycap> 鍵，進入一個圖形介面，每個可以啟動的系統會對應到一個圖示，&debian; 將是一個企鵝的圖示。

source: If you kept MacOS and at some point it changes the OpenFirmware <envar>boot-device</envar> variable you should reset OpenFirmware to its default configuration. To do this hold down the <keycombo> <keycap>command</keycap> <keycap>option</keycap> <keycap>p</keycap> <keycap>r</keycap> </keycombo> keys while cold booting the machine.
el: Αν κρατήσατε το MacOS και σε κάποια στιγμή αυτό αλλάζει την μεταβλητή του OpenFirmware <envar>boot-device</envar> θα πρέπει να επαναφέρετε το OpenFirmware στην προκαθορισμένη ρύθμισή του. Για να το κάνετε αυτό κρατήστε κάτω τα πλήκτρα <keycombo> <keycap>command</keycap> <keycap>option</keycap> <keycap>p</keycap> <keycap>r</keycap> </keycombo> κατά την "ψυχρή" επανεκκίνηση του μηχανήματος.
ko: MacOS를 가지고 있고, 그것이 어떤 때에 OpenFirmware의 <envar>boot-device</envar> 변수를 변경한다면, OpenFirmware를 기본 설정으로 리셋시켜야 합니다. 리셋하기 위해 cold 부팅을 하는 동안 <keycombo> <keycap>command</keycap> <keycap>option</keycap> <keycap>p</keycap> <keycap>r</keycap> </keycombo> 키를 누르고 있어야 합니다.
pt: Se ficou com o MacOS e este alterou a variável do OpenFirmware <envar>boot-device</envar> deverá reinicializar o OpenFirmware para a sua configuração padrão. Para fazer esta operação pressione as teclas <keycombo> <keycap>command</keycap> <keycap>option</keycap> <keycap>p</keycap> <keycap>r</keycap> </keycombo> enquanto reinicia a máquina.
ru: Если вы оставили MacOS и в какой-то момент она изменила переменную OpenFirmware <envar>boot-device</envar>, вы должны сбросить OpenFirmware в настройки по умолчанию. Чтобы сделать это, нажмите клавиши <keycombo> <keycap>command</keycap> <keycap>option</keycap> <keycap>p</keycap> <keycap>r</keycap> </keycombo> во время холодного старта машины.
zh_cn: 如果您保留 MacOS，在些时候它会修改 OpenFirmware <envar>boot-device</envar> 变量，您应该重置 OpenFirmware 到它的默认设置。要这样做需按住 <keycombo> <keycap>command</keycap> <keycap>option</keycap> <keycap>p</keycap> <keycap>r</keycap> </keycombo> 键，在启动机器的时候。
zh_tw: 如果您保留 MacOS，有時候它會修改 OpenFirmware <envar>boot-device</envar> 變數，您應該重設 OpenFirmware 到它的預設設定。請在啟動機器的時候按住 <keycombo> <keycap>command</keycap> <keycap>option</keycap> <keycap>p</keycap> <keycap>r</keycap> </keycombo> 鍵。

source: The labels defined in <filename>yaboot.conf</filename> will be displayed if you press the <keycap>Tab</keycap> key at the <prompt>boot:</prompt> prompt.
el: Οι επιλογές που ορίζονται στο αρχείο <filename>yaboot.conf</filename> θα εμφανιστούν αν πιέσετε το πλήκτρο <keycap>Tab</keycap> στο προτρεπτικό <prompt>boot:</prompt>.
ko: <filename>yaboot.conf</filename>에 정의된 레이블들은 <prompt>boot:</prompt> 프롬프트에서 <keycap>tab</keycap> 키를 누르면 보여집니다.
pt: As definições no <filename>yaboot.conf</filename> serão apresentadas se pressionar a tecla <keycap>Tab</keycap> no prompt <prompt>boot:</prompt>.
ru: Метки, заданные в <filename>yaboot.conf</filename> будут отображаться, если вы нажмете клавишу<keycap>Tab</keycap> в подсказке <prompt>boot:</prompt>.
zh_cn: 定义在 <filename>yaboot.conf</filename> 里的标签，当您按下 <keycap>Tab</keycap> 键在 <prompt>boot:</prompt> 提示符时标签会显示出来。
zh_tw: 當您在 <prompt>boot:</prompt> 提示符號下按下 <keycap>Tab</keycap> 鍵時，定義在 <filename>yaboot.conf</filename> 裡的標籤會顯示出來。

source: Resetting OpenFirmware on G3 or G4 hardware will cause it to boot &debian; by default (if you correctly partitioned and placed the Apple_Bootstrap partition first). If you have &debian; on a SCSI disk and MacOS on an IDE disk this may not work and you will have to enter OpenFirmware and set the <envar>boot-device</envar> variable, <command>ybin</command> normally does this automatically.
el: Επαναφορά του OpenFirmware σε μηχανήματα G3 ή G4 θα προκαλέσουν την αυτόματη εκκίνηση του &debian; (εφόσον έχετε κάνει σωστή κατάτμηση του δίσκου και έχετε τοποθετήσει το τμήμα Apple_Bootstrap στην αρχή). Αν έχετε το &debian; σε ένα δίσκο SCSI και το MacOS σε ένα δίσκο IDE αυτό μπορεί να μην δουλέψει οπότε θα πρέπει να μπείτε στο OpenFirmware και να ρυθμίσετε την μεταβλητή <envar>boot-device</envar>. Η εντολή <command>ybin</command> φυσιολογικά θα το κάνει αυτό αυτόματα.
ko: G3 또는 G4 하드웨어에서 OpenFirmware를 리셋하면 기본으로 &debian;을 부팅하도록 할 것입니다 (정확하게 파티션하고 Apple_Bootstrap 파티션이 먼저 놓여 있는 경우). 데비안이 SCSI 디스크에 있고, MacOS가 IDE 디스크에 있다면, 이렇게 동작하지는 않을 것입니다. 당신은 OpenFirmware에 들어가 <envar>boot-device</envar> 변수를 설정해야 합니다. <command>ybin</command> 은 보통 이 작업을 자동으로 해줍니다.
pt: Reinicializar o OpenFirmware no hardware G3 ou G4 irá fazer com que o &debian; inicie por defeito (caso tenha particionado correctamente e colocado a partição Apple_Bootstrap em primeiro lugar). Se tiver o &debian; num disco SCSI e o MacOS num disco IDE esta operação pode não funcionar e terá que entrar no OpenFirmware e definir a variável <envar>boot-device</envar>, normalmente o <command>ybin</command> efectua esta operação automaticamente.
ru: Сброс OpenFirmware на оборудовании G3 или G4 приведет к загрузке &debian; по умолчанию (если вы корректно разметили разделы и поместили раздел Apple_Bootstrap первым). Если &debian; у вас на SCSI-диске, а MacOS на IDE-диске, это может не сработать, и вам придется зайти в OpenFirmware и установить переменную <envar>boot-device</envar>. В нормальной ситуации <command>ybin</command> делает это автоматически.
zh_cn: 重置 G3 或 G4 硬件上的 OpenFirmware 将导致默认启动 &debian;(假设您正确分区，并将 Apple_Bootstrap 分区放在首位)。如果您将 &debian; 放在 SCSI 磁盘，而 MacOS 位于 IDE 磁盘，这也许不工作，而您不得不进入 OpenFirmware 并设置 <envar>boot-device</envar> 变量，<command>ybin</command> 通常会自动完成。
zh_tw: 重設 G3 或 G4 硬體上的 OpenFirmware 將導致預設啟動 &debian; (假設您正確分割區， 並將 Apple_Bootstrap 分割區放在首位)。如果您將 &debian; 放在 SCSI 磁碟，而 MacOS 位於 IDE 磁碟，這也許不會運作，而您不得不進入 OpenFirmware 並設定 <envar>boot-device</envar> 變數，<command>ybin</command> 通常會自動完成這個動作。

source: After you boot &debian; for the first time you can add any additional options you desire (such as dual boot options) to <filename>/etc/yaboot.conf</filename> and run <command>ybin</command> to update your boot partition with the changed configuration. Please read the <ulink url="&url-powerpc-yaboot-faq;">yaboot HOWTO</ulink> for more information.
el: Αφού έχετε ξεκινήσει για πρώτη φορά το &debian; μπορείτε να προσθέσετε οποιεσδήποτε άλλες επιπλέον επιλογές θέλετε (για παράδειγμα την επιλογή για διπλή εκκίνηση) στο αρχείο <filename>/etc/yaboot.conf</filename> και να τρέξετε την εντολή <command>ybin</command> για να ενημερώσετε την εκκινήσιμη κατάτμηση σας για τις αλλαγές των ρυθμίσεων. Διαβάστε το <ulink url="&url-powerpc-yaboot-faq;">yaboot HOWTO</ulink> για περισσότερες πληροφορίες.
ko: &debian;을 처음으로 부팅한 후에는 <filename>/etc/yaboot.conf</filename>에 dual boot 옵션과 같은 원하는 어떤 옵션이라도 추가 할 수 있고, <command>ybin</command>를 실행해 변경된 설정으로 부트 파티션을 업데이트 할 수 있습니다. 더 자세한 정보는 <ulink url="&url-powerpc-yaboot-faq;">yaboot HOWTO</ulink>를 읽어 보세요.
pt: Após iniciar o &debian; pela primeira vez poderá adicionar qualquer opção adicional que desejar (tal como opções de duplo arranque) ao <filename>/etc/yaboot.conf</filename> e correr o <command>ybin</command> para actualizar a partição de arranque com a configuração modificada. Para mais informação por favor leia o <ulink url="&url-powerpc-yaboot-faq;">yaboot HOWTO</ulink>.
ru: После того, как вы загрузили &debian; в первый раз, вы можете добавить дополнительные опции, какие пожелаете (такие, как опции двойной загрузки) в <filename>/etc/yaboot.conf</filename> и запустить <command>ybin</command> чтобы обновить измененную информацию в вашем загрузочном разделе. Пожалуйста, прочитайте <ulink url="&url-powerpc-yaboot-faq;">yaboot HOWTO</ulink> для более подробной информации.
zh_cn: 在首次启动 &debian; 之后，您可以添加您希望的额外选项(如双启动选项)到 <filename>/etc/yaboot.conf</filename> 并运行 <command>ybin</command> 以更新修改过的设置。请参阅 <ulink url="&url-powerpc-yaboot-faq;">yaboot HOWTO</ulink> 了解更多信息。
zh_tw: 在首次啟動 &debian; 之後，您可以添加額外選項 (如雙啟動選項) 到 <filename>/etc/yaboot.conf</filename> 並執行 <command>ybin</command> 以更新修改過的設定。請參閱 <ulink url="&url-powerpc-yaboot-faq;">yaboot HOWTO</ulink> 以了解更多資訊。

source: Debian Post-Boot (Base) Configuration
el: Ρύθμιση του Debian Μετά την Εκκίνηση (Βασική)
ko: 데비안 부팅 후 (기본) 설정
pt: Configuração para depois da inicialização (Base) do Debian
ru: Настройка базовой системы Debian
zh_cn: Debian 启动之后(基本)设置
zh_tw: Debian 啟動後之 (基本) 設置

source: After booting, you will be prompted to complete the configuration of your basic system, and then to select what additional packages you wish to install. The application which guides you through this process is called <classname>base-config</classname>. Its concept is very similar to the &d-i; from the first stage. Indeed, <classname>base-config</classname> consists of a number of specialized components, where each component handles one configuration task, contains <quote>hidden menu in the background</quote> and also uses the same navigation system.
el: Μετά την εκκίνηση θα σας ζητηθεί να ολοκληρώσετε την ρύθμιση του βασικού σας συστήματος και στη συνέχεια να επιλέξετε επιπλέον πακέτα που επιθυμείτε να εγκαταστήσετε. Η εφαρμογή που σας καθοδηγεί στη διαδικασία αυτή ονομάζεται <classname>base-config</classname>. Η ιδέα της εφαρμογής είναι πολύ ανάλογη αυτής του &d-i; από το πρώτο στάδιο. Πραγματικά, το <classname>base-config</classname> αποτελείται από έναν αριθμό εξειδικευμένων συνιστωσών η κάθε μια από τις οποίες χειρίζεται ένα συγκεκριμένο καθήκον ρύθμισης, περιέχει ένα <quote>κρυφό μενού στο υπόβαθρο</quote> και χρησιμοποιεί το ίδιο σύστημα πλοήγησης.
ko: 부팅 후 기본 시스템의 설정을 완료하도록 요구되고, 설치하기 원하는 추가적인 패키지들을 선택 해야 할 것입니다. 이 과정 동안 당신을 가이드 해줄 어플리케이션을 <classname>base-config</classname>이라고 부릅니다. 이 개념은 첫 번째 단계에서 &d-i;와 매우 유사합니다. 실제 <classname>base-config</classname>은 많은 특화된 컴포넌트들로 구성됩니다. 각 컴포넌트는 하나의 설정 작업을 처리하고, <quote>hidden menu in the background</quote>를 가지며, 동일한 네비게이션 시스템을 사용합니다.
pt: Depois do arranque, ser-lhe-á pedido para completar a configuração do seu sistema básico, e depois para seleccionar pacotes adicionais que deseja instalar. A aplicação que irá guiá-lo neste processo chama-se <classname>base-config</classname>. O seu conceito é muito semelhante ao do &d-i; da primeira fase. Na realidade, o <classname>base-config</classname> consiste num conjunto de componentes especializados, onde cada componente trata de uma tarefa de configuração, contém <quote>menus escondidos não visíveis</quote> e também usa o mesmo sistema de navegação.
ru: После загрузки вам предложат выполнить настройку базовой системы и затем выбрать дополнительные пакеты, которые нужно установить. Программа, которая проведёт вас через этот процесс называется <classname>base-config</classname>. Её структура очень похожа на &d-i; из первой стадии. В частности, <classname>base-config</classname> состоит из специализированных компонентов, каждый компонент выполняет одну задачу настройки, содержит <quote>на заднем плане невидимое меню</quote> и использует ту же самую систему навигации.
zh_cn: 启动之后，您将被提示去完成基本系统的设置，然后选择您希望安装的额外软件包。指导您完成此过程的应用程序称为 <classname>base-config</classname>。它的概念类似于 &d-i; 的第一阶段。事实上，<classname>base-config</classname> 由一些特殊的元件组成，每个元件完成一项设置任务，包括 <quote>在后台隐藏菜单</quote> 并使用同样的导航系统。
zh_tw: 啟動之後，您將被提示去完成基本系統的設定，然後選擇您希望安裝的額外軟體套件。指引您完成此過程的應用程式稱為 <classname>base-config</classname>。它的概念類似 &d-i; 的第一階段。事實上，<classname>base-config</classname> 由一些特殊的元件組成，每個元件完成一項設定任務，包括<quote>在後台隱藏選單</quote>並使用同樣的瀏覽系統。

source: If you wish to re-run the <classname>base-config</classname> at any point after installation is complete, as root run <userinput>base-config</userinput>.
el: Αν θέλετε να τρέξετε το <classname>base-config</classname> σε οποιαδήποτε άλλη στιγμή μετά την ολοκλήρωση της εγκατάστασης απλά τρέξτε την εντολή <userinput>base-config</userinput> σαν χρήστης root.
ko: 만일 설치가 완료된 후 어느 시점에 <classname>base-config</classname>을 다시 실행하길 원한다면, root 권한으로 <userinput>base-config</userinput>을 실행 합니다.
pt: Se pretender voltar a correr o <classname>base-config</classname> em qualquer altura depois da instalação estar completa, como root escreva <userinput>base-config</userinput>.
ru: <classname>base-config</classname> можно запустить в любой момент после завершения установки; от пользователя root выполните команду <userinput>base-config</userinput>.
zh_cn: 如果您希望在完成安装之后重新运行 <classname>base-config</classname>，请以 root 身份执行 <userinput>base-config</userinput>。
zh_tw: 如果您希望在完成安裝之後重新執行 <classname>base-config</classname>，請以 root 身份執行 <userinput>base-config</userinput>。

source: Configuring Your Time Zone
el: Ρύθμιση της Χρονικής Ζώνης
ko: 시간대 설정
pt: Configurar O Seu Fuso Horário
ru: Настройка часового пояса
zh_cn: 配置您的时区
zh_tw: 設定您的時區

source: After a welcome screen, you will be prompted to configure your time zone. First select whether the hardware clock of your system is set to local time or Greenwich Mean Time (GMT or UTC). The time displayed in the dialog may help you decide on the correct option. <phrase arch="m68k;powerpc">Macintosh hardware clocks are normally set to local time. If you want to dual-boot, select local time instead of GMT.</phrase> <phrase arch="i386">Systems that (also) run Dos or Windows are normally set to local time. If you want to dual-boot, select local time instead of GMT.</phrase>
el: Μετά από μια οθόνη υποδοχής θα παρακινηθείτε να ρυθμίσετε την ζώνη της τοπικής σας ώρας. Επιλέξτε καταρχήν αν το ρολόι του συστήματός σας έχει την τοπική ώρα ή την ώρα Greenwich Mean Time (GMT ή UTC). O χρόνος που εμφανίζεται στο διάλογο πιθανόν να σας βοηθήσει να αποφασίσετε την σωστή επιλογή.<phrase arch="m68k;powerpc"> Το ρολόι σε συστήματα Macintosh είναι συνήθως ρυθμισμένο στην τοπική ώρα. Αν θέλετε να έχετε διπλή εκκίνηση διαλέξτε την τοπική ώρα και όχι την ώρα GMT.</phrase> <phrase arch="i386"> Συστήματα που (επίσης) τρέχουν Dos ή Windows είναι συνήθως ρυθμισμένα σε τοπική ώρα. Αν θέλετε να έχετε διπλή εκκίνηση διαλέξτε την τοπική ώρα και όχι την ώρα GMT.</phrase>
ko: 환영 화면이 보여진 후에 시간대 설정을 해야 할 것입니다. 먼저 시스템의 하드웨어 클럭이 지역 시간(local time) 또는 Greenwich Mean Time (GMT 또는 UTC)으로 설정되는 지를 선택합니다. 다이얼로그에 보여지는 시간은 당신이 정확한 옵션을 결정하는 데 도움을 줄 것 입니다. <phrase arch="m68k;powerpc">매킨토쉬 하드웨어 클럭은 보통 지역 시간으로 설정됩니다. 만일 dual-boot을 원한다면, GMT 대신 지역 시간을 선택하세요.</phrase> <phrase arch="i386">Dos 또는 Windows를 운영하는 시스템들도 보통 지역 시간으로 설정됩니다. 만일 dual-boot을 원한다면, GMT 대신 지역 시간을 선택하세요.</phrase>
pt: Depois do ecrã de boas vindas, ser-lhe-á pedido para configurar o seu fuso horário. Seleccione primeiramente se o relógio de hardware do seu sistema está acertado para a hora local ou para o Horário do Meridiano de Greenwhich (GMT ou UTC). O horário apresentado pode ajudar a decidir a opção correcta. <phrase arch="m68k;powerpc">Os relógios de hardware do Macintosh estão normalmente acertados pela hora local. Se pretender utilizar o duplo arranque, seleccione hora local em vez de GMT.</phrase> <phrase arch="i386">Sistemas que (também) correm Dos ou Windows estão normalmente acertados pela hora local. Se pretender utilizar o duplo arranque, seleccione hora local em vez de GMT.</phrase>
ru: После экрана приветствия вам будет предложено настроить часовой пояс. Сперва выберите, что показывают аппаратные часы на вашей системе: локальное время или по Гринвичу (GMT или UTC). Время, отображённое в диалоге, может помочь вам выбрать правильный вариант. <phrase arch="m68k;powerpc">Аппаратные часы на Macintosh обычно показывают локальное время. Если хотите использовать мультизагрузку, выберите локальное время вместо GMT.</phrase> <phrase arch="i386">Системы, которые (кроме Debian) работают под Dos или Windows обычно настроены использовать локальное время. Если хотите использовать мультизагрузку, выберите локальное время вместо GMT.</phrase>
zh_cn: 欢迎画面之后，您将看到提示要求设置您的时区。首先选择设置您的系统硬件时钟为本地还是格林威治时间(GMT或UTC)。对话框里面显示的时间可以帮您做出正确的选择。<phrase arch="m68k;powerpc">Macintosh 硬件时钟通常设置为本地时间。如果您想多重启动，选择本地时间而不是 GMT。</phrase> <phrase arch="i386">(仍然)运行着 Dos 或 Windows 的系统通常设置为本地时间。如果您想多重启动，选择本地时间而不是 GMT。</phrase>
zh_tw: 歡迎畫面之後，您將看到要求設定時區的提示。首先決定系統硬體時鐘為本地還是格林威治時間 (GMT或UTC)。對話框裡面顯示的時間可以幫您做出正確的選擇。 <phrase arch="m68k;powerpc">Macintosh 硬體時鐘通常設為本地時間。如果您想多重開機，請選擇本地時間而非 GMT。</phrase> <phrase arch="i386"> 仍然) 運行 Dos 或 Windows 的系統通常設為本地時間。如果您想多重開機，選擇本地時間而非 GMT。</phrase>
