Repository: xobs/debian-installer
Catalog: doc/manual/po/*/boot-installer.po
Languages: ko, pt, zh_tw

source: Alternatively, you can boot the installer in expert mode. You will then be asked to enter the resource range options your hardware needs. For example, if you have one of the Dell laptops mentioned above, you should enter <userinput>exclude port 0x800-0x8ff</userinput> here. There is also a list of some common resource range options in the <ulink url="http://pcmcia-cs.sourceforge.net/ftp/doc/PCMCIA-HOWTO-1.html#ss1.12">System resource settings section of the PCMCIA HOWTO</ulink>. Note that you have to omit the commas, if any, when you enter this value in the installer.
ko: 다른 방법으로, 전문가 모드에서 설치 프로그램을 부팅할 수 있습니다. 그 다음에 하드웨어에 필요한 리소스 범위를 입력합니다. 예를 들어, 위에서 말한 Dell 노트북을 가지고 있다면, 여기서 <userinput>exclude port 0x800-0x8ff</userinput>라고 입력합니다. <ulink url="http://pcmcia-cs.sourceforge.net/ftp/doc/PCMCIA-HOWTO-1.html#ss1.12">System resource settings section of the PCMCIA HOWTO</ulink>에 보면 리소스 범위 관련 옵션의 목록이 있습니다. 설치 프로그램에서 이 값을 입력할 때, 쉼표를 쓰지 않는다는 것에 유의하십시오.
pt: Em alternativa, poderá iniciar o instalador em modo expert. Ser-lhe-á pedido para introduzir o intervalo de recursos que o seu hardware necessita. Por exemplo, se tem um dos portáteis Dell mencionados acima deverá introduzir <userinput>exclude port 0x800-0x8ff</userinput>. Há uma lista com os intervalos mais comuns em <ulink url="http://pcmcia-cs.sourceforge.net/ftp/doc/PCMCIA-HOWTO-1.html#ss1.12">Systemresource settings section of the PCMCIA HOWTO</ulink>. Note que tem de omitir as virgulas, se alguma, quando introduz estes valors no instalador.
zh_tw: 或者，您可以在啟動安裝程式時進入專家模式。您需要按照要求輸入硬體資源範圍選項。例如，您如果有如上所說的 Dell 筆記型電腦問題，應該在這裡輸入 <userinput>exclude port 0x800-0x8ff</userinput>。在 <ulink url="http://pcmcia-cs.sourceforge.net/ftp/doc/PCMCIA-HOWTO-1.html#ss1.12">System resource settings section of the PCMCIA HOWTO</ulink> 處有一個列表，整理出一些有問題的資源範圍選項。注意在安裝程式中，輸入這些值的時候必須忽略逗號。

source: System Freeze while Loading the USB Modules
ko: USB 모듈을 읽어들이다가 시스템 멈춤
pt: Bloqueio de Sistema durante o carregamento dos módulos USB
zh_tw: 在裝入 USB 模組時系統當機

source: The kernel normally tries to install USB modules and the USB keyboard driver in order to support some non-standard USB keyboards. However, there are some broken USB systems where the driver hangs on loading. A possible workaround may be disabling the USB controller in your mainboard BIOS setup. Another option is passing the <userinput>debian-installer/probe/usb=false</userinput> parameter at the boot prompt, which will prevent the modules from being loaded.
ko: 일부 표준이 아닌 USB 키보드를 지원하기 위해 커널에서 USB 모듈과 USB 키보드 드라이버를 읽어들입니다. 하지만 일부 문제 있는 USB 시스템에서는 드라이버를 읽어들일 때 멈춥니다. 한 가지 방법은 메인보드의 BIOS 설정에서 USB 컨트롤러를 끄는 것입니다. 또 다른 방법은 <userinput>debian-installer/probe/usb=false</userinput> 파라미터를 부팅 프롬프트에 써서, USB 모듈을 읽어들이지 못하게 하는 것입니다.
pt: O kernel normalmente tenta instalar os módulos USB e o driver do teclado USB de forma a suportar alguns teclados USB não standard. No entanto, há alguns sistemas USB, onde o driver pára ao carregar. Uma solução possível é desactivar o driver no carregamento, na BIOS da sua board. Outra opção possível é passar o parâmetro <userinput>debian-installer/probe/usb=false</userinput> na prompt de arranque, o que irá impedir os módulos de serem carregados.
zh_tw: 核心在正常情況下會嘗試安裝 USB 模組以及 USB 鍵盤驅動程式來支援一些非標準的 USB 鍵盤。但是，有些不完整的 USB 系統會在驅動程式載入時當機。一個可能的解決方法是在 BIOS 設置內禁用您的 USB 控制器。或者在開機提示符號處傳遞 <userinput>debian-installer/probe/usb=false</userinput> 參數，這將阻止載入此模組。

source: Interpreting the Kernel Startup Messages
ko: 커널 시작 메세지 해석하기
pt: Interpretar as mensagens de arranque do kernel
zh_tw: 解讀核心起始資訊

source: During the boot sequence, you may see many messages in the form <computeroutput>can't find <replaceable>something</replaceable> </computeroutput>, or <computeroutput> <replaceable>something</replaceable> not present</computeroutput>, <computeroutput>can't initialize <replaceable>something</replaceable> </computeroutput>, or even <computeroutput>this driver release depends on <replaceable>something</replaceable> </computeroutput>. Most of these messages are harmless. You see them because the kernel for the installation system is built to run on computers with many different peripheral devices. Obviously, no one computer will have every possible peripheral device, so the operating system may emit a few complaints while it looks for peripherals you don't own. You may also see the system pause for a while. This happens when it is waiting for a device to respond, and that device is not present on your system. If you find the time it takes to boot the system unacceptably long, you can create a custom kernel later (see <xref linkend="kernel-baking"/>).
ko: 부팅 과정에서, <computeroutput>can't find <replaceable>something</replaceable> </computeroutput> 혹은 <computeroutput> <replaceable>something</replaceable> not present</computeroutput>, <computeroutput>can't initialize <replaceable>something</replaceable> </computeroutput>, 아니면 심지어는 <computeroutput>this driver release depends on <replaceable>something</replaceable> </computeroutput> 형식의 메세지를 볼 수 있을 것입니다. 이러한 메세지의 대부분은 아무런 문제를 일으키지 않습니다. 설치 시스템은 여러 가지 주변 장치가 달린 컴퓨터에서 동작하도록 만들어졌기 때문에 이런 메세지가 나옵니다. 당연히 그 어떤 컴퓨터라고 해도 모든 주변 장치를 가진 컴퓨터는 없으므로, 운영체제에서는 찾으려는 주변 장치가 없을 때 이러한 메세지를 내보냅니다. 또 시스템이 일시적으로 멈추는 현상이 일어날 수도 있습니다. 이러한 현상은 어떤 장치가 응답할 때까지 기다리는데, 그 장치가 없을 때 발생합니다. 이런 시간이 너무 오래 걸린다고 생각한다면, 나중에 직접 설정한 커널을 사용할 수 있습니다. (<xref linkend="kernel-baking"/> 참고.)
pt: Durante a sequência de arranque, pode ver muitas mensagens sob a forma <computeroutput>can't find <replaceable>something</replaceable> </computeroutput>, ou <computeroutput> <replaceable>something</replaceable> not present</computeroutput>, <computeroutput>can't initialize <replaceable>something</replaceable> </computeroutput>, ou até <computeroutput>this driver release depends on <replaceable>something</replaceable> </computeroutput>. A maioria destas mensagens são inofensivas. Visualiza-as porque o kernel para a instalação do sistema é feito para correr em computadores de diferente periféricos. Obviamente, nenhum computador terá todos os periféricos possíveis, então o sistema operativo poderá emitir algumas queixas enquanto procura por periféricos que não possui. Poderá também verificar uma pausa no sistema. Isto acontece quando aguarda pela resposta de um dispositivo, e o mesmo não está presente no seu sistema. Se considerar que o tempo de arranque do sistema incrivelmente longo, poderá mais tarde criar um kernel personalizado (veja a <xref linkend="kernel-baking"/>).
zh_tw: 在開機期間，您可以看到很多資訊類似 <computeroutput>can't find <replaceable>something</replaceable> </computeroutput>，或者 <computeroutput> <replaceable>something</replaceable> not present</computeroutput>， <computeroutput>can't initialize <replaceable>something</replaceable> </computeroutput>，或者甚至 <computeroutput>this driver release depends on <replaceable>something</replaceable> </computeroutput>。大多數這些資訊都是無害的。您之所以看到它們，是因為安裝系統核心被設計成為可以在不同的電腦上執行，並且擁有不同的周邊設備。顯然地，沒有一個電腦可能擁有所有的周邊設備，因此作業系統可能在偵測一些您沒有的設備時送出一些警告。有時可以看到系統暫停了一段時間。這是由於它在等待一台設備的回應，但是這台設備並沒有安裝在您的系統上。如果您發現這段時間非常長，您可以之後重編自己的核心 (請參閱 <xref linkend="kernel-baking"/>)。

source: Bug Reporter
ko: 버그 보고
pt: Relatório de Erros

source: If you get through the initial boot phase but cannot complete the install, the bug reporter menu choice may be helpful. It copies system error logs and configuration information to a user-supplied floppy. This information may provide clues as to what went wrong and how to fix it. If you are submitting a bug report you may want to attach this information to the bug report.
ko: 최초 부팅 단계를 지나갔지만 설치를 마치지 못했다면, 버그 보고 메뉴가 도움이 될 수도 있습니다. 이 메뉴는 시스템 오류 로그와 설정 정보를 사용자의 플로피에 복사합니다. 이 정보는 무엇이 잘못되었는지 및 어떻게 고치는 지에 대한 단서가 들어 있습니다. 버그를 보고할 때, 이 정보를 버그 보고에 첨부해 주십시오.
pt: Se avançar através da fase de arranque inicial mas não conseguir completar a instalação, a escolha de menu relatório de erros pode ser útil. Copia os logs de erro de sistema e informação de configuração para uma disquete fornecida pel utilizador. Esta informação pode dar pista acerca do que correu mal e como corrigir isso. Se estiver a submeter um relatório de erros você pode querer adicionar esta informação ao relatório de erros.
zh_tw: 如果您通過了初始化開機但是不能完成安裝，Bug Reporter 選單選項可能會很有用。它會複製系統的錯誤記錄和設定資訊至一個使用者提供的軟碟中。這個資訊可能提供了一些關於錯誤的原因和如何解決它的線索。如果您正在回報問題報告，您也許想附上這些資訊。

source: Other pertinent installation messages may be found in <filename>/var/log/</filename> during the installation, and <filename>/var/log/debian-installer/</filename> after the computer has been booted into the installed system.
ko: 그 외의 설치 메세지는 설치할 때 <filename>/var/log/</filename>에 들어 있고, 설치된 시스템으로 부팅한 다음에는 <filename>/var/log/debian-installer/</filename>에 들어 있습니다.
pt: Outras mensagens de instalação pertinentes podem ser encontradas em <filename>/var/log/</filename> durante a instalação, e <filename>/var/log/debian-installer/</filename> após o computador ter arrancado para o sistema instalado.
zh_tw: 其他相關安裝期間的安裝資訊可以在 <filename>/var/log/</filename> 找到，以及在電腦已經啟動至安裝後的系統的 <filename>/var/log/debian-installer/</filename> 中。

source: Submitting Installation Reports
ko: 설치 보고 제출
pt: Submeter Relatórios de Instalação
zh_tw: 回報安裝報告

source: If you still have problems, please submit an installation report. We also encourage installation reports to be sent even if the installation is successful, so that we can get as much information as possible on the largest number of hardware configurations. Please use this template when filling out installation reports, and file the report as a bug report against the <classname>installation-reports</classname> pseudo package, by sending it to <email>submit@bugs.debian.org</email>. <informalexample><screen> Package: installation-reports Debian-installer-version: &lt;Fill in date and from where you got the image&gt; uname -a: &lt;The result of running uname -a on a shell prompt&gt; Date: &lt;Date and time of the install&gt; Method: &lt;How did you install? What did you boot off? If network install, from where? Proxied?&gt; Machine: &lt;Description of machine (eg, IBM Thinkpad R32)&gt; Processor: Memory: Root Device: &lt;IDE? SCSI? Name of device?&gt; Root Size/partition table: &lt;Feel free to paste the full partition table, with notes on which partitions are mounted where.&gt; Output of lspci and lspci -n: Base System Installation Checklist: [O] = OK, [E] = Error (please elaborate below), [ ] = didn't try it Initial boot worked: [ ] Configure network HW: [ ] Config network: [ ] Detect CD: [ ] Load installer modules: [ ] Detect hard drives: [ ] Partition hard drives: [ ] Create file systems: [ ] Mount partitions: [ ] Install base system: [ ] Install boot loader: [ ] Reboot: [ ] Comments/Problems: &lt;Description of the install, in prose, and any thoughts, comments and ideas you had during the initial install.&gt; </screen></informalexample> In the bug report, describe what the problem is, including the last visible kernel messages in the event of a kernel hang. Describe the steps that you did which brought the system into the problem state.
ko: 그래도 문제가 있으면, 설치 보고서를 제출해 주십시오. 설치가 성공했을 때에도 설치 보고서를 보내 주시면, 여러 가지 하드웨어 설정에 대해 많은 정보를 얻을 수 있습니다. 설치 보고서를 작성하실 때 아래 형식을 이용하시고, <classname>itallation-reports"</classname>가) 꾸러미로 <email>submit@bugs.debian.org</email>로 메일을 보내 버그 보고를 제출해 주십시오. <informalexample><screen> Package: installation-reports Debian-installer-version: &lt;설치 이미지를 가져온 날짜와 위치를 쓰십시오&gt; uname -a: &lt;쉘 프롬프트에서 uname -a 명령의 결과&gt; Date: &lt;설치한 날짜 및 시각&gt; Method: &lt;설치한 방법은? 처음에 부팅한 방법은? 네트워크 설치의 경우라면, 어디에서? 프록시를 사용했는지?&gt; Machine: &lt;기계 설명 (예, IBM Thinkpad R32)&gt; Processor: Memory: Root Device: &lt;IDE? SCSI? 장치 이름?&gt; Root Size/partition table: &lt;파티션 테이블 전체를 붙여 넣으십시오. 어떤 파티션을 어디에 마운트했는 지 써 주십시오.&gt; Output of lspci and lspci -n: Base System Installation Checklist: [O] = OK, [E] = Error (please elaborate below), [ ] = didn't try it Initial boot worked: [ ] Configure network HW: [ ] Config network: [ ] Detect CD: [ ] Load installer modules: [ ] Detect hard drives: [ ] Partition hard drives: [ ] Create file systems: [ ] Mount partitions: [ ] Install base system: [ ] Install boot loader: [ ] Reboot: [ ] Comments/Problems: &lt;설치 과정을 문장으로 설명하십시오. 그리고 처음에 설치했을 때 들었던 생각, 평가, 아이디어 따위도 써 주십시오.&gt; </screen></informalexample> 버그 보고서에 문제가 무엇인지 설명하시고, 커널이 멈춘 경우에 마지막으로 볼 수 있는 커널 메세지를 포함하십시오. 문제가 발생할 때 어떤 과정을 거쳤는 지 설명하십시오.
pt: Se ainda tiver problemas, por favor submeta um relatório de instalação. Nós também encorajamos que sejam enviados relatórios de instalação mesmo que a instalação tenha sucesso, de modo a que possamos obter tanta informação quanto possível no maior número de configurações de hardware. Por favor utilize este template quando preencher relatórios de instalação, e envie o relatório como um relatório de bug sobre o pseudo-pacote <classname>installation-reports</classname>, enviando-o para <email>submit@bugs.debian.org</email>. <informalexample><screen> Package: installation-reports Debian-installer-version: &lt;Preencha a data e de onde obteve a imagem&gt; uname -a: &lt;O resultado da execução de uname -a numa linha de comandos da shell&gt; Date: &lt;Data e hora da instalação&gt; Method: &lt;Como fez a instalação? De onde iniciou? Caso seja uma instalação pela rede, de onde? Com Proxy?&gt; Machine: &lt;Descrição da máquina (ex, IBM Thinkpad R32)&gt; Processor: Memory: Root Device: &lt;IDE? SCSI? Nome do dispositivo?&gt; Root Size/partition table: &lt;Copie para aqui a tabela de partições completa com notas a indicar que partição é montada onde.&gt; Output de lspci and lspci -n: Base System Installation Checklist: [O] = OK, [E] = Erro (por favor descreva abaixo), [ ] = não foi tentado Initial boot worked: [ ] Configure network HW: [ ] Config network: [ ] Detect CD: [ ] Load installer modules: [ ] Detect hard drives: [ ] Partition hard drives: [ ] Create file systems: [ ] Mount partitions: [ ] Install base system: [ ] Install boot loader: [ ] Reboot: [ ] Comments/Problems: &lt;Descrição da instalação, em prosa, e quaisquer pensamentos, comentários e ideias que tenha tido durante a instalação inicial.&gt; </screen></informalexample> No relatório de bug, descreva qual é o problema, incluindo as últimas mensagens visíveis do kernel no caso do kernel bloquear. Descreva os passos que tomou que levaram o sistema ao estado do problema.
zh_tw: 如果您還是有問題，請回報臭蟲報告。即使您安裝成功，我們還是希望您能發一份安裝報告，讓我們取得眾多硬體設定的更多資訊。請採用下列模板填寫安裝報告，並把這份報告以 <classname>installation-reports</classname> 虛擬軟體套件之臭蟲報告的名義，發送一封電子郵件至 <email>submit@bugs.debian.org</email>。 <informalexample><screen> Package: installation-reports Debian-installer-version: &lt;Fill in date and from where you got the image&gt; uname -a: &lt;The result of running uname -a on a shell prompt&gt; Date: &lt;Date and time of the install&gt; Method: &lt;How did you install? What did you boot off? If network install, from where? Proxied?&gt; Machine: &lt;Description of machine (eg, IBM Thinkpad R32)&gt; Processor: Memory: Root Device: &lt;IDE? SCSI? Name of device?&gt; Root Size/partition table: &lt;Feel free to paste the full partition table, with notes on which partitions are mounted where.&gt; Output of lspci and lspci -n: Base System Installation Checklist: [O] = OK, [E] = Error (please elaborate below), [ ] = didn't try it Initial boot worked: [ ] Configure network HW: [ ] Config network: [ ] Detect CD: [ ] Load installer modules: [ ] Detect hard drives: [ ] Partition hard drives: [ ] Create file systems: [ ] Mount partitions: [ ] Install base system: [ ] Install boot loader: [ ] Reboot: [ ] Comments/Problems: &lt;Description of the install, in prose, and any thoughts, comments and ideas you had during the initial install.&gt; </screen></informalexample> 在臭蟲報告內，請描述問題，包括核心當住後見到的核心訊息。請描述進入問題狀態前相關的步驟。
