Repository: xobs/debian-installer
Catalog: doc/manual/po/*/boot-new.po
Languages: el, ko, pt, ru, zh_cn, zh_tw

source: PPPOE is a protocol related to PPP used for some broadband connections. There is currently no support in base configuration to help you set this up. However, the necessary software has been installed, which means you can configure PPPOE manually at this stage of the installation by switching to VT2 and running <command>pppoeconf</command>.
el: To PPPOE είναι ένα πρωτόκολλο που σχετίζεται με το PPP και χρησιμοποιείται για κάποιες ευρυζωνικές συνδέσεις. Προς το παρόν δεν υπάρχει υποστήριξη στην βασική ρύθμιση του συστήματος για να σας βοηθήσει στην ρύθμισή του. Όμως το απαραίτητο λογισμικό έχει ήδη εγκατασταθεί, πράγμα που σημαίνει ότι μπορείτε να ρυθμίσετε το PPPOE χειροκίνητα στη φάση αυτή της εγκατάστασης αλλάζοντας στην κονσόλα VT2 και τρέχοντας την εντολή <command>pppoeconf</command>.
ko: PPPOE는 광대역 연결을 위해 사용되는 PPP와 관련된 프로토콜 중 하나 입니다. 기본 설정과정에 당신이 이 연결을 설정하도록 도와줄 부분은 현재 없습니다. 하지만, 필수적인 소프트웨어들은 설치가 되어 있고, PPPOE를 수작업으로 설정할 수 있습니다. PPPOE 설정을 하려면 이 설치 단계에서 터미널을 VT2로 바꿔 <command>ppppoeconf</command> 명령을 실행하세요.
pt: O PPPOE é um protocolo relacionado com o PPP utilizado por algumas ligações de banda larga. Neste momento não existe suporte na configuração base para ajuda-lo a definir este tipo de ligações. No entanto, o software necessário já se encontra instalado, o que significa que pode configurar o PPPOE manualmente nesta fase da instalação indo para para VT2 e executando o <command>pppoeconf</command>.
ru: PPPOE &mdash; это протокол, в котором PPP используется в некоторых широкополосных соединениях. В данный момент, программа установки не поддерживает его настройку. Однако, всё необходимое программное обеспечение уже установлено, а значит, вы можете настроить PPPOE вручную на этом этапе установки, переключившись на VT2 и запустив <command>pppoeconf</command>.
zh_cn: PPPOE 是与 PPP 相关的协议，用于宽带连接。当前基本系统里面不会帮您配置建立。然而，相应的软件包已经安装，也就意味着您可以在本阶段手动配置 PPPOE，只需切换到 VT2，然后执行 <command>pppoeconf</command>。
zh_tw: PPPOE 是與 PPP 相關的協定，用於寬頻連線。目前基本系統裡面不會幫您建立設定。然而，相應的軟體套件已經安裝，也就意味著您可以在本階段手動設定 PPPOE，只需切換到 VT2，然後執行 <command>pppoeconf</command>。

source: Configuring APT
el: Ρύθμιση του APT
ko: APT 설정
pt: A Configurar o APT
ru: Настройка APT
zh_cn: 配置 APT
zh_tw: 設定 APT

source: The main means that people use to install packages on their system is via a program called <command>apt-get</command>, from the <classname>apt</classname> package.<footnote> <para> Note that the actual program that installs packages is called <command>dpkg</command>. However, this package is more of a low-level tool. <command>apt-get</command> is a higher-level tool as it will invoke <command>dpkg</command> as appropriate and also because it knows to install other packages which are required for the package you're trying to install, as well as how to retrieve the package from your CD, the network, or wherever. </para> </footnote> Other front-ends for package management, like <command>aptitude</command>, <command>synaptic</command> and the older <command>dselect</command> also use and depend on <command>apt-get</command>. These front-ends are recommended for new users, since they integrate some additional features (package searching and status checks) in a nice user interface.
el: Το βασικότερο μέσο που χρησιμοποιούν οι χρήστες για να εγκαταστήσουν πακέτα στο σύστημά τους είναι το πρόγραμμα <command>apt-get</command> από το πακέτο <classname>apt</classname>.<footnote> <para> Σημειώστε ότι το πρόγραμμα που πραγματικά εγκαθιστά τα πακέτα ονομάζεται <command>dpkg</command>. Όμως αυτό το πακέτο είναι κατά κάποιο τρόπο ένα εργαλείο χαμηλότερου επιπέδου στο σύστημα. Το <command>apt-get</command> είναι από την άλλη ένα εργαλείο υψηλότερου επιπέδου στο σύστημα καθώς καλεί το ίδιο το <command>dpkg</command> με τον κατάλληλο τρόπο κάθε φορά και καθώς ξέρει πώς να εγκαταστήσει άλλα πακέτα που χρειάζονται από το πακέτο που θέλετε να εγκαταστήσετε αλλά και πώς να ανακτήσει το κάθε πακέτο από το CD σας, το δίκτυο ή από όπου αλλού θέλετε.</para> </footnote> Άλλα front-ends για την διαχείριση πακέτων, όπως το <command>aptitude</command>, το <command>synaptic</command> και το παλιότερο <command>dselect</command> επίσης χρησιμοποιούν και εξαρτώνται από το <command>apt-get</command>. Αυτά συνίστανται για καινούριους χρήστες καθώς ενσωματώνουν μερικά επιπρόσθετα χαρακτηριστικά όπως δυνατότητα αναζήτησης πακέτων και ελέγχου της κατάστασης τους σε ένα όμορφο γραφικό περιβάλλον για το χρήστη.
ko: 주요한 점은 사람들이 시스템에 패키지들을 설치하기 위해 <classname>apt</classname> 패키지에 있는 <command>apt-get</command> 프로그램을 사용하곤 한다는 점 입니다. <footnote> <para>패키지들을 설치하는 실제 프로그램은 <command>dpkg</command> 명령임을 알아두세요. 그러나, 이 패키지는 좀 더 저수준의 도구입니다. <command>apt-get</command>은 <command>dpkg</command>를 적절히 불러주고, 당신이 설치하려고 하는 패키지가 필요로 하는 다른 패키지들을 알고, CD, 네트워크 또는 다른 곳으로부터 패키지들을 어떻게 받아올 지를 알고 있는 고수준의 도구입니다. </para> </footnote> 패키지 관리를 위한 다른 프론트엔드로는 <command>apt-get</command>를 사용하거나 의존하는 <command>apttude</command>, <command>synaptic</command>와 오래된 <command>dselect</command>가 있습니다. 이러한 프론트엔드들은 패키지 찾기와 상태 체크 등의 추가적인 기능들을 사용하기 쉽게 제공하기 때문에 새로운 사용자들에게 추천됩니다.
pt: O meio principal que os utilizadores utilizam para instalar pacotes nos seus sistemas é através de um programa chamado <command>apt-get</command>, do pacote <classname>apt</classname>. <footnote> <para> Note que o programa actual que instala os pacotes é o <command>dpkg</command>. No entanto, este pacote é uma ferramenta de mais baixo nível. O <command>apt-get</command> é uma ferramenta de um nível mais alto uma vez que invoca o <command>dpkg</command> quando necessário e também porque é capaz de instalar outros pacotes que são necessários para o pacote que está a tentar instalar, bem como ir buscar o pacote do CD, da rede, ou de outro lado. </para> </footnote> Outras ferramentas para a gestão de pacotes, como o <command>aptitude</command>, o <command>synaptic</command> e o antigo <command>dselect</command> também usam e dependem do <command>apt-get</command>. Estas ferramentas são recomendadas para novos utilizadores, uma vez que integram algumas funcionalidades adicionais (procura de pacotes e verificação de estado) num agradável ambiente gráfico.
ru: В основном, для установки пакетов в систему люди используют программу под названием <command>apt-get</command> из пакета <classname>apt</classname>.<footnote><para> Заметим, что программа, которая в действительности устанавливает пакеты, называется <command>dpkg</command>. Однако, это более низкоуровневая утилита. <command>apt-get</command> &mdash; утилита более высокого уровня, так как вызывает <command>dpkg</command> при необходимости и знает, что нужно установить другие пакеты, которые нужны для работы пакету, который вы хотите установить, а также знает, где взять этот пакет: с CD, по сети или как-то ещё.</para></footnote> Также используются другие программы управления пакетами, например <command>aptitude</command>, <command>synaptic</command> и устаревший <command>dselect</command>: они зависят от <command>apt-get</command>. Эти программы рекомендуются для новичков, так как они объединяют в себе несколько дополнительных свойств (поиск пакетов и отображение состояния) в отличном интерфейсе пользователя.
zh_cn: 本节的重点是 <command>apt-get</command>，这是一个人们用来安装各种软件的程序，它被包含在 <classname>apt</classname> 软件包中。<footnote> <para> 事实上，真正用来安装软件包的程序是 <command>dpkg</command>。但这是一个比较低层次的工具。<command>apt-get</command> 是一个高级工具，它可以在适当的时候执行 <command>dpkg</command> ，还知道在安装某个软件包时自动安装所需的其它软件包，并且能够从您的光盘、网络或其它地方下载它们。</para> </footnote> 其他的包管理前端程序，像 <command>aptitude</command>，<command>synaptic</command> 和较早的 <command>dselect</command> 也是使用并依赖 <command>apt-get</command>。这些前端软件推荐新用户使用，因为它们在良好的用户界面下集成了一些其他特性(搜索包与状态检验)。
zh_tw: 本節的重點是 <command>apt-get</command>，這是一個用來安裝各種軟體的程式，它被包含在 <classname>apt</classname> 軟體套件中。<footnote> <para> 事實上，真正用來安裝軟體套件的程式是 <command>dpkg</command>。但這是一個比較低階的工具。<command>apt-get</command> 是一個高階工具，它可以在適當的時候執行 <command>dpkg</command>，並在安裝某個軟體套件時自動安裝所需的其它軟體套件， 並且能夠從您的光碟、網路或其它地方下載這些套件。</para> </footnote> 其他的套件管理前端程式，像 <command>aptitude</command>，<command>synaptic</command> 和較早的 <command>dselect</command> 也是使用並依賴 <command>apt-get</command>。在此推薦這些前端軟體給新使用者使用，因為它們在良好的使用者介面下整合了一些其他功能 (搜索套件與狀態檢驗)。

source: APT must be configured so that it knows where to retrieve packages from. The helper application which assists in this task is called <command>apt-setup</command>.
el: Το APT θα πρέπει να ρυθμιστεί ώστε να ξέρει από πού θα ανακτήσει τα πακέτα. Η εφαρμογή που βοηθά σε αυτό λέγεται <command>apt-setup</command>.
ko: APT는 어디에서 패키지들을 가져와야 할 지 설정되어 있어야 합니다. 설정 작업을 도와주는 <command>apt-setup</command> 프로그램이 있습니다.
pt: O APT tem que ser configurado de modo a que saiba onde ir buscar os pacotes. A aplicação que ajuda nesta tarefa é a <command>apt-setup</command>.
ru: Для APT должен быть настроен источник из которого будут браться пакеты. С этой задачей поможет справиться программа <command>apt-setup</command>.
zh_cn: 您必须配置 APT，使它明白该从哪里获取软件包。有一个帮助您完成这一工作的程序叫 <command>apt-setup</command>。
zh_tw: 您必須設定 APT，使它明白該從哪裡取得軟體套件。有一個幫助您完成這工作的程式叫 <command>apt-setup</command>。

source: The next step in your configuration process is to tell APT where other Debian packages can be found. Note that you can re-run this tool at any point after installation by running <command>apt-setup</command>, or by manually editing <filename>/etc/apt/sources.list</filename>.
el: Το επόμενο βήμα στην διαδικασία ρύθμισης του συστήματος σας είναι να πείτε στο APT πού μπορεί να βρει άλλα πακέτα Debian. Σημειώστε ότι μπορείτε να τρέξετε αυτό το εργαλείο οποιαδήποτε άλλη στιγμή μετά την εγκατάσταση εκτελώντας την εντολή <command>apt-setup</command> ή διορθώνοντας με το χέρι το αρχείο <filename>/etc/apt/sources.list</filename>.
ko: 설정 과정의 다음 단계는 어디에서 다른 데비안 패키지들을 찾을 수 있는 지 APT에게 알려주는 일입니다. 이 작업은 설치 후 언제든지 <command>apt-setup</command>를 실행하거나 <filename>/etc/apt/sources.list</filename>을 직접 편집해서 다시 수행 할 수 있습니다.
pt: O próximo passo no seu processo de configuração é dizer ao APT onde outros pacotes Debian podem ser encontrados. Note que pode correr este utilitário de novo a qualquer altura depois da instalação executando o <command>apt-setup</command>, ou editando manualmente o <filename>/etc/apt/sources.list</filename>.
ru: Следующим шагом в процессе настройки является указание APT, где можно найти дополнительные пакеты Debian. Заметим, что вы можете запускать эту утилиту в любой момент после установки командой <command>apt-setup</command> или вручную редактировать <filename>/etc/apt/sources.list</filename>.
zh_cn: 然后该告诉 APT 其它软件包可以在什么地方获取。您可以在安装完毕后的任何时候重新运行 <command>apt-setup</command>进行配置，或者手工编辑 <filename>/etc/apt/sources.list</filename>。
zh_tw: 然後該告訴 APT 其它軟體套件可以在什麼地方取得軟體套件。您可以在安裝完畢後的任何時候重新執行 <command>apt-setup</command> 以進行設定，或者手動編輯 <filename>/etc/apt/sources.list</filename>。

source: If an official CD-ROM is in the drive at this point, then that CD-ROM should automatically be configured as an apt source without prompting. You will notice this because you will see the CD-ROM being scanned.
el: Αν στη συσκευή CD-ROM βρίσκεται εκείνη τη στιγμή ένα από τα επίσημα CD του Debian τότε αυτό το CD θα θεωρηθεί αυτόματα σαν μια πηγή για το apt χωρίς να ρωτηθείτε.Θα το προσέξετε αυτό γιατί θα δείτε το CD να σαρώνεται από το σύστημα.
ko: 공식 CD-ROM 이 드라이브에 들어 있다면, 자동으로 CD-ROM 이 apt source로 설정될 것입니다. CD-ROM 이 검색되는 것을 통해 이 작업의 수행을 알 수 있을 것입니다.
pt: Se um CD-ROM oficial estiver na drive neste momento, então esse CD-ROM deve ser configurado automaticamente como uma fonte do apt sem lhe ser perguntado. Irá notar esta situação porque irá observar o CD-ROM a ser pesquisado.
ru: Если в этот момент в дисководе есть официальный компакт-диск, то этот диск должен настроиться автоматически в качестве источника apt без всяких указаний. Вы заметите это потому что увидите обращение к CD-ROM.
zh_cn: 如果此时驱动器内放有官方发布的 CD-ROM，那么 CD-ROM 将会被自动配置为 apt 源，而不会有提示。您可以发现系统会扫描您的光盘。
zh_tw: 如果此時光碟機內放有官方發佈的光碟，那麼光碟機將會被自動設定為 apt 來源，而不會有提示。您會發現系統掃瞄您的光碟。

source: For users without an official CD-ROM, you will be offered an array of choices for how Debian packages are accessed: FTP, HTTP, CD-ROM, or a local file system.
el: Αν δεν έχετε ένα επίσημο CD-ROM τότε θα σας δοθεί μια σειρά από επιλογές για τον τρόπο πρόσβασης στα πακέτα του Debian: FTP, HTTP, CD-ROM ή από ένα τοπικό σύστημα αρχείων.
ko: 공식 CD-ROM 이 없는 사용자를 위해 FTP, HTTP, CD-ROM, 또는 지역 파일시스템 등의 목록을 제공해 데비안 패키지들에 접근할 수 있는 방법을 선택할 수 있도록 합니다.
pt: Para utilizadores sem um CD-ROM oficial, ser-lhe-á oferecido um conjunto de escolhas da forma como os pacotes Debian são acedidos: FTP, HTTP, CD-ROM, ou um sistema de ficheiros local.
ru: Для пользователей без официального компакт-диска будет предложен список с выбором метода доступа к пакетам Debian: FTP, HTTP, CD-ROM или локальная файловая система.
zh_cn: 对于那些没有官方发布光盘的使用者，有一列选项会让您选择如果获取软件包： FTP、HTTP、CD-ROM 或者本地文件系统。
zh_tw: 對於那些沒有官方發佈光碟的使用者，有一列選項會讓您選擇如何取得軟體套件：FTP、HTTP、CD-ROM 或者本地檔案系統。

source: You should know that it's perfectly acceptable to have a number of different APT sources, even for the same Debian archive. <command>apt-get</command> will automatically pick the package with the highest version number given all the available versions. Or, for instance, if you have both an HTTP and a CD-ROM APT source, <command>apt-get</command> should automatically use the local CD-ROM when possible, and only resort to HTTP if a newer version is available there. However, it is not a good idea to add unnecessary APT sources, since this will tend to slow down the process of checking the network archives for new versions.
el: Θα πρέπει να ξέρετε ότι είναι απόλυτα θεμιτό να έχετε έναν διαφορετικό αριθμό από πηγές APT ακόμα και για την ίδια αρχειοθήκη Debian. To <command>apt-get</command> θα επιλέξει αυτόματα το πακέτο με τον νεώτερο (μεγαλύτερο) αριθμό έκδοσης από όλες τις διαθέσιμες εκδόσεις. Ή, για παράδειγμα, αν χρησιμοποιείτε ταυτόχρονα ένα CD και μια τοποθεσία HTTP σαν πηγές του APT, to <command>apt-get</command> θα χρησιμοποιήσει αυτόματα το τοπικό CD-ROM όταν αυτό είναι δυνατόν και θα προσφύγει στην πηγή HTTP μόνο να μια νεώτερη έκδοση ενός πακέτου είναι διαθέσιμη εκεί. Παρόλα αυτά δεν είναι καλή ιδέα να προσθέτετε μη απαραίτητες πηγές APT καθώς αυτό τείνει να επιβραδύνει τη διαδικασία του ελέγχου των διαδικτυακών αρχειοθηκών για νεώτερες εκδόσεις των πακέτων.
ko: 같은 데비안 아카이브라도 여러 개의 다른 APT source들을 가질 수 있다는 것을 알아 두세요. <command>apt-get</command>은 모든 가능한 버전 중에서 가장 높은 버전의 패키지를 자동으로 선택할 것입니다. 예를 들어 HTTP와 CD-ROM APT source가 있다면, <command>apt-get</command> 명령은 자동으로 가능 하다면 CD-ROM을 사용하고, 새로운 버전이 있는 경우에만 HTTP를 사용할 것입니다. 하지만, 필요없는 APT source들을 추가하는 것은 새 버전을 네트워크를 통해 검사하기 때문에 시스템을 느리게 할 수 있으므로 그리 좋은 생각이 아닙니다.
pt: Deverá saber que é perfeitamente aceitável ter uma quantidade de fontes APT diferentes, mesmo que seja para o mesmo repositório Debian. O <command>apt-get</command> irá escolher automaticamente o pacote com o número de versão mais alto dadas todas as versões disponíveis. Ou, por exemplo, se tive tanto uma fonte APT HTTP e um CD-ROM, o <command>apt-get</command> deverá usar automaticamente o CD-ROM local quando possível, e apenas recorrer ao HTTP se uma versão mais recente estiver disponível. No entanto, não é uma boa ideia adicionar fontes APT desnecessárias, uma vez que irá atrasar o processo de verificação de novas versões nos repositórios de rede.
ru: Вы должны знать, что допускается использование нескольких разных источников APT, даже для одного и того же архива Debian. <command>apt-get</command> автоматически выберет пакет с наибольшим номером версии среди всех доступных версий. Или, например, если у вас есть и HTTP и CD-ROM источники APT, то <command>apt-get</command> будет автоматически использовать локальный CD-ROM когда это возможно, и обратится к HTTP только если там есть более новая версия. Однако, добавлять ненужные источники APT не очень хорошая идея, поскольку это замедлит процесс поиска более новой версии из-за проверки сетевых архивов.
zh_cn: 您完全可以添加多个不同的 APT 源(甚至是同一 Debian 存档也可以)。<command>apt-get</command> 会自动挑选出软件包中的最新版本。例如，如果您同时使用 HTTP 和 CD-ROM 的 APT 源，<command>apt-get</command> 会在有新版本的时候采用 HTTP 源，没有新版本时自动采用 CD-ROM 源。虽然 APT 非常智能化，但仍然不建议您增加不必要的 APT 源，因为这会大降低检查网络存档中的新版本软件的速度。
zh_tw: 您完全可以添加多個不同的 APT 來源 (甚至是同一 Debian 檔案庫也可以)。<command>apt-get</command> 會自動挑選出軟體套件中的最新版本。例如，如果您同時使用 HTTP 和 CD-ROM 作為 APT 來源，<command>apt-get</command> 會在有新版本的時候採用 HTTP 來源，沒有新版本時自動採用 CD-ROM 來源。儘管如此，仍然不建議您增加不必要的 APT 來源，因為這會大降低檢查網路檔案庫中新版本軟體的速度。

source: Configuring Network Package Sources
el: Ρύθμιση των Δικτυακών πηγών για τα πακέτα
ko: 네트워크 패키지 소스(Sources) 설정
pt: Configurar As Fontes de Pacotes de Rede
ru: Настройка сетевых источников пакетов
zh_cn: 配置网络软件包源
zh_tw: 設定網路軟體套件來源

source: If you plan on installing the rest of your system via the network, the most common option is to select the <userinput>http</userinput> source. The <userinput>ftp</userinput> source is also acceptable, but tends to be somewhat slower making connections.
el: Αν σχεδιάζετε να εγκαταστήσετε το υπόλοιπο του συστήματός σας από το δίκτυο η πιο κοινή επιλογή που έχετε είναι μια πηγή <userinput>http</userinput>. Η πηγή <userinput>ftp</userinput> είναι επίσης αποδεκτή αλλά δίνει σχετικά πιο αργές συνδέσεις.
ko: 시스템의 나머지 부분을 네트워크를 통해 설치하려고 한다면, 일반적으로 <userinput>http</userinput> 소스를 선택합니다. <userinput>ftp</userinput> 소소도 괜찮습니다만, 연결을 만드는 데 약간 느립니다.
pt: Se pretender instalar o resto do seu sistema via rede, a opção mais comum é seleccionar a fonte <userinput>http</userinput>. Uma fonte <userinput>ftp</userinput> é também aceitável, mas tende a ser algo mais lento ao efectuar as ligações.
ru: Если вы планируете установить оставшуюся часть системы из сети, наиболее распространённым вариантом является выбор <userinput>http</userinput> источника. <userinput>ftp</userinput> источник тоже возможен, но приведёт к чуть более медленной установки соединения.
zh_cn: 如果您计划通过网络安装系统的其它部分，通常的作法是选择 <userinput>http</userinput> 源。当然，<userinput>ftp</userinput> 源也是可以的，只是在连接时会略慢一些。
zh_tw: 如果您計劃透過網路安裝系統的其它部分，常見的作法是選擇 <userinput>http</userinput> 來源。當然，<userinput>ftp</userinput> 來源也是可以的，只是在連接時會略慢一些。

source: The next step during the configuration of network package sources is to tell <command>apt-setup</command> which country you live in. This configures which of the official Debian Internet mirrors you will connect to. Depending on which country you select, you will be presented with a list of possible servers. It's generally fine to pick the one at the top of the list, but any of them should work. Note however that the mirror list provided by the installation was generated when this version of Debian was released and some mirrors may no longer be available.
el: Το επόμενο βήμα στη ρύθμιση των διαδικτυακών πηγών για τα πακέτα είναι η ενημέρωση του <command>apt-setup</command> για τη χώρα στην οποία ζείτε. Αυτό ρυθμίζει σε ποιον από τους επίσημους διαδικτυακούς καθρέφτες του Debian θα συνδεθείτε. Ανάλογα με τη χώρα που ζείτε θα δείτε μια λίστα με διαθέσιμους servers. Είναι γενικά εντάξει το να διαλέξετε έναν από την κορυφή της λίστας αλλά οποιοσδήποτε από αυτούς θα είναι εξίσου αποτελεσματικός. Προσέξτε όμως ότι η λίστα των καθρεφτών που δίνεται με την εγκατάσταση αυτή δημιουργήθηκε με την κυκλοφορία αυτής της έκδοσης του Debian και πιθανόν κάποιοι από αυτούς να μην είναι πια διαθέσιμοι.
ko: 네트워크 패키지 소스 설정의 다음 단계는 <command>apt-setup</command> 에게 당신이 살고 있는 나라를 알려주는 것입니다. 이 작업은 당신이 연결할 데비안 공식 인터넷 미러들 중의 하나를 설정합니다. 선택한 나라에 따라 가능한 서버들의 목록이 보여질 것입니다. 목록의 어느 것을 선택하더라도 괜찮습니다만, 보통 목록의 가장 위의 것을 선택합니다. 미러들의 목록은 데비안의 버전이 릴리즈 될 때 만들어 지기 때문에 어떤 미러들은 더이상 사용가능 하지 않을 수 있습니다.
pt: O próximo passo durante a configuração das fontes de pacotes por rede é informar o <command>apt-setup</command> em que país vive. Isto configura qual dos repositórios oficiais do Debian na Internet irá ligar-se. Dependendo do país que escolher, ser-lhe-á apresentada uma lista de possíveis servidores. Poderá escolher logo o primeiro da lista, no entanto qualquer outro deverá funcionar. De notar contudo que a lista de repositórios fornecida pela instalação foi gerada quando uma versão do Debian foi lançada e que alguns desses repositórios podem já não estar disponíveis.
ru: Следующим шагом при настройке сетевых источников пакетов является указание <command>apt-setup</command> в какой стране вы живёте. Это определяет к какому официальному серверу-зеркалу Debian в Интернет вы будете подключены. В зависимости от выбранной страны, вам будет предложен список возможных серверов. Обычно, хорошим является выбор одного из верхних в списке, хотя любой из них должен работать. Обратите внимание на то, что список серверов-зеркал, предлагаемых программой установки, формировался во время выпуска этой версии Debian, и некоторые из серверов-зеркал могут уже не работать.
zh_cn: 接下来您需要告诉 <command>apt-setup</command> 您生活在哪个国家。Debian会为您选择最近的官方 Debian 网络镜像。根据您选择的国家，程序会列出一些可能的服务器列表。通常选择最上面的一个，但所有服务器应该都是正常可用的。之后，进行测试，如果您发现任何问题，您应该选择另外一个。请注意，服务器列表是在发行 Debian 时生成的，在发行与您安装的这段时间内，一些镜像也许不在存在。
zh_tw: 接下來您需要告訴 <command>apt-setup</command> 您生活在哪個國家。Debian會為您選擇最近的官方 Debian 網路鏡像站。根據您選擇的國家，程式會列出一些可能的伺服器列表。通常選擇最上面的一個，但所有伺服器應該都是正常可用的。之後，進行測試，如果您發現任何問題，您應該選擇另外一個。請注意，伺服器列表是在發行 Debian 時生成的，在發行之後到您安裝的這段時間內，一些鏡像網站也許無法存取。
