Repository: xobs/debian-installer
Catalog: doc/manual/po/*/boot-installer.po
Languages: ko, pt, zh_tw

source: Even if you cannot boot from CD-ROM, you can probably install the Debian system components and any packages you want from CD-ROM. Simply boot using a different media, such as floppies. When it's time to install the operating system, base system, and any additional packages, point the installation system at the CD-ROM drive.
ko: CD-ROM에서 부팅할 수 없는 경우에도, CD-ROM에서 데비안 시스템 구성 요소와 꾸러미를 설치할 수 있습니다. 일단 플로피같은 다른 미디어를 이용해 부팅하십시오. 운영 체제, 베이스 시스템 및 다른 추가 꾸러미를 설치할 때가 되면 설치 시스템을 CD-ROM 드라이브로 맞춰 놓으십시오.
pt: Mesmo se não conseguir iniciar a partir do CD-ROM, poderá provavelmente instalar os componentes do Debian e qualquer pacote que deseje a partir do CD-ROM. Simplesmente arranque utilizando uma media diferente, tal como disquetes. Quanto for altura de instalar o sistema operativo, sistema base, e qualquer pacote adicional, aponte o sistema de instalação para a drive de CD-ROM.
zh_tw: 即便您不能從光碟開機，依然可以安裝光碟上面的 Debian 系統組件和所有軟體套件。只需要使用不同的媒介，例如軟碟來開機即可。當安裝作業系統、基礎系統和任意附加的軟體套件時只需指向安裝系統至光碟機即可。

source: If you have problems booting, see <xref linkend="boot-troubleshooting"/>.
ko: 부팅하는 데 문제가 있으면, <xref linkend="boot-troubleshooting"/> 부분을 참고하십시오.
pt: Se tiver problemas com o arranque, veja a <xref linkend="boot-troubleshooting"/>.
zh_tw: 如果您遇到開機方面的問題，請參閱 <xref linkend="boot-troubleshooting"/>。

source: To boot a CD-ROM from the Cyclone console prompt, use the command <command>boot cd0:cats.bin</command>
ko: Cyclone 콘솔 프롬프트에서 CD-ROM 부팅을 하려면, <command>boot cd0:cats.bin</command> 명령을 사용하십시오.
pt: Para iniciar de um CD-ROM a partir da prompt da consola Cyclone, use o comando <command>boot cd0:cats.bin</command>
zh_tw: 如果需要在 Cyclone 控制台提示符號下從光碟下開機，請使用指令 <command>boot cd0:cats.bin</command>

source: Booting from a CD-ROM
ko: CD-ROM에서 부팅하기
pt: Iniciar a partir de CD-ROM
zh_tw: 從光碟開機

source: Booting from Linux Using <command>LILO</command> or <command>GRUB</command>
ko: <command>LILO</command> 혹은 <command>GRUB</command>을 사용해 리눅스 부팅하기
pt: Iniciar a partir de Linux utilizando o <command>lilo</command> ou o <command>GRUB</command>
zh_tw: 使用 <command>LILO</command> 或 <command>GRUB</command> 啟動 Linux

source: To boot the installer from hard disk, you must first download and place the needed files as described in <xref linkend="boot-drive-files"/>.
ko: 하드 디스크에서 설치 프로그램을 부팅하려면, 먼저 <xref linkend="boot-drive-files"/>에서 설명한 필요한 파일들을 내려 받아 하드에 저장해야 합니다.
pt: Para arrancar o instalador a partir do disco rígido, terá primeiro de fazer o download e colocar os ficheiros necessários, como descrito na <xref linkend="boot-drive-files"/>.
zh_tw: 為了從硬碟開機安裝程式，您首先必須按照要求下載並且放置所需的文件，請參閱 <xref linkend="boot-drive-files"/>。

source: If you intend to use the hard drive only for booting and then download everything over the network, you should download the <filename>netboot/debian-installer/i386/initrd.gz</filename> file and its corresponding kernel. This will allow you to repartition the hard disk from which you boot the installer, although you should do so with care.
ko: 하드 드라이브를 부팅용으로만 사용하고 나머지는 모두 네트워크에서 받으려고 한다면, <filename>netboot/debian-installer/i386/initrd.gz</filename> 파일 및 해당 커널을 받아야 합니다. 설치 프로그램을 부팅한 다음에 하드 디스크를 다시 파티션할 수 있습니다. 단 주의를 기울여야 합니다.
pt: Se tenciona usar o disco rígido para arrancar e depois fazer o download de tudo através da rede, deverá fazer o download do ficheiro <filename>netboot/debian-installer/i386/initrd.gz</filename> e do kernel correspondente. Isto permitir-lhe-á reparticionar o disco rígido do qual o instalador inicia, deverá fazer isto com bastante cuidado.
zh_tw: 如果您只想用硬碟開機，然後從網路下載其他檔案，您需要下載 <filename>netboot/debian-installer/i386/initrd.gz</filename> 及其對應的核心。這將允許您重新分割您用於開機的硬碟。這裡需要小心操作。

source: Alternatively, if you intend to keep an existing partition on the hard drive unchanged during the install, you can download the <filename>hd-media/initrd.gz</filename> file and its kernel, as well as copy a CD iso to the drive (make sure the file is named ending in <literal>.iso</literal>). The installer can then boot from the drive and install from the CD image, without needing the network.
ko: 다른 방법으로, 하드 드라이브의 현재 파티션을 바꾸지 않고 유지하려면, <filename>hd-media/initrd.gz</filename> 파일과 그 커널을 받으시고, CD iso 파일도 드라이브에 복사해 놓으십시오 (파일 이름이 <literal>.iso</literal>로 끝나도록 하십시오). 그러면 설치 프로그램이 이 드라이브에서 부팅한 다음 네트워크 없이 그 CD 이미지에서 설치할 수 있습니다.
pt: Em alternativa, se pretende manter uma partição, existente no disco rígido, inalterada durante a instalação, poderá fazer o download do ficheiro <filename>hd-media/initrd.gz</filename> e do seu kernel, assim como uma copia do iso de CD para a drive (garanta que o ficheiro tem o nome que termine em <literal>.iso</literal>). O instalador poderá então arrancar a partir da drive e instalar a partir da imagem do CD, sem necessitar da rede.
zh_tw: 或者，如果您想要保持安裝硬碟原有分割區，可以下載 <filename>hd-media/initrd.gz</filename> 檔案及其核心，複製一個光碟 iso 檔到硬碟上 (確保文件名結尾是 <literal>.iso</literal>)。安裝程式就可以不使用網路而從硬碟開機，並且從光碟映像檔上安裝。

source: For <command>LILO</command>, you will need to configure two essential things in <filename>/etc/lilo.conf</filename>: <itemizedlist> <listitem><para> to load the <filename>initrd.gz</filename> installer at boot time; </para></listitem> <listitem><para> have the <filename>vmlinuz</filename> kernel use a RAM disk as its root partition. </para></listitem> </itemizedlist> Here is a <filename>/etc/lilo.conf</filename> example:
ko: <command>LILO</command>의 경우, <filename>/etc/lilo.conf</filename>에 있는 두 가지 중요한 부분을 설정해야 합니다: <itemizedlist> <listitem><para> 부팅할 때 <filename>initrd.gz</filename> 설치 프로그램을 읽어들여야 하고 </para></listitem> <listitem><para> <filename>vmlinuz</filename> 커널의 루트 파티션으로 램 디스크를 사용하도록 합니다. </para></listitem> </itemizedlist> 여기 예제 <filename>/etc/lilo.conf</filename> 파일이 있습니다:
pt: Para o <command>LILO</command>, necessitará de configurar 2 coisas essenciais em <filename>/etc/lilo.conf</filename>: <itemizedlist> <listitem><para> para carregar o instalador do <filename>initrd.gz</filename> em tempo de arranque; </para></listitem> <listitem><para> ter o kernel <filename>vmlinuz</filename> a usar uma RAM disk como partição de root. </para></listitem> </itemizedlist> Aqui está um exemplo do <filename>/etc/lilo.conf</filename>:
zh_tw: 如果採用 <command>LILO</command>，您需要在 <filename>/etc/lilo.conf</filename> 中設定兩件最基本的事情: <itemizedlist> <listitem><para> 在開機時載入 <filename>initrd.gz</filename> 安裝程式﹔</para></listitem> <listitem><para> 讓 <filename>vmlinuz</filename> 核心使用一個記憶體虛擬磁碟作為它的根分割區。</para></listitem> </itemizedlist> 這裡是一個 <filename>/etc/lilo.conf</filename> 的例子：

source: For more details, refer to the <citerefentry><refentrytitle>initrd</refentrytitle> <manvolnum>4</manvolnum></citerefentry> and <citerefentry><refentrytitle>lilo.conf</refentrytitle> <manvolnum>5</manvolnum></citerefentry> man pages. Now run <userinput>lilo</userinput> and reboot.
ko: 더 자세한 정보는, <citerefentry><refentrytitle>initrd</refentrytitle> <manvolnum>4</manvolnum></citerefentry> 및 <citerefentry><refentrytitle>lilo.conf</refentrytitle> <manvolnum>5</manvolnum></citerefentry> 맨페이지를 참고하십시오. 이제 <userinput>lilo</userinput>를 실행하고 다시 부팅하십시오.
pt: Para mais detalhes, veja as páginas do man <citerefentry><refentrytitle>initrd</refentrytitle> <manvolnum>4</manvolnum></citerefentry> e <citerefentry><refentrytitle>lilo.conf</refentrytitle> <manvolnum>5</manvolnum></citerefentry>. Agora execute <userinput>lilo</userinput> e reinicie.
zh_tw: 欲獲知更多細節，請參閱 <citerefentry><refentrytitle>initrd</refentrytitle> <manvolnum>4</manvolnum></citerefentry> 和 <citerefentry><refentrytitle>lilo.conf</refentrytitle> <manvolnum>5</manvolnum></citerefentry> man 手冊。現在執行 <userinput>lilo</userinput> 並且重新啟動。

source: The procedure for <command>GRUB</command> is quite similar. Locate your <filename>menu.lst</filename> in the <filename>/boot/grub/</filename> directory (sometimes in the <filename>/boot/boot/grub/</filename>), add the following lines: <informalexample><screen> title New Install kernel (hd0,0)/boot/newinstall/vmlinuz root=/dev/ram0 ramdisk_size=12000 initrd (hd0,0)/boot/newinstall/initrd.gz </screen></informalexample> and reboot. <phrase condition="sarge">If the boot fails, you can try adding <userinput>devfs=mount,dall</userinput> to the <quote>kernel</quote> line. </phrase>
ko: <command>GRUB</command> 사용법은 아주 비슷합니다. <filename>menu.lst</filename> 파일을 <filename>/boot/grub/</filename> 디렉토리에 (어떤 경우는 <filename>/boot/boot/grub/</filename>) 놓고, 다음 줄을 추가하십시오: <informalexample><screen> title New Install kernel (hd0,0)/boot/newinstall/vmlinuz root=/dev/ram0 ramdisk_size=12000 initrd (hd0,0)/boot/newinstall/initrd.gz </screen></informalexample> 그리고 다시 부팅하십시오. 부팅이 실패하면 <quote>kernel</quote> 줄에 <userinput>devfs=mount,dall</userinput>을 추가해 보십시오.
pt: O procedimento para o <command>GRUB</command> é bastante semelhante. Localize o seu <filename>menu.lst</filename> na directoria <filename>/boot/grub/</filename> (por vezes em <filename>/boot/boot/grub/</filename>), e adicione as seguintes linhas: <informalexample><screen> title New Install kernel (hd0,0)/boot/newinstall/vmlinuz root=/dev/ram0 ramdisk_size=12000 initrd (hd0,0)/boot/newinstall/initrd.gz </screen></informalexample> e reinicie. <phrase condition="sarge">Se o arranque falhar, pode tentar adicionar <userinput>devfs=mount,dall</userinput> à linha <quote>kernel</quote> </phrase>.
zh_tw: 採用 <command>GRUB</command> 的設定過程也很相似。在 <filename>/boot/grub/</filename> 目錄下 (有時會是 <filename>/boot/boot/grub/</filename>) 找出您的 <filename>menu.lst</filename>，加入幾行：<informalexample><screen> title New Install kernel (hd0,0)/boot/newinstall/vmlinuz root=/dev/ram0 ramdisk_size=12000 initrd (hd0,0)/boot/newinstall/initrd.gz </screen></informalexample> 並重開機。<phrase condition="sarge">如果開機失敗，您可以嘗試在 <quote>kernel</quote> 行添加 <userinput>devfs=mount,dall</userinput>。</phrase>

source: Note that the value of the <userinput>ramdisk_size</userinput> may need to be adjusted for the size of the initrd image. From here on, there should be no difference between <command>GRUB</command> or <command>LILO</command>.
ko: <userinput>ramdisk_size</userinput>의 값을 initrd 이미지 크기에 따라 조정해야 할 수도 있습니다. 이 이후부터는 <command>GRUB</command>와 <command>LILO</command> 사이에 차이점이 없습니다.
pt: Note que para o valor de <userinput>ramdisk_size</userinput> poderá necessitar de ser ajustado para o tamanho da imagem do initrd. A partir daqui, não deverá haver diferenças entre o <command>GRUB</command> ou o <command>LILO</command>.
zh_tw: 注意 <userinput>ramdisk_size</userinput> 的值也許需要調整至 initrd 映像的大小。從此之後，採用 <command>GRUB</command> 或 <command>LILO</command> 都沒區別。

source: Booting from USB Memory Stick
ko: USB 메모리 스틱에서 부팅하기
pt: Iniciar a partir de um Stick de Memória USB
zh_tw: 從 USB 隨身碟開機

source: Let's assume you have prepared everything from <xref linkend="boot-dev-select"/> and <xref linkend="boot-usb-files"/>. Now just plug your USB stick into some free USB connector and reboot the computer. The system should boot up, and you should be presented with the <prompt>boot:</prompt> prompt. Here you can enter optional boot arguments, or just hit &enterkey;.
ko: <xref linkend="boot-dev-select"/> 및 <xref linkend="boot-usb-files"/>의 모든 것을 준비했다고 하면, USB 스틱을 빈 USB 커넥터에 꼽고 컴퓨터를 다시 부팅하십시오. 시스템이 부팅해서 <prompt>boot:</prompt> 프롬프트가 나와야 합니다. 거기에서 부팅 파라미터를 추가로 넣을 수도 있고, 그냥 &enterkey;를 누를 수도 있습니다.
pt: Vamos assumir que tem tudo preparado a partir na <xref linkend="boot-dev-select"/> e da <xref linkend="boot-usb-files"/>. Agora basta ligar a sua pen USB em algum dos conectores USB e reiniciar o computador. O sistema deverá arrancar e você deverá ser presenteado com a linha de comandos <prompt>boot:</prompt>. Aqui poderá introduzir argumentos de arranque opcionais, ou então simplesmente pressionar &enterkey;.
zh_tw: 假設您已經準備好了從 <xref linkend="boot-dev-select"/> 到 <xref linkend="boot-usb-files"/> 的所有步驟。現在只需要插入您的 USB 隨身碟到一個空的 USB 插槽並且重新啟動電腦。系統應該能夠開機，並且您會看到 <prompt>boot:</prompt> 提示符號。您可以輸入一些開機選項，或者只是按下 &enterkey;。

source: In case your computer doesn't support booting from USB memory devices, you can still use a single floppy to do the initial boot and then switch to USB. Boot your system as described in <xref linkend="floppy-boot"/>; the kernel on the boot floppy should detect your USB stick automatically. When it asks for the root floppy, simply press &enterkey;. You should see &d-i; starting.
ko: 컴퓨터가 USB 메모리 장치에서 부팅을 지원하지 않는 경우, 플로피로 부팅한 다음에 USB로 바꿀 수 있습니다. <xref linkend="floppy-boot"/>에 설명된 대로 부팅하십시오. 부트 플로피의 커널은 USB 스틱을 자동으로 찾아낼 것입니다. 루트 플로피가 필요한 시점에, &enterkey;를 누르십시오. 그러면 &d-i;가 시작할 것입니다.
pt: No caso do seu computador não suportar arranque a partir de dispositivos de memória USB, poderá na mesma usar uma única disquete para fazer o arranque inicial e depois mudar para USB. Arranque o seu sistema conforme descrito na <xref linkend="floppy-boot"/>; o kernel na disquete de arranque deverá detectar a sua pen USB automaticamente. Quando lhe perguntar pela disquete root, simplesmente pressione &enterkey;. Deverá ver o &d-i; a iniciar.
zh_tw: 如果您的電腦不支援從 USB 隨身碟設備開機，您也可以採用單張軟碟來開機並且切換至 USB。根據 <xref linkend="floppy-boot"/>，開機軟碟中的核心應該能夠自動偵測您的 USB 隨身碟。當它要求根軟碟的時候，只需簡單敲入 &enterkey;。您應該看到 &d-i; 開始執行。

source: Booting from Floppies
ko: 플로피에서 부팅하기
pt: Iniciar de Disquetes
zh_tw: 從軟碟開機

source: You will have already downloaded the floppy images you needed and created floppies from the images in <xref linkend="create-floppy"/>.
ko: 필요한 플로피 이미지를 내려받아서 <xref linkend="create-floppy"/>에 설명한 대로 이미지에서 플로피를 만듭니다.
pt: Poderá já ter feito download das imagens das disquete que necessita e ter criado as disquetes a partir das imagens na <xref linkend="create-floppy"/>.
zh_tw: 您可能已經下載了所需要得軟碟映像，並且根據這些映像建立了軟碟 <xref linkend="create-floppy"/>。

source: To boot from the installer boot floppy, place it in the primary floppy drive, shut down the system as you normally would, then turn it back on.
ko: 설치 프로그램의 부트 플로피에서 부팅하려면, 플로피를 첫 번째 플로피 드라이브에 넣고, 평소에 하던 방법대로 시스템을 끈 다음 다시 켜십시오.
pt: Para arrancar a partir da disquete de arranque do instalador, coloque a disquete na drive de disquetes primária, desligue o sistema como faria normalmente, e de seguida lige-o outra vez.
zh_tw: 從軟碟開機安裝程式需要放置軟碟至主軟碟機。按照您平時的習慣關閉系統，然後重新啟動。

source: For installing from an LS-120 drive (ATAPI version) with a set of floppies, you need to specify the virtual location for the floppy device. This is done with the <emphasis>root=</emphasis> boot argument, giving the device that the ide-floppy driver maps the device to. For example, if your LS-120 drive is connected as the first IDE device (master) on the second cable, you enter <userinput>linux root=/dev/hdc</userinput> at the boot prompt. Installation from LS-120 is only supported by 2.4 and later kernels.
ko: 플로피를 이용해 LS-120 드라이브에서 (ATAPI 버전) 설치하는 경우, 플로피 장치의 가상 위치를 지정해야 합니다. <emphasis>root=</emphasis> 부팅 파라미터를 사용해, ide-floppy 드라이버가 어느 장치로 매핑되는 지 장치를 지정합니다. 예를 들어, LS-120 드라이브가 두 번째 케이블의 첫 번째 (master) IDE 장치에 연결되어 있는 경우, 부팅 프롬프트에서 <userinput>linux root=/dev/hdc</userinput>라고 입력합니다. LS-120에서 설치하는 건 2.4 이후의 커널에서만 지원합니다.
pt: Para instalar a partir de uma drive LS-120 (versão ATAPI) com um conjunto de disquetes, necessita de especificar a localização virtual para o dispositivo de disquetes. Isto é feito com o argumento de arranque <emphasis>root=</emphasis>, dando o dispositivo para onde o driver ide-floppy mapeia o dispositivo. Por exemplo, se a sua drive LS-120 está conectada no primeiro dispositivo IDE (master) no segundo cabo, deverá introduzir <userinput>linux root=/dev/hdc</userinput> na linha de comandos de arranque. Instalação a partir de LS-120 apenas é suportada em kernel 2.4 e posteriores.
zh_tw: 如果想在 LS-120 磁碟機 (ATAPI 版本) 使用這些軟碟，您需要指定這些軟碟設備的虛擬位址。這個可以透過 <emphasis>root=</emphasis> 開機參數來指定映射的 ide-floppy 磁碟機名稱來完成。例如，如果您的 LS-120 磁碟機連接到第二條排線上的第一個 IDE 設備 (master)，那麼在提示符號下輸入 <userinput>linux root=/dev/hdc</userinput>。從 LS-120 上安裝只為 2.4 及其以後版本的核心支援。

source: Note that on some machines, <keycombo><keycap>Control</keycap> <keycap>Alt</keycap> <keycap>Delete</keycap></keycombo> does not properly reset the machine, so a <quote>hard</quote> reboot is recommended. If you are installing from an existing operating system (e.g., from a DOS box) you don't have a choice. Otherwise, please do a hard reboot when booting.
ko: 몇몇 기계에서는 <keycombo><keycap>Control</keycap> <keycap>Alt</keycap> <keycap>Delete</keycap></keycombo> 키를 눌러도 컴퓨터를 리셋하지 않기 때문에, <quote>하드</quote> 리부팅을 권장합니다. 기존 운영 체제에서 설치하는 경우에는 (예를 들어 DOS에서) 다른 방법이 없습니다. 그 외의 경우에는 항상 부팅할 때 하드 리부팅을 하십시오.
pt: Note que em algumas máquinas, <keycombo><keycap>Control</keycap> <keycap>Alt</keycap> <keycap>Delete</keycap></keycombo> não faz reset à máquina portanto é recomendado um <quote>hard</quote> reboot. Se está a instalar a partir de um sistema operativo já existente (p.e., a partir de uma máquina com DOS) não terá escolha. Caso contrário, por favor, faça um hard reboot quando arrancar.
zh_tw: 注意有些機器使用，<keycombo><keycap>Control</keycap> <keycap>Alt</keycap> <keycap>Delete</keycap></keycombo> 不能重新啟動系統，所以建議使用<quote>硬</quote>重開機。如果您從一個既有的作業系統上安裝 (例如從 DOS 上) 您不需要這樣。否則，請用硬重開機的方法來開機。

source: The floppy disk will be accessed, and you should then see a screen that introduces the boot floppy and ends with the <prompt>boot:</prompt> prompt.
ko: 플로피 디스크를 읽게 됩니다. 그 다음에 부트 플로피에 대해 소개하는 화면이 나오고 마지막에 <prompt>boot:</prompt> 프롬프트가 나옵니다.
pt: A disquete irá ser acedida e deverá ver um ecrã que introduz a disquete de arranque e acaba com a prompt <prompt>boot:</prompt>.
zh_tw: 讀完軟碟後，您將看到螢幕上有一段有關開機軟碟的介紹，並且結尾是 <prompt>boot:</prompt> 提示符號。

source: Once you press &enterkey;, you should see the message <computeroutput>Loading...</computeroutput>, followed by <computeroutput>Uncompressing Linux...</computeroutput>, and then a screenfull or so of information about the hardware in your system. More information on this phase of the boot process can be found below in <xref linkend="kernel-msgs"/>.
ko: &enterkey;를 누르면, <computeroutput>Loading...</computeroutput> 메세지 다음에, <computeroutput>Uncompressing Linux...</computeroutput>라고 나오고, 시스템의 하드웨어에 관한 여러가지 정보가 화면 가득히 나옵니다. 이 부팅 과정에 대한 더 자세한 정보는 아래의 <xref linkend="kernel-msgs"/>에 있습니다.
pt: Uma vez pressionado &enterkey; deverá ver a mensagem <computeroutput>Loading...</computeroutput>, seguida de <computeroutput>Uncompressing Linux...</computeroutput>, e depois um ecrã de informação sobre o hardware no seu sistema. Mais informação deste passo do processo de arranque pode ser encontrada na <xref linkend="kernel-msgs"/>.
zh_tw: 一旦您按下 &enterkey;，您應該能夠看到 <computeroutput>Loading...</computeroutput> 消息，並且接下來是 <computeroutput>Uncompressing Linux...</computeroutput>，然後是一些有關您系統的硬體資訊。想知道更多有關這段開機過程的資訊，請參考 <xref linkend="kernel-msgs"/>。

source: After booting from the boot floppy, the root floppy is requested. Insert the root floppy and press &enterkey;, and the contents are loaded into memory. The installer program <command>debian-installer</command> is automatically launched.
ko: 부트 플로피에서 부팅한 다음, 루트 플로피를 요청합니다. 루트 플로피를 넣고 &enterkey;를 누르십시오. 그러면 루트 플로피의 내용을 메모리에 읽어들입니다. 설치 프로그램 <command>debian-installer</command>를 자동으로 실행합니다.
pt: Após arrancar a partir da disquete de arranque, a disquete de root é pedida. Insira a disquete root e pressione &enterkey;, e os conteúdos serão carregados para a memória. O programa instalador <command>debian-installer</command> é lançado automaticamente.
zh_tw: 軟碟開機後需要根軟碟。請插入根軟碟並且輸入 &enterkey;，然後其中的內容會被載入記憶體。安裝程式 <command>debian-installer</command> 會自動啟動。

source: There are various ways to do a TFTP boot on i386.
ko: i386에서 TFTP 부팅을 하는 여러 가지 방법이 있습니다.
pt: Existem várias maneiras fazer um arranque TFTP em i386.
zh_tw: 在 i386 架構上有很多方法用 TFTP 進行開機。

source: NIC or Motherboard that support PXE
ko: PXE를 지원하는 NIC 혹은 마더보드
pt: NIC ou Motherboards que suportam PXE
zh_tw: 支援 PXE 的網卡或者主機板

source: It could be that your Network Interface Card or Motherboard provides PXE boot functionality. This is a <trademark class="trade">Intel</trademark> re-implemention of TFTP boot. If so you may be able to configure your BIOS to boot from the network.
ko: 네트워크 인터페이스 카드나 마더보드에서 PXE 부팅 기능을 지원할 수도 있습니다. PXE는 <trademark class="trade">Intel</trademark>에서 TFTP 부팅을 다시 만든 것입니다. PXE를 지원하는 경우 네트워크 부팅을 하도록 BIOS를 설정할 수 있을 것입니다.
pt: Pode acontecer que a sua Network Interface Card (NIC, ou placa de rede), ou a sua Motherboard providencie a funcionalidade de arranque PXE. Isto é uma re-implementação da <trademark class="trade">Intel</trademark> do arranque TFTP. Se tal acontecer, ser-lhe-á possível configurar a sua BIOS para arrancar pela rede.
zh_tw: 您的網卡或者主機板可能已經提供了 PXE 開機功能。這 <trademark class="trade">Intel</trademark> TFTP 開機的再實作。如果是這樣，也許可以能夠設定您的 BIOS 來用網路進行開機。

source: NIC with Network BootROM
ko: 네트워크 부트롬이 들어 있는 NIC
pt: NIC (placa de rede) com Network bootROM
zh_tw: 採用 Network BootROM 的網卡

source: It could be that your Network Interface Card provides TFTP boot functionality.
ko: 네트워크 인터페이스 카드에서 TFTP 부팅 기능을 지원할 수도 있습니다.
pt: Poderá acontecer que a sua Network Interface Card (NIC, ou placa de rede), providencie a funcionalidade de arranque TFTP.
zh_tw: 您的網卡很有可能提供了 TFTP 開機功能。

source: Let us (<email>&email-debian-boot-list;</email>) know how did you manage it. Please refer to this document.
ko: 어떻게 했는 지 알려 주십시오 (<email>&email-debian-boot-list;</email>). 이 문서를 언급해 주십시오.
pt: Diga-nos(<email>&email-debian-boot-list;</email>) como o conseguiu fazer. Por favor, refira-se a este documento.
zh_tw: 請讓我們知道 (<email>&email-debian-boot-list;</email>) 您如何操作，並參考此文件。

source: The <ulink url="http://www.etherboot.org">etherboot project</ulink> provides bootdiskettes and even bootroms that do a TFTPboot.
ko: <ulink url="http://www.etherboot.org">etherboot project</ulink>에는 TFTPboot를 할 수 있는 부팅 디스켓과 부트롬이 있습니다.
pt: O <ulink url="http://www.etherboot.org"> projecto etherboot</ulink> providencia disquetes de arranque e mesmo bootroms que fazem TFTPboot.
zh_tw: <ulink url="http://www.etherboot.org">etherboot project</ulink> 提供了為 TFTP 開機所需要的開機軟碟甚至是開機 ROMS 。

source: The Boot Prompt
ko: 부팅 프롬프트
pt: A prompt de Arranque
zh_tw: 開機提示

source: When the installer boots, you should be presented with a friendly graphical screen showing the Debian logo and the boot prompt: <informalexample><screen> Press F1 for help, or ENTER to boot: </screen></informalexample> At the boot prompt you can either just press &enterkey; to boot the installer with default options or enter a specific boot method and, optionally, boot parameters.
ko: 설치 프로그램이 부팅할 때, 데비안 로고와 다음 부팅 프롬프트가 표시되는 친근한 그래픽 화면이 나타납니다: <informalexample><screen> Press F1 for help, or ENTER to boot: </screen></informalexample> 부팅 프롬프트에서 그냥 &enterkey; 키를 눌러 기본 옵션으로 설치 프로그램을 부팅할 수도 있고, 특정 부팅 방법이나 부팅 파라미터를 입력할 수도 있습니다.
pt: Quando o instalador inicia, ser-lhe-á apresentado um ecrã gráfico amistoso que mostra o logo de Debian e a linha de comandos de arranque: <informalexample><screen> Carregue em F1 para ajuda, ou ENTER para iniciar: </screen></informalexample> Na linha de comandos de arranque você pode apenas carregar em &enterkey; para iniciar o instalador com as opções por omissão ou pode escrever um método de arranque específico e, opcionalmente, parâmetros de arranque.
zh_tw: 安裝程式啟動後，您應該會看到一個友善的畫面，顯示著 Debian 的標誌，以及啟動提示：<informalexample><screen> Press F1 for help, or ENTER to boot: </screen></informalexample> 在提示號下您可以直接按下 &enterkey; 來使用預設選項啟動安裝程式，或者輸入參數以指定您要使用的啟動方式。
