Repository: xobs/debian-installer
Catalog: doc/manual/po/*/boot-installer.po
Languages: ko, pt, zh_tw

source: To configure the client to support TFTP booting, start by booting to EFI and entering the <guimenu>Boot Option Maintenance Menu</guimenu>. <itemizedlist> <listitem><para> Add a boot option. </para></listitem> <listitem><para> You should see one or more lines with the text <guimenuitem>Load File [Acpi()/.../Mac()]</guimenuitem>. If more than one of these entries exist, choose the one containing the MAC address of the interface from which you'll be booting. Use the arrow keys to highlight your choice, then press enter. </para></listitem> <listitem><para> Name the entry <userinput>Netboot</userinput> or something similar, save, and exit back to the boot options menu. </para></listitem> </itemizedlist> You should see the new boot option you just created, and selecting it should initiate a DHCP query, leading to a TFTP load of <filename>elilo.efi</filename> from the server.
ko: TFTP 부팅을 지원하도록 클라이언트를 설정하려면, EFI를 부팅해서 <guimenu>Boot Option Maintenance Menu</guimenu>로 들어가십시오. <itemizedlist> <listitem><para> 부트 옵션을 추가하십시오. </para></listitem> <listitem><para> <guimenuitem>Load File [Acpi()/.../Mac()]</guimenuitem> 텍스트가 들어 있는 줄을 볼 수 있을 것입니다. 이런 항목이 여러 줄 있을 때, 부팅하려는 인터페이스의 MAC 주소가 들어 있는 항목을 선택하십시오. 화살표 키로 반전시킨 다음 enter를 누르십시오. </para></listitem> <listitem><para> 그 항목을 <userinput>Netboot</userinput>와 같이 이름 짓고, 저장하고, 부트 옵션 메뉴로 나가십시오. </para></listitem> </itemizedlist> 이제 방금 만든 새로운 부트 옵션을 볼 수 있을 것입니다. 그 옵션을 선택하면 DHCP 쿼리를 하고, 서버에서 <filename>elilo.efi</filename> 파일을 서버에서 가져옵니다.
pt: Para configurar o cliente para suportar arranque por TFTP, comece por arrancar em EFI e entre em <guimenu>Boot Option Maintenance Menu</guimenu>. <itemizedlist> <listitem><para> Adicione uma opção de arranque. </para></listitem> <listitem><para> Deve ver uma ou mais linhas com o texto <guimenuitem>Load File [Acpi ()/.../Mac()]</guimenuitem>. Se existir mais de uma destas entradas, escolha a que tem o endereço MAC do seu interface a partir do qual você irá arrancar. Utilize as teclas com setas para indicar a sua escolha, de seguida carregue em enter. </para></listitem> <listitem><para> Dê o nome <userinput>Netboot</userinput> ou algo similar, grave, e saia de novo para o menu de opções de arranque. </para></listitem> </itemizedlist> Você deve ver a nova opção de arranque acabada de criar, e ao selecciona-la deve iniciar um query DHCP, levando a carregar <filename>elilo.efi</filename> via TFTP a partir do servidor.
zh_tw: 如果要設定支援 TFTP 開機的客戶端，只需要開機至 EFI，然後進入 <guimenu>Boot Option Maintenance Menu</guimenu>。<itemizedlist> <listitem><para> 加入一個開機選項。</para></listitem> <listitem><para> 您會看到一行或多行含有 <guimenuitem>Load File [Acpi()/.../Mac()]</guimenuitem> 的文字。如果存在一個以上的選項，選擇您需要您要啟動的機器的 MAC 位址的選項。使用方向鍵反白選擇，然後按 Enter。</para></listitem> <listitem><para> 為此選項命名，如 <userinput>Netboot</userinput> 或者相似的，儲存然後退回至開機選項選單。</para></listitem> </itemizedlist> 您現在應該能夠看到剛剛建立的新開機選項，選擇後應該會初始化一個 DHCP 查詢，然後會從伺服器載入 <filename>elilo.efi</filename>。

source: The boot loader will display its prompt after it has downloaded and processed its configuration file. At this point, the installation proceeds with the same steps as a CD install. Select a boot option as in above and when the kernel has completed installing itself from the network, it will start the Debian Installer.
ko: 부트로더에서 설정 파일을 내려받고 관련된 처리를 한 다음 프롬프트를 표시합니다. 여기까지 오면, CD 설치와 마찬가지로 설치를 진행합니다. 위에서와 같이 부트 옵션을 선택하시고 네트워크에서 커널 설치를 마치면, 데비안 설치 프로그램이 시작합니다.
pt: O gestor de arranque irá mostrar a sua linha de comandos após ter feito o download e processado o seu ficheiro de configuração. Neste ponto, a instalação continua com os mesmos passos do que a instalação por CD. Escolha uma opção de arranque tal como em cima quando o kernel completar de se instalar a ele próprio a partir da rede, e irá iniciar o Instalador Debian.
zh_tw: 在下載並且處理設定檔後，boot-loader 將顯示它的提示符號。從這裡開始，安裝過程將和光碟安裝是同樣的過程。完成從網路的自動安裝核心後，選擇一個如同前文提到的開機選項，它將開始 Debian 安裝程式。

source: Proceed to the next chapter to continue the installation where you will set up the language locale, network, and the disk partitions.
ko: 다음 장으로 가서 언어 로케일, 네트워크, 디스크 파티션 설정을 계속 하십시오.
pt: Continue para o próximo capítulo para continuar a instalação onde irá configurar idioma do locale, rede, e partições de disco.
zh_tw: 下一章將繼續安裝過程，在那裡您將設定語言區域，網路以及磁碟分割區。

source: Choosing an Installation Method
ko: 설치 방법 고르기
pt: Escolher um Método de Instalação
zh_tw: 選擇安裝方法

source: Some &arch-title; subarchs have the option of booting using either a 2.4.x or 2.2.x linux kernel. When such a choice exists, try the 2.4.x linux kernel. The installer should also require less memory when using a 2.4.x linux kernel as 2.2.x support requires a fixed-sized ramdisk and 2.4.x uses tmpfs.
ko: 몇몇 &arch-title; 서브 아키텍쳐는 2.4.x 아니면 2.2.x 리눅스 커널중에 하나를 선택해 부팅하는 옵션이 있습니다. 그렇게 선택할 수 있는 경우, 2.4.x 리눅스 커널을 선택하십시오. 2.4.x 리눅스 커널을 사용할 때 오히려 더 작은 메모리를 사용합니다. 2.2.x는 고정된 크기의 램디스크를 사용하고 2.4.x는 tmpfs를 사용하기 때문입니다.
pt: Algumas sub-arquitecturas &arch-title; têm a opção de iniciar utilizando qualquer kernel linux seja 2.4.x ou 2.2.x. Quando existem tais escolhas, tente o kernel linux 2.4.x. O instalador requer menos memória utilizando um kernel linux 2.4.x o suporte para o kernel linux 2.2.x requerem um tamanho fixo de ramdisk e o 2.4.x utilizam tmpfs.
zh_tw: 一些 &arch-title; 子架構可以選擇使用從 2.4.x 或 2.2.x linux 核心啟動。如果以，請使用 2.4.x linux 核心。使用 2.4.x linux 核心的安裝程式要求較少的記憶體， 因為 2.2.x 支援需要固定大小的 ramdisk 而 2.4.x 使用 tmpfs。

source: If you are using a 2.2.x linux kernel, then you need to use the &ramdisksize; kernel parameter.
ko: 2.2.x 커널을 사용한다면, &ramdisksize; 커널 변수를 설정할 필요가 있습니다.
pt: Se está a utilizar um kernel linux 2.2.x, então necessita utilizar &ramdisksize;.

source: Also, if you are using a 2.2.x linux kernel, then you must make sure you are using a ramdisk built to accommodate it, see the <ulink url="&disturl;/main/installer-&architecture;/current/images/MANIFEST">MANIFEST</ulink>. In general, this means you need to use the initrd22.gz ramdisk from the respective directory.
ko: 또한, 2.2.x 리눅스 커널을 사용한다면, 반드시 거기 맞는 램디스크를 사용해야 합니다. <ulink url="&disturl;/main/installer-&architecture;/current/images/MANIFEST">MANIFEST</ulink>를 참고하십시오. 일반적으로 보통 해당 디렉토리의 initrd22.gz 램디스크를 사용해야 하면 됩니다.
pt: Se está a utilizar um kernel linux 2.2.x, então terá de se certificar que está a utilizar um ramdisk criado para o alojar, veja o <ulink url="&disturl;/main/installer-&architecture;/current/images/MANIFEST">MANIFEST</ulink>. Normalmente, isto significa que necessita utilizar o ramdisk initrd22.gz a partir do respectivo directório.

source: Make sure <userinput>root=/dev/ram</userinput> is one of your kernel parameters.
ko: <userinput>root=/dev/ram</userinput>을 커널 파라미터로 사용하십시오.
pt: Certifique-se que <userinput>root=/dev/ram</userinput> é um dos parâmetros do kernel.
zh_tw: 確保 <userinput>root=/dev/ram</userinput> 使用您要用的核心。

source: If you're having trouble, check <ulink url="&url-m68k-cts-faq;">cts's &arch-title; debian-installer FAQ</ulink>.
ko: 문제가 있으면, <ulink url="&url-m68k-cts-faq;">cts's &arch-title; debian-installer FAQ</ulink>를 참고하십시오.
pt: Se está a ter dificuldades, verifique <ulink url="&url-m68k-cts-faq;">cts's &arch-title; debian-installer FAQ</ulink>.
zh_tw: 如果碰到麻煩，請參閱 <ulink url="&url-m68k-cts-faq;">cts's &arch-title; debian-installer 常見問答集</ulink>。

source: The only method of installation available to amiga is the hard drive (see <xref linkend="m68k-boot-hd"/>). <emphasis>In other words the cdrom is not bootable.</emphasis>
ko: Amiga에서 설치하는 유일한 방법은 하드 드라이브입니다. (<xref linkend="m68k-boot-hd"/> 참고) <emphasis>즉 CD-ROM에서 부팅할 수 없습니다.</emphasis>
pt: O único método de instalação disponível para o amiga através do disco rígido (veja a <xref linkend="m68k-boot-hd"/>). <emphasis> Por outras palavras não é possível iniciar a partir de cdrom.</emphasis>
zh_tw: amiga 僅支援從硬碟安裝方式 (請參閱 <xref linkend="m68k-boot-hd"/>)。 <emphasis>也就是說光碟機無法開機</emphasis>。

source: Amiga does not currently work with bogl, so if you are seeing bogl errors, you need to include the kernel parameter <userinput>debian-installer/framebuffer=false</userinput>.
ko: 현재 Amiga에서는 bogl이 동작하지 않습니다. bogl 오류가 있으면, 커널 파라미터에 <userinput>debian-installer/framebuffer=false</userinput>를 포함해야 합니다.
pt: O Amiga actualmente não trabalha com o bogl, se encontrar erros bogl, terá de incluir no kernel o parâmetro <userinput>debian-installer/framebuffer=false</userinput>.
zh_tw: 目前 Amiga 不能與 bogl 一起工作，如果您看到 bogl 錯誤，您需要使用將下面核心參數 <userinput>debian-installer/framebuffer=false</userinput>。

source: The installer for atari may be started from either the hard drive (see <xref linkend="m68k-boot-hd"/>) or from floppies (see <xref linkend="boot-from-floppies"/>). <emphasis>In other words the cdrom is not bootable.</emphasis>
ko: Atari용 설치 프로그램은 하드 드라이브에서 시작할 수도 있고 (<xref linkend="m68k-boot-hd"/> 참고) 플로피에서 시작할 수도 있습니다 (<xref linkend="boot-from-floppies"/> 참고). <emphasis>즉 CD-ROM에서 부팅할 수 없습니다.</emphasis>
pt: O instalador para atari tanto pode iniciar de disco rígido (veja a <xref linkend="m68k-boot-hd"/>) ou de disquetes (veja <xref linkend="boot-from-floppies"/>). <emphasis>Por outras palavras não é possível iniciar de cdrom.</emphasis>
zh_tw: Atari 安裝程式可以從硬碟 (請參閱 <xref linkend="m68k-boot-hd"/>) 或軟碟 (請參閱 <xref linkend="boot-from-floppies"/>)。<emphasis>也就是說光碟機無法開機</emphasis>。

source: Atari does not currently work with bogl, so if you are seeing bogl errors, you need to include the kernel parameter <userinput>debian-installer/framebuffer=false</userinput>.
ko: 현재 Atari에서는 bogl이 동작하지 않습니다. bogl 오류가 있으면, 커널 파라미터에 <userinput>debian-installer/framebuffer=false</userinput>를 포함해야 합니다.
pt: Atari actualmente não trabalha com bogl, se está tendo erros bogl, terá de incluir no kernel o parâmetro <userinput>debian-installer/framebuffer=false</userinput>.
zh_tw: 目前 Atari 不能與 bogl 一起工作，如果您看到 bogl 錯誤，應該使用下面核心參數 <userinput>debian-installer/framebuffer=false</userinput>。

source: The installer for BVME6000 may be started from a cdrom (see <xref linkend="m68k-boot-cdrom"/>), floppies (see <xref linkend="boot-from-floppies"/>), or the net (see <xref linkend="boot-tftp"/>).
ko: BVME6000용 설치 프로그램은 CD-ROM (<xref linkend="m68k-boot-cdrom"/> 참고), 플로피 (<xref linkend="boot-from-floppies"/> 참고), 혹은 네트워크에서 (<xref linkend="boot-tftp"/> 참고) 실행할 수 있습니다.
pt: O instalador para BVME6000 pode iniciar a partir de cdrom (veja a <xref linkend="m68k-boot-cdrom"/>), disquetes (veja a <xref linkend="boot-from-floppies"/>), ou a partir da rede (veja a <xref linkend="boot-tftp"/>).
zh_tw: BVME6000 上安裝程式可以從光碟 (請參閱 <xref linkend="m68k-boot-cdrom"/>)、軟碟 (請參閱 <xref linkend="boot-from-floppies"/>)，或網路 (請參閱 <xref linkend="boot-tftp"/>)。

source: The only method of installation available to mac is from the hard drive (see <xref linkend="m68k-boot-hd"/>). <emphasis>In other words the cdrom is not bootable.</emphasis> Macs do not have a working 2.4.x kernel.
ko: Mac에서 사용할 수 있는 유일한 설치 방법은 하드 드라이브에서 설치하는 것입니다 (<xref linkend="m68k-boot-hd"/> 참고). <emphasis>즉 CD-ROM에서 부팅할 수 없습니다.</emphasis> Mac에서는 2.4.x 커널이 동작하지 않습니다.
pt: O único método de instalação disponível para mac é a partir do disco rígido (veja a <xref linkend="m68k-boot-hd"/>). <emphasis>Por outras palavras não é possível iniciar de cdrom.</emphasis> Macs não têm um kernel 2.4.x funcional.
zh_tw: Mac 上啟動安裝的唯一方法是硬碟 (請參閱 <xref linkend="m68k-boot-hd"/>)。 <emphasis>也就是說光碟無法開機</emphasis>。Macs 不能工作在 2.4 核心上。

source: If your hardware uses a 53c9x-based scsi bus, then you may need to include the kernel parameter <userinput>mac53c9x=1,0</userinput>. Hardware with two such scsi buses, such as the Quadra 950, will need <userinput>mac53c9x=2,0</userinput> instead. Alternatively, the parameter can be specified as <userinput>mac53c9x=-1,0</userinput> which will leave autodetection on, but which will disable SCSI disconnects. Note that specifying this parameter is only necessary if you have more than one hard disk; otherwise, the system will run faster if you do not specify it.
ko: 53c9x 기반 SCSI 버스를 사용하는 경우, <userinput>mac53c9x=1</userinput> 커널 파라미터를 써야 할 수 있습니다. Quadra 950처럼 그런 SCSI 버스가 두 개 있는 하드웨어의 경우 <userinput>mac53c9x=2</userinput> 파라미터를 사용해야 합니다.대신,자동발견을 켜기 위해 <userinput>mac53c9x=-1,0</userinput>로 설정할 수 있습니다. 하지만 이는 SCSI 연결해제를 불가능하게 할 수있습니다. 이 인수를 설정하는 것은 하나이상의 하드 디스크가 있을때 설정해야 합니다. 그외의 경우, 설정하지 않을 때 시스템이 더 빠르게 동작합니다.
pt: Se o seu hardware utiliza um bus scsi baseado em 53c9x, então pode precisar de incluir o parâmetro de kernel <userinput>mac53c9x=1,0</userinput>. Hardware com dois desses bus scsi, tal como o Quadra 950, em vez disso irá necessitar de <userinput>mac53c9x=2,0</userinput>. Em alternativa, o parâmetro pode ser especificado como <userinput>mac53c9x=-1,0</userinput> que deixará a autodetecção ligada, mas que irá desabilitar desligar SCSIs. Note que especificar este parâmetro é apenas necessário se tiver mais do que um disco rígido; caso contrário, o sistema irá correr mais rápido se não o especificar.

source: MVME147 and MVME16x
ko: MVME147 및 MVME16x
pt: MVME147 e MVME16x
zh_tw: MVME147 和 MVME16x

source: The installer for MVME147 and MVME16x may be started from either floppies (see <xref linkend="boot-from-floppies"/>) or the net (see <xref linkend="boot-tftp"/>). <emphasis>In other words the cdrom is not bootable.</emphasis>
ko: MVME147 및 MVME16x용 설치 프로그램은 플로피 (<xref linkend="boot-from-floppies"/> 참고) 혹은 네트워크에서 (<xref linkend="boot-tftp"/> 참고) 설치할 수 있습니다. <emphasis>즉 CD-ROM에서 부팅할 수 없습니다.</emphasis>
pt: O instalador para MVME147 e MVME16x poderá ser iniciado tanto de disquetes (veja a <xref linkend="boot-from-floppies"/>) ou a partir da rede (veja a <xref linkend="boot-tftp"/>). <emphasis> Por outras palavras não é possível iniciar de cdrom.</emphasis>
zh_tw: MVEM147 和 MVEM16x 可以從軟碟 (請參閱 <xref linkend="boot-from-floppies"/>) 或網路 (請參閱 <xref linkend="boot-tftp"/>)。 <emphasis>也就是說光碟無法開機</emphasis>。

source: The only method of installation available to Q40/Q60 is from the hard drive (see <xref linkend="m68k-boot-hd"/>). <emphasis>In other words the cdrom is not bootable.</emphasis>
ko: Q40/Q60에서 설치하는 유일한 방법은 하드 드라이브에서 설치하는 것입니다 (<xref linkend="m68k-boot-hd"/> 참고). <emphasis>즉 CD-ROM에서 부팅할 수 없습니다.</emphasis>
pt: O único método de instalação disponível para Q40/Q60 é a partir do disco rígido (veja a <xref linkend="m68k-boot-hd"/>). <emphasis> Por outras palavras não é possível iniciar de cdrom.</emphasis>
zh_tw: Q40/Q60 只支援從硬碟安裝 (請參閱 <xref linkend="m68k-boot-hd"/>)。<emphasis>也就是說光碟機無法啟動。</emphasis>

source: Booting from a Hard Disk
ko: 하드 디스크에서 부팅하기
pt: Iniciar a partir de um Disco Rígido
zh_tw: 從硬碟開機

source: Booting from an existing operating system is often a convenient option; for some systems it is the only supported method of installation.
ko: 기존 운영 체제에서 부팅하는 게 가장 편리한 방법입니다. 몇몇 시스템의 경우에는 이게 유일한 설치 방법입니다.
pt: Iniciar de um sistema operativo já existente é por vezes uma opção adequada; para alguns sistemas é a única forma de instalação suportada.
zh_tw: 從一個已存在的作業系統上開機通常是一個方便的選擇﹔對於一些系統來說，這則是唯一支援的安裝方法。

source: To boot the installer from hard disk, you will have already completed downloading and placing the needed files in <xref linkend="boot-drive-files"/>.
ko: 하드 디스크에서 설치 프로그램을 부팅하려면, <xref linkend="boot-drive-files"/>에서 필요한 파일들을 내려 받아서 하드 디스크에 저장해 놓습니다.
pt: Para iniciar o instalador a partir do disco rígido, terá de já ter completado os downloads dos ficheiros necessários bem como tê-los colocado na <xref linkend="boot-drive-files"/>.
zh_tw: 如果要從硬碟上啟動安裝程式，您也許已經在 <xref linkend="boot-drive-files"/> 處下載並且在 <xref linkend="boot-drive-files"/> 安置了所需檔案。

source: At least six different ramdisks may be used to boot from the hard drive, three different types each with and without support for a 2.2.x linux kernel (see <ulink url="&disturl;/main/installer-&architecture;/current/images/MANIFEST">MANIFEST</ulink> for details).
ko: 하드 드라이브에서 부팅하려면 최소한 여섯 가지의 램디스크를 사용할 수 있습니다. 2.2.x 리눅스 커널이 지원하는 3가지와 지원하지 않는 3가지가 있습니다. (자세한 설명은 <ulink url="&disturl;/main/installer-&architecture;/current/images/MANIFEST">MANIFEST</ulink> 참고)
pt: Podem ser utilizadas pelo menos 6 ramdisks para iniciar de disco rígido, três diferentes tipos de cada com e sem suporte para kernel linux 2.2.x (para detalhes veja <ulink url="&disturl;/main/installer-&architecture;/current/images/MANIFEST">MANIFEST</ulink>).
zh_tw: 至少有六種不同的 ramdisk 可以從硬碟啟動，三個不同的類型分別用於支援或不支援 2.2.x linux 核心 (請參閱 <ulink url="&disturl;/main/installer-&architecture;/current/images/MANIFEST">MANIFEST</ulink> 以瞭解更多細節)。

source: The three different types of ramdisks are <filename>cdrom</filename>, <filename>hd-media</filename>, and <filename>nativehd</filename>. These ramdisks differ only in their source for installation packages. The <filename>cdrom</filename> ramdisk uses a cdrom to get debian-installer packages. The <filename>hd-media</filename> ramdisk uses an iso image file of a cdrom currently residing on a hard disk. Finally, the <filename>nativehd</filename> ramdisk uses the net to install packages.
ko: 세 가지 종류의 램 디스크는 <filename>cdrom</filename>, <filename>hd-media</filename>, <filename>nativehd</filename>입니다. 이 램디스크는 설치 꾸러미의 위치만 다릅니다. <filename>cdrom</filename> 램디스크는 debian-installer 꾸러미를 CD-ROM에서 가져옵니다. <filename>hd-media</filename> 램디스크는 하드 디스크에 들어 있는 CD-ROM의 ISO 이미지를 사용합니다. 마지막으로, <filename>nativehd</filename> 램디스크는 꾸러미를 설치하는 데 네트워크를 사용합니다.
pt: Os três diferentes tipos de ramdisks são <filename>cdrom</filename>, <filename>hd-media</filename>, e <filename>nativehd</filename>. Estes ramdisks diferem apenas nas suas fontes para os pacotes de instalação. O ramdisk <filename>cdrom</filename> utiliza um cdrom para conseguir pacotes para uma instalação Debian. O ramdisk <filename>hd-media</filename> utiliza um ficheiro com uma imagem iso de um cdrom que na altura se encontre no disco rígido. Por fim, o ramdisk <filename>nativehd</filename> utiliza a rede para instalar os pacotes.
zh_tw: 這三種 ramdisk 類型為 <filename>cdrom</filename>、<filename>hd-media</filename> 和 <filename>nativehd</filename>。它們的區別僅在於安裝軟體套件的來源不同。<filename>cdrom</filename> ramdisk 使用光碟取得 debian-installer 軟體套件。<filename>hd-media</filename> ramdisk 使用硬碟上的 iso 映像檔。最後，<filename>nativehd</filename> ramdisk 使用網路安裝軟體套件。

source: Booting from AmigaOS
ko: AmigaOS에서 부팅하기
pt: Iniciar a partir de SO Amiga
zh_tw: 從 AmigaOS 上開機

source: In the <command>Workbench</command>, start the Linux installation process by double-clicking on the <guiicon>StartInstall</guiicon> icon in the <filename>debian</filename> directory.
ko: <command>Workbench</command>에서는, <filename>debian</filename> 디렉토리 안의 <guiicon>StartInstall</guiicon> 아이콘을 더블클릭해서 리눅스 설치를 시작하십시오.
pt: No <command>Workbench</command>, inicie o processo de instalação do linux fazendo duplo clique no ícone <guiicon>StartInstall</guiicon> na directoria <filename>debian</filename>.
zh_tw: 在 <command>Workbench</command> 下，雙擊 <guiicon>StartInstall</guiicon> 圖示來啟動 Linux 安裝過程，它位於 <filename>debian</filename> 目錄中。

source: You may have to press the &enterkey; key twice after the Amiga installer program has output some debugging information into a window. After this, the screen will go grey, there will be a few seconds' delay. Next, a black screen with white text should come up, displaying all kinds of kernel debugging information. These messages may scroll by too fast for you to read, but that's OK. After a couple of seconds, the installation program should start automatically, so you can continue down at <xref linkend="d-i-intro"/>.
ko: Amiga 설치 프로그램에서 디버깅 정보를 창에 출력하면 &enterkey;를 두 번 눌러야 합니다. 그 다음에 화면이 없어지면 몇 초간 딜레이가 있을 것입니다. 그 다음에 흰 글자의 검은 화면이 나타나고, 커널 디버깅 정보를 표시합니다. 이 메세지는 읽기에는 너무 빠르게 스크롤 되겠지만, 상관없습니다. 몇 초 후에 설치 프로그램이 자동으로 시작하고, <xref linkend="d-i-intro"/> 부분으로 넘어가실 수 있습니다.
pt: Poderá ter de clicar na tecla &enterkey; duas vezes após o programa de instalação para Amiga ter gerado para o ecrã informação de debugging. Após isto, o ecrã tornar-se-á cinzento, haverá alguns segundos de atraso. Em seguida, surgirá um ecrã preto com um texto branco, indicando todos os tipos de debugging do kernel. Estas mensagens poderá passar demasiado rápido para as conseguir lêr, mas não tem importância. Após alguns segundos, o programa de instalação deverá iniciar automaticamente, assim você pode continuar para baixo até à <xref linkend="d-i-intro"/>.
zh_tw: Amiga 安裝程式會在一個視窗輸出一些除錯訊息，您可以按兩次 &enterkey; 。之後螢幕將變灰，這裡有一些很短的延遲。接下來，以黑底白字將顯示更多的除錯訊息。這些資訊可能捲動的非常快無法看到，但這沒有關係。在一些時間過後，安裝程式應該會自動安裝，因此您可以繼續參閱 <xref linkend="d-i-intro"/>。

source: Booting from Atari TOS
ko: Atari TOS에서 부팅하기
pt: Iniciar a partir de Atari TOS
zh_tw: 從 Atari TOS 開機

source: At the GEM desktop, start the Linux installation process by double-clicking on the <guiicon>bootstra.prg</guiicon> icon in the <filename>debian</filename> directory and clicking <guibutton>Ok</guibutton> at the program options dialog box.
ko: GEM 데스크탑에서, <filename>debian</filename> 디렉토리의 <guiicon>bootstra.prg</guiicon> 아이콘을 더블 클릭하고 프로그램 옵션 대화 상자의 <guibutton>Ok</guibutton>를 클릭해 리눅스 설치를 시작하십시오.
pt: No desktop GEM, inicie o processo de instalação do linux clicando duas vezes no ícone <guiicon>bootstra.prg</guiicon> na directoria <filename>debian</filename> e clicando <guibutton>Ok</guibutton> na caixa de diálogo de opções do programa.
zh_tw: 在 GEM 桌面上，可以透過雙擊 <guiicon>bootstra.prg</guiicon> 圖示，它位於 <filename>debian</filename> 目錄下，並且在程式選項對話框內點擊 <guibutton>Ok</guibutton> 來開始啟動安裝過程。

source: You may have to press the &enterkey; key after the Atari bootstrap program has output some debugging information into a window. After this, the screen will go grey, there will be a few seconds' delay. Next, a black screen with white text should come up, displaying all kinds of kernel debugging information. These messages may scroll by too fast for you to read, but that's OK. After a couple of seconds, the installation program should start automatically, so you can continue below at <xref linkend="d-i-intro"/>.
ko: Atari 부팅 프로그램에서 디버깅 정보를 창에 출력하면 &enterkey;를 눌러야 합니다. 그 다음에 화면이 없어지면 몇 초간 딜레이가 있을 것입니다. 그 다음에 흰 글자의 검은 화면이 나타나고, 커널 디버깅 정보를 표시합니다. 이 메세지는 읽기에는 너무 빠르게 스크롤 되겠지만, 상관없습니다. 몇 초 후에, 설치 프로그램이 자동으로 시작하고, <xref linkend="d-i-intro"/> 부분으로 넘어가실 수 있습니다.
pt: Poderá ter de pressionar na tecla &enterkey; após o programa Atari bootstrap ter gerado o output com a informação de eliminação de erros para o ecrã. Após isto o ecrã tornar-se-á cinzento, haverá alguns segundos de atraso. Em seguida no ecrã surgirá um texto branco sobre um fundo preto, informando todos os tipos de debugging de erros do kernel. Estas mensagens poderão passar rápido demasiado rápido não lhe sendo possível as conseguir lêr, mas não tem importância. Após uns quantos segundos, o programa de instalação deverá começar automaticamente, assim você pode continuar para baixo até à <xref linkend="d-i-intro"/>.
zh_tw: 當 Atari 安裝程式在視窗輸出一些除錯資訊以後，您可能要按下 &enterkey;。之後螢幕將變灰，這裡有一些很短的延遲。接下來，一個黑屏白字將顯示更多的除錯信息。這些資訊可能捲動的非常快沒法看，但這沒有問題。在一些時間過後，安裝程式應該自動安裝，因此您可以繼續參閱 <xref linkend="d-i-intro"/>。

source: Booting from MacOS
ko: MacOS에서 부팅하기
pt: Iniciar a partir de MacOS
zh_tw: 從 MacOS 開機
