Repository: xobs/debian-installer
Catalog: doc/manual/po/*/boot-installer.po
Languages: ko, pt, zh_tw

source: Select <command>EFI Shell</command> from the menu with the arrow keys and press <command>ENTER</command>. The EFI Shell will scan all of the bootable devices and display them to the console before displaying its command prompt. The recognized bootable partitions on devices will show a device name of <filename>fs<replaceable>n</replaceable>:</filename>. All other recognized partitions will be named <filename>blk<replaceable>n</replaceable>:</filename>. If you inserted the CD just before entering the shell, this may take a few extra seconds as it initializes the CD drive.
ko: 메뉴에서 화살표로 <command>EFI Shell</command>을 선택하고 <command>ENTER</command>를 누르십시오. EFI Shell은 부팅 가능한 장치를 모두 검색하고 명령어 프롬프트 앞에 장치 목록을 표시합니다. 찾아낸 부팅 가능 파티션은 <filename>fs<replaceable>n</replaceable>:</filename> 식으로 이름을 표시합니다. 그 외에 찾아낸 파티션은 <filename>blk<replaceable>n</replaceable>:</filename> 모양입니다. CD를 넣었다면 쉘에 들어가면서 CD 드라이브를 초기화하는 데 몇 초가 더 걸릴 수 있습니다.
pt: Escolha <command>EFI Shell</command> a partir do menu com as teclas de setas e carregue em <command>ENTER</command>. A EFI Shell irá procurar todos os seus dispositivos de arranque e mostra-los na consola antes de mostrar a sua linha de comandos. As partições de arranque reconhecidas nos dispositivos irão mostrar um nome de dispositivo de <filename>fs<replaceable>n</replaceable>:</filename>. Todas as outras partições reconhecidas serão chamadas <filename>blk<replaceable>n</replaceable>:</filename>. Se você inseriu um CD mesmo antes de entrar na shell, desta forma poderá demorar alguns segundos extra enquanto inicializa a drive de CD.
zh_tw: 選擇 <command>EFI Shell</command> 然後按下 <command>ENTER</command>。EFI Shell 將掃瞄所有的可開機設備，並且在顯示其指令提示符號前在控制台列出它們。被辨認出去有可開機分割區的設備將以 <filename>fs<replaceable>n</replaceable>:</filename> 格式顯示。所有其他辨認出的分割區，將被命名為 <filename>blk<replaceable>n</replaceable>:</filename>。如果您在進入介殼之前就插入光碟，這將花費一些時間以初始化光碟機。

source: Examine the output from the shell looking for the CDROM drive. It is most likely the <filename>fs0:</filename> device although other devices with bootable partitions will also show up as <filename>fs<replaceable>n</replaceable></filename>.
ko: 쉘에서 CD-ROM 드라이브를 찾을 때 출력을 잘 살펴보십시오. 다른 장치는 <filename>fs<replaceable>n</replaceable></filename>이라고 나올 때 CD-ROM 드라이브는 <filename>fs0:</filename>이라고 나올 것입니다.
pt: Examine o output da consola a procurar a drive de CDROM. É muito provável que seja o dispositivo <filename>fs0:</filename> embora possam também aparecer outros dispositivos com partições de arranque como <filename>fs<replaceable>n</replaceable></filename>.
zh_tw: 在檢查光碟機期間請查看介殼的輸出顯示。一般來說是 <filename>fs0:</filename> 其他具有可開機分割區的設備上也會顯示成 <filename>fs<replaceable>n</replaceable></filename>。

source: Enter <command>fs<replaceable>n</replaceable>:</command> and press <command>ENTER</command> to select that device where <replaceable>n</replaceable> is the partition number for the CDROM. The shell will now display the partition number as its prompt.
ko: <command>fs<replaceable>n</replaceable>:</command>이라고 입력하고 <command>ENTER</command>를 눌러 선택하십시오. 여기서 <replaceable>n</replaceable>은 CD-ROM의 파티션 번호입니다. 그러면 파티션 번호가 쉘의 프롬프트에 표시됩니다.
pt: Introduza <command>fs<replaceable>n</replaceable>:</command> e carregue em <command>ENTER</command> para seleccionar qual o dispositivo onde <replaceable>n</replaceable> é o número da partição para o CDROM. A shell irá agora mostrar o número da partição assim que aparecer a linha de comandos.
zh_tw: 進入 <command>fs<replaceable>n</replaceable>:</command> 然後按下 <command>ENTER</command> 來選擇設備。這裡 <replaceable>n</replaceable> 是光碟的分割區號。介殼將在提示符號下顯示分割區號。

source: Enter <command>elilo</command> and press <command>ENTER</command>. This will start the boot load sequence.
ko: <command>elilo</command>라고 입력하고 <command>ENTER</command>를 누르십시오. 그러면 부팅 과정을 시작합니다.
pt: Introduza <command>elilo</command> e pressione <command>ENTER</command>. Isto irá iniciar a sequência de arranque.
zh_tw: 進入 <command>elilo</command> 並按下 <command>ENTER</command>。這將進入啟動步驟。

source: As with option 1, these steps start the Debian boot loader which will display a menu page for you to select a boot kernel and options. You can also enter the shorter <command>fs<replaceable>n</replaceable>:elilo</command> command at the shell prompt. Proceed to selecting the boot kernel and options.
ko: 방법 1과 마찬가지로, 데비안 부트 로더가 시작하면 부트 커널과 옵션을 선택하는 메뉴 페이지를 표시합니다. 쉘 프롬프트에서 더 간단히 <command>fs<replaceable>n</replaceable>:elilo</command> 명령을 입력할 수도 있습니다. 계속해서 부팅 커널과 옵션을 선택하십시오.
pt: Tal como a opção 1, estes passos iniciam o gestor de arranque de Debian que irá mostrar uma página de menu para você escolher um kernel e opções de arranque. Você pode também introduzir o comando mais curto <command>fs<replaceable>n</replaceable>:elilo</command> na linha de comando. Continue para seleccionar o kernel e as opções de arranque.
zh_tw: 與選項 1 相同，這些步驟也會啟動 Debian boot-loader，顯示一個選單頁供選擇啟動核心和參數。您可在介殼提示符號下輸入 <command>fs<replaceable>n</replaceable>:elilo</command>簡短指令。進入選擇啟動核心和選項。

source: Installing using a Serial Console
ko: 시리얼 콘솔을 사용해 설치하기
pt: Instalar utilizando uma Consola Série
zh_tw: 使用序列埠控制台安裝

source: You may choose to perform an install using a monitor and keyboard or using a serial connection. To use a monitor/keyboard setup, select an option containing the string [VGA console]. To install over a serial connection, choose an option containing the string [<replaceable>BAUD</replaceable> baud serial console], where <replaceable>BAUD</replaceable> is the speed of your serial console. Menu items for the most typical baud rate settings on the ttyS0 device are preconfigured.
ko: 설치할 때 모니터와 키보드를 사용할 수도 있고 시리얼 연결을 사용할 수도 있습니다. 모니터/키보드 설정을 이용하려면, [VGA console]이 들어 있는 옵션을 선택하십시오. 시리얼 연결을 통해 설치하려면, [<replaceable>BAUD</replaceable> baud serial console]이 들어 있는 옵션을 선택하십시오. 여기서 <replaceable>BAUD</replaceable>는 시리얼 콘솔의 속도입니다. ttyS0 장치가 가장 일반적인 속도로 설정되어 있는 메뉴 항목이 이미 설정되어 있습니다.
pt: Você pode escolher fazer uma instalação utilizando um monitor e teclado ou utilizando uma ligação série. Para utilizar uma configuração monitor/teclado, escolha uma opção que contém a string [consola VGA]. Para instalar através de uma ligação série, escolha uma opção que contenha a string [<replaceable>BAUD</replaceable> consola série baud], onde <replaceable>BAUD</replaceable> é a velocidade da sua consola série. Os itens do menu para as definições de baud rate mais típicas no dispositivo ttyS0 são pré-configuradas.
zh_tw: 您可選擇使用顯示器與鍵盤或者序列埠連接來進行安裝。要使用顯示器/鍵盤配置，選擇包含 [VGA console] 的選項。要透過序列埠連接，選擇包含 [<replaceable>BAUD</replaceable> baud serial console] 的選項，其中 <replaceable>BAUD</replaceable> 是序列連接速度。選單項裡有大多數常見鮑率的 ttyS0 設備都有預設。

source: In most circumstances, you will want the installer to use the same baud rate as your connection to the EFI console. If you aren't sure what this setting is, you can obtain it using the command <command>baud</command> at the EFI shell.
ko: 대부분의 경우, 설치 프로그램의 속도를 EFI 콘솔 연결과 같게 해야 합니다. 설정을 어떻게 해야 할 지 잘 모르겠다면, EFI 쉘에서 <command>baud</command> 명령으로 알아낼 수 있습니다.
pt: Na maioria das circunstâncias, você irá querer que o instalador utilize o mesmo baud rate que a sua ligação para a consola EFI. Se você não tiver a certeza qual á a definição, pode obtê-la utilizando o comando <command>baud</command> na shell EFI.
zh_tw: 大多時候，您會讓安裝程式使用與連接 EFI 控制台相同的鮑率。如果您不知如何設定，可以在 EFI shell 透過 <command>baud</command> 指令取得。

source: If there is not an option available that is configured for the serial device or baud rate you would like to use, you may override the console setting for one of the existing menu options. For example, to use a 57600 baud console over the ttyS1 device, enter <command>console=ttyS1,57600n8</command> into the <classname>Boot:</classname> text window.
ko: 사용하려는 시리얼 장치나 속도에 맞춰 설정된 옵션이 없다면, 기존 메뉴 옵션의 콘솔 설정을 바꿀 수 있습니다. 예를 들어, ttyS1 장치에 57600 baud 콘솔을 사용하려면, <classname>Boot:</classname> 텍스트 창에 <command>console=ttyS1,57600n8</command>이라고 입력하십시오.
pt: Se não tiver disponível uma opção que é configurada para o dispositivo série ou baus rate que você gostaria de utilizar, você pode pode ultrapassar a configuração da consola para uma ou mais das opções do menu. Por exemplo, para utilizar uma consola a 57600 baud no dispositivo ttyS1, introduza <command>console=ttyS1,57600n8</command> na janela de texto <classname>Boot:</classname>.
zh_tw: 如果沒有序列配置的選項或者您要使用的鮑率，可以覆蓋某個選單項裡面的既有鮑率。例如，使用 57600 鮑率覆蓋 ttyS1 設備，輸入 <command>console=ttyS1,57600n8</command> 到 <classname>Boot:</classname> 文字視窗。

source: Most IA-64 boxes ship with a default console setting of 9600 baud. This setting is rather slow, and the normal installation process will take a significant time to draw each screen. You should consider either increasing the baud rate used for performing the installation, or performing a Text Mode installation. See the <classname>Params</classname> help menu for instructions on starting the installer in Text Mode.
ko: 대부분의 IA-64 컴퓨터는 기본 콘솔 설정이 9600bps로 되어 있습니다. 이 속도는 상당히 느려서, 기본 설치 과정에서 각 화면을 그릴 때 상당한 시간을 소모하게 됩니다. 설치 과정에서 사용하는 속도를 빠르게 하거나, 텍스트 모드 설치를 고려해 봐야 합니다. 텍스트 모드에서 설치를 시작하려면 <classname>Params</classname> 도움말 메뉴를 참고하십시오.
pt: A maioria das máquinas IA-64 vem com uma configuração de consola por omissão de 9600 baud. Esta configuração é um bocado lenta, e o processo de instalação normal irá demorar um tempo significativo a desenhar cada ecrã. Você deve considerar aumentar o baud rate utilizado para fazer a instalação, ou fazer uma instalação em Modo Texto. Veja o menu de ajuda <classname>Params</classname>para instruções de como iniciar o instalador em Modo Texto.
zh_tw: 大多數 IA-64 機器配備預設 9600 鮑率的控制台。這個速率太慢，普通安裝過程將花費明顯的時間來更新每個螢幕。您要麼透過提高鮑率以提升安裝效率，要麼使用文字模式安裝。參考 <classname>Params</classname> 說明選單，取得啟動文字模式安裝的指導。

source: If you select the wrong console type, you will be able to select the kernel and enter parameters but both the display and your input will go dead as soon as the kernel starts, requiring you to reboot before you can begin the installation.
ko: 잘못된 콘솔 종류를 선택했다면, 커널을 선택하고 파라미터를 입력할 수는 있지만 커널이 시작하자 마자 화면과 입력이 멎어 버릴 것입니다. 그러면 다시 부팅해야 설치를 할 수 있습니다.
pt: Se escolheu o tipo de consola errado, você será capaz de escolher o kernel e introduzir os parâmetros mas o display e o seu input estarão mortos logo que o kernel inicie, e você terá de reiniciar antes de conseguir iniciar a instalação.
zh_tw: 如果您選擇了錯誤的控制台類型，即便可以選擇核心和輸入參數，但顯示與輸入將在內核啟動後死掉，只有重新啟動才能開始安裝。

source: Selecting the Boot Kernel and Options
ko: 부팅 커널과 옵션 선택하기
pt: Escolher o Kernel e Opções de Arranque
zh_tw: 選擇啟動核心與選項

source: The boot loader will display a form with a menu list and a text window with a <classname>Boot:</classname> prompt. The arrow keys select an item from the menu and any text typed at the keyboard will appear in the text window. There are also help screens which can be displayed by pressing the appropriate function key. The <classname>General</classname> help screen explains the menu choices and the <classname>Params</classname> screen explains the common command line options.
ko: 부트 로더에서 메뉴 목록과 <classname>Boot:</classname> 프롬프트가 있는 텍스트 창을 표시합니다. 화살표 키로 메뉴의 항목을 선택할 수 있고 키보드로 입력한 텍스트도 텍스트 창에 나타납니다. 각 펑션 키를 누르면 도움말 화면도 나타납니다. <classname>General</classname> 도움말 화면은 메뉴 선택에 대해 설명하고 <classname>Params</classname> 화면은 일반적인 명령행 옵션에 대해 설명합니다.
pt: O gestor de arranque irá mostrar um formulário com um menu em lista e uma janela de texto com uma linha de comandos <classname>Boot:</classname>. As teclas com as setas seleccionam um item a partir do menu e qualquer texto escrito no teclado irá aparecer na janela de texto. Existem também ecrãs de ajuda que podem ser mostrados pressionando a tecla de função apropriada. O ecrã de ajuda <classname>General</classname> explica as escolhas do menu e o ecrã <classname>Params</classname> explica as opções comuns da linha de comandos.
zh_tw: 開機程式會顯示一個表單，具有選單列與包含 <classname>Boot:</classname> 提示符號的文字視窗。用方向鍵選擇選單項並且鍵盤輸入的字元將顯示在鮑率視窗。輸入適當的功能鍵會顯示說明視窗。<classname>普通的</classname>說明視窗解釋選單選項，<classname>Params</classname>視窗解釋命令列參數。

source: Consult the <classname>General</classname> help screen for the description of the kernels and install modes most appropriate for your installation. You should also consult <xref linkend="boot-parms"/> below for any additional parameters that you may want to set in the <classname>Boot:</classname> text window. The kernel version you choose selects the kernel version that will be used for both the installation process and the installed system. If you encounter kernel problems with the installation, you may also have those same problems with the system you install. The following two steps will select and start the install:
ko: <classname>General</classname> 도움말 화면을 보면 설치하는 데 가장 적합한 커널과 설치 모드에 대한 설명이 있습니다. 또 아래의 <xref linkend="boot-parms"/>에 보면 <classname>Boot:</classname> 텍스트 창에서 입력할 수 있는 추가 파라미터에 대한 설명이 있습니다. 커널 버전은 설치 과정과 설치된 시스템 모두에 사용할 커널의 버전을 설정합니다. 그래서 설치할 때 커널 문제가 발생하면, 설치한 시스템에서도 같은 문제가 발생할 것입니다. 다음 두 단계에서 설치 모드를 선택하고 설치를 시작합니다:
pt: Consulte o ecrã de ajuda <classname>Geral</classname> para a descrição dos kernel e modos de instalação mais apropriados para a sua instalação. Você também deve consultar a <xref linkend="boot-parms"/> abaixo para quaisquer parâmetros adicionais que você queira definir na janela de texto <classname>Boot:</classname>. A versão do kernel que você escolher seleccione a versão do kernel que será utilizada para o processo de instalação e para o sistema instalado, você também pode ter esses problemas com o sistema que instalar. Os dois passos seguintes irão seleccionar e iniciar a instalação:
zh_tw: 查詢 <classname>General</classname> 說明頁面，瞭解核心的說明和安裝對應的模式。您還應該查詢 <xref linkend="boot-parms"/>，瞭解在文字視窗中需要設置的額外參數 <classname>Boot:</classname>，您選擇的核心版本將會用在安裝過程和安裝好的系統中。如果安裝時碰到核心問題，在安裝好的系統中也會出現。以下兩步選擇和開始安裝：

source: Select the kernel version and installation mode most appropriate to your needs with the arrow keys.
ko: 화살표 키로 가장 적합한 커널 버전과 설치 모드를 선택하십시오.
pt: Escolha a versão do kernel e o modo de instalação mais apropriado para as suas necessidades com as teclas com as setas.
zh_tw: 使用方向鍵選擇您需要的核心版本和適合的安裝模式。

source: Enter any boot parameters by typing at the keyboard. The text will be displayed directly in the text window. This is where kernel parameters (such as serial console settings) are specified.
ko: 키보드로 부팅 파라미터가 있으면 입력하십시오. 입력한 텍스트가 텍스트 창에 직접 표시됩니다. 여기에서 커널 파라미터를 지정합니다 (예를 들어 시리얼 콘솔 설정).
pt: Introduza quaisquer parâmetros de arranque escrevendo-os com o teclado. O texto será mostrado directamente na janela de texto. Isto é onde são especificados os parâmetros do kernel (tais como configurações da consola série).
zh_tw: 在鍵盤上輸入任何啟動參數。這些文字將直接顯示在文字視窗。這是核心參數 (如同序列控制台) 指定的。

source: Press <command>ENTER</command>. This will load and start the kernel. The kernel will display its usual initialization messages followed by the first screen of the Debian Installer.
ko: <command>ENTER</command>를 누르십시오. 그러면 커널을 읽어들여서 시작합니다. 커널에서 초기화 메세지를 표시한 다음에 데비안 설치 프로그램의 첫 번째 화면이 나타납니다.
pt: Carregue em <command>ENTER</command>. Isto irá carregar e iniciar o kernel. O kernel irá mostrar as suas típicas mensagens de inicialização seguidas do primeiro ecrã do Instalador Debian.
zh_tw: 按下 <command>ENTER</command>。會載入並啟動核心。核心在 Debian 安裝程式的第一個螢幕顯示常規的初始化資訊。

source: Proceed to the next chapter to continue the installation where you will set up the language locale, network, and disk partitions.
ko: 다음 장으로 가서 언어 로케일, 네트워크, 디스크 파티션 설정을 계속 하십시오.
pt: Continue para o próximo capítulo para continuar com a instalação onde você irá configurar o idioma, rede, e partições de disco.
zh_tw: 進入到下一章繼續安裝本地語言，網路和磁碟分割區。

source: Booting an IA64 system from the network is similar to a CD boot. The only difference is how the installation kernel is loaded. The EFI Boot Manager can load and start programs from a server on the network. Once the installation kernel is loaded and starts, the system install will proceed thru the same steps as the CD install with the exception that the packages of the base install will be loaded from the network rather than the CD drive.
ko: 네트워크에서 IA64 시스템을 부팅하는 건 CD 부팅과 비슷합니다. 차이점은 설치 커널을 읽어들이는 방법입니다. EFI 부트 관리자는 네트워크에 있는 서버에서 프로그램을 읽어들여서 실행할 수 있습니다. 일단 설치 커널을 읽어들이고 실행하면, CD 설치와 마찬가지로 시스템 설치를 진행합니다. 차이점은 베이스 설치 꾸러미를 CD 드라이브가 아니라 네트워크에서 가져온다는 점입니다.
pt: Arrancar de um sistema IA64 a partir da rede é idêntico a arrancar a partir de CD. A única diferença é a forma como como é carregado o kernel de instalação. O EFI Boot Manager pode carregar e iniciar programas a partir de um servidor na rede. Uma vez que o kernel de instalação esteja carregado e inicie, a instalação do sistema irá continuar através dos mesmos passos do que a instalação de CD com a excepção que os pacotes da instalação base serão carregados a partir da rede em vez da drive de CD.
zh_tw: 在 IA64 系統上面從網路開機很像從光碟上開機。唯一的區別是如何裝入核心。EFI Boot Manager 可以裝入並且從網路伺服器開始程式。一旦安裝核心被載入並且啟動，系統的安裝將和光碟安裝步驟相同，只是基本軟體套件將從網路裝入而不是光碟機。

source: Network booting an ia64 system requires two architecture-specific actions. On the boot server, DHCP and TFTP must be configured to deliver <command>elilo</command>. On the client a new boot option must be defined in the EFI boot manager to enable loading over a network.
ko: IA64 시스템에서 네트워크 부팅은 두 가지 아키텍쳐 전용 작업이 필요합니다. 부트 서버에서는 DHCP와 TFTP에서 <command>elilo</command>를 전송하도록 설정해야 합니다. 클라이언트에서는 EFI 부트 매니저가 네트워크에서 읽어들이게 하는 부트 옵션을 정의해야 합니다.
pt: Iniciar a partir da rede num sistema ia64 necessita de duas acções específicas da arquitectura. No servidor de arranque, DHCP e TFTP têm de estar configurados para entregarem o <command>elilo</command>. No cliente tem de ser definida uma nova opção de arranque no gestor de arranque EFI para permitir carregar através da rede.
zh_tw: 用網路將一台 IA64 系統開機需要兩個架構相關的操作。在開機伺服器上，DHCP 和 TFTP 必須設定成可以傳送 <command>elilo</command>。在客戶端，必須在 EFI Boot Manager 定義新的開機選項來啟動網路網路以下載核心。

source: Configuring the Server
ko: 서버 설정하기
pt: Configurar o Servidor
zh_tw: 配置網路伺服器

source: A suitable TFTP entry for network booting an ia64 system looks something like this: <informalexample><screen> host mcmuffin { hardware ethernet 00:30:6e:1e:0e:83; fixed-address 10.0.0.21; filename "debian-installer/ia64/elilo.efi"; } </screen></informalexample> Note that the goal is to get <command>elilo.efi</command> running on the client.
ko: IA64 시스템에서 네트워크 부팅을 위한 TFTP 엔트리는 다음과 같습니다: <informalexample><screen> host mcmuffin { hardware ethernet 00:30:6e:1e:0e:83; fixed-address 10.0.0.21; filename "debian-installer/ia64/elilo.efi"; } </screen></informalexample> 목표는 <command>elilo.efi</command>를 클라이언트에서 실행하는 것입니다.
pt: Uma entrada TFTP adequada para iniciar a partir da rede num sistema ia64 parece-se um pouco como isto: <informalexample><screen> host mcmuffin { hardware ethernet 00:30:6e:1e:0e:83; fixed-address 10.0.0.21; filename "debian-installer/ia64/elilo.efi"; } </screen></informalexample> Note que o objectivo é pôr <command>elilo.efi</command> a correr no cliente.
zh_tw: 一個用於 ia64 系統的合適呵網路開機 TFTP 選項應該看起來像這樣： <informalexample><screen> host mcmuffin { hardware ethernet 00:30:6e:1e:0e:83; fixed-address 10.0.0.21; filename "debian-installer/ia64/elilo.efi"; } </screen></informalexample> 注意到目標是讓 <command>elilo.efi</command> 在客戶端運行。

source: Extract the <filename>netboot.tar.gz</filename> file into the directory used as the root for your tftp server. Typical tftp root directories include <filename>/var/lib/tftp</filename> and <filename>/tftpboot</filename>. This will create a <filename>debian-installer</filename> directory tree containing the boot files for an IA-64 system.
ko: <filename>netboot.tar.gz</filename> 파일을 TFTP 서버의 루트에 쓸 디렉토리에 풀어 놓으십시오. TFTP 루트 디렉토리는 보통 <filename>/var/lib/tftp</filename> 및 <filename>/tftpboot</filename>입니다. 파일을 풀면 <filename>debian-installer</filename> 디렉토리 밑에 IA64 시스템용 부팅 파일들이 들어 있습니다.
pt: Extraia o ficheiro <filename>netboot.tar.gz</filename> para o directório utilizado como raiz do seu servidor tftp. Tipicamente os directórios raiz de tftp incluem <filename>/var/lib/tftp</filename> e <filename>/tftpboot</filename>. Isto irá criar uma árvore de directórios <filename>debian-installer</filename> que contém os ficheiros de arranque para um sistema IA-64.
zh_tw: 使用 root 解壓縮 <filename>netboot.tar.gz</filename> 檔案到您的 tftp 伺服器。典型的 tftp 根目錄包括 <filename>/var/lib/tftp</filename> 和 <filename>/tftpboot</filename>。這將建立 <filename>debian-installer</filename> 目錄樹，它包括 IA-64 系統需要的開機檔案。

source: The <filename>netboot.tar.gz</filename> contains an <filename>elilo.conf</filename> file that should work for most configurations. However, should you need to make changes to this file, you can find it in the <filename>debian-installer/ia64/</filename> directory. It is possible to have different config files for different clients by naming them using the client's IP address in hex with the suffix <filename>.conf</filename> instead of <filename>elilo.conf</filename>. See documentation provided in the <classname>elilo</classname> package for details.
ko: <filename>netboot.tar.gz</filename> 안에는, 대부분의 경우에 동작하는 <filename>elilo.conf</filename> 파일이 들어 있습니다. 하지만 이 파일을 수정해야 하는 경우에는, <filename>debian-installer/ia64/</filename> 디렉토리 안에 있습니다. 각각의 클라이언트에 대해 다른 설정 파일을 이용하려면 파일이름을 <filename>elilo.conf</filename> 대신에 클라이언트의 IP 주소를 16진수로 쓰고 <filename>.conf</filename>를 뒤에 붙이면 됩니다. 자세한 설명은 <classname>elilo</classname> 꾸러미에 들어 있는 문서를 참고하십시오.
pt: O <filename>netboot.tar.gz</filename> contém um <filename>elilo.conf</filename> que deve funcionar com a maioria das configurações. No entanto, se você necessitar de fazer modificações no ficheiro pode encontra-lo no directório <filename>debian-installer/ia64/</filename>. É possível ter vários ficheiros de configuração para diferentes clientes dando-lhes o nome do endereço IP do cliente em hexadecimal com o sufixo <filename>.conf</filename> em vez de <filename>elilo.conf</filename>. Para mais detalhes veja a documentação fornecida pelo pacote <classname>elilo</classname>.
zh_tw: <filename>netboot.tar.gz</filename> 包含 <filename>elilo.conf</filename> 可以在大多數的設定下工作。另外，要修改這個檔案，您可以在 <filename>debian-installer/ia64/</filename> 目錄中找到。這只需要按照客戶端 IP 位址的 16 進位命名這些檔案並且以 <filename>.conf</filename> 為副檔名取代 <filename>elilo.conf</filename>。請查看 <classname>elilo</classname> 軟體套件附帶的文件以取得細節。

source: Configuring the Client
ko: 클라이언트 설정하기
pt: Configurar o Cliente
zh_tw: 配置客戶端
