Repository: xobs/debian-installer
Catalog: doc/manual/po/*/boot-installer.po
Languages: ko, pt, zh_tw

source: If you wish to use a serial console, you <emphasis>must</emphasis> pass the <userinput>console=</userinput> parameter to the kernel. This can be done using the <userinput>-flags</userinput> argument to the SRM <userinput>boot</userinput> command. The serial ports are named the same as their corresponding files in <userinput>/dev</userinput>. Also, when specifying additional kernel parameters, you must repeat certain default options that are needed by the &d-i; images. For example, to boot from <userinput>ewa0</userinput> and use a console on the first serial port, you would type:
ko: 시리얼 콘솔을 사용하려면, <userinput>console=</userinput> 파라미터를 커널에 넘겨야 <emphasis>합니다</emphasis>. <userinput>-flags</userinput> 인수를 SRM <userinput>boot</userinput> 명령에 사용하면 됩니다. 시리얼 포트의 이름은 <userinput>/dev</userinput> 아래 있는 해당 장치 파일 이름과 같습니다. 또, 추가 커널 파라미터를 지정할 경우, &d-i; 이미지에서 필요한 기본 옵션들을 다시 집어 넣어야 합니다. 예를 들어, <userinput>ewa0</userinput>에서 부팅해서 첫 번째 시리얼 포트를 사용하려면, 다음과 같이 입력합니다:
pt: Se deseja usar a consola de série, <emphasis>tem</emphasis> de passar o parâmetro <userinput>console=</userinput> para o kernel. Isto pode ser feito usado o argumento <userinput>-flags</userinput> para o comando <userinput>boot</userinput> do SRM.As portas série são nomeadas da mesma maneira que o seu correspondente em ficheiros em <userinput>/dev</userinput>. Também, quando especificar parâmetros de kernel adicionais, terá de repetir certas opções pré-definias que são necessárias pelas imagens do &d-i;. Por exemplo, para arrancar a partir de <userinput>ewa0</userinput> e usar uma consola na primeira porta série, deverá digitar:
zh_tw: 如果希望使用一個序列控制台，您<emphasis>必須</emphasis>傳遞 <userinput>console=</userinput> 參數給核心。這個工作可以使用SRM <userinput>boot</userinput> 指令加上 <userinput>-flags</userinput> 參數來完成。序列埠編號的命名和它們在目錄 <userinput>/dev</userinput> 中相同。另外，如有指定額外的核心參數，那麼連預設值也必須指定給 &d-i; 映像。例如，若需要從 <userinput>ewa0</userinput> 開機，並且在第一個序列埠使用控制台，您得輸入：

source: Booting from CD-ROM with the SRM Console
ko: SRM 콘솔로 CD-ROM에서 부팅하기
pt: Iniciar a partir de CD-ROM com a Consola SRM
zh_tw: 透過 SRM 控制台來從光碟開機

source: Type <informalexample><screen> &gt;&gt;&gt; boot xxxx -flags 0 </screen></informalexample> where <replaceable>xxxx</replaceable> is your CD-ROM drive in SRM notation.
ko: 다음 명령을 입력하십시오: <informalexample><screen> &gt;&gt;&gt; boot xxxx -flags 0 </screen></informalexample> 여기서 <replaceable>xxxx</replaceable>는 CD-ROM 드라이브의 SRM방식 표기입니다.
pt: Escreva <informalexample><screen> &gt;&gt;&gt; boot xxxx -flags 0 </screen></informalexample>onde <replaceable>xxxx</replaceable> é a sua drive de CD-ROM na notação SRM.
zh_tw: 輸入 <informalexample><screen> &gt;&gt;&gt; boot xxxx -flags 0 </screen></informalexample> 上一行 <replaceable>xxxx</replaceable> 是光碟機在 SRM 裡的提示號。

source: Booting from CD-ROM with the ARC or AlphaBIOS Console
ko: ARC 혹은 AlphaBIOS 콘솔로 CD-ROM에서 부팅하기
pt: Iniciar a partir de CD-ROM com a Consola ARC ou AlphaBIOS
zh_tw: 透過 ARC 或者 AlphaBIOS 控制台來從光碟啟動

source: To boot a CD-ROM from the ARC console, find your sub-architecture code name (see <xref linkend="alpha-cpus"/>), then enter <filename>\milo\linload.exe</filename> as the boot loader and <filename>\milo\<replaceable>subarch</replaceable></filename> (where <replaceable>subarch</replaceable> is the proper subarchitecture name) as the OS Path in the `OS Selection Setup' menu. Ruffians make an exception: You need to use <filename>\milo\ldmilo.exe</filename> as boot loader.
ko: ARC 콘솔에서 CD-ROM을 부팅하려면, 서브 아키텍쳐 코드 이름을 찾아서 (<xref linkend="alpha-cpus"/> 참고), <filename>\milo\linload.exe</filename>를 부트 로더로 입력하고 <filename>\milo\<replaceable>subarch</replaceable></filename>를 (여기서 <replaceable>subarch</replaceable>는 해당 서브 아키텍쳐 이름) `OS Selection Setup' 메뉴의 OS Path로 입력하십시오. Ruffian의 경우는 예외로, 부트 로더로 <filename>\milo\ldmilo.exe</filename>를 입력하십시오.
pt: Para iniciar um CD-ROM a partir da consola ARC, encontre o nome de código da sua sub-arquitectura (veja a <xref linkend="alpha-cpus"/>), seguidamente insira <filename>\milo\linload.exe</filename> como gestor de arranque e <filename>\milo\<replaceable>subarch</replaceable></filename> (onde <replaceable>subarch</replaceable> é o nome correcto da sub-arquitectura) como o caminho do SO no menu `OS Selection Setup'. Ruffians são as excepções: necessita do <filename>\milo\ldmilo.exe</filename> como gestor de arranque.
zh_tw: 為了透過 ARC 控制台以光碟開機，找出您的子架構結構代碼名稱 (請參閱 <xref linkend="alpha-cpus"/>)，然後輸入 <filename>\milo\linload.exe</filename> 作為 boot-loader 並且在 `OS Selection Setup' 選單下選擇 <filename>\milo\<replaceable>subarch</replaceable></filename> (<replaceable>subarch</replaceable> 是相應的子架構結構名稱) 作為作業系統路徑。Ruffians 則是一個例外：您需要使用 <filename>\milo\ldmilo.exe</filename> 作為 boot-loader 。

source: Booting from Floppies with the SRM Console
ko: SRM 콘솔로 플로피에서 부팅하기
pt: Iniciar a partir de Disquetes com a Consola SRM
zh_tw: 透過 SRM 控制台從軟碟開機

source: At the SRM prompt (<prompt>&gt;&gt;&gt;</prompt>), issue the following command: <informalexample><screen> &gt;&gt;&gt; boot dva0 -flags 0 </screen></informalexample> possibly replacing <filename>dva0</filename> with the actual device name. Usually, <filename>dva0</filename> is the floppy; type <informalexample><screen> &gt;&gt;&gt; show dev </screen></informalexample> to see the list of devices (e.g., if you want to boot from a CD). Note that if you are booting via MILO, <command>-flags</command> argument is ignored, so you can just type <command>boot dva0</command>. If everything works OK, you will eventually see the Linux kernel boot.
ko: SRM 프롬프트에서 (<prompt>&gt;&gt;&gt;</prompt>), 다음 명령을 실행하십시오: <informalexample><screen> &gt;&gt;&gt; boot dva0 -flags 0 </screen></informalexample> 여기서 <filename>dva0</filename>을 실제 장치 이름으로 바꿔야 할 수도 있습니다. 보통 <filename>dva0</filename>이 플로피입니다. 다음을 실행해 장치 목록을 보려면 (CD에서 부팅하려거나 할 때) 다음을 실행하십시오: <informalexample><screen> &gt;&gt;&gt; show dev </screen></informalexample> MILO를 통해 부팅하는 경우, <command>-flags</command> 인수는 무시하기 때문에, <command>boot dva0</command>라고만 입력할 수도 있습니다. 모두 문제 없이 동작한다면, 마침내 리눅스 커널 부팅을 볼 수 있을 것입니다.
pt: Na prompt da SRM (<prompt>&gt;&gt;&gt;</prompt>), digite o seguinte comando: <informalexample><screen> &gt;&gt;&gt; boot dva0 -flags 0 </screen></informalexample> possivelmente substituindo <filename>dva0</filename> pelo nome do dispositivo correcto. Normalmente, <filename>dva0</filename> é a disquete; digite <informalexample><screen> &gt;&gt;&gt; show dev </screen></informalexample> para ver a lista de dispositivos (e.g, se quer iniciar a partir de um CD). Note que se está a arrancar via MILO, o argumento <command>-flags</command> é ignorado, para que possa apenas digitar <command>boot dva0</command>. Se tudo estiver OK, irá eventualmente ver o arranque do kernel Linux.
zh_tw: 在 SRM 提示符號下 (<prompt>&gt;&gt;&gt;</prompt>)，使用如下指令：<informalexample><screen> &gt;&gt;&gt; boot dva0 -flags 0 </screen></informalexample> 可能要以實際的設備名稱來替換 <filename>dva0</filename>。一般狀況下，<filename>dva0</filename> 是軟碟﹔輸入 <informalexample><screen> &gt;&gt;&gt; show dev </screen></informalexample> 來查看設備列表 (例如，如果您想從光碟開機)。注意如果您想透過 MILO 開機，<command>-flags</command> 參數將被忽略，因此您可以只輸入 <command>boot dva0</command>。如果上面步驟正常執行，您最終將看到 Linux 核心啟動。

source: If you want to specify kernel parameters when booting via <command>aboot</command>, use the following command: <informalexample><screen> &gt;&gt;&gt; boot dva0 -file linux.bin.gz -flags "root=/dev/fd0 load_ramdisk=1 arguments" </screen></informalexample> (typed on one line), substituting, if necessary, the actual SRM boot device name for <filename>dva0</filename>, the Linux boot device name for <filename>fd0</filename>, and the desired kernel parameters for <filename>arguments</filename>.
ko: <command>aboot</command>를 통해 부팅할 때 커널 파라미터를 지정하려면, 다음 명령을 사용하십시오: <informalexample><screen> &gt;&gt;&gt; boot dva0 -file linux.bin.gz -flags "root=/dev/fd0 load_ramdisk=1 arguments" </screen></informalexample> (한 줄에 입력하십시오) 필요한 경우 <filename>dva0</filename>을 실제 SRM 부팅 장치 이름으로, <filename>fd0</filename>을 리눅스 부팅 장치 이름으로, <filename>arguments</filename>를 사용하려는 커널 파라미터로 바꾸십시오.
pt: Se desejar especificar os parâmetros do kernel quando iniciado via <command>aboot</command>, use o seguinte comando:<informalexample><screen> &gt;&gt;&gt; boot dva0 -file linux.bin.gz -flags "root=/dev/fd0 load_ramdisk=1 arguments" </screen></informalexample> (escrito numa linha), substituindo, se necessário, o nome do dispositivo actual de boot SRM para <filename>dva0</filename>, o nome do dispositivo de arranque do Linux para <filename>fd0</filename>, e os parâmetros desejados para o kernel para <filename>arguments</filename>.
zh_tw: 如果您想在透過 <command>aboot</command> 開機的時候指定特定的核心參數，請使用如下指令：<informalexample><screen> &gt;&gt;&gt; boot dva0 -file linux.bin.gz -flags "root=/dev/fd0 load_ramdisk=1 arguments" </screen></informalexample> (以一行輸入)，如果有需要，替換 <filename>dva0</filename> 的真實 SRM 開機設備名稱，<filename>fd0</filename> 是 Linux 的開機設備名稱，而 <filename>arguments</filename> 是需要指定的核心參數。

source: If you want to specify kernel parameters when booting via <command>MILO</command>, you will have to interrupt bootstrap once you get into MILO. See <xref linkend="booting-from-milo"/>.
ko: MILO를 통해 부팅할 때 커널 파라미터를 지정하려면, 부팅할 때 MILO로 들어간 다음 일시정지해야 합니다. <xref linkend="booting-from-milo"/> 참고.
pt: Se desejar especificar os parâmetros do kernel quando iniciar via <command>MILO</command>, terá de interromper o bootstrap mal chegue ao MILO. veja a <xref linkend="booting-from-milo"/>.
zh_tw: 如果您想在透過 <command>MILO</command> 開機時指定核心參數，您必須在進入 MILO 時中斷開機。請參閱 <xref linkend="booting-from-milo"/>。

source: Booting from Floppies with the ARC or AlphaBIOS Console
ko: ARC 혹은 AlphaBIOS 콘솔로 플로피에서 부팅하기
pt: Iniciar a partir de Disquetes com a Consola ARC ou AlphaBIOS
zh_tw: 透過 ARC 或者 AlphaBISO 控制台從軟碟開機

source: In the OS Selection menu, set <command>linload.exe</command> as the boot loader, and <command>milo</command> as the OS Path. Bootstrap using the newly created entry.
ko: OS Selection 메뉴에서, <command>linload.exe</command>를 부트 로더로, <command>milo</command>를 OS Path로 설정하십시오. 새로 만든 항목을 이용해 부팅하십시오.
pt: No menu de selecção do SO, defina <command>linload.exe</command> como o gestor de arranque, e <command>milo</command> como o OS Path. Faça o bootstrap usando a entrada recentemente criada.
zh_tw: 在作業系統選擇選單內，設定 <command>linload.exe</command> 作為 boot-loader，並且將 <command>milo</command> 作為作業系統參數。然後使用這個最近建立的選項啟動。

source: Booting with MILO
ko: MILO로 부팅하기
pt: Iniciar com o MILO
zh_tw: 採用 MILO 開機

source: MILO contained on the bootstrap media is configured to proceed straight to Linux automatically. Should you wish to intervene, all you need is to press space during MILO countdown.
ko: 부팅 미디어에 들어 있는 MILO는 자동으로 리눅스로 들어가도록 되어 있습니다. 중간에 멈추려면 MILO 카운트다운동안에 스페이스 키를 누르면 됩니다.
pt: O MILO contido na bootstrap media está configurado automaticamente para proceder automaticamente para Linux. Caso deseje intervir, tudo o que necessita fazer é pressionar a tecla de espaço durante a contagem decrescente do MILO.
zh_tw: 開機媒介上的 MILO 會自動進入 Linux 開機過程。如果您要對此有所控制，只需要在 MILO 倒計時時按下空格鍵。

source: If you want to specify all the bits explicitly (for example, to supply additional parameters), you can use a command like this: <informalexample><screen> MILO> boot fd0:linux.bin.gz root=/dev/fd0 load_ramdisk=1 <!-- arguments --> </screen></informalexample> If you are booting from something other than a floppy, substitute <filename>fd0</filename> in the above example with the appropriate device name in Linux notation. The <command>help</command> command would give you a brief MILO command reference.
ko: 모든 부분을 하나 하나 지정하려면 (예를 들어, 파라미터를 추가로 지정하려면), 다음과 같은 명령을 사용하십시오: <informalexample><screen> MILO> boot fd0:linux.bin.gz root=/dev/fd0 load_ramdisk=1 <!-- arguments --> </screen></informalexample> 플로피 외에 다른 장치에서 부팅하는 경우에는, 위의 예에서 <filename>fd0</filename>을 적당한 리눅스 장치 이름으로 바꾸십시오. <command>help</command> 명령을 실행하면 간단한 MILO 명령어 도움말을 볼 수 있습니다.
pt: Se deseja especificar todos os bits explicitamente (por exemplo, para fornecer parâmetros adicionais), poderá usar um comando como o seguinte: <informalexample><screen> MILO> boot fd0:linux.bin.gz root=/dev/fd0 load_ramdisk=1 <!-- arguments --> </screen></informalexample> Se está a fazer o arranque a partir de algo que não seja uma disquete, substitua <filename>fd0</filename> no exemplo acima, pelo nome do dispositivo apropriado, na notação Linux. O comando <command>help</command> dar-lhe-á uma breve referência do comando MILO.
zh_tw: 如果您確切想指定所有的位元 (例如，支援附加的參數)，您可以使用像下面的指令：<informalexample><screen> MILO> boot fd0:linux.bin.gz root=/dev/fd0 load_ramdisk=1 <!-- arguments --> </screen></informalexample> 如果透過軟碟之外的方法開機，在 Linux 提示號下把上面例子中的 <filename>fd0</filename> 替換成合適的設備名稱。<command>help</command> 指令將列出簡單的 MILO 指令參考。

source: Booting from TFTP
ko: TFTP에서 부팅하기
pt: Iniciar com TFTP
zh_tw: 從 TFTP 開機

source: Booting from the network requires that you have a network connection and a TFTP network boot server (DHCP, RARP, or BOOTP).
ko: 네트워크에서 부팅하려면, 네트워크에 연결되어 있어야 하고 TFTP 네트워크 부트 서버가 (DHCP, RARP 혹은 BOOTP) 필요합니다.
pt: Iniciar pela rede, requer que tenha uma ligação de rede configurada e um servidor de arranque de rede TFTP (DHCP, RARP ou BOOTP).
zh_tw: 要從網路開機，您的機器必須連接上網路和一台 TFTP 網路開機伺服器 (DHCP, RARP 以及 BOOTP)。

source: Older systems such as the 715 might require the use of an RBOOT server instead of a BOOTP server.
ko: 715처럼 오래된 시스템의 경우에는 BOOTP 서버 대신에 RBOOT 서버를 사용해야 할 수도 있습니다.
pt: Sistemas mais antigos como o 715 poderão necessitar do uso de um servidor RBOOT em vez de um servidor BOOTP.
zh_tw: 較早的系統如 715 也許需要使用一台 RBOOT 伺服器來取代 BOOTP 伺服器。

source: The installation method to support network booting is described in <xref linkend="install-tftp"/>.
ko: 네트워크 부팅을 지원하는 설치 방법은 <xref linkend="install-tftp"/>에 설명되어 있습니다.
pt: O método de instalação para suportar o arranque pela rede é descrito na <xref linkend="install-tftp"/>.
zh_tw: 支援的網路開機安裝方法在 <xref linkend="install-tftp"/>。

source: Booting from TFTP on NetWinder
ko: NetWinder에서 TFTP에서 부팅하기
pt: Iniciar a partir de TFTP em NetWinder
zh_tw: 從 NetWinder 上的 TFTP 開機

source: NetWinders have two network interfaces: The 10Mbps NE2000-compatible card is <filename>eth0</filename> and the 100Mbps Tulip card is <filename>eth1</filename>.
ko: NetWinders에는 두 개의 네트워크 인터페이스가 있습니다: 10Mbps NE2000 호환 카드는 <filename>eth0</filename>이고 100Mbps Tulip 카드는 <filename>eth1</filename>입니다.
pt: NetWinders têm duas interfaces de rede: a placa compatível com NE2000 de 10Mbps é <filename>eth0</filename> e a placa Tulip de 100Mbps é <filename>eth1</filename>.
zh_tw: NetWinders 具有兩個網路界面：10Mbps NE2000 相容的網卡作為 <filename>eth0</filename> 以及 100Mbps Tulip 網卡作為 <filename>eth1</filename>。

source: You need NeTTrom 2.2.1 or later to boot the installation system. NeTTrom 2.3.3 is recommended: get these files from <ulink url="ftp://ftp.netwinder.org/pub/netwinder/firmware/"></ulink>:
ko: 설치 시스템을 부팅하려면 NeTTrom 2.2.1 혹은 그 이후의 버전을 사용해야 합니다. NeTTrom 2.3.3을 권장합니다: 다음 파일을 <ulink url="ftp://ftp.netwinder.org/pub/netwinder/firmware/"></ulink>에서 가져오십시오:
pt: Necessita do NeTTrom 2.2.1 ou posterior para arrancar o sistema de instalação. recomendado o NeTTrom 2.3.3: pode conseguir estes ficheiros em <ulink url="ftp://ftp.netwinder.org/pub/netwinder/firmware/"></ulink>
zh_tw: 您需要 NeTTrom 2.2.1 或者較高的版本來啟動安裝系統。建議使用 NeTTrom 2.3.3：請從下面網址取得 <ulink url="ftp://ftp.netwinder.org/pub/netwinder/firmware/"></ulink>:

source: After rebooting and interrupting the boot process during the countdown, you must first configure the network either with a static address: <informalexample><screen> NeTTrom command-&gt; setenv eth0_ip 192.168.0.10/24 </screen></informalexample> where 24 is the number of set bits in the netmask, or a dynamic address: <informalexample><screen> NeTTrom command-&gt; boot diskless </screen></informalexample> You may also need to configure the <userinput>route1</userinput> settings if the TFTP server is not on the local subnet. The rest of the config is pretty standard (the save-all step is optional): <informalexample><screen> NeTTrom command-&gt; setenv kerntftpserver 192.168.0.1 NeTTrom command-&gt; setenv kerntftpfile boot.img NeTTrom command-&gt; save-all NeTTrom command-&gt; setenv netconfig_eth0 flash NeTTrom command-&gt; setenv kernconfig tftp NeTTrom command-&gt; setenv rootdev /dev/ram NeTTrom command-&gt; setenv cmdappend root=/dev/ram </screen></informalexample> Only the last four of these interfere with normal disk booting, so it is safe to issue <command>save-all</command> right before them, which will store the network settings in case you need to boot from the network again. If you want to use the serial console to install your NetWinder, you also need the following setting: <informalexample><screen> NeTTrom command-&gt; setenv cmdappend root=/dev/ram console=ttyS0,115200 </screen></informalexample> Use the <command>printenv</command> command to review your environment settings. Finally, if your <envar>cmdappend</envar> NeTTrom variable has the <option>noinitrd</option> option, you must remove it so the downloaded kernel can boot with its attached ramdisk.
ko: 다시 부팅해서 카운트다운할 때 부팅 과정을 일시 중단한 다음에, 네트워크를 고정 주소로 설정할 수 있습니다: <informalexample><screen> NeTTrom command-&gt; setenv eth0_ip 192.168.0.10/24 </screen></informalexample> 여기서 24는 네트마스크의 비트 개수입니다. 아니면 동적 주소로 설정할 수도 있습니다: <informalexample><screen> NeTTrom command-&gt; boot diskless </screen></informalexample> TFTP 서버가 로컬 서브네트에 없다면 <userinput>route1</userinput>을 설정해야 할 수도 있습니다. 나머지 설정은 항상 똑같습니다 (save-all 단계는 하지 않을 수도 있음): <informalexample><screen> NeTTrom command-&gt; setenv kerntftpserver 192.168.0.1 NeTTrom command-&gt; setenv kerntftpfile boot.img NeTTrom command-&gt; save-all NeTTrom command-&gt; setenv netconfig_eth0 flash NeTTrom command-&gt; setenv kernconfig tftp NeTTrom command-&gt; setenv rootdev /dev/ram NeTTrom command-&gt; setenv cmdappend root=/dev/ram </screen></informalexample> 마지막 4개의 경우에는 일반적인 디스크 부팅과 다르기 때문에, 그 바로 전에 <command>save-all</command> 명령을 실행하는 게 안전합니다. 이 명령은 네트워크에서 다시 부팅할 경우에 필요한 네트워크 설정을 저장합니다. NetWinder를 설치할 때 시리얼 콘솔을 사용하려면, 다음 설정도 필요합니다: <informalexample><screen> NeTTrom command-&gt; setenv cmdappend root=/dev/ram console=ttyS0,115200 </screen></informalexample> 환경 설정을 다시 보려면 <command>printenv</command> 명령을 사용하십시오. 마지막으로 <envar>cmdappend</envar> NeTTrom 변수에 <option>noinitrd</option> 옵션이 있으면, 이 옵션을 먼저 없애야 다운로드한 커널을 램디스크로 부팅할 수 있습니다.
pt: Após reiniciar e interromper o processo de arranque durante a contagem decrescente, terá de primeiro configurar a rede ou com um endereço estático: <informalexample><screen> NeTTrom command-&gt; setenv eth0_ip 192.168.0.10/24 </screen></informalexample> onde 24 é o número do conjunto de bits na máscara de rede, ou com um endereço dinâmico: <informalexample><screen> NeTTrom command-&gt; boot diskless </screen></informalexample> Poderá também ser necessário configurar as definições da <userinput>route1</userinput> se o servidor de TFTP não estiver na sub-rede local. O resto da configuração é standard (o passo save-all é opcional): <informalexample><screen> NeTTrom command-&gt; setenv kerntftpserver 192.168.0.1 NeTTrom command-&gt; setenv kerntftpfile tftpboot.img NeTTrom command-&gt; save-all NeTTrom command-&gt; setenv netconfig_eth0 flash NeTTrom command-&gt; setenv kernconfig tftp NeTTrom command-&gt; setenv rootdev /dev/ram NeTTrom command-&gt; setenv cmdappend root=/dev/ram </screen></informalexample> Apenas as duas últimas destas interfaces estão com um arranque normal pelo disco, portanto é seguro fazer o <command>save-all</command> imediatamente antes disso, o que irá guardar as definições da rede para o caso de ser necessário arrancar pela rede novamente. Use o comando <command>printenv</command> para rever as suas definições de ambiente. Finalmente, se a sua variável <envar>cmdappend</envar> NeTTrom tem a opção <option>noinitrd</option> (o que é necessário para arrancar kernels 2.4), deverá remove-la, para que o kernel retirado na internet possa iniciar juntamente com a sua ramdisk.
zh_tw: 在重新開機並在倒數計時的時候中斷開機後，您必須設定靜態網路: <informalexample><screen> NeTTrom command-&gt; setenv eth0_ip 192.168.0.10/24 </screen></informalexample> 這裡 24 是網路遮罩，您也可以設定一個動態位址： <informalexample><screen> NeTTrom command-&gt; boot diskless </screen></informalexample> 如果 TFTP 伺服器並不在子網域內， 您也可能需要設定 <userinput>route1</userinput>。其他的設定方法是非常標準的 (save-all 這步是可選的)： <informalexample><screen> NeTTrom command-&gt; setenv kerntftpserver 192.168.0.1 NeTTrom command-&gt; setenv kerntftpfile tftpboot.img NeTTrom command-&gt; save-all NeTTrom command-&gt; setenv netconfig_eth0 flash NeTTrom command-&gt; setenv kernconfig tftp NeTTrom command-&gt; setenv rootdev /dev/ram NeTTrom command-&gt; setenv cmdappend root=/dev/ram </screen></informalexample> 只有最後四項會影響正常的磁碟開機，所以在此之前選擇 <command>save-all</command> 將儲存網路設定以免您需要再一次開機。如果您想用序列埠控制台安裝 netWinder，您需要如下設置:<informalexample><screen> NeTTrom command-&gt; setenv cmdappend root=/dev/ram console=ttyS0,115200 </screen></informalexample> 使用 <command>printenv</command> 可以檢查您的環境設定。最後，如果您的 <envar>cmdappend</envar> NeTTrom 參數具有 <option>noinitrd</option> 選項，您必須刪除它以確保下載的核心可以用其附帶的記憶體虛擬磁碟開機。

source: Booting from TFTP on CATS
ko: CATS에서 TFTP에서 부팅하기
pt: Iniciar a partir de TFTP em CATS
zh_tw: 透過 CATS 上的 TFTP 開機

source: On CATS machines, use <command>boot de0:</command> or similar at the Cyclone prompt.
ko: CATS 기계에서는 Cyclone 프롬프트에서 <command>boot de0:</command>과 같은 명령을 사용하십시오.
pt: Em máquinas CATS, use o comando <command>boot de0:</command> ou similar na prompt Cyclone.
zh_tw: 在 CATS 機器上，可以使用指令 <command>boot de0:</command> 或者在 Cyclone 開機提示號輸入類似的指令。

source: Booting from CD-ROM
ko: CD-ROM에서 부팅하기
pt: Iniciar a partir de CD-ROM
zh_tw: 從光碟開機

source: The easiest route for most people will be to use a set of Debian CDs. If you have a CD set, and if your machine supports booting directly off the CD, great! Simply <phrase arch="i386"> configure your system for booting off a CD as described in <xref linkend="boot-dev-select"/>, </phrase> insert your CD, reboot, and proceed to the next chapter.
ko: 대부분의 사람들에게 가장 쉬운 방법은 데비안 CD 세트를 이용하는 것입니다. CD 세트를 가지고 있고, 기계에서 직접 CD 부팅을 할 수 있다면 매우 좋은 경우입니다. <phrase arch="i386"><xref linkend="boot-dev-select"/>에 설명되어 있는 대로 CD에서 시스템을 부팅할 수 있도록 설정하고, </phrase> CD를 넣은 다음, 다시 부팅하고, 다음 장으로 넘어가십시오.
pt: O melhor caminho para a maioria das pessoas será usar um conjunto de CDs Debian. Se tem um conjunto de CDs, e se a sua máquina suporta arranque directamente a partir do CD, fantástico! Simplesmente <phrase arch="i386"> configure o seu sistema para arrancar a partir de um CD como descrito na <xref linkend="boot-dev-select"/>, </phrase> insira o seu CD, reinicie, e proceda para o próximo capítulo.
zh_tw: 對於大多數人來說，最快的途徑是使用一套 Debian CD 光碟套件。如果您有此套件，並且如果您的機器支援直接光碟開機，太棒了！只需要 <phrase arch="i386"> 設定您的系統以光碟開機，請參閱 <xref linkend="boot-dev-select"/>, </phrase> 插入您的光碟，重開機，然後繼續下一章。

source: Note that certain CD drives may require special drivers, and thus be inaccessible in the early installation stages. If it turns out the standard way of booting off a CD doesn't work for your hardware, revisit this chapter and read about alternate kernels and installation methods which may work for you.
ko: 일부 CD 드라이브의 경우에는 특별한 드라이버가 필요하므로, 설치 단계의 앞 부분에서는 CD 드라이브에 접근할 수 없을 수도 있습니다. 하드웨어에서 표준적인 방법의 CD 부팅이 동작하지 않는다면, 이 장을 다시 보시고 이 경우에 동작하는 다른 커널 및 설치 방법을 읽어보십시오.
pt: Note que determinadas drives de CD podem necessitar de drivers especiais, e portanto estarem inacessíveis nas fases iniciais da instalação. Se se verificar que a maneira comum de iniciar a partir do CD não funciona no seu hardware, visite novamente este capítulo e leia sobre métodos alternativos para instalar e kernels alternativos que poderão funcionar consigo.
zh_tw: 注意某些特定的光碟機需要一些特殊的驅動程式，因為他們可能在安裝的早期步驟中無法被存取。如果標準的光碟開機的方法不能用於您的硬體，閱讀本章中關於其他種類的核心以及安裝方法，它們有可能能解決問題。
