Repository: xobs/debian-installer
Catalog: doc/manual/po/*/boot-new.po
Languages: el, ko, pt, ru, zh_cn, zh_tw

source: In order to setup PPP, you'll need to know the basics of file viewing and editing in GNU/Linux. To view files, you should use <command>more</command>, and <command>zmore</command> for compressed files with a <userinput>.gz</userinput> extension. For example, to view <filename>README.debian.gz</filename>, type <userinput>zmore README.debian.gz</userinput>. The base system comes with an editor named <command>nano</command>, which is very simple to use, but does not have a lot of features. You will probably want to install more full-featured editors and viewers later, such as <command>jed</command>, <command>nvi</command>, <command>less</command>, and <command>emacs</command>.
el: Για να ρυθμίσετε το PPP, θα πρέπει να ξέρετε τα βασικά της επισκόπησης και επεξεργασίας αρχείων στο Linux. Για να δείτε αρχεία χρησιμοποιήστε την εντολή <command>more</command>, και <command>zmore</command> για συμπιεσμένα αρχεία, δηλ. αρχεία με την κατάληξη <userinput>.gz</userinput>. Για παράδειγμα, για να δείτε το αρχείο <filename>README.debian.gz</filename> πληκτρολογήστε <userinput>zmore README.debian.gz</userinput>. Το βασικό σύστημα έρχεται επίσης με έναν επεξεργαστή κειμένου που λέγεται <command>nano</command> και ο οποίος είναι πολύ απλός στη χρήση αλλά χωρίς πολλές δυνατότητες, Πιθανόν να θέλετε να εγκαταστήσετε αργότερα πιο ολοκληρωμένους και με περισσότερα γνωρίσματα επεξεργαστές κειμένου και viewers όπως οι <command>jed</command>, <command>nvi</command>, <command>less</command> και ο <command>emacs</command>.
ko: PPP 설정을 하려면 GNU/Linux에서 파일 보기와 편집의 기본을 알 필요가 있습니다. 파일을 보기 위해서 <command>more</command>를 <userinput>.gz</userinput> 확장자로 압축된 파일을 보기위해서는 <command>zmore</command>를 사용해야 합니다. 예를 들어 <filename>README.debian.gz</filename>을 보기 위해 <userinput>zmore README.debian.gz</userinput>을 입력합니다. 기본 시스템은 <command>nano</command>라는 이름의 매우 간단하고 기능이 적은 편집기를 제공합니다. 당신은 이 후에 좀 더 기능이 많은 편집기와 뷰어인 <command>jed</command>, <command>nvi</command>, <command>less</command>, <command>emacs</command> 등을 설치하길 원할 것입니다.
pt: Para poder configurar o PPP, irá necessitar de conhecer os princípios básicos da edição e visualização de ficheiros em GNU/Linux. Para visualizar ficheiros, deverá usar o <command>more</command>, e o <command>zmore</command> para ficheiros comprimidos com a extensão <userinput>.gz</userinput>. Por exemplo, para ver o <filename>README.debian.gz</filename>, escreva <userinput>zmore README.debian.gz</userinput>. O sistema base vem com um editor chamado <command>nano</command>, que é muito simples de utilizar, mas não inclui muitas funcionalidades. Irá provavelmente querer instalar editores com mais funcionalidades e mais poderosos mais tarde, tais como o <command>jed</command>, o <command>nvi</command>, o <command>less</command>, e o <command>emacs</command>.
ru: Чтобы настроить PPP, вам нужно знать основы просмотра и редактирования файлов в GNU/Linux. Для просмотра файлов вы должны использовать программу <command>more</command> или <command>zmore</command> для сжатых файлов с расширением <userinput>.gz</userinput>. Например, для просмотра <filename>README.debian.gz</filename>, наберите <userinput>zmore README.debian.gz</userinput>. В базовой системе есть редактор, который называется <command>nano</command>; им очень просто пользоваться и он не содержит большого количества функций. Скорее всего позже вы захотите установить более полноценные редакторы и программы просмотра, такие как <command>jed</command>, <command>nvi</command>, <command>less</command> и <command>emacs</command>.
zh_cn: 在开始之前，您需要了解在GNU/Linux中的文件查看和编辑的基础知识。要查看一个文件，您可以使用 <command>more</command>，和 <command>zmore</command> 查看后缀为 <userinput>.gz</userinput> 的压缩档。例如：要察看 <filename>README.debian.gz</filename>，您可以键入命令 <userinput>zmore README.debian.gz</userinput>。最小安装的系统中带有一个使用简单但功能略少的编辑器，叫 <command>nano</command>。您也可以后续安装其它功能强大的编辑器如 <command>jed</command>, <command>nvi</command>, <command>less</command>，和 <command>emacs</command>。
zh_tw: 在開始之前，您需要瞭解在 GNU/Linux 中閱覽和編輯檔案的基礎知識。要閱覽一個檔案，您可以使用 <command>more</command>，和 <command>zmore</command> 閱覽副檔名為 <userinput>.gz</userinput> 的壓縮檔。例如：要閱覽 <filename>README.debian.gz</filename>，您可以鍵入指令 <userinput>zmore README.debian.gz</userinput>。最小安裝的系統中帶有一個使用簡單但功能略少的編輯器，叫 <command>nano</command>。您也可以後續安裝其它功能強大的編輯器如 <command>jed</command>, <command>nvi</command>, <command>less</command>，和 <command>emacs</command>。

source: Edit <filename>/etc/ppp/peers/provider</filename> and replace <userinput>/dev/modem</userinput> with <userinput>/dev/ttyS<replaceable>&num;</replaceable></userinput> where <replaceable>&num;</replaceable> stands for the number of your serial port. In Linux, serial ports are counted from 0; your first serial port <phrase arch="i386">(i.e., <userinput>COM1</userinput>)</phrase> is <filename>/dev/ttyS0</filename> under Linux. <phrase arch="powerpc;m68k">On Macintoshes with serial ports, the modem port is <filename>/dev/ttyS0</filename> and the printer port is <filename>/dev/ttyS1</filename>.</phrase> The next step is to edit <filename>/etc/chatscripts/provider</filename> and insert your provider's phone number, your user-name and password. Please do not delete the <quote>\q</quote> that precedes the password. It hides the password from appearing in your log files.
el: Ανοίξτε το αρχείο <filename>/etc/ppp/peers/provider</filename> και αντικαταστήσετε το <userinput>/dev/modem</userinput> με <userinput>/dev/ttyS<replaceable>&num;</replaceable></userinput> όπου το <replaceable>&num;</replaceable> αντιστοιχεί στον αριθμό της σειριακής θύρας. Στο Linux οι σειριακές θύρες μετρώνται από το 0. Έτσι η πρώτη σειριακή θύρα <phrase arch="i386">(δηλ. η, <userinput>COM1</userinput>)</phrase> είναι στο Linux η <filename>/dev/ttyS0</filename>. <phrase arch="powerpc;m68k">Σε συστήματα Macintosh με σειριακές θύρες, η θύρα για το modem είναι η <filename>/dev/ttyS0</filename> και για τον εκτυπωτή η <filename>/dev/ttyS1</filename>.</phrase>. Το επόμενο βήμα είναι να ανοίξετε το αρχείο <filename>/etc/chatscripts/provider</filename> και να εισάγετε τον αριθμό τηλεφώνου του παροχέα σας, το όνομα χρήστη που έχετε και τον κωδικό πρόσβασης. Προσέξτε να μην διαγράψετε τους χαρακτήρες <quote>\q</quote> που προηγούνται από τον κωδικό πρόσβασης! Οι χαρακτήρες αυτοί αποτρέπουν την εμφάνιση του κωδικού σας στα αρχεία καταγραφής του συστήματος αποκρύπτοντάς τον.
ko: <filename>/etc/ppp/peers/provider</filename>을 편집기로 열고 <userinput>/dev/modem</userinput>을 <userinput>/dev/ttyS<replaceable>&num;</replaceable></userinput>으로 바꿔줍니다. 여기에서 <replaceable>&num;</replaceable>은 당신의 시리얼 포트의 번호를 의미합니다. 리눅스에서 시리얼 포트는 0 부터 시작합니다. 첫 번째 시리얼 포트<phrase arch="i386">(즉, <userinput>COM1</userinput>)</phrase>는 리눅스에서는 <filename>/dev/ttyS0</filename> 입니다.
pt: Edite o <filename>/etc/ppp/peers/provider</filename> e substitua o <userinput>/dev/modem</userinput> por <userinput>/dev/ttyS<replaceable>&num;</replaceable></userinput> onde <replaceable>&num;</replaceable> significa o número da sua porta de série. Em Linux, a numeração das portas de série começa em 0; a primeira porta de série <phrase arch="i386">(i.e., <userinput>COM1</userinput>)</phrase> é <filename>/dev/ttyS0</filename> em Linux. <phrase arch="powerpc;m68k">Em Macintoshes com portas de série, a porta do modem é <filename>/dev/ttyS0</filename> e a porta da impressora é <filename>/dev/ttyS1</filename>.</phrase> O próximo passo é editar o <filename>/etc/chatscripts/provider</filename> e inserir o número de telefone do seu fornecedor, o seu nome de utilizador e password. Por favor não apague o <quote>\q</quote> que antecede a password. Isto faz com que a sua password não apareça nos ficheiros de registo.
ru: Отредактируйте <filename>/etc/ppp/peers/provider</filename> и замените <userinput>/dev/modem</userinput> на <userinput>/dev/ttyS<replaceable>&num;</replaceable></userinput>, где <replaceable>&num;</replaceable> означает номер вашего последовательного порта. В Linux последовательные порты отсчитываются с 0; первый порт в Linux <phrase arch="i386">(т.е., <userinput>COM1</userinput>)</phrase> это <filename>/dev/ttyS0</filename>. <phrase arch="powerpc;m68k">На Macintosh с последовательными портами, модемный порт это <filename>/dev/ttyS0</filename>, а порт принтера это <filename>/dev/ttyS1</filename>.</phrase> Потом отредактируйте <filename>/etc/chatscripts/provider</filename> и вставьте телефонный номер вашего провайдера, ваше имя пользователя и пароль. Пожалуйста, не удаляйте <quote>\q</quote> перед паролем. Это не даёт паролю записываться в журнальные файлы.
zh_cn: 编辑 <filename>/etc/ppp/peers/provider</filename> 并替换 <userinput>/dev/modem</userinput> 为 <userinput>/dev/ttyS<replaceable>&num;</replaceable></userinput> 其中 <replaceable>&num;</replaceable> 取决于您的Modem串口号。在Linux下，串口是从0开始计数的，您的第一个串口 <phrase arch="i386">(如 <userinput>COM1</userinput>)</phrase> 就叫 <filename>/dev/ttyS0</filename> 。<phrase arch="powerpc;m68k">如果您在Macintoshes上，那么modem端口是 <filename>/dev/ttyS0</filename> 打印机的端口是 <filename>/dev/ttyS1</filename>。</phrase> 下一步是编辑 <filename>/etc/chatscripts/provider</filename> 然后插入提供商的电话号码，您的用户与口令。请勿删除 <quote>\q</quote> 它出现在口令后面。用来隐藏您的口令，而不出现在日志文件里面。
zh_tw: 編輯 <filename>/etc/ppp/peers/provider</filename> 並替換 <userinput>/dev/modem</userinput> 為 <userinput>/dev/ttyS<replaceable>&num;</replaceable></userinput> 其中 <replaceable>&num;</replaceable> 取決於您的數據機序列埠編號。在 Linux 下，序列埠是從0開始，您的第一個序列埠 <phrase arch="i386">(如 <userinput>COM1</userinput>)</phrase> 就叫 <filename>/dev/ttyS0</filename>。<phrase arch="powerpc;m68k">如果您在 Macintoshes 上，那麼數據機序列埠是 <filename>/dev/ttyS0</filename> 印表機的連接埠是 <filename>/dev/ttyS1</filename>。</phrase>下一步是編輯 <filename>/etc/chatscripts/provider</filename> 然後輸入供應商的電話號碼，您的使用者名稱與密碼。請勿刪除出現在密碼之前的 <quote>\q</quote>。這是用來隱藏您的密碼，而不出現在紀錄檔案裡面。

source: Many providers use PAP or CHAP for login sequence instead of text mode authentication. Others use both. If your provider requires PAP or CHAP, you'll need to follow a different procedure. Comment out everything below the dialing string (the one that starts with <quote>ATDT</quote>) in <filename>/etc/chatscripts/provider</filename>, modify <filename>/etc/ppp/peers/provider</filename> as described above, and add <userinput>user <replaceable>name</replaceable></userinput> where <replaceable>name</replaceable> stands for your user-name for the provider you are trying to connect to. Next, edit <filename>/etc/ppp/pap-secrets</filename> or <filename>/etc/ppp/chap-secrets</filename> and enter your password there.
el: Αρκετοί παροχείς χρησιμοποιούν τα πρωτόκολλα PAP ή CHAP για την διαδικασία πρόσβασης αντί της αυθεντικοποίησης με χρήση απλών χαρακτήρων κειμένου. Άλλοι χρησιμοποιούν και τις δυο μεθόδους. Αν ο παροχέας σας απαιτεί την χρήση PAP ή CHAP θα πρέπει να ακολουθήσετε άλλη διαδικασία. Σχολιάστε όλες τις γραμμές κάτω από την συμβολοσειρά κλήσης (την συμβολοσειρά που αρχίζει με <quote>ATDT</quote>) στο αρχείο <filename>/etc/chatscripts/provider</filename>, τροποποιήστε το αρχείο <filename>/etc/ppp/peers/provider</filename> όπως περιγράψαμε παραπάνω και συμπληρώστε το <userinput><replaceable>όνομα</replaceable>χρήστη</userinput> όπου <replaceable>όνομα</replaceable> αντιστοιχεί στο όνομα χρήστη από τον παροχέα με τον οποίον προσπαθείτε να συνδεθείτε. Στην συνέχεια ανοίξτε το αρχείο <filename>/etc/ppp/pap-secrets</filename> ή το <filename>/etc/ppp/chap-secrets</filename> και βάλτε εκεί τον κωδικό πρόσβασης σας.
ko: 많은 ISP들은 텍스트 모드 인증 대신 로긴 과정에 PAP 또는 CHAP을 사용합니다. 어떤 ISP들은 둘 다 사용하기도 합니다. 당신의 ISP가 PAP 또는 CHAP을 사용한다면, 다른 방법을 따라야 할 것입니다. <filename>/etc/chatscripts/provider</filename>에서 <quote>ATDT</quote>로 시작하는 다이얼링 문자열들을 모두 주석처리하고, <filename>/etc/ppp/peers/provider</filename>을 앞에서 설명된 대로 변경하고, <userinput>user <replaceable>name</replaceable></userinput> 를 추가 하세요. 여기에서 <replaceable>name</replaceable>은 당신의 ISP에 접속하기위한 이름입니다. 다음으로 <filename>/etc/ppp/pap-secrets</filename> 또는 <filename>/etc/ppp/chap-secretes</filename>을 편집기로 열고, 당신의 패스워드를 입력합니다.
pt: Muitos fornecedores usam o PAP ou o CHAP para a sequência de autenticação em vez de utilizarem a autenticação em modo de texto. Outros usam ambos. Se o seu fornecedor requer o uso de PAP ou CHAP, irá necessitar de seguir um procedimento diferente. Comente tudo abaixo da sequência de marcação (a que começa com <quote>ATDT</quote>) no <filename>/etc/chatscripts/provider</filename>, modifique o <filename>/etc/ppp/peers/provider</filename>, tal como foi descrito em cima, e adicione <userinput>user <replaceable>name</replaceable></userinput> onde <replaceable>name</replaceable> significa o seu nome de utilizador para o fornecedor que pretende efectuar a ligação. Seguidamente, edite o <filename>/etc/ppp/pap-secrets</filename> ou o <filename>/etc/ppp/chap-secrets</filename> e introduza lá a sua password.
ru: Многие провайдеры для входа используют PAP или CHAP вместо режима текстовой аутентификации. Другие используют оба метода. Если ваш провайдер использует PAP или CHAP, нужно следовать другой процедуре. Закомментируйте всё после строки дозвона (это та, которая начинается с <quote>ATDT</quote>) в <filename>/etc/chatscripts/provider</filename>, измените <filename>/etc/ppp/peers/provider</filename> как описано выше и добавьте <userinput>user <replaceable>name</replaceable></userinput>, где <replaceable>name</replaceable> &mdash; ваше имя пользователя у провайдера, к которому вы пытаетесь подключиться. Затем отредактируйте <filename>/etc/ppp/pap-secrets</filename> или <filename>/etc/ppp/chap-secrets</filename> и введите здесь ваш пароль.
zh_cn: 许多拨号提供商现在使用PAP或CHAP作为认证方法来取代最初的文本模式认证。部份ISP两者都采用，如果您的ISP需要PAP或CHAP，您需要按如下步骤进行配置： 将文件中拨号字串下的所有内容注释掉(即从 <quote>ATDT</quote>) 在 <filename>/etc/chatscripts/provider</filename>同样也注释掉 <filename>/etc/ppp/peers/provider</filename> 文件中拨号字串下的内容，并添加 <userinput>user <replaceable>name</replaceable></userinput> 其中 <replaceable>name</replaceable> 指的是您在ISP的拨号用户。然后编辑 <filename>/etc/ppp/pap-secrets</filename> 或 <filename>/etc/ppp/chap-secrets</filename>在其中填入您的密码。
zh_tw: 許多供應商現在使用 PAP 或 CHAP 作為認證方式來取代最初的文字模式認證。部份ISP兩者都採用，如果您的ISP需要 PAP 或 CHAP，您需要按如下步驟進行設定：將檔案中撥號字串之後的所有內容加上註解符號 (即從 <quote>ATDT</quote>)，在 <filename>/etc/chatscripts/provider</filename> 裡同樣也把 <filename>/etc/ppp/peers/provider</filename> 檔案中撥號字串之後的內容加上註解，並添加 <userinput>user <replaceable>name</replaceable></userinput>，其中 <replaceable>name</replaceable> 指的是您在ISP的撥號使用者名稱。然後編輯 <filename>/etc/ppp/pap-secrets</filename> 或 <filename>/etc/ppp/chap-secrets</filename> 並在其中填入您的密碼。

source: You will also need to edit <filename>/etc/resolv.conf</filename> and add your provider's name server (DNS) IP addresses. The lines in <filename>/etc/resolv.conf</filename> are in the following format: <userinput>nameserver <replaceable>xxx.xxx.xxx.xxx</replaceable></userinput> where the <replaceable>x</replaceable>s stand for numbers in your IP address. Optionally, you could add the <userinput>usepeerdns</userinput> option to the <filename>/etc/ppp/peers/provider</filename> file, which will enable automatic choosing of appropriate DNS servers, using settings the remote host usually provides.
el: Θα πρέπει επίσης να ανοίξετε το αρχείο <filename>/etc/resolv.conf</filename> και να προσθέσετε εκεί τις IP διευθύνσεις των DNS servers του παροχέα σας. Οι γραμμές στο αρχείο αυτό έχουν την ακόλουθη μορφή:<userinput>nameserver <replaceable>xxx.xxx.xxx.xxx</replaceable></userinput> όπου τα <replaceable>x</replaceable> αντιστοιχούν στους αριθμούς της IP διεύθυνσης. Προαιρετικά, μπορείτε να προσθέσετε την επιλογή <userinput>usepeerdns</userinput> στο αρχείο <filename>/etc/ppp/peers/provider</filename>, η οποία επιτρέπει την αυτόματη επιλογή κατάλληλων DNS servers χρησιμοποιώντας ρυθμίσεις που συνήθως παρέχει το απομακρυσμένο σύστημα.
ko: <filename>/etc/resolv.conf</filename> 파일을 편집기로 열어 당신의 ISP의 DNS 서버 IP 주소를 입력해야 할 것입니다. <filename>/etc/resolv.conf</filename>에 추가될 부분은 다음과 같은 형식을 가집니다. <userinput>nameserver <replaceable>xxx.xxx.xxx.xxx</replaceable></userinput> 여기에서 <replaceable>x</replaceable>들은 당신의 IP 주소의 숫자들을 나타냅니다. 선택적으로 <userinput>usepeerdns</userinput> 옵션을 <filename>/etc/ppp/peers/provider</filename>에 추가 할 수 있습니다. 이 옵션을 사용하면 자동으로 반대쪽 호스트에서 주어지는 DNS 서버의 설정 값들을 사용하여 설정을 해줍니다.
pt: Irá também necessitar de editar o <filename>/etc/resolv.conf</filename> e adicionar o endereço IP do servidor de nomes (DNS) do seu fornecedor. As linhas no <filename>/etc/resolv.conf</filename> tem o seguinte formato: <userinput>nameserver <replaceable>xxx.xxx.xxx.xxx</replaceable></userinput> onde os <replaceable>x</replaceable> são os números do endereço IP. Opcionalmente pode adicionar a opção <userinput>usepeerdns</userinput> ao ficheiro <filename>/etc/ppp/peers/provider</filename>, o que irá activar a escolha automática dos servidores DNS, utilizando as definições que a máquina remota normalmente fornece.
ru: Также вам надо отредактировать <filename>/etc/resolv.conf</filename> и добавить IP-адреса серверов имён (DNS) вашего провайдера. Строки в <filename>/etc/resolv.conf</filename> имеют вид: <userinput>nameserver <replaceable>xxx.xxx.xxx.xxx</replaceable></userinput>, где <replaceable>x</replaceable> нужно заменить на цифры IP-адреса. Также, вы можете добавить параметр <userinput>usepeerdns</userinput> в файл <filename>/etc/ppp/peers/provider</filename>, что разрешит автоматический выбор правильных DNS-серверов из настроек, которые обычно передаёт удалённый хост.
zh_cn: 您还需要编辑 <filename>/etc/resolv.conf</filename>，将您的ISP的域名服务器 (DNS) 的 IP 地址填写进去。<filename>/etc/resolv.conf</filename> 里面内容的填写格式应该是： <userinput>nameserver <replaceable>xxx.xxx.xxx.xxx</replaceable></userinput> 这里的 <replaceable>x</replaceable>是DNS的 IP 地址。作为可选项，您也可以在 <userinput>usepeerdns</userinput> 中添加 <filename>/etc/ppp/peers/provider</filename> ，这样系统能够在必要的时候选择适当的 DNS 服务器。
zh_tw: 您還需要編輯 <filename>/etc/resolv.conf</filename>，將您的 ISP 網域名稱伺服器 (DNS) 的 IP 位址填寫進去。<filename>/etc/resolv.conf</filename> 裡面內容的填寫格式應該是：<userinput>nameserver <replaceable>xxx.xxx.xxx.xxx</replaceable></userinput> 這裡的 <replaceable>x</replaceable> 是 DNS 的 IP 位址。作為選項，您也可以在 <userinput>usepeerdns</userinput> 中添加 <filename>/etc/ppp/peers/provider</filename>，這樣系統能夠在必要的時候選擇適當的 DNS 伺服器。

source: Unless your provider has a login sequence different from the majority of ISPs, you are done! Start the PPP connection by typing <command>pon</command> as root, and monitor the process using <command>plog</command> command. To disconnect, use <command>poff</command>, again, as root.
el: Αν ο παροχέας σας δεν χρησιμοποιεί κάποια διαδικασία εισόδου που να διαφέρει από την πλειονότητα των άλλων παροχέων, έχετε τελειώσει! Ξεκινήστε την σύνδεση PPP δίνοντας σαν χρήστης root την εντολή <command>pon</command> και παρακολουθήστε την όλη διαδικασία χρησιμοποιώντας την εντολή <command>plog</command> . Για να αποσυνδεθείτε χρησιμοποιήστε την εντολή <command>poff</command> πάλι σαν root.
ko: 대부분의 ISP들이 사용하는 로긴 방법을 사용한다면, 설정이 끝났습니다. root로 <command>pon</command> 명령을 내려 PPP 연결을 시작하고, <command>plog</command> 명령을 사용하여 그 과정을 지켜보세요. 연결을 끊기 위해서는 root 권한으로 <command>poff</command> 명령을 사용합니다.
pt: A não ser que o seu fornecedor possua uma sequência de login diferente da maioria dos ISPs, este passo está concluído! Inicie a ligação PPP escrevendo <command>pon</command> como root, e verifique o processo utilizando o comando <command>plog</command>. Para desligar, utilize <command>poff</command>, de novo, como root.
ru: Если ваш провайдер не использует процедуру входа, отличающуюся от большинства других ISP, то всё готово! Для установления PPP соединения наберите <command>pon</command> от пользователя root, и наблюдайте за процессом с помощью команды <command>plog</command>. Для отключения используйте <command>poff</command> опять же от root.
zh_cn: 除非您的 ISP 的登陆方式与其它主要 ISP 有极大的差异，否则这样就配置完成了。以root的身份键入 <command>pon</command> 就能打开 PPP 连接，<command>plog</command> 能够监控当前连接，要断开连接，则同样是以root身份执行 <command>poff</command>。
zh_tw: 除非您的 ISP 的登陸方式與其它主要 ISP 有極大的差異，否則這樣就設定完成了。以root的身份輸入 <command>pon</command> 就能啟用 PPP 連線，<command>plog</command> 能夠監控目前連接，要中斷連線，則同樣是以root身份執行 <command>poff</command>。

source: Read <filename>/usr/share/doc/ppp/README.Debian.gz</filename> file for more information on using PPP on Debian.
el: Διαβάστε το αρχείο <filename>/usr/share/doc/ppp/README.Debian.gz</filename> για περισσότερες πληροφορίες σχετικά με τη χρήση του PPP στο Debian.
ko: 데비안에서 PPP 사용하는 것에 대해 더 많은 정보를 원하신다면, <filename>/usr/share/doc/ppp/README.Debian.gz</filename> 파일을 읽어 보세요.
pt: Ler o ficheiro <filename>/usr/share/doc/ppp/README.Debian.gz</filename> para mais informações de como usar o PPP em Debian.
ru: Файл <filename>/usr/share/doc/ppp/README.Debian.gz</filename> содержит более подробную информацию об использовании PPP в Debian.
zh_cn: 阅读 <filename>/usr/share/doc/ppp/README.Debian.gz</filename> 可以获取更多Debian上的PPP配置信息。
zh_tw: 閱讀 <filename>/usr/share/doc/ppp/README.Debian.gz</filename> 可以獲得更多 Debian 上的 PPP 設定資訊。

source: For static SLIP connections, you will need to add the <userinput>slattach</userinput> command (from the <classname>net-tools</classname> package) into <filename>/etc/init.d/network</filename>. Dynamic SLIP will require the <classname>gnudip</classname> package.
el: Για στατικές συνδέσεις SLIP, θα χρειαστεί να προσθέσετε την εντολή <userinput>slattach</userinput> (από το πακέτο <classname>net-tools</classname>) στο αρχείο <filename>/etc/init.d/network</filename>. Δυναμικό SLIP απαιτεί το πακέτο <classname>gnudip</classname>.
ko: 고정 SLIP 연결을 하려면, <userinput>slattach</userinput> 명령(<classname>net-tools</classname> 패키지에 있음)을 <filename>/etc/init.d/network</filename>에 추가 하세요. 유동 SLIP은 <classname>gnudip</classname> 패키지가 필요할 것입니다.
pt: Para ligações SLIP estáticas, necessitará de adicionar o comando <userinput>slattach</userinput> (do pacote <classname>net-tools</classname>) no <filename>/etc/init.d/network</filename>. O SLIP dinâmico necessita do pacote <classname>gnudip</classname>.
ru: Для статических соединений SLIP вам надо добавить команду <userinput>slattach</userinput> (из пакета <classname>net-tools</classname>) в <filename>/etc/init.d/network</filename>. Для динамического SLIP требуется пакет <classname>gnudip</classname>.
zh_cn: 对于静态SLIP连接来说，您需要加上 <userinput>slattach</userinput> 命令(从 <classname>net-tools</classname> 软件包)到 <filename>/etc/init.d/network</filename>。动态 SLIP 要求 <classname>gnudip</classname> 软件包。
zh_tw: 對於靜態 SLIP 連接來說，您需要加上 <userinput>slattach</userinput> 指令 (位於 <classname>net-tools</classname> 軟體套件中) 到 <filename>/etc/init.d/network</filename>。動態 SLIP 需要 <classname>gnudip</classname> 軟體套件。

source: Setting Up PPP over Ethernet (PPPOE)
el: Ρύθμιση του PPP over Ethernet (PPPoE)
ko: PPP over Ethernet (PPPOE) 설정
pt: Configurar o PPP através de Ethernet (PPPOE)
ru: Настройка PPP через Ethernet (PPPOE)
zh_cn: 配置 PPP over Ethernet (PPPOE)
zh_tw: 設定 PPP over Ethernet (PPPOE)
