Repository: xobs/debian-installer
Catalog: doc/manual/po/*/boot-new.po
Languages: el, ko, pt, ru, zh_cn, zh_tw

source: For a more complete introduction to Debian and GNU/Linux, see <filename>/usr/share/doc/debian-guide/html/noframes/index.html</filename>.
el: Για μια πληρέστερη εισαγωγή στο Debian και στο GNU/Linux, δείτε το αρχείο<filename>/usr/share/doc/debian-guide/html/noframes/index.html</filename>.
ko: 데비안 GNU/리눅스에 대한 완전한 소개를 원한다면 <filename>/usr/share/doc/debian-guide/html/noframes/index.html</filename>를 보세요.
pt: Para uma introdução mais completa ao Debian e ao GNU/Linux, consulte <filename>/usr/share/doc/debian-guide/html/noframes/index.html</filename>.
ru: Более полное введение в Debian и GNU/Linux, смотрите в <filename>/usr/share/doc/debian-guide/html/noframes/index.html</filename>.
zh_cn: 了解更多的 Debian 和 GNU/Linux，请参阅 <filename>/usr/share/doc/debian-guide/html/noframes/index.html</filename>。
zh_tw: 想要多瞭解 Debian 和 GNU/Linux，請參閱 <filename>/usr/share/doc/debian-guide/html/noframes/index.html</filename>。
