Repository: xobs/debian-installer
Catalog: doc/manual/po/*/boot-installer.po
Languages: ko, pt, zh_tw

source: Booting the Installation System
ko: 설치 시스템 부팅하기
pt: Iniciar a Instalação do sistema
zh_tw: 啟動安裝系統

source: Booting the Installer on &arch-title;
ko: &arch-title;에서 설치 프로그램 부팅하기
pt: Iniciar o Instalador em &arch-title;
zh_tw: 在 &arch-title; 上啟動安裝程式

source: Alpha Console Firmware
ko: Alpha 콘솔 펌웨어
pt: Consola de Firmware Alpha
zh_tw: Alpha 控制台韌體

source: Console firmware is stored in a flash ROM and started when an Alpha system is powered up or reset. There are two different console specifications used on Alpha systems, and hence two classes of console firmware available:
ko: 콘솔 펌웨어는 플래시 ROM에 들어 있고 Alpha 시스템의 전원을 켜거나 리셋할 때 시작합니다. Alpha 시스템에는 두 가지 콘솔 방식이 있어서, 두 종류의 콘솔 펌웨어를 사용할 수 있습니다:
pt: A consola de firmware está guardada numa flash ROM e é iniciada quando um sistema Alpha é ligado ou reiniciado. Existem duas especificações diferentes de consolas utilizadas em sistemas Alpha, e assim, duas classes de consolas de firmware disponíveis.
zh_tw: 控制台韌體是儲存在一個快閃 ROM 中並且每次在 Alpha 系統開機或者重新啟動的時候啟動。在 Alpha 系統上有兩種規格的控制台，並且因此有兩類控制台韌體供使用。

source: <emphasis>SRM console</emphasis>, based on the Alpha Console Subsystem specification, which provides an operating environment for OpenVMS, Tru64 UNIX, and Linux operating systems.
ko: <emphasis>SRM 콘솔</emphasis>은, Alpha Console Subsystem 명세서에 기반하며, OpenVMS, Tru64 UNIX 및 리눅스 운영체제를 위한 운영 환경이 있습니다.
pt: As <emphasis>consolas SRM</emphasis>, baseadas na especificação do Alpha Console Subsystem, que disponibiliza um ambiente operacional para sistemas operativos OpenVMS, Tru64, UNIX e Linux.
zh_tw: <emphasis>SRM console</emphasis> 基於 Alpha 控制檯子系統。它為 OpenVMS， Tru64 Unix，以及 Linux 作業系統提供了一個操作環境。

source: <emphasis>ARC, AlphaBIOS, or ARCSBIOS console</emphasis>, based on the Advanced RISC Computing (ARC) specification, which provides an operating environment for Windows NT.
ko: <emphasis>ARC, AlphaBIOS, 혹은 ARCSBIOS 콘솔</emphasis>은, Advanced RISC Computing (ARC) 명세서에 기반하며, Windows NT를 위한 운영 환경이 있습니다.
pt: As <emphasis>consolas ARC, AlphaBIOS, ou ARCSBIOS</emphasis>, baseadas na especificação Advanced RISC Computing (ARC), que providencia um ambiente operacional para Windows NT.
zh_tw: <emphasis>ARC, AlphaBIOS 或 ARCSBIOS console</emphasis> 以 Advanced RISC Computing (ARC) 為基礎，為 Windows NT 提供了一個操作環境。

source: From the user's perspective, the most important difference between SRM and ARC is that the choice of console constrains the possible disk-partitioning scheme for the hard disk which you wish to boot off of.
ko: 사용자 측면에서 SRM과 ARC의 가장 중요한 차이점은, 어떤 콘솔을 선택하느냐에 따라서 부팅하려는 하드 디스크에 사용할 수 있는 파티션 방식이 다르다는 점입니다.
pt: Da perspectiva do utilizador, a diferença mais importante entre SRM e ARC é que a escolha da consola restringe o possível esquema de partição do disco a partir do qual deseja arrancar.
zh_tw: 從使用者的角度看，SRM 和 ARC 最重要的區別是控制台的選擇，可能會影響到您開機磁碟的分割方式。

source: ARC requires that you use an MS-DOS partition table (as created by <command>cfdisk</command>) for the boot disk. Therefore MS-DOS partition tables are the <quote>native</quote> partition format when booting from ARC. In fact, since AlphaBIOS contains a disk partitioning utility, you may prefer to partition your disks from the firmware menus before installing Linux.
ko: ARC에서는 부팅 디스크에 MS-DOS 파티션 테이블을 사용해야 합니다 (<command>cfdisk</command> 명령으로 만듭니다). 즉 MS-DOS 파티션 테이블은 ARC에서 부팅할 때 <quote>네이티브</quote> 파티션 형식입니다. AlphaBIOS에 디스크 파티션 유틸리티가 들어 있기 때문에, 원한다면 리눅스를 설치하기 전에 펌웨어 메뉴에서 디스크를 파티션할 수도 있습니다.
pt: ARC requer que utilize uma tabela de partições MS-DOS (como as criadas pelo <command>cfdisk</command>) para o disco de arranque. Assim, as tabelas de partições MS-DOS são do formato <quote>nativo</quote> quando se arranca a partir de ARC. De facto, como o AlphaBIOS contém um utilitário de particionamento de disco, você poderá preferir particionar os seus discos a partir dos menus do firmware, antes de instalar Linux.
zh_tw: ARC 需要您在開機磁碟上建立一個 MS-DOS 分割表(用 <command>cfdisk</command> 建立)。因此 MS-DOS 分割表是從 ARC 開機的``原始''分割區格式。事實上，由於 AlphaBIOS 包含了一個磁碟分割工具，您也許可以在安裝 Linux 時透過韌體選單對磁碟進行分割區。

source: Conversely, SRM is <emphasis>incompatible</emphasis><footnote> <para> Specifically, the bootsector format required by the Console Subsystem Specification conflicts with the placement of the DOS partition table. </para> </footnote> with MS-DOS partition tables. Since Tru64 Unix uses the BSD disklabel format, this is the <quote>native</quote> partition format for SRM installations.
ko: 그 반대로, SRM은 MS-DOS 파티션 테이블과 <emphasis>호환되지 않습니다</emphasis>. <footnote><para>특히, Console Subsystem Specification에서 필요한 부트섹터 형식이 DOS 파티션 테이블의 위치와 충돌합니다</para></footnote> Tru64 Unix는 BSD 디스크레이블 형식을 사용하기 때문에, 이 형식이 SRM 설치의 경우 <quote>네이티브</quote> 파티션 형식입니다.
pt: Inversamente, SRM é <emphasis>incompatível</emphasis><footnote> <para> Especificamente, o formato do sector de boot necessário pela Console Subsystem Specification entra em conflito com a colocação da tabela de partições do DOS. </para> </footnote> com as tabelas de partições MS-DOS. Como o Tru64 Unix utiliza o formato disklabel BSD, este é o formato de partição <quote>nativo</quote> para instalações SRM.
zh_tw: 保守地說，SRM 是<emphasis>不相容</emphasis>於 <footnote> <para> 具體來說，控制檯子系統規範與需要的開機磁區格式和 DOS 分割表表衝突。</para> </footnote> MS-DOS 分割表。由於 Tru64 Unix 使用的是 BSD 磁碟標記格式，對於 SRM 安裝來說，這是一個<quote>原始的</quote>分割區格式。

source: GNU/Linux is the only operating system on Alpha that can be booted from both console types, but &debian; &release; only supports booting on SRM-based systems. If you have an Alpha for which no version of SRM is available, if you will be dual-booting the system with Windows NT, or if your boot device requires ARC console support for BIOS initialization, you will not be able to use the &debian; &release; installer. You can still run &debian; &release; on such systems by using other install media; for instance, you can install Debian woody with MILO and upgrade.
ko: Alpha에서 GNU/리눅스는 이 두 콘솔에서 모두 부팅할 수 있는 유일한 운영체제입니다. 하지만 &debian; &release; 릴리스는 SRM 기반 시스템에서만 부팅을 지원합니다. SRM이 없는 Alpha 시스템을 가지고 있다면, Windows NT와 같이 선택 부팅을 할 것이고, BIOS 초기화에 ARC 콘솔 기능이 필요하다면, &debian; &release; 설치 프로그램을 사용할 수 없을 것입니다. ARC 콘솔이 필요한 경우에도 다른 설치 미디어를 이용해서 &debian; &release; 릴리스를 실행할 수 있습니다. 예를 들어 MILO로 데비안 woody를 설치하고 업그레이드할 수 있습니다.
pt: GNU/Linux é o único sistema operativo em Alpha que pode ser iniciado a partir de ambos os tipos de consola, mas &debian; &release; apenas suporta arranque em sistemas baseados em SRM (SRM-based). Se tem um Alpha para o qual nenhuma versão de SRM está disponível, se irá fazer dual-boot do sistema com Windows NT, ou se o seu periférico de boot requer suporte para uma consola ARC para inicialização por BIOS, não lhe irá ser possível correr o instalador de &debian; &release;. Será, no entanto, possível correr &debian; &release; em tais sistemas usando outro meio para instalar; por exemplo, poderá instalar o Debian woody com recurso ao MILO e fazendo upgrade.
zh_tw: 由於 GNU/Linux 是唯一能夠透過兩種控制台格式開機的系統，但是 &debian; $release只支援從以 SRM 為基礎的系統開機。如果您的 Alpha 沒有任何版本的 SRM，如果您希望和 Windows NT 做雙重開機，或是您個開機設備需要 ARC 控制台支援 BIOS 的初始化，您無法使用 &debian; &release; 安裝程式。所有其他的 Unix 型作業系統 (Tru64 Unix，FreeBSD，OpenBSD，以及 NetBSD) 和 OpenVMS 只能從 SRM 上面開機，而 Windows NT 只能從 ARC 上面開機。

source: Because <command>MILO</command> is not available for any of the Alpha systems currently in production (as of February 2000), and because it is no longer necessary to buy an OpenVMS or Tru64 Unix license to have SRM firmware on your older Alpha, it is recommended that you use SRM when possible.
ko: 현재 제조되는 (2000년 2월 이후로) Alpha 시스템에서는 <command>MILO</command>를 사용할 수 없으므로, 그리고 옛날 Alpha 시스템에서 SRM 펌웨어를 쓰려고 OpenVMS나 Tru64 유닉스 라이선스를 구입할 필요는 없으므로, 가능하면 SRM을 사용하기를 권장합니다.
pt: Uma vez que o <command>MILO</command> não está disponível para nenhum dos sistemas Alpha em produção corrente (em Fevereiro de 2000), e uma vez que já não é necessário comprar uma licença OpenVMS ou Tru64 Unix para ter firmware SRM no seu antigo Alpha, é recomendado que utilize SRM quando possível.
zh_tw: 由於在目前生產的 Alpha 系統上並沒有實作 <command>MILO</command>(從 2000 年二月份開始)。而且購買一個 OpenVMS 和 Tru64 Unix 授權，來在老 Alpha 上裝上 SRM 韌體也是不必要的。我們建議在新的機器上使用 SRM。

source: The following table summarizes available and supported system type/console combinations (see <xref linkend="alpha-cpus"/> for the system type names). The word <quote>ARC</quote> below denotes any of the ARC-compliant consoles.
ko: 다음 표는 지원하는 시스템 종류/콘솔을 요약한 것입니다 (시스템 종류 이름에 관해서는 <xref linkend="alpha-cpus"/> 참고). 아래의 <quote>ARC</quote>라는 말은 ARC와 호환되는 모든 콘솔을 뜻합니다.
pt: A tabela seguinte sumariza as combinações disponíveis e suportadas do tipo de sistema/consola (ver a <xref linkend="alpha-cpus"/> para os nomes dos tipos de sistema). A palavra <quote>ARC</quote> abaixo denota qualquer das consolas compatíveis com ARC.
zh_tw: 下面表格總括了可用以及支援的系統類型/控制台組合 (系統類型名稱參閱 <xref linkend="alpha-cpus"/> )。<quote>ARC</quote> 一詞表示任何和 ARC 相容的控制台。

source: System Type
ko: 시스템 종류
pt: Tipo de Sistema
zh_tw: 系統類型

source: Console Type Supported
ko: 지원하는 콘솔 종류
pt: Tipo de Consola Suportada
zh_tw: 支援的控制台類型

source: ARC or SRM
ko: ARC 혹은 SRM
pt: ARC ou SRM

source: SRM only
ko: SRM 전용
pt: só SRM

source: ARC (see motherboard manual) or SRM
ko: ARC (마더보드 매뉴얼 참고) 혹은 SRM
pt: ARC (veja o manual da motherboard) ou SRM

source: ARC only
ko: ARC 전용
pt: só ARC

source: Generally, none of these consoles can boot Linux directly, so the assistance of an intermediary bootloader is required. For the SRM console, <command>aboot</command>, a small, platform-independent bootloader, is used. See the (unfortunately outdated) <ulink url="&url-srm-howto;">SRM HOWTO</ulink> for more information on <command>aboot</command>.
ko: 이 콘솔 중에 어느 것도 직접 리눅스를 부팅할 수 없습니다. 그래서 중간 역할을 하는 부트 로더를 활용해야 합니다. SRM 콘솔의 경우 작은 플랫폼 독립 부트로더인, <command>aboot</command>를 사용합니다. <command>aboot</command>에 대한 더 자세한 정보는 <ulink url="&url-srm-howto;">SRM HOWTO</ulink>를 참고하십시오. (아쉽지만 좀 오래 된 내용)
pt: Geralmente, nenhuma destas consolas pode iniciar o Linux directamente, portanto é necessária a assistência de um gestor de arranque. Para a consola SRM, é usado o <command>aboot</command>, um gestor de arranque pequeno e independente da plataforma usada. Ver o (infelizmente desactualizado) <ulink url="&url-srm-howto;">SRM HOWTO</ulink> para mais informações acerca do <command>aboot</command>.
zh_tw: 一般來說，這些控制台都不能直接以 Linux 開機，因此需要一個中繼的 boot-loader。SRM 控制台使用一個小型的、平台獨立的 boot-loader，<command>aboot</command>。請參閱 (抱歉的是它也有點過時了) <ulink url="&url-srm-howto;">SRM HOWTO</ulink>來獲得更多有關資訊 <command>aboot</command>。

source: The following paragraphs are from the woody install manual, and are included here for reference; they may be useful to someone at a later date when Debian supports MILO-based installs again.
ko: 다음 문단은 woody 설치 매뉴얼에서 가져온 부분으로, 참고하십시오. 나중에 데비안이 MILO 기반 설치를 다시 지원할 때 유용할 것입니다.
pt: Os parágrafos seguintes são referentes ao manual de instalação do woody, e são aqui incluídos para referência; podem vir a ser úteis mais à frente, quando o Debian voltar a suportar instalações baseadas em MILO.
zh_tw: 以下章節來自 woody 安裝手冊，放在這裡作為參考﹔如果以後 Debian 再支援基於 MILO 的安裝，它們或許對某些人有用。

source: Generally, none of these consoles can boot Linux directly, so the assistance of an intermediary bootloader is required. There are two mainstream Linux loaders: <command>MILO</command> and <command>aboot</command>.
ko: 이 콘솔 중에 어느 것도 리눅스를 직접 부팅할 수 없습니다. 그래서 중간 역할을 하는 부트 로더를 활용해야 합니다. 주로 쓰는 리눅스 로더 프로그램은 두 개인데, <command>MILO</command>와 <command>aboot</command>입니다.
pt: Geralmente, nenhuma destas consolas pode arrancar o Linux directamente, portanto é necessário o recurso a um gestor de arranque intermediário. Há dois gestores de arranque de Linux muito populares: <command>MILO</command> e <command>aboot</command>.
zh_tw: 一般來說，這些控制台都不能直接以 Linux 開機，因此需要一個中繼的 boot-loader。這裡有兩個主要的 Linux loader：<command>MILO</command> 和 <command>aboot</command>。

source: <command>MILO</command> is itself a console, which replaces ARC or SRM in memory. <command>MILO</command> can be booted from both ARC and SRM and is the only way to bootstrap Linux from the ARC console. <command>MILO</command> is platform-specific (a different <command>MILO</command> is needed for each system type) and exist only for those systems, for which ARC support is shown in the table above. See also the (unfortunately outdated) <ulink url="&url-milo-howto;">MILO HOWTO</ulink>.
ko: <command>MILO</command>는 그 자체가 콘솔이며, 메모리에서 ARC나 SRM을 덮어 씁니다. <command>MILO</command>는 ARC나 SRM에서 부팅할 수 있으며 ARC 콘솔에서는 리눅스를 부팅할 수 있는 유일한 방법입니다. <command>MILO</command>는 플랫폼에 따라 다르고 (각 시스템 종류에 따라 다른 <command>MILO</command>가 필요합니다) 위의 표에서 ARC를 지원하는 시스템에만 있습니다. <ulink url="&url-milo-howto;">MILO HOWTO</ulink>도 참고하십시오 (아쉽지만 좀 오래된 내용).
pt: <command>MILO</command> é em si mesmo uma consola, que substitui a ARC ou a SRM em memória. <command>MILO</command> pode ser iniciado tanto a partir da ARC como da SRM e é a única maneira de fazer o bootstrap a partir da consola ARC. <command>MILO</command> é específico de uma plataforma (são necessários diferentes <command>MILO</command> para cada tipo de sistema) e existe apenas para esses sistemas, para os quais o suporte ARC é mostrado na tabela acima. Ver também o (infelizmente desactualizado) <ulink url="&url-milo-howto;">MILO HOWTO</ulink>.
zh_tw: <command>MILO</command> 自己本身就是一個控制台，可以替換載入記憶體中的 ARC 和 SRM。<command>MILO</command> 能夠同時從 ARC 和 SRM 開機並且是唯一一種從 ARC 控制台啟動 Linux 的方法。<command>MILO</command> 是與平台相依的 (對於每種不同的系統需要不同的 <command>MILO</command>) 並且只適合這些平台。請參閱 (很遺憾有點過時) <ulink url="&url-milo-howto;">MILO HOWTO</ulink>。

source: <command>aboot</command> is a small, platform-independent bootloader, which runs from SRM only. See the (also unfortunately outdated) <ulink url="&url-srm-howto;">SRM HOWTO</ulink> for more information on <command>aboot</command>.
ko: <command>aboot</command>는 작은 플랫폼 독립 부트로더로, SRM에서만 동작합니다. <command>aboot</command>에 대한 더 자세한 정보는 <ulink url="&url-srm-howto;">SRM HOWTO</ulink>를 참고하십시오 (역시 아쉽지만 좀 오래된 내용).
pt: <command>aboot</command> é um pequeno e independente gestor de arranque, que apenas corre a partir de SRM. Ver também o (infelizmente desactualizado) <ulink url="&url-srm-howto;">SRM HOWTO</ulink> para mais informação acerca do <command>aboot</command>.
zh_tw: <command>aboot</command> 是一個小型的，平台獨立的 boot-loader，不過只運作於 SRM 上。請參閱 (遺憾的是它也有點過時了 ) <ulink url="&url-srm-howto;">SRM HOWTO</ulink>來取得更多有關資訊 <command>aboot</command>。

source: Thus, three scenarios are generally possible, depending on the system's console firmware and whether or not <command>MILO</command> is available: <informalexample><screen> SRM -&gt; aboot SRM -&gt; MILO ARC -&gt; MILO </screen></informalexample> Because <command>MILO</command> is not available for any of the Alpha systems currently in production (as of February 2000), and because it is no longer necessary to buy an OpenVMS or Tru64 Unix license to have SRM firmware on your older Alpha, it is recommended that you use SRM and <command>aboot</command> on new installations of GNU/Linux, unless you wish to dual-boot with Windows NT.
ko: 즉, 시스템의 콘솔 펌웨어가 무엇인가와 <command>MILO</command>를 사용할 수 있는지 여부에 따라 세 가지 방법이 가능합니다: <informalexample><screen> SRM -&gt; aboot SRM -&gt; MILO ARC -&gt; MILO </screen></informalexample> 현재 제조되는 (2000년 2월 이후로) Alpha 시스템에서는 <command>MILO</command>를 사용할 수 없으므로, 그리고 옛날 Alpha 시스템에서 SRM 펌웨어를 쓰려고 OpenVMS나 Tru64 유닉스 라이선스를 구입할 필요는 없으므로, 가능하면 SRM을 사용하기를 권장합니다. (Windows NT와 듀얼 부팅을 하는 경우가 아니라면.)
pt: Assim, três cenários são normalmente possíveis, dependendo da consola do firmware do sistema e se o <command>MILO</command> está ou não disponível: <informalexample><screen> SRM -&gt; aboot SRM -&gt; MILO ARC -&gt; MILO </screen></informalexample> Como <command>MILO</command> não está disponível para nenhum dos sistemas Alpha correntemente em produção (em Fevereiro de 2000), e porque não é mais necessário comprar uma licença Unix OpenVMS ou Tru64 para ter firmware SRM no seu Alpha mais antigo, é recomendado que use SRM e <command>aboot</command> nas novas instalações de GNU/Linux, a não ser que deseje fazer dual-boot com Windows NT.
zh_tw: 因此，三種方案都是可行的，但取決與系統控制台韌體以及是否有可用的 <command>MILO</command>：<informalexample><screen> SRM -&gt; aboot SRM -&gt; MILO ARC -&gt; MILO </screen></informalexample> 由於 <command>MILO</command> 並沒有實作於目前生產的 Alpha 系統上(從 2000 年二月份開始)。而且也不需要購買 OpenVMS 和 Tru64 Unix 授權，來在老 Alpha 上裝上 SRM 韌體。除非您想採用 Windows NT 並且進行雙開機，我們建議在新的機器上使用 SRM 和 <command>aboot</command> 安裝 Linux。

source: The majority of AlphaServers and all current server and workstation products contain both SRM and AlphaBIOS in their firmware. For <quote>half-flash</quote> machines such as the various evaluation boards, it is possible to switch from one version to another by reflashing the firmware. Also, once SRM is installed, it is possible to run ARC/AlphaBIOS from a floppy disk (using the <command>arc</command> command). For the reasons mentioned above, we recommend switching to SRM before installing &debian;.
ko: AlphaServer의 대다수와 현재의 모든 서버와 워크스테이션 제품들에는 펌웨어 안에 SRM과 AlphaBIOS가 모두 들어 있습니다. 여러가지 평가보드처럼 <quote>반쪽-플래시</quote>기계들의 경우에는, 펌웨어를 플래시에 다시 쓰는 방법을 통해 두 가지 사이를 전환할 수 있습니다. 또 SRM을 설치하면 플로피 디스크에서 ARC/AlphaBIOS를 실행할 수 있습니다 (<command>arc</command> 명령어 사용). 위에서 설명한 이유들때문에, 우리는 &debian;을 설치하기 전에 SRM으로 바꾸기를 권장합니다.
pt: A maioria dos AlphaServers e todos os produtos actuais para servidores e estações de trabalho contém tanto SRM como AlphaBIOS no seu firmware. Para máquinas <quote>half-flash</quote> tais como as várias placas de avaliação, é possível mudar de uma versão para outra apenas fazendo novamente o flash ao firmware. Além disso, uma vez o SRM esteja instalado, é possível correr o ARC/AlphaBIOS a partir de uma disquete (usando o comando <command>arc</command>). Pelas razões mencionadas acima, nós recomendamos que mude para SRM antes de instalar &debian;.
zh_tw: 大部分 AlphaServers 以及目前所有的伺服器以及工作站產品韌體中都同時含有 SRM 和 AlphaBIOS 。對於具有不同試用主機板的 <quote>half-flash</quote> 機器來說。可以透過重寫韌體切換到另外一個版本。一旦 SRM 安裝完畢，從軟碟上運行 ARC/AlphaBIOS 也是可能的 (使用 <command>arc</command>)。基於上述理由，我們建議在安裝 &debian; 之前切換至 SRM。

source: As on other architectures, you should install the newest available revision of the firmware<footnote> <para> Except on Jensen, where Linux is not supported on firmware versions newer than 1.7 &mdash; see <ulink url="&url-jensen-howto;"></ulink> for more information. </para> </footnote> before installing &debian;. For Alpha, firmware updates can be obtained from <ulink url="&url-alpha-firmware;">Alpha Firmware Updates</ulink>.
ko: 다른 아키텍쳐와 마찬가지로, &debian;을 설치하기 전에 항상 최신 버전의 펌웨어를 <footnote><para>Jensen의 경우는 예외입니다. Jensen에서는 1.7 뒤 버전의 펌웨어에서 리눅스를 사용할 수 없습니다. 자세한 정보는 <ulink url="&url-jensen-howto;"></ulink> 참고.</para></footnote> 설치해야 합니다. Alpha의 경우, 펌웨어 업데이트는 <ulink url="&url-alpha-firmware;">Alpha Firmware Updates</ulink>에서 구할 수 있습니다.
pt: Assim como noutras arquitecturas, deverá instalar a revisão de firmware mais recente<footnote> <para> Excepto em Jensen, onde o Linux não é suportado nas versões superiores a 1.7 &mdash; ver <ulink url="&url-jensen-howto;"></ulink> para mais informação. </para> </footnote> antes de instalar &debian;. Para Alpha, os updates de firmware podem ser obtidos a partir de <ulink url="&url-alpha-firmware;">Alpha Firmware Updates </ulink>.
zh_tw: 和其他的架構一樣，您也應該在安裝 &debian; 之前安裝最新的韌體版本。但 <footnote><para> 不包括 Jensen 1.7 以上的韌體版本，其不支援 Linux &mdash; 請參閱 <ulink url="&url-jensen-howto;"></ulink> 以取得更多的資訊。</para> </footnote>。對於 Alpha 來說，韌體升級可以從 <ulink url="&url-alpha-firmware;">Alpha Firmware Updates</ulink> 取得。

source: Booting with TFTP
ko: TFTP로 부팅하기
pt: Iniciar com TFTP
zh_tw: 用 TFTP 開機

source: In SRM, Ethernet interfaces are named with the <userinput>ewa</userinput> prefix, and will be listed in the output of the <userinput>show dev</userinput> command, like this (edited slightly): <informalexample><screen> &gt;&gt;&gt; show dev ewa0.0.0.9.0 EWA0 08-00-2B-86-98-65 ewb0.0.0.11.0 EWB0 08-00-2B-86-98-54 ewc0.0.0.2002.0 EWC0 00-06-2B-01-32-B0 </screen></informalexample> You first need to set the boot protocol: <informalexample><screen> &gt;&gt;&gt; set ewa0_protocol bootp </screen></informalexample> Then check the medium type is correct: <informalexample><screen> &gt;&gt;&gt; set ewa0_mode <replaceable>mode</replaceable> </screen></informalexample> You can get a listing of valid modes with <userinput>&gt;&gt;&gt;set ewa0_mode</userinput>.
ko: SRM에서 이더넷 인터페이스는 이름 앞에 <userinput>ewa</userinput>가 붙고, <userinput>show dev</userinput> 명령을 실행하면 다음과 같은 인터페이스 목록을 볼 수 있습니다: <informalexample><screen> &gt;&gt;&gt; show dev ewa0.0.0.9.0 EWA0 08-00-2B-86-98-65 ewb0.0.0.11.0 EWB0 08-00-2B-86-98-54 ewc0.0.0.2002.0 EWC0 00-06-2B-01-32-B0 </screen></informalexample> 먼저 부팅 프로토콜을 설정해야 합니다: <informalexample><screen> &gt;&gt;&gt; set ewa0_protocol bootp </screen></informalexample> 그 다음에 미디어 종류를 올바르게 맞추십시오: <informalexample><screen> &gt;&gt;&gt; set ewa0_mode <replaceable>mode</replaceable> </screen></informalexample> <userinput>&gt;&gt;&gt;set ewa0_mode</userinput> 명령으로 가능한 모드 목록을 볼 수 있습니다.
pt: Em SRM, as interfaces Ethernet são nomeados com o prefixo <userinput>ewa</userinput>, e serão listados no output do comando <userinput>show dev</userinput>, tal como se mostra em seguida (ligeiramente editado): <informalexample><screen> &gt;&gt;&gt; show dev ewa0.0.0.9.0 EWA0 08-00-2B-86-98-65 ewb0.0.0.11.0 EWB0 08-00-2B-86-98-54 ewc0.0.0.2002.0 EWC0 00-06-2B-01-32-B0 </screen></informalexample> Primeiro, necessita de estabelecer o protocolo de arranque: <informalexample><screen> &gt;&gt;&gt; set ewa0_protocol bootp </screen></informalexample>Seguidamente, deverá ver se o tipo de media é correcto:<informalexample><screen> &gt;&gt;&gt; set ewa0_mode <replaceable>mode</replaceable> </screen></informalexample>Pode obter uma lista dos modos válidos através de <userinput>&gt;&gt;&gt;set ewa0_mode</userinput>.
zh_tw: 在 SRM 上，以太網路介面名稱帶有 <userinput>ewa</userinput> 前綴，並可以用 <userinput>show dev</userinput> 命令列出，類似如下 (可能有一點不同)：<informalexample><screen> &gt;&gt;&gt; show dev ewa0.0.0.9.0 EWA0 08-00-2B-86-98-65 ewb0.0.0.11.0 EWB0 08-00-2B-86-98-54 ewc0.0.0.2002.0 EWC0 00-06-2B-01-32-B0 </screen></informalexample> 您首先需要設定開機協定： <informalexample><screen> &gt;&gt;&gt; set ewa0_protocol bootp </screen></informalexample> 然後檢查媒介類型是否正確： <informalexample><screen> &gt;&gt;&gt; set ewa0_mode <replaceable>mode</replaceable> </screen></informalexample> 您檢閱有效模式的列表 <userinput>&gt;&gt;&gt;set ewa0_mode</userinput>。

source: Then, to boot from the first Ethernet interface, you would type: <informalexample><screen> &gt;&gt;&gt; boot ewa0 -flags "" </screen></informalexample> This will boot using the default kernel parameters as included in the netboot image.
ko: 그 다음, 첫 번째 이더넷 인터페이스로 부팅하려면 다음을 입력하십시오: <informalexample><screen> &gt;&gt;&gt; boot ewa0 -flags "" </screen></informalexample> 그러면 netboot 이미지에 들어 있는 대로 기본 커널 파라미터를 사용해 부팅하게 됩니다.
pt: Depois, para iniciar a primeira interface de Ethernet, deverá digitar: <informalexample><screen> &gt;&gt;&gt; boot ewa0 -flags "" </screen></informalexample> Isto irá iniciar os parâmetros de kernel pré-definidos, como foram incluídos na imagem netboot.
zh_tw: 接下來，如果從第一個以太網路介面開機，您需要輸入：<informalexample><screen> &gt;&gt;&gt; boot ewa0 -flags "" </screen></informalexample> 這會把 netboot 映像啟動，並使用預設的核心參數。
