Repository: xobs/debian-installer
Catalog: doc/manual/po/*/boot-new.po
Languages: el, ko, pt, ru, zh_cn, zh_tw

source: If you choose <quote>manual package selection</quote> <emphasis>without</emphasis> selecting any tasks, no packages will be installed by default. This means you can use this option if you want to install a minimal system, but also that the responsibility for selecting any packages not installed as part of the base system (before the reboot) that might be required for your system lies with you.
el: Αν διαλέξετε <quote>manual package selection</quote> <emphasis>χωρίς</emphasis> να επιλέξετε κάποια καθήκοντα, τότε κανένα πακέτο δεν θα εγκατασταθεί αυτόματα. Αυτό σημαίνει ότι μπορείτε να κάνετε αυτή την επιλογή αν θέλετε να εγκαταστήσετε ένα ελάχιστο σύστημα, αλλά και ότι η ευθύνη για την μη εγκατάσταση οποιωνδήποτε πακέτων σαν μέρους του βασικού συστήματος (πριν την επανεκκίνηση) που πιθανόν να είναι απαραίτητα στο σύστημά σας είναι δική σας.
ko: 아무런 태스크의 선택 <emphasis>없이</emphasis> <quote>manual package selection</quote>을 선택했다면, 기본으로 아무런 패키지도 설치되지 않을 것입니다. 최소의 시스템 설치를 원한다면 이 옵션을 사용할 수 있습니다. 하지만, 재부팅 하기 전에 기본 시스템의 일부로 설치되어야 하는 패키지들의 선택의 책임도 당신에게 있습니다.
pt: Se escolher a <quote>selecção manual de pacotes</quote> <emphasis>sem</emphasis> escolher qualquer tarefa, nenhum pacote irá ser instalado por omissão. Isto significa que pode usar esta opção se pretender instalar um sistema mínimo, mas também que a responsabilidade para seleccionar qualquer pacote não instalado como parte do sistema base (antes do reboot) que pode ser necessária para o seu sistema.
ru: Если вы предпочли <quote>выбор пакетов вручную</quote> и <emphasis>не выбрали</emphasis> ни одной задачи, то по умолчанию не будет установлено ни одного пакета. Этот вариант можно использовать для установки минимальной системы, но в этом случае ответственность за выбор пакетов, которые не устанавливаются как часть базовой системы (перед перезагрузкой) лежит полностью на вас.
zh_cn: 如果您选择 <quote>manual package selection</quote> <emphasis>而不</emphasis> 选择任务，默认不会安装任何软件包。这就是说，如果您希望安装一个最小系统，并且您的系统(启动之前)不需要选择安装任何软件包，可用使用该选项。
zh_tw: 如果您選擇<quote>手動選取套件</quote><emphasis>而不</emphasis>選擇軟體集，預設不會安裝任何軟體套件。這就是說，如果您希望安裝一個最小系統，並且您的系統 (啟動之前) 不需要安裝任何軟體套件，可用使用該選項。

source: Of the &num-of-distrib-pkgs; packages available in Debian, only a small minority are covered by tasks offered in the Task Installer. To see information on more packages, either use <userinput>apt-cache search <replaceable>search-string</replaceable></userinput> for some given search string (see the <citerefentry> <refentrytitle>apt-cache</refentrytitle> <manvolnum>8</manvolnum> </citerefentry> man page), or run <command>aptitude</command> as described below.
el: Από τα &num-of-distrib-pkgs; πακέτα που είναι διαθέσιμα στο Debian, μόνο μια μικρή μειοψηφία καλύπτονται από τα καθήκοντα που προσφέρει ο Εγκαταστάτης Καθηκόντων. Για να δείτε πληροφορίες για περισσότερα πακέτα. χρησιμοποιήστε είτε την εντολή <userinput>apt-cache search <replaceable>search-string</replaceable></userinput> για κάποια συγκεκριμένη συμβολοσειρά που θέλετε να ψάξετε (δείτε σχετικά την σελίδα εγχειριδίου (man page)του <citerefentry> <refentrytitle>apt-cache</refentrytitle> <manvolnum>8</manvolnum> </citerefentry>) ή τρέξτε το <command>aptitude</command> όπως περιγράφεται παρακάτω.
ko: 데비안에서는 &num-of-distrib-pkgs; 패키지들이 사용가능 하기 때문에 태스크 설치관리자에서 제공되는 태스크들은 작은 수의 것들만 포함되어 있습니다. 더 많은 패키지들의 정보를 보기위해서는 <userinput>apt-cache search <replaceable>search-string</replaceable></userinput>를 사용해 주어진 문자열을 검색하거나 다음에 설명되는 <command>aptitude</command>를 실행하세요. (<citerefentry> <refentrytitle>apt-cache</refentrytitle> <manvolnum>8</manvolnum> </citerefentry> man 페이지를 보세요.)
pt: Dos &num-of-distrib-pkgs; pacotes disponíveis no Debian, apenas uma pequena minoria está coberta pelas tarefas oferecidas no Instalador de Tarefas. Para ver informação sobre mais pacotes, pode usar o <userinput>apt-cache search <replaceable>search-string</replaceable></userinput> para uma data string de pesquisa (ver a página do manual <citerefentry> <refentrytitle>apt-cache</refentrytitle> <manvolnum>8</manvolnum> </citerefentry>), ou execute o <command>aptitude</command> como descrito abaixo.
ru: Из &num-of-distrib-pkgs; пакетов, доступных в Debian, только малая часть выбирается с помощью задач. Чтобы посмотреть информацию об остальных пакетах, используйте <userinput>apt-cache search <replaceable>строка поиска</replaceable></userinput> (смотрите man-страницу <citerefentry> <refentrytitle>apt-cache</refentrytitle> <manvolnum>8</manvolnum> </citerefentry>), либо запустите <command>aptitude</command> как это описано ниже.
zh_cn: 在 &num-of-distrib-pkgs; 的 Debian 软件包中，只有少数被任务安装器涵盖。为了了解更多软件包的信息，使用 <userinput>apt-cache search <replaceable>search-string</replaceable></userinput> 查找搜索字符串(参考 <citerefentry> <refentrytitle>apt-cache</refentrytitle> <manvolnum>8</manvolnum> </citerefentry> man 页), 或者执行 <command>aptitude</command> 下面有说明。
zh_tw: 在 &num-of-distrib-pkgs; 的 Debian 軟體套件中，只有少數被軟體集安裝程式涵蓋。為了瞭解更多軟體套件的資訊，請使用 <userinput>apt-cache search <replaceable>search-string</replaceable></userinput> 搜索字串 (請參閱 <citerefentry> <refentrytitle>apt-cache</refentrytitle> <manvolnum>8</manvolnum> </citerefentry> man 頁), 或者執行 <command>aptitude</command> 以觀看畫面下面的說明。

source: Advanced Package Selection with <command>aptitude</command>
el: Προχωρημένη Επιλογή πακέτων με το <command>aptitude</command>
ko: <command>aptitude</command>를 사용한 고급 패키지 선택
pt: Selecção de Pacotes Avançada com o <command>aptitude</command>
ru: Усовершенствованный выбор пакетов с помощью <command>aptitude</command>
zh_cn: 高级软件包选择 <command>aptitude</command>
zh_tw: <command>aptitude</command> 軟體套件進階選擇

source: <command>Aptitude</command> is a modern program for managing packages. <command>aptitude</command> allows you to select individual packages, set of packages matching given criteria (for advanced users), or whole tasks.
el: Το <command>Aptitude</command> είναι ένα μοντέρνο πρόγραμμα για την διαχείριση πακέτων. Το <command>aptitude</command> σας επιτρέπει να διαλέγετε μεμονωμένα πακέτα, σύνολα πακέτων που ταιριάζουν κάποια συγκεκριμένα κριτήρια (για προχωρημένους χρήστες), ή ολόκληρα καθήκοντα.
ko: <command>Aptitude</command>는 패키지 관리를 위한 최신 프로그램입니다. <command>aptitude</command>는 당신이 개별 패키지나 주어진 기준에 맞는 패키지들의 집합이나 전체 태스크를 선택할 수 있게 해줍니다.
pt: O <command>aptitude</command> é um programa moderno para gerir pacotes. O <command>aptitude</command> permite-lhe seleccionar pacotes individuais, conjuntos de pacotes por um dado critério (para utilizadores avançados), ou tarefas inteiras.
ru: <command>Aptitude</command> &mdash; это новая программа управления пакетами. <command>aptitude</command> позволяет вам выбирать индивидуальные пакеты, наборы пакетов, соответствующие заданным критериям (для опытных пользователей) или по задаче.
zh_cn: <command>Aptitude</command> 是管理软件包的流行软件。<command>aptitude</command> 允许您选择单独的软件包，匹配给定标准的软件包(针对高级用户)，或者整个任务。
zh_tw: <command>Aptitude</command> 是管理軟體套件的流行軟體。<command>aptitude</command> 允許您選擇單獨的軟體套件，符合指定要求的軟體套件群組 (針對進階使用者)，或者整個軟體集。

source: The most basic keybindings are: <informaltable> <tgroup cols="2"> <thead> <row> <entry>Key</entry><entry>Action</entry> </row> </thead> <tbody> <row> <entry><keycap>Up</keycap>, <keycap>Down</keycap></entry> <entry>Move selection up or down.</entry> </row><row> <entry>&enterkey;</entry> <entry>Open/collapse/activate item.</entry> </row><row> <entry><keycap>+</keycap></entry> <entry>Mark package for installation.</entry> </row><row> <entry><keycap>-</keycap></entry> <entry>Mark package for removal.</entry> </row><row> <entry><keycap>d</keycap></entry> <entry>Show package dependencies.</entry> </row><row> <entry><keycap>g</keycap></entry> <entry>Actually download/install/remove packages.</entry> </row><row> <entry><keycap>q</keycap></entry> <entry>Quit current view.</entry> </row><row> <entry><keycap>F10</keycap></entry> <entry>Activate menu.</entry> </row> </tbody></tgroup></informaltable> For more commands see the online help under the <keycap>?</keycap> key.
el: Οι πιο βασικές συντομεύσεις πληκτρολογίου είναι: <informaltable> <tgroup cols="2"> <thead> <row> <entry>Πλήκτρο</entry><entry>Δράση</entry> </row> </thead> <tbody> <row> <entry><keycap>Πάνω</keycap>, <keycap>Κάτω</keycap></entry> <entry>Μετακίνηση επιλογής πάνω ή κάτω.</entry> </row><row> <entry>&enterkey;</entry> <entry>Άνοιγμα/Κλείσιμο/Ενεργοποίηση αντικειμένου.</entry> </row><row> <entry><keycap>+</keycap></entry> <entry>Σημείωση πακέτου για εγκατάσταση.</entry> </row><row> <entry><keycap>-</keycap></entry> <entry>Σημείωση πακέτου για απεγκατάσταση.</entry> </row><row> <entry><keycap>d</keycap></entry> <entry>Εμφάνιση εξαρτήσεων πακέτου.</entry> </row><row> <entry><keycap>g</keycap></entry> <entry>Μεταφόρτωση/εγκατάσταση/απεγκατάσταση των πακέτων.</entry> </row><row> <entry><keycap>q</keycap></entry> <entry>Έξοδος από την τρέχουσα οθόνη.</entry> </row><row> <entry><keycap>F10</keycap></entry> <entry>Ενεργοποίηση μενού.</entry> </row> </tbody></tgroup></informaltable> Για περισσότερες εντολές δείτε την online βοήθεια με το πλήκτρο <keycap>?</keycap>.
ko: 가장 기본적인 키 연결은 다음과 같습니다. <informaltable> <tgroup cols="2"> <thead> <row> <entry>Key</entry><entry>Action</entry> </row> </thead> <tbody> <row> <entry><keycap>Up</keycap>, <keycap>Down</keycap></entry> <entry>선택을 위/아래로 움직임</entry> </row><row><entry>&enterkey;</entry> <entry>아이템 열기/닫기/활성화</entry> </row><row> <entry><keycap>+</keycap></entry> <entry>패키지 설치하도록 표시</entry> </row><row> <entry><keycap>-</keycap></entry> <entry>패키지를 제거하도록 표시</entry> </row><row> <entry><keycap>d</keycap></entry> <entry>패키지 의존성 보여주기</entry> </row><row> <entry><keycap>g</keycap></entry> <entry>패키지 다운로드/설치/제거를 실제로 수행</entry> </row><row> <entry><keycap>q</keycap></entry> <entry>현재 보여지는 것을 그만둠</entry> </row><row> <entry><keycap>F10</keycap></entry> <entry>메뉴 활성화</entry> </row> </tbody></tgroup></informaltable> 더 많은 명령어에 대해 보기를 원한다면 <keycap>?</keycap> 키를 눌러 온라인 도움말을 보세요.
pt: As combinações de teclas mais utilizadas são: <informaltable> <tgroup cols="2"> <thead> <row> <entry>Tecla</entry><entry>Action</entry> </row> </thead> <tbody> <row> <entry><keycap>Cima</keycap>, <keycap>Baixo</keycap></entry> <entry>Move a selecção para cima e para baixo.</entry> </row><row> <entry>&enterkey;</entry> <entry>Abrir/expandir/activar um item.</entry> </row><row> <entry><keycap>+</keycap></entry> <entry>Marcar o pacote para ser instalado.</entry> </row><row> <entry><keycap>-</keycap></entry> <entry>Marcar o pacote para ser desinstalado.</entry> </row><row> <entry><keycap>d</keycap></entry> <entry>Mostra as dependências do pacote.</entry> </row><row> <entry><keycap>g</keycap></entry> <entry>Faz a transferência/instalação/desinstalação dos pacotes.</entry> </row><row> <entry><keycap>q</keycap></entry> <entry>Sair da vista actual.</entry> </row><row> <entry><keycap>F10</keycap></entry> <entry>Activa o menu.</entry> </row> </tbody></tgroup></informaltable> Para mais comandos veja a ajuda utilizando a tecla <keycap>?</keycap>.
ru: Часто используемые сочетания клавиш: <informaltable> <tgroup cols="2"> <thead> <row> <entry>Клавиша</entry><entry>Действие</entry> </row> </thead> <tbody> <row> <entry><keycap>Вверх</keycap>, <keycap>Вниз</keycap></entry> <entry>Переместить выделение вверх или вниз.</entry> </row><row> <entry>&enterkey;</entry> <entry>Открыть/развернуть/активировать пункт.</entry> </row><row> <entry><keycap>+</keycap></entry> <entry>Пометить пакет для установки.</entry> </row><row> <entry><keycap>-</keycap></entry> <entry>Пометить пакет для удаления.</entry> </row><row> <entry><keycap>d</keycap></entry> <entry>Показать зависимости пакета.</entry> </row><row> <entry><keycap>g</keycap></entry> <entry>Выполнить загрузку/установку/удаление пакетов.</entry> </row><row> <entry><keycap>q</keycap></entry> <entry>Выход из текущего вида.</entry> </row><row> <entry><keycap>F10</keycap></entry> <entry>Активация меню.</entry> </row> </tbody></tgroup></informaltable> Остальные команды смотрите в справке к программе вызываемой по клавише <keycap>?</keycap>.
zh_cn: 最基本的绑定键是： <informaltable> <tgroup cols="2"> <thead> <row> <entry>按键</entry><entry>动作</entry> </row> </thead> <tbody> <row> <entry><keycap>Up</keycap>, <keycap>Down</keycap></entry> <entry>上下移到选项。</entry> </row><row> <entry>&enterkey;</entry> <entry>打开/关闭/激活 项目。</entry> </row><row> <entry><keycap>+</keycap></entry> <entry>标注要安装的软件包。</entry> </row><row> <entry><keycap>-</keycap></entry> <entry>标注要删除的软件包。</entry> </row><row> <entry><keycap>d</keycap></entry> <entry>显示软件包依赖关系。</entry> </row><row> <entry><keycap>g</keycap></entry> <entry>实际 下载/安装/删除 软件包。</entry> </row><row> <entry><keycap>q</keycap></entry> <entry>关闭当前视图。</entry> </row><row> <entry><keycap>F10</keycap></entry> <entry>激活菜单</entry> </row> </tbody></tgroup></informaltable> 查看更多的帮助请按 <keycap>?</keycap> 键。
zh_tw: 最基本的按鍵組合是： <informaltable> <tgroup cols="2"> <thead> <row> <entry>按鍵</entry><entry>動作</entry> </row> </thead> <tbody> <row> <entry><keycap>Up</keycap>, <keycap>Down</keycap></entry> <entry>上下移到選項。</entry> </row><row> <entry>&enterkey;</entry> <entry>展開/關閉/啟用 項目。</entry> </row><row> <entry><keycap>+</keycap></entry> <entry>標註要安裝的軟體套件。</entry> </row><row> <entry><keycap>-</keycap></entry> <entry>標註要刪除的軟體套件。</entry> </row><row> <entry><keycap>d</keycap></entry> <entry>顯示軟體套件依賴關係。</entry> </row><row> <entry><keycap>g</keycap></entry> <entry>實際 下載/安裝/刪除 軟體套件。</entry> </row><row> <entry><keycap>q</keycap></entry> <entry>離開目前畫面。</entry> </row><row> <entry><keycap>F10</keycap></entry> <entry>啟用選單</entry> </row> </tbody></tgroup></informaltable> 查看更多的幫助請按 <keycap>?</keycap> 鍵。

source: Prompts During Software Installation
el: Διάφορα προτρεπτικά κατά την εγκατάσταση λογισμικού
ko: 소프트웨어 설치 중의 프롬프트
pt: Perguntas Durante a Instalação do Software
ru: Вопросы во время установки программ
zh_cn: 软件安装过程中的命令
zh_tw: 軟體安裝過程中的指令

source: Each package you selected with <command>tasksel</command> or <command>aptitude</command> is downloaded, unpacked and then installed in turn by the <command>apt-get</command> and <command>dpkg</command> programs. If a particular program needs more information from the user, it will prompt you during this process. You might also want to keep an eye on the output during the process, to watch for any installation errors (although you will be asked to acknowledge errors which prevented a package's installation).
el: Κάθε πακέτο που επιλέγετε με το <command>tasksel</command> ή το <command>aptitude</command> κατεβαίνει, αποσυμπιέζεται και μετά εγκαθίσταται το ένα μετά το άλλο με τα προγράμματα <command>apt-get</command> και<command>dpkg</command>. Αν ένα συγκεκριμένο πρόγραμμα χρειάζεται περισσότερες πληροφορίες από τον χρήστη, θα τον προτρέψει στη διάρκεια της διαδικασίας αυτής. Πιθανόν επίσης να θέλετε να επιβλέπετε την παραγόμενη πληροφορία από την όλη διαδικασία, προσέχοντας για οποιαδήποτε λάθη κατά την εγκατάσταση (αν και θα σας ζητηθεί να σημειώσετε τυχόν λάθη που αποτρέπουν την εγκατάσταση ενός πακέτου).
ko: <command>tasksel</command> 또는 <command>aptitude</command>를 통해 선택된 각 패키지들은 <command>apt-get</command>와 <command>dpkg</command> 프로그램을 통해 다운로드 된 후 패키지가 풀리고, 설치됩니다. 특정 프로그램이 사용자로 부터 더 많은 정보를 필요로 하는 경우 이 과정에서 당신에게 즉시 물어볼 것입니다. 당신은 설치 오류(패키지 설치 과정에 금지된 에러들이 발생하는 경우 당신에게 알려줄 지를 물어보지만)가 발생하지 않는 지 보기위해 그 과정 동안의 출력을 보고 있기를 원할 것입니다.
pt: Cada pacote que seleccionar com o <command>tasksel</command> ou o <command>aptitude</command> é transferido, desempacotado e depois instalado na sua vez pelos programas <command>apt-get</command> e <command>dpkg</command>. Se um programa particular necessita de mais informação do utilizador, ser-lhe-á perguntado durante esse processo. Poderá também ter em atenção ao ecrã durante o processo, para ver qualquer erro de instalação (apesar de que ser-lhe-á perguntado para confirmar os erros que previnem a instalação dos pacotes).
ru: Каждый пакет, который вы выбрали программой <command>tasksel</command> или <command>aptitude</command> загружается, распаковывается и затем устанавливается программами <command>apt-get</command> и <command>dpkg</command>. Если какой-то программе нужно больше информации от пользователя, она попросит её во время этого процесса. Также вы можете наблюдать за процессом установки, чтобы увидеть возможные ошибки (хотя, вас всё равно спросят что делать с ошибкой, которая мешает установке пакета).
zh_cn: 您通过 <command>tasksel</command> 或 <command>aptitude</command> 选择的每个软件包，都是由 <command>apt-get</command> 和 <command>dpkg</command> 程序下载、解包并安装的。部份特殊的软件在安装过程中需要用户提供更多的信息，在这一过程中会有相关提示。您需要留意该过程的屏幕输出，以判断安装中是否存在错误(尽管通常情况下如果一个软件包无法安装，您会收到一个明确的错误信号)。
zh_tw: 您透過 <command>tasksel</command> 或 <command>aptitude</command> 選擇的每個軟體套件包，都是由 <command>apt-get</command> 和 <command>dpkg</command> 程式下載、解開並安裝的。部份特殊的軟體在安裝過程中需要使用者提供更多的資訊，在這一過程中會有相關提示。您需要留意該過程的螢幕輸出，以判斷安裝中是發生錯誤 (儘管一般情況下如果一個軟體套件無法安裝，您會收到一個明確的錯誤訊息)。

source: Settings for the X Server
el: Ρυθμίσεις για τον X Server
ko: X 서버 설정
pt: A Configurar o Servidor X
ru: Настройка X сервера
zh_cn: X 服务器设置
zh_tw: 設定 X 伺服器

source: On iMacs, and some older Macintoshes as well, the X Server software doesn't calculate appropriate video settings. You will need to choose the <guimenuitem>Advanced</guimenuitem> option during configuration of the video settings. For the monitor's horizontal sync range, enter 59&ndash;63. You can leave the default for vertical refresh range.
el: Σε κάποιους iMac αλλά και σε κάποιους παλιότερους Macintosh, το λογισμικό του X Server δεν υπολογίζει σωστά τις κατάλληλες ρυθμίσεις των γραφικών. Θα πρέπει να διαλέξετε την επιλογή <guimenuitem>Advanced</guimenuitem> στη διάρκεια της ρύθμισης των γραφικών. Για το εύρος της οριζόντιας συχνότητας εισάγετε τις τιμές 59&ndash;63. Για το εύρος της συχνότητας κάθετης ανανέωσης μπορείτε να αφήσετε την προκαθορισμένη τιμή.
ko: iMacs과 몇몇 오래된 매킨토쉬들에서 X 서버 소프트웨어가 적절한 비디오 설정을 계산하지 못합니다. 비디오 설정 중에 <guimenuitem>Advanced</guimenuitem> 옵션을 선택해야할 것입니다. 모니터의 수평 Sync 범위는 59-63을 입력합니다. 수직 refresh 범위는 기본 설정을 사용할 수 있습니다.
pt: Nos iMacs, e também em alguns Machitoshes antigos, o software Servidor X não calcula as definições de vídeo apropriadas. Necessitará de escolher a opção <guimenuitem>Avançadas</guimenuitem> durante a configuração das definições de vídeo. Para a gama de sincronização horizontal do monitor, introduza 59&ndash;63. Pode deixar o valor por defeito para a gama de refrescamento vertical.
ru: На iMac, а также на некоторых старых Macintosh, программа X сервер неправильно вычисляет видеопараметры. Вы должны выбрать опцию <guimenuitem>Дополнительно</guimenuitem> во время настройки видеопараметров. Для дипазона частот горизонтальной синхронизации монитора введите 59&ndash;63. Для диапазона частот вертикальной развертки можно оставить значения по умолчанию.
zh_cn: 在 iMacs 或者一些古老的 Macintoshes 机器上，X 服务器软件无法自动计算出适当的显卡设置。您需要在配置显卡时选择<guimenuitem>高级</guimenuitem>选项，在监视器的水平同步范围中，填入 59&ndash;63。对垂直刷新范围，可以选择默认值。
zh_tw: 在 iMacs 或者一些古老的 Macintoshes 機器上，X 伺服器軟體無法自動計算出適當的顯示卡設定。您需要在設定顯示卡時選擇<guimenuitem>進階</guimenuitem>選項，在螢幕的水平同步範圍中，填入 59&ndash;63。對垂直更新範圍，可以選擇預設值。

source: The mouse device should be set to <userinput>/dev/input/mice</userinput>.
el: Σαν συσκευή για το ποντίκι θα πρέπει να τεθεί η <userinput>/dev/input/mice</userinput>.
ko: 마우스는 <userinput>/dev/input/mice</userinput>으로 설정되어야 합니다.
pt: O rato deve ser definido para <userinput>/dev/input/mice</userinput>.
ru: Устройство мышь надо установить в <userinput>/dev/input/mice</userinput>.
zh_cn: 鼠标设备可以设置为 <userinput>/dev/input/mice</userinput>。
zh_tw: 滑鼠設備可以設定為 <userinput>/dev/input/mice</userinput>。

source: Configuring Your Mail Transport Agent
el: Ρύθμιση του Πράκτορα Μεταφοράς Αλληλογραφίας (MTA)
ko: 메일 배달 에이전트(Mail Transport Agent) 설정
pt: Configurar o Mail Transport Agent
ru: Настройка программы пересылки почты (MTA)
zh_cn: 配置您的邮件传输代理(MTA)
zh_tw: 設定您的郵件傳輸代理 (MTA)

source: Today, email is a very important part of many people's life, so it's no surprise Debian lets you configure your mail system right as a part of the installation process. The standard mail transport agent in Debian is <command>exim4</command>, which is relatively small, flexible, and easy to learn.
el: Σήμερα η ηλεκτρονική αλληλογραφία είναι ένα πολύ σημαντικό μέρος της ζωής πολλών ανθρώπων, επομένως δεν αποτελεί έκπληξη ότι το Debian σας επιτρέπει να ρυθμίσετε το σύστημα αλληλογραφίας σας σαν μέρος της διαδικασίας εγκατάστασης. Ο προκαθορισμένος πράκτορας ηλεκτρονικής αλληλογραφίας στο Debian είναι το <command>exim4</command>, που είναι σχετικά μικρό, ευέλικτο και εύκολο στην εκμάθηση.
ko: 요즘 이메일은 많은 사람들의 생활에서 매우 중요한 부분을 차지하고 있기 때문에 데비안에서 설치과정의 일부로 메일 시스템 설정을 하도록 하는 것은 그리 놀라운 일은 아닙니다. 데비안에서 기본 메일 배달 에이전트(MTA)는 <command>exim4</command> 입니다. 이 프로그램은 상대적으로 작고, 유연하며, 실행시키기 쉽습니다.
pt: Hoje em dia, o email é uma parte muito importante da vida de muitas pessoas, por isso não é nenhuma surpresa que o Debian o deixe configurar o seu sistema de correio de forma correcta como parte do processo de instalação. O agente de transporte de mail por omissão no Debian é o <command>exim4</command>, que é relativamente pequeno, flexível, e fácil de aprender.
ru: Сегодня электронная почта (email) &mdash; это очень важная часть жизни многих людей, и не удивительно, что настройка почтовой системы в Debian производится как одна из частей процесса установки. Стандартной программой доставки почты в Debian является <command>exim4</command>. Это относительно маленькая, гибкая и лёгкая в освоении программа.
zh_cn: 今天，电子邮件已经成为很多人生活中不可或缺的部份，所以，Debian 让您在安装过程中配置邮件传输代理，并不是件奇怪的事。Debian 中的标准邮件传输代理是 <command>exim4</command>。这是一个非常小巧、灵活并且容易理解的工具。
zh_tw: 今天，電子郵件已經成為很多人生活中不可或缺的部份，所以，Debian 讓您在安裝過程中設定郵件傳輸代理，並不是件奇怪的事。Debian 中的標準郵件傳輸代理是 <command>exim4</command>。這是一個非常小巧、靈活並且容易理解的工具。

source: You may ask if this is needed even if your computer is not connected to any network. The short answer is: Yes. The longer explanation: Some system utilities (like <command>cron</command>, <command>quota</command>, <command>aide</command>, &hellip;) may send you important notices via email.
el: Πιθανόν να ρωτήσετε αν ένα τέτοιο πρόγραμμα είναι απαραίτητο ακόμα και στην περίπτωση που ο υπολογιστής σας δεν είναι συνδεδεμένος σε κάποιο δίκτυο. Η σύντομη απάντηση είναι: Ναι. Η πιο μακροσκελής εξήγηση: Κάποια βοηθητικά εργαλεία του συστήματος (όπως τα <command>cron</command>, <command>quota</command>,<command>aide</command>, &hellip;) πιθανόν να σας αποστέλλουν σημαντικές πληροφορίες μέσω του ηλεκτρονικού ταχυδρομείου.
ko: 당신의 컴퓨터가 네트워크에 연결되어 있지 않는 경우에도 메일 설정이 필요한지 물어볼 수 있습니다. 그 대답은 '예' 입니다. 좀 더 설명하면 <command>cron</command>, <command>quota</command>, <command>aide</command> &hellip; 등의 몇몇 시스템 유틸리티들은 당신에게 중요한 공지를 이메일을 통해 보낼 수 있습니다.
pt: Poderá perguntar se isto é necessário mesmo que o seu computador não esteja ligado a nenhuma rede. A resposta mais rápida é: Sim. A explicação mais longa: Algumas ferramentas do sistema (tal como o <command>cron</command>, o <command>quota</command>, o <command>aide</command>, &hellip;) podem enviar-lhe avisos importantes por email.
ru: Вы можете спросить, необходимо ли это, особенно если компьютер не подключён к сети. Краткий ответ: Да. Более длинное описание: Некоторые системные утилиты (такие как <command>cron</command>, <command>quota</command>, <command>aide</command>, &hellip;) смогут отправлять вам важные извещения по электронной почте.
zh_cn: 您可能会问，我的电脑并没有连接到网络上，是否也需要做这一步工作呢？ 简短的答案：是。稍长一些的解释：部份系统工具(比如 <command>cron</command>, <command>quota</command>, <command>aide</command> 等)的重要通知都是通过邮件发送的。
zh_tw: 您可能會問，我的電腦並沒有連接到網路上，是否也需要這一步呢？答案是：是的。稍長一點的解釋是：部份系統工具 (例如 <command>cron</command>, <command>quota</command>, <command>aide</command> 等) 的重要通知都是透過郵件發送的。
