Repository: xobs/debian-installer
Catalog: doc/manual/po/*/gpl.po
Languages: el, pt

source: in no event unless required by applicable law or agreed to in writing will any copyright holder, or any other party who may modify and/or redistribute the program as permitted above, be liable to you for damages, including any general, special, incidental or consequential damages arising out of the use or inability to use the program (including but not limited to loss of data or data being rendered inaccurate or losses sustained by you or third parties or a failure of the program to operate with any other programs), even if such holder or other party has been advised of the possibility of such damages.
el: σε καμιά περίπτωση, έκτος εάν απαιτείται από την ισχύουσα νομοθεσία ή έχει συμφωνηθεί γραπτώς, ο κάτοχος των πνευματικών δικαιωμάτων, ή οποιοδήποτε άλλο μέλος το οποίο μπορεί να τροποποιήσει ή/και να αναδιανείμει το πρόγραμμα όπως προβλέπεται παραπάνω, δεν φέρεται ως υπεύθυνος απέναντί σας για ζημιές, συμπεριλαμβανομένων όλων των γενικών, ειδικών, συμπτωματικών ή συνεπακόλουθων ζημιών που ενδέχεται να προκύψουν λόγω της χρήσης ή της αδυναμίας χρήσης του προγράμματος (συμπεριλαμβανομένων, ενδεικτικά, της απώλειας δεδομένων ή της αλλοίωσης της ακρίβειας των δεδομένων τους, ή απώλειας που επήλθε από εσάς ή από τρίτα μέλη, ή αδυναμίας του προγράμματος να λειτουργήσει μαζί με άλλα προγράμματα), έστω και αν ο κάτοχος αυτός ή το άλλο μέλος έχει ενημερωθεί για το ενδεχόμενο τέτοιων ζημιών.
pt: em nenhum caso a menos se necessário pela lei aplicável ou acordado por escrito qualquer detentor do direito de cópia, ou qualquer outra parte que possa modificar e/ou redistribuir o programa conforme permitido acima, será responsável perante si por danos, incluindo quaisquer prejuízos gerais, especiais, incidentes ou consequentes que resultem da utilização ou da não aptidão de utilizar o programa (incluindo mas não limitado a perda de dados, ou dados que sejam tornados inexactos ou perdas sustentadas por você ou por terceiros ou uma falha do programa em operar com qualquer outro programa), mesmo se tal detentor ou outra parte tenham sido aconselhados da possibilidade de tais prejuízos.

source: END OF TERMS AND CONDITIONS
el: ΤΕΛΟΣ ΤΩΝ ΟΡΩΝ ΚΑΙ ΤΩΝ ΠΡΟΥΠΟΘΕΣΕΩΝ
pt: FIM DOS TERMOS E CONDIÇÕES

source: How to Apply These Terms to Your New Programs
el: Τρόπος εφαρμογής των όρων στα νέα Προγράμματα
pt: Como Aplicar Estes Termos Aos Seus novos Programas

source: If you develop a new program, and you want it to be of the greatest possible use to the public, the best way to achieve this is to make it free software which everyone can redistribute and change under these terms.
el: Εάν αναπτύσσετε ένα νέο πρόγραμμα και θέλετε να έχει τη μεγαλύτερη δυνατή χρήση από το κοινό, ο καλύτερος τρόπος να ΤΟ επιτύχετε είναι να το χαρακτηρίσετε ελεύθερο λογισμικό, το οποίο όλοι θα μπορούν να αναδιανέμουν και να τροποποιούν υπό τους όρους αυτούς.
pt: Se você desenvolver um novo programa, e desejar que seja da melhor utilização possível para o público, a melhor forma de o alcançar é torna-lo software livre que todos possam redistribuir e modificar sob estes termos.

source: To do so, attach the following notices to the program. It is safest to attach them to the start of each source file to most effectively convey the exclusion of warranty; and each file should have at least the "copyright" line and a pointer to where the full notice is found.
el: Για να γίνει αυτό, συνάψτε το ακόλουθο σημείωμα στο πρόγραμμα. Είναι πιο ασφαλές να το συνάψετε στην αρχή κάθε αρχείου πηγαίου κώδικα, ώστε να φέρεται πιο αποτελεσματικά η εξαίρεση της εγγύησης και κάθε αρχείο θα πρέπει να διαθέτει τουλάχιστον τη γραμμή "πνευματικής ιδιοκτησίας" και έναν δείκτη για το που βρίσκεται το πλήρες σημείωμα.
pt: Para o fazer, anexe os seguintes avisos ao programa. É mais seguro adiciona-los ao inicio de cada ficheiro de código fonte para ser mais eficaz no meio de transmissão a exclusão de garantia; em cada ficheiro deve ter pelo menos a linha "copyright" e um indicador onde o aviso completo pode ser encontrado.

source: one line to give the program's name and a brief idea of what it does.
el: μια γραμμή που παρέχει το όνομα του προγράμματος και μια σύντομη περιγραφή της λειτουργίας του.
pt: uma linha para dar o nome do programa e uma breve ideia do que faz.

source: Copyright (C) year name of author
el: Copyright (C) έτος όνομα δημιουργού
pt: Copyright (C) ano nome do autor

source: This program is free software; you can redistribute it and/or modify it under the terms of the gnu General Public License as published by the Free Software Foundation; either version 2 of the License, or (at your option) any later version.
el: Το πρόγραμμα αυτό είναι ελεύθερο λογισμικό. Επιτρέπεται η αναδιανομή ή/και τροποποίησή του υπό τους όρους της Γενικής Άδειας Δημόσιας Χρήσης GNU (GNU General Public License), όπως αυτή δημοσιεύεται από το Ίδρυμα Ελεύθερου Λογισμικού (Free Software Foundation) είτε της έκδοσης 2 της Άδειας, είτε (κατ' επιλογήν) οποιασδήποτε μεταγενέστερης έκδοσης.
pt: Este programa é software livre; você pode redistribuí-lo e/ou modifica-lo sob os termos da gnu General Public License conforme publicada pela Free Software Foundation; quer seja a versão 2 dessa licença, ou (por sua opção) qualquer versão posterior.

source: This program is distributed in the hope that it will be useful, but without any warranty; without even the implied warranty of merchantability or fitness for a particular purpose. See the gnu General Public License for more details.
el: Το πρόγραμμα αυτό διανέμεται με την ελπίδα ότι θα αποδειχθεί χρήσιμο, παρόλα αυτά χωρίς καμία εγγύηση χωρίς ακόμη και την έμμεση εγγύηση εμπορευσιμότητας ή καταλληλότητας. Για περισσότερες λεπτομέρειες ανατρέξτε στη Γενική Άδεια Δημόσιας Χρήσης GNU (GNU General Public License).
pt: Este programa é distribuído com a esperança de que seja útil, mas sem qualquer garantia; mesmo sem a implícita garantia da transacção ou de adequação a um determinado propósito. Para mais detalhes veja a gnu General Public License.

source: You should have received a copy of the gnu General Public License along with this program; if not, write to the Free Software Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301, USA.
pt: Você deve ter recebido uma cópia da gnu General Public License junto com este programa; caso contrário, escreva para a Free Software Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA 02111-1301, USA.

source: Also add information on how to contact you by electronic and paper mail.
el: Επίσης, προσθέστε πληροφορίες για τον τρόπο με τον οποίο μπορεί κάποιος να επικοινωνήσει μαζί σας μέσω ηλεκτρονικού ή παραδοσιακού ταχυδρομείου.
pt: Adicione também informação acerca de como o contactar por correio electrónico e postal.

source: If the program is interactive, make it output a short notice like this when it starts in an interactive mode:
el: Εάν το πρόγραμμα είναι αλληλεπιδραστικό, φροντίστε ώστε κατά την εκκίνησή του σε αλληλεπιδραστική λειτουργία να εμφανίζει ένα σύντομο σημείωμα όπως το παρακάτω:
pt: Se o programa for interactivo, faça-o mostrar um pequeno aviso como este quanto iniciar num modo interactivo:

source: Gnomovision version 69, Copyright (C) year name of author
el: Όνομα_προγράμματος έκδοση αριθμός_έκδοσης, Copyright (C) έτος όνομα_δημιουργού
pt: Gnomovision versão 69, Copyright (C) ano nome do autor

source: Gnomovision comes with absolutely no warranty; for details type `show w'.
el: Το όνομα_προγράμματος διανέμεται χωρίς καμιά εγγύηση. Για λεπτομέρειες πληκτρολογήστε `show w'.
pt: Gnomovision vem absolutamente sem garantia; para detalhes escreva `show w'.

source: This is free software, and you are welcome to redistribute it under certain conditions; type `show c' for details.
el: Το λογισμικό αυτό είναι ελεύθερο, και η αναδιανομή του είναι ευπρόσδεκτη υπό συγκεκριμένους όρους. Πληκτρολογήστε `show c' για λεπτομέρειες.
pt: Isto é software livre, e você está convidado a o redistribuir sob certas condições; escreva `show c' para detalhes.

source: The hypothetical commands `show w' and `show c' should show the appropriate parts of the General Public License. Of course, the commands you use may be called something other than `show w' and `show c'; they could even be mouse-clicks or menu items &mdash; whatever suits your program.
el: Οι υποθετικές εντολές `show w' και `show c' θα πρέπει να προβάλλουν τις αντίστοιχες ενότητες της Γενικής Άδειας Δημόσιας Χρήσης. Ασφαλώς οι εντολές που χρησιμοποιείτε δεν είναι απαραίτητο να ονομάζονται `show w' και `show c'. Μπορούν να είναι ακόμη και σύνδεσμοι που ενεργοποιούνται με πάτημα του ποντικιού ή στοιχεία μενού ή οτιδήποτε ταιριάζει με το πρόγραμμά σας.
pt: Os hipotéticos comandos `show w' e `show c' devem mostrar as porções apropriadas da General Public License. Claro que, os comandos que você utiliza podem ser chamados outra coisa qualquer em vez de `show w' e `show c'; eles podem ser mesmo cliques de rato ou itens de menu - o que for mais adequado ao seu programa.

source: You should also get your employer (if you work as a programmer) or your school, if any, to sign a "copyright disclaimer" for the program, if necessary. Here is a sample; alter the names:
el: Εάν κρίνετε απαραίτητο, θα πρέπει επίσης να ζητήσετε από τον εργοδότη σας (εάν εργάζεστε ως προγραμματιστής) ή τη σχολή σας, εάν υπάρχουν, να υπογράψουν μια 'δήλωση αποκήρυξης πνευματικών δικαιωμάτων' (copyright disclaimer) για το πρόγραμμα. Μπορείτε να ακολουθήσετε το παρακάτω δείγμα, συμπληρώνοντας τα ονόματα:
pt: Se necessário, você deve também fazer com que o seu empregador (se você trabalhar como programador) ou a sua escola, assine uma "renúncia do direito de cópia" para o programa. Aqui está uma amostra; altere os nomes:

source: Yoyodyne, Inc., hereby disclaims all copyright interest in the program `Gnomovision' (which makes passes at compilers) written by James Hacker.
el: Η 'επωνυμία εταιρίας/σχολής' αποκηρύσσει οποιοδήποτε δικαίωμα πνευματικής ιδιοκτησίας επί του προγράμματος 'όνομα_προγράμματος', το οποίο αποτελεί δημιουργία του/της 'όνομα_δημιουργού'.
pt: Yoyodyne, Inc., aqui por este meio renuncia todos os interesses de direitos de cópia no programa `Gomovision' (que faz passagens em compiladores) escrito por James Hacker.

source: signature of Ty Coon, 1 April 1989
el: 'υπογραφή εκπροσώπου εταιρίας/σχολής', 'ημερομηνία', 'έτος'
pt: assinatura de Ty Coon, 1 de Abril de 1989

source: Ty Coon, President of Vice
pt: Ty Coon, Presidente de Vice

source: This General Public License does not permit incorporating your program into proprietary programs. If your program is a subroutine library, you may consider it more useful to permit linking proprietary applications with the library. If this is what you want to do, use the gnu Library General Public License instead of this License.
el: Η παρούσα Γενική Άδεια Δημόσιας Χρήσης δεν επιτρέπει την ενσωμάτωση του προγράμματός σας σε ιδιόκτητα προγράμματα. Εάν το πρόγραμμά σας αποτελεί βιβλιοθήκη υπορουτίνας, θα είναι ενδεχομένως χρησιμότερο να επιτρέπετε σύνδεση ιδιόκτητων εφαρμογών με τη βιβλιοθήκη. Εάν όντως αυτό επιθυμείτε, χρησιμοποιήστε τη Γενική Άδεια Δημόσιας Χρήσης Βιβλιοθήκης GNU (GNU Library General Public License) αντί της παρούσας Άδειας.
pt: Esta General Public License não permite incorporar o seu programa em programas proprietários. Se o seu programa é uma biblioteca de subrotinas, você pode achar mais útil permitir a ligação de aplicações de software proprietário com a biblioteca. Se isto é o que você quer fazer, utilize a gnu Library General Public License em vez desta licença.

source: GNU General Public License
el: ΓΕΝΙΚΗ ΑΔΕΙΑ ΔΗΜΟΣΙΑΣ ΧΡΗΣΗΣ GNU

source: GNU GENERAL PUBLIC LICENSE
el: ΓΕΝΙΚΗ ΑΔΕΙΑ ΔΗΜΟΣΙΑΣ ΧΡΗΣΗΣ GNU
