Repository: xobs/debian-installer
Catalog: doc/manual/po/*/gpl.po
Languages: el, pt

source: a) Accompany it with the complete corresponding machine-readable source code, which must be distributed under the terms of Sections 1 and 2 above on a medium customarily used for software interchange; or,
el: α) Το συνοδεύετε με τον αντίστοιχο, πλήρη πηγαίο κώδικα, ο οποίος είναι αναγνώσιμος από το σύστημα και ο οποίος πρέπει να διανέμεται σύμφωνα με τους όρους των παραπάνω Ενοτήτων 1 και 2, σε ένα συνηθισμένο μέσο μεταφοράς λογισμικού ή,
pt: a) Acompanha-lo com o correspondente e completo código fonte em formato digital, que tem de ser distribuído sob os termos das Secções 1 e 2 acima num meio usualmente utilizado para troca de software; ou,

source: b) Accompany it with a written offer, valid for at least three years, to give any third party, for a charge no more than your cost of physically performing source distribution, a complete machine-readable copy of the corresponding source code, to be distributed under the terms of Sections 1 and 2 above on a medium customarily used for software interchange; or,
el: β) Το συνοδεύετε με γραπτή προσφορά παράδοσης σε τρίτους του πλήρους, αναγνώσιμου από το σύστημα αντιγράφου του αντίστοιχου πηγαίου κώδικα, ο οποίος θα διανεμηθεί υπό τους όρους των παραπάνω Ενοτήτων 1 και 2, σε συνηθισμένο μέσο μεταφοράς λογισμικού, προσφορά που θα ισχύει τουλάχιστον για τρία χρόνια και με χρέωση όχι μεγαλύτερη από το κόστος της φυσικής διανομής κώδικα, ή,
pt: b) Acompanha-lo com uma oferta escrita, válida por pelo menos três anos, para dar a quaisquer terceiros, por uma taxa não superior ao custo de efectuar a distribuição física, uma cópia completa em formato digital do código fonte correspondente, para ser distribuído sob os termos das Secções 1 e 2 acima num meio usualmente utilizado para a troca de software; ou,

source: c) Accompany it with the information you received as to the offer to distribute corresponding source code. (This alternative is allowed only for noncommercial distribution and only if you received the program in object code or executable form with such an offer, in accord with Subsection b above.)
el: γ) Το συνοδεύετε με τις πληροφορίες που λάβατε όσον αφορά την προσφορά διανομής του αντίστοιχου πηγαίου κώδικα. (Η εναλλακτική αυτή επιλογή επιτρέπεται μόνο για μη εμπορική διανομή και μόνο εφόσον λάβατε το πρόγραμμα σε αντικειμενικό κώδικα ή εκτελέσιμη μορφή μέσω αυτής της προσφοράς, σύμφωνα με την Υποενότητα [β] παραπάνω.)
pt: c) Acompanha-lo com a informação que você recebeu assim como a oferta para distribuir o correspondente código fonte. (Esta alternativa é permitida apenas para distribuição não-comercial e apenas se você recebeu o programa em código objecto ou na forma executável com uma dessas ofertas, de acordo com a Subsecção b acima.)

source: The source code for a work means the preferred form of the work for making modifications to it. For an executable work, complete source code means all the source code for all modules it contains, plus any associated interface definition files, plus the scripts used to control compilation and installation of the executable. However, as a special exception, the source code distributed need not include anything that is normally distributed (in either source or binary form) with the major components (compiler, kernel, and so on) of the operating system on which the executable runs, unless that component itself accompanies the executable.
el: Ο πηγαίος κώδικας ενός έργου σημαίνει την μορφή εκείνη που πρέπει να έχει το έργο για να είναι δυνατές οι τροποποιήσεις του. Για ένα εκτελέσιμο έργο, πλήρης πηγαίος κώδικας σημαίνει όλον τον πηγαίο κώδικα για όλες τις λειτουργικές μονάδες που περιλαμβάνει, συν οποιαδήποτε σχετικά αρχεία ορισμού διασύνδεσης, συν τις δέσμες ενεργειών που χρησιμοποιούνται για τον έλεγχο της μεταγλώττισης και εγκατάστασης του εκτελέσιμου αρχείου. Όμως, ως ειδική εξαίρεση, ο διανεμημένος πηγαίος κώδικας μιας εκτελέσιμης εργασίας δεν είναι απαραίτητο να περιλαμβάνει τα σημαντικότερα συστατικά (μεταγλωττιστής, πυρήνας, και τα λοιπά) του λειτουργικού συστήματος στο οποίο θα τρέξει αυτή και τα οποία συνοδεύουν κανονικά μια τέτοια διανομή ( σε μορφή είτε πηγαία είτε δυαδική ), εκτός αν συνοδεύει την εκτελέσιμη εργασία ένα από τα παραπάνω συστατικά.
pt: O código fonte para um trabalho significa a forma preferida do trabalho para fazer modificações nele próprio. Para um trabalho executável, o código fonte completo significa todo o código fonte para todos os módulos que contém, mais quaisquer ficheiros de definições do interface associados, mais os scripts utilizados para controlar a compilação e instalação do executável. No entanto, como excepção especial, o código fonte distribuído não necessita de incluir qualquer coisa que seja normalmente distribuída (quer em código fonte quer em forma binária) com os componentes maiores (compilador, kernel, e por aí fora) do sistema operativo no qual o executável corre, a não ser que o próprio componente acompanhe o executável.

source: If distribution of executable or object code is made by offering access to copy from a designated place, then offering equivalent access to copy the source code from the same place counts as distribution of the source code, even though third parties are not compelled to copy the source along with the object code.
el: Εάν η διανομή του εκτελέσιμου ή του αντικειμενικού κώδικα πραγματοποιείται με παραχώρηση πρόσβασης για αντιγραφή από καθορισμένη τοποθεσία, τότε η παραχώρησηισοδύναμης πρόσβασης για αντιγραφή του πηγαίου κώδικα από την ίδια τοποθεσία λογίζεται ως διανομή του πηγαίου κώδικα αν και τα τρίτα μέλη δεν υποχρεούνται να αντιγράψουν τον πηγαίο κώδικα μαζί με τον αντικειμενικό.
pt: Se a distribuição do executável ou do código objecto é feita por oferta de acesso a uma cópia de um local designado, então oferecer acesso equivalente para cópia do código fonte a partir do mesmo local conta como distribuição do código fonte, mesmo que terceiros não sejam levados a copiar o código fonte junto com o código objecto.

source: You may not copy, modify, sublicense, or distribute the Program except as expressly provided under this License. Any attempt otherwise to copy, modify, sublicense or distribute the Program is void, and will automatically terminate your rights under this License. However, parties who have received copies, or rights, from you under this License will not have their licenses terminated so long as such parties remain in full compliance.
el: Δεν επιτρέπεται η αντιγραφή, τροποποίηση, παραχώρηση άδειας περαιτέρω εκμετάλλευσης ή διανομή του Προγράμματος εκτός εάν προβλέπεται ρητά στην παρούσα Άδεια. Διαφορετικά, κάθε απόπειρα για αντιγραφή, τροποποίηση, παραχώρηση άδειας εκμετάλλευσης ή διανομή του Προγράμματος είναι άκυρη και αυτομάτως καταργεί τα δικαιώματα που σας παραχωρεί η παρούσα Άδεια. Ωστόσο, οι άδειες χρήσης των μελών που έχουν λάβει αντίγραφα ή δικαιώματα από εσάς, μέσω της παρούσας Άδειας, δεν θα ακυρωθούν, εφόσον τα μέλη αυτάπαραμένουν πλήρως συμμορφωμένα με τους όρους της Άδειας.
pt: Você não pode copiar, modificar, sub-licenciar, ou distribuir o Programa excepto como expressamente nas condições sob esta Licença. Qualquer tentativa de outra forma de cópia, modificar, sub-licenciar ou distribuir o Programa é nula, e automaticamente termina os seus direitos sob esta licença. No entanto, partes que tenham recebido cópias, ou direitos, de si sob esta licença não irão ter as suas licenças terminadas durante o tempo que tais partes se mantenham em total conformidade.

source: You are not required to accept this License, since you have not signed it. However, nothing else grants you permission to modify or distribute the Program or its derivative works. These actions are prohibited by law if you do not accept this License. Therefore, by modifying or distributing the Program (or any work based on the Program), you indicate your acceptance of this License to do so, and all its terms and conditions for copying, distributing or modifying the Program or works based on it.
el: Δεν απαιτείται από εσάς να δεχθείτε την παρούσα Άδεια, εφόσον δεν την έχετε υπογράψει. Ωστόσο, τίποτε άλλο δεν σας δίνει το δικαίωμα να τροποποιήσετε ή να διανείμετε το Πρόγραμμα ή τα παραγόμενα από αυτό έργα. Οι ενέργειες αυτές απαγορεύονται από το νόμο, εάν δεν αποδεχθείτε την παρούσα Άδεια. Συνεπώς, με το να τροποποιήσετε ή να διανείμετε το Πρόγραμμα (ή οποιοδήποτε έργο που βασίζεται στο Πρόγραμμα), δηλώνετε ότι αποδέχεστε την παρούσα Άδεια, καθώς και όλους τους όρους και συνθήκες που προβλέπει η Άδεια για την αντιγραφή, διανομή ή τροποποίηση του Προγράμματος ή έργων που βασίζονται σε αυτό.
pt: Você não é obrigado a aceitar esta Licença, desde que não a tenha assinado. No entanto, mais nada lhe concede permissão para modificar ou distribuir o Programa ou seus trabalhos derivados. Estas acções são proibidas por lei se você não aceitar esta licença. Por isso, ao modificar ou distribuir o Programa (ou qualquer trabalho baseado no Programa), você indica a sua aceitação desta Licença para o fazer, em todos os seus termos e condições para copiar, distribuir ou modificar o Programa ou trabalhos baseados nele.

source: Each time you redistribute the Program (or any work based on the Program), the recipient automatically receives a license from the original licensor to copy, distribute or modify the Program subject to these terms and conditions. You may not impose any further restrictions on the recipients' exercise of the rights granted herein. You are not responsible for enforcing compliance by third parties to this License.
el: Κάθε φορά που αναδιανέμετε το Πρόγραμμα (ή ένα έργο βασισμένο στο Πρόγραμμα), ο αποδέκτης αυτόματα παραλαμβάνει την αρχική άδεια αντιγραφής, διανομής ή τροποποίησης του Προγράμματος σύμφωνα με τους όρους και τις συνθήκες αυτές. Δεν επιτρέπεται να επιβάλλετε περαιτέρω περιορισμούς στην άσκηση των δικαιωμάτων του αποδέκτη τα οποία προβλέπονται εδώ. Δεν είστε υπεύθυνοι για το εάν τρίτα μέλη επιβάλλουν συμμόρφωση σε αυτήν τη Άδεια.
pt: Cada vez que redistribuir o Programa (ou qualquer trabalho baseado no Programa), aquele que o recebe automaticamente recebe a licença daquele que o licenciou originalmente para copiar, distribuir ou modificar o Programa sujeito a esses termos e condições. Você não pode impor quaisquer outras restrições ao exercício daqueles que recebem os direitos atribuídos aqui. Você não é responsável por impor a conformidade de terceiros a esta Licença.

source: If, as a consequence of a court judgment or allegation of patent infringement or for any other reason (not limited to patent issues), conditions are imposed on you (whether by court order, agreement or otherwise) that contradict the conditions of this License, they do not excuse you from the conditions of this License. If you cannot distribute so as to satisfy simultaneously your obligations under this License and any other pertinent obligations, then as a consequence you may not distribute the Program at all. For example, if a patent license would not permit royalty-free redistribution of the Program by all those who receive copies directly or indirectly through you, then the only way you could satisfy both it and this License would be to refrain entirely from distribution of the Program.
el: Εάν, ως συνέπεια δικαστικής απόφασης ή κατηγορίας για παράβαση νόμου περί πνευματικής ιδιοκτησίας ή για οποιονδήποτε άλλο λόγο (μη περιοριζόμενο σε θέματα ευρεσιτεχνίας), σας επιβληθούν όροι (είτε μέσω δικαστικής απόφασης, συμφωνίας ή μέσω άλλου τρόπου) οι οποίοι αντιβαίνουν τους όρους της παρούσας Άδειας, οι όροι εκείνοι δεν σας απαλλάσσουν από τους όρους της παρούσας. Εάν δεν είναι δυνατή η αναδιανομή με τρόπο ώστε να ικανοποιεί συγχρόνως τις υποχρεώσεις σας σύμφωνα με την παρούσα Άδεια και οποιεσδήποτε άλλες υποχρεώσεις απορρέουν από αυτή, τότε, ως συνέπεια, δεν επιτρέπεται να αναδιανέμετε το Πρόγραμμα με κανένα τρόπο. Για παράδειγμα, εάν μια άδεια ευρεσιτεχνίας δεν επιτρέπει τη χωρίς δικαιώματα εκμετάλλευσης αναδιανομή του Προγράμματος από όλους όσους λαμβάνουν αντίγραφα άμεσα ή έμμεσα από εσάς, τότε ο μόνος τρόπος με τον οποίο θα μπορούσατε να ικανοποιήσετε την άδεια εκείνη και την παρούσα Άδεια θα ήταν να αποφύγετε εντελώς την αναδιανομή του Προγράμματος.
pt: Se, como consequência de um julgamento de tribunal ou alegação de infrigir patentes ou por qualquer outra razão (não limitada a assuntos de patentes), as condições que lhe são impostas a si (quer por ordem do tribunal, acordo ou de outro modo) que contradigam as condições desta Licença, não o libertam das condições desta Licença. Se você não pode distribuir de modo a satisfazer simultaneamente as suas obrigações sob esta Licença ou quaisquer outras obrigações pertinentes, então como consequência você não pode distribuir o Programa de modo nenhum. Por exemplo, se uma licença de patente não permitir a redistribuição sem pagar direitos do Programa por todos aqueles que recebam cópias directamente ou indirectamente através de si, então o único modo que você pode satisfazer ambos e esta Licença é conter-se totalmente da distribuição do Programa.

source: If any portion of this section is held invalid or unenforceable under any particular circumstance, the balance of the section is intended to apply and the section as a whole is intended to apply in other circumstances.
el: Εάν οποιοδήποτε τμήμα αυτής της ενότητας καταστεί άκυρο ή μη δυνάμενο να επιβληθεί σε κάποια συγκεκριμένη περίπτωση, το υπόλοιπο τμήμα της ενότητας αυτής εφαρμόζεται και η ενότητα ως σύνολο εφαρμόζεται υπό οποιεσδήποτε συγκυρίες.
pt: Se alguma parte desta secção for considerada inválida ou não possa ser cumprida sob qualquer circunstância particular, o equilíbrio da secção é para aplicar e a secção como um todo é para aplicar nas outras circunstâncias.

source: It is not the purpose of this section to induce you to infringe any patents or other property right claims or to contest validity of any such claims; this section has the sole purpose of protecting the integrity of the free software distribution system, which is implemented by public license practices. Many people have made generous contributions to the wide range of software distributed through that system in reliance on consistent application of that system; it is up to the author/donor to decide if he or she is willing to distribute software through any other system and a licensee cannot impose that choice.
el: Δεν ανήκει στους σκοπούς της ενότητας αυτής να σας παρακινήσει να παραβιάσετε την ευρεσιτεχνία ή άλλες αξιώσεις πνευματικής ιδιοκτησίας ή να αμφισβητήσετε τον κύρος οποιωνδήποτε τέτοιων αξιώσεων. Μοναδικός σκοπός αυτής της ενότητας είναι να προστατέψει την ακεραιότητα του συστήματος διανομής ελεύθερου λογισμικού, η οποία υλοποιείται μέσω της πρακτικής των αδειών δημόσιας χρήσης. Πολλοί άνθρωποι έχουν συνεισφέρει γενναιόδωρα στην ευρεία έκταση του λογισμικού που διανέμεται μέσω αυτού του συστήματος, εμπιστευόμενοι την συνεπή εφαρμογή αυτού του συστήματος. Είναι στην ευχέρεια του δημιουργού/δωρητή να αποφασίσει εάν προτίθεται να διανείμει λογισμικό μέσω οποιουδήποτε άλλου συστήματος, και καμιά άδεια δεν είναι δυνατό να επιβάλει αυτήν την επιλογή.
pt: Não é o propósito desta secção induzi-lo a infringir qualquer patente ou outros direitos de propriedade reclamados ou contestar a validade de quaisquer dessas reclamações; esta secção tem apenas o propósito de proteger a integridade do sistema de distribuição de software livre, que é implementado por práticas de licenças públicas. Muitas pessoas fizeram generosas contribuições ao vasto leque de software distribuído através desse sistema com confiança e aplicação consistente desse sistema; cabe ao autor/doador decidir se ele ou ela estão dispostos a redistribuir software através de qualquer outro sistema e o licenciado não pode impor essa escolha.

source: This section is intended to make thoroughly clear what is believed to be a consequence of the rest of this License.
el: Η ενότητα αυτή έχει ως σκοπό να καταστήσει σαφές ό,τι συνεπάγεται το υπόλοιπο τμήμα της παρούσας Άδειας.
pt: Esta secção destina-se a tornar claro de forma exaustiva o que se acredita ser a consequência do resto desta Licença.

source: If the distribution and/or use of the Program is restricted in certain countries either by patents or by copyrighted interfaces, the original copyright holder who places the Program under this License may add an explicit geographical distribution limitation excluding those countries, so that distribution is permitted only in or among countries not thus excluded. In such case, this License incorporates the limitation as if written in the body of this License.
el: Εάν η διανομή ή/και η χρήση του Προγράμματος εμποδίζεται σε ορισμένες χώρες, είτε μέσω κατοχυρωμένης ευρεσιτεχνίας είτε μέσω διασυνδέσεων που προστατεύονται από πνευματικά δικαιώματα, επιτρέπεται στον κάτοχο του αρχικού πνευματικού δικαιώματος, ο οποίος θέτει το Πρόγραμμα υπό τους όρους της παρούσας Άδειας, να προσθέσει έναν ρητό γεωγραφικό περιορισμό στη διανομή, εξαιρώντας εκείνες τις χώρες, έτσι ώστε η διανομή να επιτρέπεται μόνο για τις χώρες οι οποίες δεν εξαιρούνται. Σε τέτοια περίπτωση, η παρούσα Άδεια ενσωματώνει τον περιορισμό σαν να ήταν διατυπωμένος στο σώμα της παρούσας Άδειας.
pt: Se a distribuição e/ou utilização do Programa está restrito em certos países quer por patentes ou por interfaces com direitos de cópia, o detentor do direito de cópia original que coloca o Programa sob esta Licença pode adicionar explicitamente uma limitação de distribuição geográfica excluindo esses países, de modo a que a distribuição apenas seja permitida entre os países não excluídos desta forma. Nesse caso, esta Licença incorpora a limitação conforme escrita no corpo desta Licença.

source: The Free Software Foundation may publish revised and/or new versions of the General Public License from time to time. Such new versions will be similar in spirit to the present version, but may differ in detail to address new problems or concerns. Each version is given a distinguishing version number. If the Program specifies a version number of this License which applies to it and "any later version", you have the option of following the terms and conditions either of that version or of any later version published by the Free Software Foundation. If the Program does not specify a version number of this License, you may choose any version ever published by the Free Software Foundation.
el: Το Ίδρυμα Ελεύθερου Λογισμικού (Free Software Foundation) έχει τη δυνατότητα περιστασιακά να δημοσιεύει αναθεωρημένες ή/και νέες εκδόσεις της Γενικής Άδειας Δημόσιας Χρήσης. Αυτές οι νέες εκδόσεις θα είναι συναφείς στο πνεύμα με την παρούσα έκδοση, όμως ενδέχεται να διαφέρουν στις λεπτομέρειες, καθώς αναφέρονται σε νέα προβλήματα και ζητήματα. Σε κάθε έκδοση δίνεται ένας διακριτικός αριθμός έκδοσης. Εάν στο Πρόγραμμακαθορίζεται ένας αριθμός έκδοσης της παρούσας Άδειας, η οποία ισχύει σε αυτό, καθώς και "οποιασδήποτε μεταγενέστερης έκδοσης", μπορείτε να επιλέξετε ανάμεσα στο να ακολουθήσετε τους όρους και τις προυποθέσεις είτε εκείνης της έκδοσης είτε οποιασδήποτε άλλης έκδοσης που δημοσιεύεται από το Ίδρυμα Ελεύθερου Λογισμικού (Free Software Foundation). Εάν στο Πρόγραμμα δεν καθορίζεται αριθμός έκδοσης της παρούσας Άδειας, μπορείτε να επιλέξετε οποιαδήποτε έκδοση η οποία έχει δημοσιευθεί από το Ίδρυμα Ελεύθερου Λογισμικού.
pt: A Free Software Foundation pode publicar revisões e/ou novas versões da General Public License de tempos a tempos. Tais novas versões serão similares ao espírito da versão actual, mas podem diferir em detalhes para endereçar novos problemas ou preocupações. A cada versão é dado um número de versão distinto. Se o Programa especifica um número de versão desta Licença que se lhe aplica e "qualquer versão posterior", você tem a opção de seguir os termos e condições quer dessa versão ou de qualquer outra versão posterior publicada pela Free Software Foundation. Se o programa não especificar o número de versão desta Licença, você pode escolher qualquer versão alguma vez publicada pela Free Software Foundation.

source: If you wish to incorporate parts of the Program into other free programs whose distribution conditions are different, write to the author to ask for permission. For software which is copyrighted by the Free Software Foundation, write to the Free Software Foundation; we sometimes make exceptions for this. Our decision will be guided by the two goals of preserving the free status of all derivatives of our free software and of promoting the sharing and reuse of software generally.
el: Εάν επιθυμείτε να ενσωματώσετε μέρη του Προγράμματος σε άλλα ελεύθερα προγράμματα, των οποίων οι όροι διανομής είναι διαφορετικοί, επικοινωνήστε με το δημιουργό του Προγράμματος για να ζητήσετε την έγκρισή του. Για λογισμικό του οποίου η πνευματική ιδιοκτησία ανήκει στο Ίδρυμα Ελεύθερου Λογισμικού (Free Software Foundation), επικοινωνήστε μαζί μας στο Ίδρυμα Ελεύθερου Λογισμικού (σε ορισμένες περιπτώσεις προβαίνουμε σε εξαιρέσεις). Η απόφασή μας θα ληφθεί βάσει του διττού στόχου μας να διατηρήσουμε την ελευθερία όλων των προϊόντων που παράγονται από το ελεύθερο λογισμικό μας, καθώς και να προωθήσουμε γενικότερα την κοινή χρήση και τη δυνατότητα επαναχρησιμοποίησης του λογισμικού.
pt: Se desejar incorporar porções do Programa noutros programas livres cujas condições de distribuição sejam diferentes, escreva ao autor a pedir permissão. Para software que tem direito de cópia pela Free Software Foundation, escreva à Free Software Foundation; nós por vezes fazemos excepções para isto. A nossa decisão será guiada pelos dois objectivos de preservar o estado livre de todos os derivados do nosso software livre e a promoção da partilha e reutilização de software em geral.

source: NO WARRANTY
el: ΚΑΜΙΑ ΕΓΓΥΗΣΗ
pt: SEM GARANTIA

source: because the program is licensed free of charge, there is no warranty for the program, to the extent permitted by applicable law. except when otherwise stated in writing the copyright holders and/or other parties provide the program "as is" without warranty of any kind, either expressed or implied, including, but not limited to, the implied warranties of merchantability and fitness for a particular purpose. the entire risk as to the quality and performance of the program is with you. should the program prove defective, you assume the cost of all necessary servicing, repair or correction.
el: Επειδή η άδεια χρήσης του προγράμματος παρέχεται χωρίς χρέωση, δεν υπάρχει εγγύηση για το προγραμμα, στο βαθμό που επιτρέπει η ισχύουσα νομοθεσία. εφόσον δεν υπάρχει διαφορετική έγγραφη δήλωση, οι κάτοχοι πνευματικών δικαιωμάτων ή/και άλλες πλευρές παρέχουν το προγραμμα "ως έχει" χωρίς κανενός είδους εγγυήσεις, είτε ρητές είτε έμμεσες, στις οποίες συμπεριλαμβάνονται, ενδεικτικά, οι έμμεσες εγγυήσεις εμπορευσιμότητας και καταλληλότητάς. οποιοσδήποτε κίνδυνος από την ποιότητα και την απόδοση του προγράμματος ανήκει εξ ολοκλήρου σε εσάς. Εάν το προγραμμα αποδειχθεί ελαττωματικό, το κόστος όλων των εργασιών επισκευής ή διόρθωσής βαρύνει εσάς.
pt: porque o programa é licenciado livre de encargos, não existe qualquer garantia para o programa, até ao limite permitido pela lei aplicável. excepto quando de outro modo é afirmado por escrito que os detentores do direito de cópia e/ou outras partes disponibilizam o programa "como está" sem garantia de qualquer tipo, quer expressa ou implícita, incluindo, mas não limitado a, às garantias implícitas de transacção e adequação para um determinado propósito. todo o risco tal como a qualidade e desempenho do software é da sua responsabilidade. se o programa se provar defeituoso, você assume todo o custo de todo o serviço necessário, reparação ou correcção.
