Repository: xobs/debian-installer
Catalog: doc/manual/po/*/gpl.po
Languages: el, pt

source: Version 2, June 1991
el: Έκδοση 2, Ιούνιος 1991
pt: Versão 2, Junho de 1991

source: Copyright (C) 1989, 1991 Free Software Foundation, Inc. &mdash; 51 Franklin St, Fifth Floor, Boston, MA 02110-1301, USA.
pt: Copyright (C) 1989, 1991 Free Software Foundation, Inc. &mdash; 51 Franklin St, Fifth Floor, Boston, MA 02111-1301, USA.

source: Everyone is permitted to copy and distribute verbatim copies of this license document, but changing it is not allowed.
el: Ο καθένας επιτρέπεται να αντιγράψει και να διανείμει πιστά αντίγραφα του παρόντος εγγράφου αδειών, αλλά δεν επιτρέπεται καμία αλλαγή του.
pt: A todos é permitido copiar e distribuir cópias deste documento de licença com exactamente as mesmas palavras, mas modifica-lo não é permitido.

source: Preamble
el: Εισαγωγή
pt: Preâmbulo

source: The licenses for most software are designed to take away your freedom to share and change it. By contrast, the gnu General Public License is intended to guarantee your freedom to share and change free software &mdash; to make sure the software is free for all its users. This General Public License applies to most of the Free Software Foundation's software and to any other program whose authors commit to using it. (Some other Free Software Foundation software is covered by the gnu Library General Public License instead.) You can apply it to your programs, too.
el: Οι άδειες για το περισσότερο λογισμικό σχεδιάζονται έτσι ώστε να σας στερούν την ελευθερία σας να το μοιραστείτε με άλλους και να το αλλάξετε. Αντίθετα, η Γενική Άδεια Δημόσιας Χρήσης GNU έχει σκοπό να εγγυηθεί την ελευθερία σας να χρησιμοποιείτε από κοινού με άλλους και να τροποποιείτε προγράμματα που διατίθενται ελεύθερα &mdash; εξασφαλίζοντας έτσι ότι το λογισμικό είναι ελεύθερο για όλους τους χρήστες του. Αυτή η Γενική Άδεια Δημόσιας Χρήσης ισχύει για το μεγαλύτερο μέρος του λογισμικού του Ιδρύματος Ελεύθερου Λογισμικού (Free Software Foundation) καθώς και για κάθε άλλο πρόγραμμα οι δημιουργοί του οποίου συμμορφώνονται με την άδεια αυτή.(Αντ' αυτής, ορισμένα άλλα προγράμματα του Ιδρύματος Ελεύθερου Λογισμικού καλύπτονται από τη Γενική Άδεια Δημόσιας Χρήσης Βιβλιοθήκης GNU.) Την άδεια αυτή μπορείτε να την εφαρμόσετε και στα δικά σας προγράμματα.
pt: As licenças para a maioria do software são desenhadas para lhe tirar a sua liberdade de o partilhar e alterar. Em contraste, a licença gnu General Public License destina-se a garantir a sua liberdade de partilhar e modificar software livre - para garantir que este software é livre para todos os seus utilizadores. Esta licença General Public License aplica-se à maioria do software da Free Software Foundation e para qualquer outro programa cujos autores se comprometam a utilizá-la. (Algum outro software da Free Software Foundation em vez disso é coberto pela licença gnu Library General Public License.) Você pode aplicá-la também aos seus programas.

source: When we speak of free software, we are referring to freedom, not price. Our General Public Licenses are designed to make sure that you have the freedom to distribute copies of free software (and charge for this service if you wish), that you receive source code or can get it if you want it, that you can change the software or use pieces of it in new free programs; and that you know you can do these things.
el: Μιλώντας για ελεύθερο λογισμικό, αναφερόμαστε στην ελευθερία χρήσης του, όχι στο κόστος του. Οι Γενικές Άδειες Δημόσιας Χρήσης τις οποίες συντάσσουμε έχουν σκοπό να κατοχυρώσουν την ελευθερία σας να διανέμετε αντίγραφα ελεύθερου λογισμικού (και να χρεώνετε, εάν το επιθυμείτε, την παροχή αυτής της υπηρεσίας), να σας εξασφαλίσουν το δικαίωμα να λαμβάνετε τον πηγαίο κώδικα,ή να τον κατεβάσετε εάν τον χρειάζεστε, καθώς και να τροποποιείτε το λογισμικό, ή να χρησιμοποιείτε τμήματά του σε καινούργια ελεύθερα λογισμικά και να διασφαλίσουν ότι είστε ενήμεροι για τα παραπάνω δικαιώματά σας.
pt: Quando nós falamos de software livre, nós estamos a referir-nos à liberdade, não ao preço. As nossas General Public License são desenhadas de modo a assegurar que você tenha a liberdade de distribuir cópias de software livre (e cobrar por este serviço se assim o desejar), a que você receba o código fonte ou que possa obtê-lo se assim o quiser, a que possa modificar o software ou utilizar porções dele em novos programas livres; e a que você saiba que pode fazer essas coisas.

source: To protect your rights, we need to make restrictions that forbid anyone to deny you these rights or to ask you to surrender the rights. These restrictions translate to certain responsibilities for you if you distribute copies of the software, or if you modify it.
el: Για να προστατέψουμε τα δικαιώματά σας, πρέπει να θέσουμε περιορισμούς οι οποίοι θα εμποδίζουν σε κάποιον να αμφισβητήσει τα δικαιώματά σας ή να σας ζητήσει να παραιτηθείτε από αυτά. Εάν διανέμετε αντίγραφά του λογισμικού, ή το τροποποιείτε τότε αυτοί οι περιορισμοί μεταφράζονται σε ορισμένες ευθύνες από τη μεριά σας.
pt: Para proteger os seus direitos, nós precisamos fazer restrições que proíbam a alguém de lhe negar estes direitos ou de pedir-lhe para libertar os direitos. Estas restrições traduzem-se em certas responsabilidades para si se distribuir cópias do software, ou se o modificar.

source: For example, if you distribute copies of such a program, whether gratis or for a fee, you must give the recipients all the rights that you have. You must make sure that they, too, receive or can get the source code. And you must show them these terms so they know their rights.
el: Παραδείγματος χάριν, εάν διανέμετε τα αντίγραφα ενός τέτοιου προγράμματος, είτε δωρεάν είτε έναντι αμοιβής, πρέπει να δώσετε στους παραλήπτες όλα τα δικαιώματα που έχετε και εσείς. Πρέπει να σιγουρευτείτε ότι και εκείνοι επίσης λαμβάνουν, ή μπορούν να λάβουν, τον πηγαίο κώδικα. Επίσης πρέπει να τους γνωστοποιήσετε τούς όρους αυτής της άδειας χρήσης, έτσι ώστε να γνωρίζουν τα δικαιώματά τους.
pt: Por exemplo, se você distribuir cópias de um desses programa, quer seja grátis ou por uma taxa, você deve dar a quem o recebe todos os direitos que você possua. Você deve assegurar-se que, também, eles recebam ou possam obter o código fonte. E você tem de lhes mostrar estes termos de modo a que eles conheçam os seus direitos.

source: We protect your rights with two steps: (1) copyright the software, and (2) offer you this license which gives you legal permission to copy, distribute and/or modify the software.
el: Προστατεύουμε τα δικαιώματά σας με δύο τρόπους: (1) προστατεύοντας το λογισμικό και (2) προσφέροντάς σας αυτήν την άδεια, με την οποία αποκτάτε νόμιμο δικαίωμα αντιγραφής, διανομής ή/και τροποποίησης του λογισμικού.
pt: Nós protegemos os seus direitos em duas etapas: (1) direito de cópia do software, e (2) oferecemos-lhe esta licença que lhe dá o direito legal para copiar, distribuir e/ou modificar o software.

source: Also, for each author's protection and ours, we want to make certain that everyone understands that there is no warranty for this free software. If the software is modified by someone else and passed on, we want its recipients to know that what they have is not the original, so that any problems introduced by others will not reflect on the original authors' reputations.
el: Επίσης, για την προστασία κάθε δημιουργού και την δικιά μας, θέλουμε να είμαστε σίγουροι ότι όλοι κατανοούν τη μη ύπαρξη εγγύησης γι' αυτό το ελεύθερο λογισμικό. Εάν το λογισμικό τροποποιηθεί από κάποιον τρίτο και στη συνέχεια διανεμηθεί, θέλουμε να γνωρίζουν οι παραλήπτες του ότι το λογισμικό που απέκτησαν δεν είναι το πρωτότυπο, έτσι ώστε οποιαδήποτε προβλήματα προκληθούν από τρίτους σε αυτό να μην βαρύνουν το όνομα του πραγματικού δημιουργού του.
pt: Também, para nossa protecção e de cada autor, nós queremos ter a certeza que todos compreendam que não existe qualquer garantia para este software livre. Se o software é modificado por alguém e distribuído, nós queremos que aqueles que o recebam saibam que não é o original, de modo a que quaisquer problemas introduzidos por outros não se reflictam na reputação do autor original.

source: Finally, any free program is threatened constantly by software patents. We wish to avoid the danger that redistributors of a free program will individually obtain patent licenses, in effect making the program proprietary. To prevent this, we have made it clear that any patent must be licensed for everyone's free use or not licensed at all.
el: Τέλος, οποιοδήποτε ελεύθερο πρόγραμμα απειλείται συνεχώς από τα διπλώματα ευρεσιτεχνίας λογισμικού. Επιθυμούμε να αποτρέψουμε τον κίνδυνο να αποκτήσουν οι αναδιανομείς ελεύθερου λογισμικού διπλώματα ευρεσιτεχνίας, μετατρέποντάς το, στην πραγματικότητα σε προσωπική τους ιδιοκτησία. Για να αποτρέψουμε αυτό, έχουμε καταστήσει σαφές ότι οποιοδήποτε δίπλωμα ευρεσιτεχνίας λογισμικού πρέπει να χορηγεί άδεια ελεύθερης χρήσης του από οποιοδήποτε, διαφορετικά να μη χορηγείται καμία απολύτως άδεια.
pt: Finalmente, qualquer programa livre é constantemente ameaçado por patentes de software. Nós desejamos evitar o perigo de que aqueles que redistribuam um programa livre possam individualmente obter licenças de patentes, com o efeito de tornarem o programa proprietário. Para prevenir isto, nós deixamos claro que qualquer patente tem de ser licenciada para a utilização livre de todos ou então não pode ser licenciada de nenhuma forma.

source: The precise terms and conditions for copying, distribution and modification follow.
el: Ακολουθούν οι ακριβείς όροι και οι προϋποθέσεις αντιγραφής, διανομής και τροποποίησης.
pt: Seguem-se os termos precisos e as condições para cópia, distribuição e modificação.

source: TERMS AND CONDITIONS FOR COPYING, DISTRIBUTION AND MODIFICATION
el: ΟΡΟΙ ΚΑΙ ΠΡΟΥΠΟΘΕΣΕΙΣ ΑΝΤΙΓΡΑΦΗΣ, ΔΙΑΝΟΜΗΣ ΚΑΙ ΤΡΟΠΟΠΟΙΗΣΗΣ
pt: TERMOS E CONDIÇÕES PARA CÓPIA, DISTRIBUIÇÃO E MODIFICAÇÃO

source: This License applies to any program or other work which contains a notice placed by the copyright holder saying it may be distributed under the terms of this General Public License. The "Program", below, refers to any such program or work, and a "work based on the Program" means either the Program or any derivative work under copyright law: that is to say, a work containing the Program or a portion of it, either verbatim or with modifications and/or translated into another language. (Hereinafter, translation is included without limitation in the term "modification".) Each licensee is addressed as "you".
el: Αυτή η Άδεια ισχύει για οποιοδήποτε πρόγραμμα ή άλλο έργο που περιέχει μια ειδοποίηση από τον κάτοχο πνευματικών δικαιωμάτων και η οποία αναφέρει ότι αυτό το πρόγραμμα ή το έργο μπορεί να διανεμηθεί υπό τούς όρους αυτής της Γενικής Άδειας Δημόσιας Χρήσης. Ο όρος "Πρόγραμμα", παρακάτω, αναφέρεται σε οποιοδήποτε τέτοιο πρόγραμμα ή έργο, και η φράση "έργο βασισμένο στο Πρόγραμμα" σημαίνει είτε το ίδιο το Πρόγραμμα είτε οποιοδήποτε προερχόμενο από αυτό έργο που υπάγεται στο νόμο περί πνευματικής ιδιοκτησίας: δηλαδή, μια εργασία που περιέχει ακέραιο το Πρόγραμμα ή ένα τμήμα του, είτε αυτούσιο είτε τροποποιημένο ή/και μεταφρασμένο σε άλλη γλώσσα. ( Από δω κει πέρα, η μετάφραση θα συμπεριλαμβάνεται μέσα στον όρο "τροποποίηση" χωρίς κανένα περιορισμό.) Κάθε κάτοχος άδειας αποκαλείται ως "εσείς/εσάς".
pt: Esta licença aplica-se a qualquer programa ou outro trabalho que contenha um aviso colocado pelo detentor do direito de cópia a dizer que pode ser distribuído nos termos da General Public License. O "Programa", abaixo, refere-se a qualquer programa ou trabalho, e um "trabalho baseado no Programa" significa ou o Programa ou qualquer trabalho derivado sob a lei de direito de cópia: isso é dizer, um trabalho contendo o Programa ou uma porção dele, quer seja uma cópia exacta ou com modificações e/ou traduzido para outro idioma. (numa parte seguinte deste documento, tradução é incluída sem limitações no termo "modificação".) Cada licenciado é endereçado como "você".

source: Activities other than copying, distribution and modification are not covered by this License; they are outside its scope. The act of running the Program is not restricted, and the output from the Program is covered only if its contents constitute a work based on the Program (independent of having been made by running the Program). Whether that is true depends on what the Program does.
el: Άλλες δραστηριότητες πέραν της αντιγραφής, της διανομής και της τροποποίησης δεν καλύπτονται από αυτήν την Άδεια - είναι εκτός των πλαισίων της. Δεν υπάρχει περιορισμός στην ενέργεια εκτέλεσης ενός προγράμματος, ενώ το προϊόν της χρήσης του Προγράμματος καλύπτεται μόνο εφόσον το περιεχόμενό του συνιστά έργο βασισμένο στο Πρόγραμμα (ανεξάρτητα από το εάν δημιουργήθηκε με την εκτέλεση του Προγράμματος). Το κατά πόσο συμβαίνει αυτό εξαρτάται από το είδος του Προγράμματος.
pt: Outras actividades que não sejam a cópia, distribuição e modificação não são cobertas por esta licença; estão fora do seu âmbito. O acto de correr o Programa não é restrito, e a saída do Programa é coberta apenas se o seu conteúdo constituir um trabalho baseado no Programa (independentemente de ter sido feito por correr o Programa). Quer seja verdade que dependa do que o Programa faz.

source: You may copy and distribute verbatim copies of the Program's source code as you receive it, in any medium, provided that you conspicuously and appropriately publish on each copy an appropriate copyright notice and disclaimer of warranty; keep intact all the notices that refer to this License and to the absence of any warranty; and give any other recipients of the Program a copy of this License along with the Program.
el: Επιτρέπεται η αντιγραφή και διανομή αυτούσιων αντιγράφων του πηγαίου κώδικα του Προγράμματος όπως ακριβώς το έχετε λάβει, σε οποιοδήποτε αποθηκευτικό μέσο, με την προϋπόθεση ότι θα δημοσιεύσετε εμφανώς και καταλλήλως, σε κάθε αντίγραφο, ένα σημείωμα πνευματικής ιδιοκτησίας και ένα σημείωμα αποποίησης ευθυνών εγγύησης ότι θα συμπεριλάβετε ακέραια όλα τα σημειώματα που αναφέρονται στην Άδεια αυτή και στην απουσία οποιασδήποτε εγγύησης και, τέλος, ότι θα εκχωρήσετε σε κάθε άλλον παραλήπτη του Προγράμματος ένα αντίγραφο αυτής της Άδειας μαζί με το Πρόγραμμα.
pt: Você pode copiar e distribuir cópias com exactamente o mesmo conteúdo do código fonte do Programa como você o recebeu, em qualquer meio, desde que seja óbvio, facilmente notado e publicado de forma apropriada em cada cópia um aviso do direito de cópia e a renúncia de direito à garantia; manter intactos todos os outros avisos que se referem a esta Licença e à ausência de qualquer garantia; e dar a quaisquer outros que recebam o Programa uma cópia desta Licença junto com o Programa.

source: You may charge a fee for the physical act of transferring a copy, and you may at your option offer warranty protection in exchange for a fee.
el: Έχετε δικαίωμα να επιβάλετε χρέωση για τη φυσική ενέργεια της μεταφοράς ενός αντιγράφου, καθώς και να παράσχετε, κατά την κρίση σας, προστασία εγγύησης με χρέωση.
pt: Você pode cobrar uma taxa pelo acto físico de transferir uma cópia, e pode por sua opção oferecer protecção de garantia em troca de uma taxa.

source: You may modify your copy or copies of the Program or any portion of it, thus forming a work based on the Program, and copy and distribute such modifications or work under the terms of Section 1 above, provided that you also meet all of these conditions:
el: Επιτρέπεται η τροποποίηση του αντιγράφου ή των αντιγράφων ολόκληρου του Προγράμματος ή μέρους του, η οποία συνιστά συνεπώς δημιουργία ενός έργου βασισμένου στο Πρόγραμμα, και η διανομή αυτών των τροποποιήσεων ή έργων υπόκειται στους όρους της παραπάνω Ενότητας 1, με την προϋπόθεση ότι και εσείς πληροίτε όλες τις παρακάτω προϋποθέσεις:
pt: Você pode modificar a sua cópia ou cópias do Programa ou qualquer parte dele, assim formando um trabalho baseado no Programa, e copiar e distribuir tais modificações ou trabalho sob os termos da Secção 1 acima, desde que também cumpra todas as seguintes condições:

source: a) You must cause the modified files to carry prominent notices stating that you changed the files and the date of any change.
el: α) Πρέπει να φροντίζετε ώστε τα τροποποιημένα αρχεία να παρέχουν εμφανή σημειώματα στα οποία να δηλώνεται η τροποποίηση των αρχείων και η ημερομηνία τροποποίησης.
pt: a) Você deve fazer com que os ficheiros modificados acompanhem avisos visíveis afirmando que você alterou os ficheiros e a data de qualquer modificação.

source: b) You must cause any work that you distribute or publish, that in whole or in part contains or is derived from the Program or any part thereof, to be licensed as a whole at no charge to all third parties under the terms of this License.
el: β) Πρέπει να φροντίζετε ώστε για κάθε έργο το οποίο διανέμετε ή δημοσιεύετε, και το οποίο περιέχει ή παράγεται από ολόκληρο ή μέρος του Προγράμματος, να παρέχεται άδεια χρήσης του, χωρίς χρέωση, σε όλα τα τρίτα μέρη, σύμφωνα με τους όρους αυτής της Άδειας.
pt: b) Você deve fazer com que qualquer trabalho que distribua ou publique, quer em todo quer em parte contenha ou o seu derivado do Programa ou qualquer parte relacionada com isto, seja licenciada como um todo sem obrigações para todos os terceiros sob os termos desta Licença.

source: c) If the modified program normally reads commands interactively when run, you must cause it, when started running for such interactive use in the most ordinary way, to print or display an announcement including an appropriate copyright notice and a notice that there is no warranty (or else, saying that you provide a warranty) and that users may redistribute the program under these conditions, and telling the user how to view a copy of this License. (Exception: if the Program itself is interactive but does not normally print such an announcement, your work based on the Program is not required to print an announcement.)
el: γ) Εάν το τροποποιημένο πρόγραμμα διαβάζει εντολές αλληλεπιδραστικά, κατά την τυπική εκτέλεσή του, πρέπει να φροντίζετε ώστε, κατά την έναρξη τυπικής εκτέλεσής του για αυτήν την αλληλεπιδραστική χρήση, να εκτυπώνεται ή να εμφανίζεται στην οθόνη μια ανακοίνωση, η οποία θα περιλαμβάνει το απαραίτητο σημείωμα πνευματικής ιδιοκτησίας και ένα σημείωμα στο οποίο θα αναφέρεται ότι δεν υπάρχει καμιά εγγύηση (ή, αντίθετα, ότι δεν παρέχετε εγγύηση) και ότι οι χρήστες έχουν τη δυνατότητα να αναδιανέμουν το πρόγραμμα σύμφωνα με τις προϋποθέσεις αυτές, καθώς και οδηγίες προς το χρήστη για τον τρόπο προβολής ενός αντιγράφου αυτής της Άδειας. (Εξαίρεση: εάν το ίδιο το Πρόγραμμα είναι αλληλεπιδραστικό αλλά κανονικά δεν εκτυπώνει αυτήν την ανακοίνωση, δεν απαιτείται από το έργο, που δημιουργήσατε βασισμένοι στο Πρόγραμμα, να εκτυπώνει ανακοίνωση.)
pt: c) Se o programa modificado normalmente lê comandos interactivamente quando executado, quando iniciada a execução para uma dessas utilizações interactivas na forma mais usual, imprimir ou mostrar um aviso de direito de cópia e um aviso de que não há qualquer garantia (ou então, dizer que você disponibiliza uma garantia) e que os utilizadores podem redistribuir o programa sob estas condições, e dizer ao utilizador como pode ver uma cópia desta Licença. (Excepção: se o próprio Programa é interactivo mas normalmente não mostra um desses avisos, o seu trabalho baseado no Programa não tem de mostrar um anúncio.)

source: These requirements apply to the modified work as a whole. If identifiable sections of that work are not derived from the Program, and can be reasonably considered independent and separate works in themselves, then this License, and its terms, do not apply to those sections when you distribute them as separate works. But when you distribute the same sections as part of a whole which is a work based on the Program, the distribution of the whole must be on the terms of this License, whose permissions for other licensees extend to the entire whole, and thus to each and every part regardless of who wrote it.
el: Οι απαιτήσεις αυτές ισχύουν για ολόκληρο το τροποποιημένο έργο. Εάν συγκεκριμένες ενότητες του έργου αυτού δεν παράγονται από το Πρόγραμμα, και μπορούν να θεωρηθούν με ασφάλεια από μόνες τους ως ανεξάρτητα και ξεχωριστά έργα, τότε αυτή η Άδεια και οι όροι της δεν ισχύουν για τις ενότητες αυτές, κατά τη διανομή τους ως ξεχωριστά έργα. Αλλά όταν διανέμετε τις ίδιες ενότητες ως τμήματα ενός ευρύτερου έργου το οποίο βασίζεται στο Πρόγραμμα, η διανομή του συνόλου πρέπει να υπόκειται στους όρους της Άδειας, σύμφωνα με την οποία τα δικαιώματα των άλλων χρηστών εκτείνονται σε ολόκληρο το έργο, επομένως και σε καθένα χωριστό τμήμα του, ανεξάρτητα από το ποιος είναι ο δημιουργός του.
pt: Estes requisitos aplicam-se ao trabalho modificado como um todo. Se secções identificáveis desse trabalho que não sejam derivadas do Programa, e possam ser razoavelmente consideradas independentes e trabalhos separados neles mesmos, então esta Licença, nos seus termos, não se aplica a essas secções quando você as distribui como trabalhos separados. Mas quando você distribuir as mesmas secções como parte de um todo o qual é um trabalho baseado no Programa, a distribuição do todo tem de ser nos termos desta Licença, cujas permissões para outros licenciados se estendem para o todo completo, e deste modo para cada e para todas as partes sem interessar quem o escreveu.

source: Thus, it is not the intent of this section to claim rights or contest your rights to work written entirely by you; rather, the intent is to exercise the right to control the distribution of derivative or collective works based on the Program.
el: Επομένως, πρόθεση αυτής της ενότητας δεν είναι να εγείρει δικαιώματα ή να αμφισβητήσει τα δικά σας δικαιώματα σε ένα έργο που δημιουργήσατε εξ ολοκλήρου οι ίδιοι η πρόθεση της, περισσότερο, είναι να ασκήσει το δικαίωμα ελέγχου της διανομής των παραγόμενων ή των συλλογικών έργων που βασίζονται στο Πρόγραμμα.
pt: Deste modo, não é objectivo desta secção reclamar direitos ou contestar os seus direitos para trabalho escrito exclusivamente por si; em vez disso, o intuito é exercer o direito de controlar a distribuição dos trabalhos derivados ou colectivos baseados no Programa.

source: In addition, mere aggregation of another work not based on the Program with the Program (or with a work based on the Program) on a volume of a storage or distribution medium does not bring the other work under the scope of this License.
el: Επιπλέον, η απλή προσθήκη ενός άλλου έργου, που δεν βασίζεται στο Πρόγραμμα, μαζί με το Πρόγραμμα (ή με ένα έργο που βασίζεται στο Πρόγραμμα) σε ένα μέσο αποθήκευσης ή διανομής, δεν υπάγει αυτό το άλλο έργο στα πλαίσια αυτής της Άδειας.
pt: Em adição, a mera agregação de outro trabalho não baseado no Programa com o Programa (ou com um trabalho baseado no Programa) num volume de armazenamento ou meio de distribuição não traz o outro trabalho sob o âmbito desta Licença.

source: You may copy and distribute the Program (or a work based on it, under Section 2) in object code or executable form under the terms of Sections 1 and 2 above provided that you also do one of the following:
el: Επιτρέπεται η αντιγραφή και διανομή του Προγράμματος (ή ενός έργου βασισμένο σε αυτό, σύμφωνα με την Ενότητα 2) σε μορφή αντικειμενικού κώδικα ή εκτελέσιμη μορφή, σύμφωνα με τους όρους των παραπάνω Ενοτήτων 1 και 2 , με την προϋπόθεση ότι πραγματοποιείτε και μια από τις ακόλουθες ενέργειες:
pt: Você pode copiar e distribuir o Programa (ou um trabalho baseado nele, sob a Secção 2) em código objecto ou na forma de executável sob os termos das Secções 1 e 2 acima desde que você faça um dos seguintes:
