Repository: xobs/debian-installer
Catalog: doc/manual/po/*/installation-howto.po
Languages: el, pt, ru, zh_cn, zh_tw

source: On the next screen you will see your partition table, how the partitions will be formatted, and where they will be mounted. Select a partition to modify or delete it. If you did automatic partitioning, you should just be able to choose <guimenuitem>Finished partitioning</guimenuitem> from the menu to use what it set up. Remember to assign at least one partition for swap space and to mount a partition on <filename>/</filename>. <xref linkend="partitioning"/> has more information about partitioning.
el: Στην επόμενη οθόνη θα δείτε τον πίνακα τμημάτων, πως θα διαμορφωθούν τα τμήματα, και σε ποιο κατάλογο θα προσαρτηθούν (σημείο επαφής). Επιλέξτε ένα τμήμα προς επεξεργασία ή διαγράψτε το. Αν κάνατε αυτόματη κατάτμηση, πρέπει να έχετε διαθέσιμη από το μενού μόνο την επιλογή <guimenuitem>Ολοκλήρωση διαμέρισης</guimenuitem>,για την εφαρμογή της νέας διαρύθμισης. Θυμηθείτε να ορίσετε τουλάχιστον ένα τμήμα για χώρο εικονικής μνήμης (swap) και να προσαρτήσετε ένα τμήμα στον κατάλογο<filename>/</filename>. Περισσότερες πληροφορίες σχετικά με τη κατάτμηση στο <xref linkend="partitioning"/>.
pt: No ecrã seguinte irá ver a sua tabela de partições, como irão as partições ser formatadas, e onde irão ser montadas. Seleccione uma partição para a modificar ou a apagar. Se você fez o particionamento automático deverá poder escolher <guimenuitem>Terminar particionamento</guimenuitem> do menu para utilizar o que foi definido. Lembre-se de atribuir pelo menos uma partição para swap e montar uma partição em <filename>/</filename>. Veja o <xref linkend="partitioning"/> mais informações acerca do particionamento.
ru: На следующем экране вы увидите текущую таблицу разделов, формат разделов и куда они будут монтироваться. Выберите раздел для изменения или удаления. Если вы выбрали автоматическую разметку, то вам доступен только пункт меню <guimenuitem>Закончить разметку</guimenuitem>, нажав на который вы подтвердите изменения. Не забудьте назначить по крайней мере один раздел для подкачки и смонтировать один раздел в качестве корневого раздела <filename>/</filename>. В <xref linkend="partitioning"/> рассказано более подробно о процедуре разметки.
zh_cn: 在接下来的界面里，您可以看到自己有关分区的一张表，上面标出了各分区将以何种方式格式化，以及它们将来的挂载点在何处。要修改分区的设置或是删除分区，可以先选中它，再进行操作。如果您先前选择的是自动分区，那么您现在只要选<guimenuitem>分区结束</guimenuitem>, 使用自动分区的设置即可。有一点，请不要忘记至少要分配一个分区作为交换空间，还有必须把一个分区挂载到 <filename>/</filename>上。<xref linkend="partitioning"/> 有更多关于分区方面的信息。
zh_tw: 在接下來的畫面裡，您可以看到分割區列表，上面標出了各分區將以何種方式格式化，以及它們的掛載點在何處。選擇一個磁區再修改分區的設置或是刪除分區。如果您選擇的是自動分割，那麼只要選則 <guimenuitem>完成分割磁區</guimenuitem> ,使用自動分割的設定即可。請記得至少要分配一個磁區作為置換空間，並把一個磁區掛載到 <filename>/</filename>上。<xref linkend="partitioning"/> 有更多關於分割磁區的資訊。

source: Now &d-i; formats your partitions and starts to install the base system, which can take a while. That is followed by installing a kernel.
el: Τώρα ο &d-i; διαμορφώνει τα τμήματα και ξεκινάει την εγκατάσταση του κυρίως συστήματος, που μπορεί να πάρει κάποια ώρα. Κατόπιν εγκαθίσταται ο πυρήνας.
pt: Agora o &d-i; formata as partições e começa a instalar o sistema base, que poderá levar algum tempo. Será seguido pela instalação do Kernel.
ru: Далее &d-i; отформатирует разделы и начнёт установку базовой системы, что может занять некоторое время. Затем устанавливается ядро.
zh_cn: 现在 &d-i; 会把您的分区格式化，然后安装基系统。这两步会花些时间。接着，它会安装内核。
zh_tw: 現在 &d-i; 會先把您的磁區格式化，然後安裝基本系統，這兩步會花些時間。接著它會安裝核心。

source: The last step is to install a boot loader. If the installer detects other operating systems on your computer, it will add them to the boot menu and let you know. <phrase arch="i386">By default GRUB will be installed to the master boot record of the first harddrive, which is generally a good choice. You'll be given the opportunity to override that choice and install it elsewhere. </phrase>
el: Το τελευταίο βήμα είναι η εγκατάσταση ενός εκκινητή συστήματος. Αν ο εγκαταστάτης ανιχνεύσει άλλα λειτουργικά συστήματα στον υπολογιστή, θα τα προσθέσει στο μενού εκκίνησης και θα σας ενημερώσει σχετικά.<phrase arch="i386">Ο προεπιλεγμένος εκκινητής συστήματος GRUB θα εγκατασταθεί στο master boot record του πρώτου σκληρού δίσκου, που είναι γενικά μια καλή επιλογή. Σας δίνεται όμως η ευκαιρία να παρακάμψετε αυτή την επιλογή και να τον εγκαταστήσετε κάπου αλλού.</phrase>
pt: A última etapa é instalar o gestor de arranque. Se o instalador detectar outros sistemas operativos no seu computador, irá adicioná-los ao menu do gestor e notifica-lo-á do acrescento. <phrase arch="i386">Por omissão o GRUB será instalado no master boot record do seu primeiro disco rígido, que por norma é uma boa escolha. Ser-lhe-á dada a oportunidade para alterar essa opção e instalar noutro sítio. </phrase>
ru: На последнем шаге устанавливается системный загрузчик. Если программа установки обнаружит другую операционную систему на компьютере, то добавит её в меню загрузки и скажет вам об этом. <phrase arch="i386">По умолчанию GRUB устанавливается в главную загрузочную запись первого жёсткого диска, что обычно и нужно. Вам будет предоставлена возможность изменения и установки его в другое место. </phrase>
zh_cn: 最后一步就是安装 boot loader 了。如果安装程序发现您的计算机还安装有其它的操作系统，它会把它们加入启动菜单，并通知您。<phrase arch="i386">缺省情况下会把 GRUB 安装到第一块硬盘的引导记录上。一般来说，这样做没什么问题。您也可以不让它这样做，而是把 GRUB 装在其它什么地方。</phrase>
zh_tw: 最後一步就是安裝 boot loader 了。如果安裝程式發現您的電腦還安裝有其它作業系統，它會把它們加入開機選單並通知您。<phrase arch="i386">預設狀況下會把 GRUB 安裝到第一塊硬碟的開機記錄上，一般來說，這是一個不錯的方法。當然您也可以不讓它這樣做，而是把 GRUB 裝在其它地方。</phrase>

source: &d-i; will now tell you that the installation has finished. Remove the cdrom or other boot media and hit &enterkey; to reboot your machine. It should boot up into the next stage of the install process, which is explained in <xref linkend="boot-new"/>.
el: Ο &d-i; θα σας ενημερώσει τώρα ότι η εγκατάσταση ολοκληρώθηκε. Αφαιρέστε το cdrom ή το μέσο εκκίνησης που επιλέξατε και πατήστε &enterkey; για να επανεκκινήσετε το σύστημα. Θα πρέπει να εκκινήσει στο επόμενο στάδιο της διαδικασίας εγκατάστασης, που εξηγείται στο <xref linkend="boot-new" />.
pt: &d-i; irá o informar de que a instalação terminou. Retire o CD ou outros media de arranque e carregue na tecla &enterkey; para reiniciar a sua máquina. Deverá iniciar na etapa seguinte do processo de instalação, que é explicado no <xref linkend="boot-new"/>.
ru: Далее &d-i; скажет, что установка завершена. Вытащите компакт-диск или другой носитель с программой установки и нажмите &enterkey; для перезагрузки машины. После этого должен начаться следующий этап процесса установки, который описан в <xref linkend="boot-new"/>.
zh_cn: &d-i; 现在会告诉您安装已经完成了。把光盘从光驱里取出或者取下其它启动介质，然后敲一下 &enterkey; 就可以重新启动您的机器了。重启后，它会进入安装过程的下一个阶段，在 <xref linkend="boot-new"/> 有对它的详尽说明。
zh_tw: &d-i; 現在會告訴您安裝已經完成。把光碟片從光碟裡取出或者移除其它啟動媒介，然後按 &enterkey; 就可以重新啟動電腦了。然後它會進入安裝過程的下一個階段，在 <xref linkend="boot-new"/> 有對它的詳盡說明。

source: If you need more information on the install process, see <xref linkend="d-i-intro"/>.
el: Αν χρειάζεστε περισσότερες πληροφορίες σχετικά με τη διαδικασία εγκατάστασης, δείτε το <xref linkend="d-i-intro" />.
pt: Se precisar de mais informação sobre o processo de instalação, visite o <xref linkend="d-i-intro"/>.
ru: Если вам требуется дополнительная информация по процессу установки, посмотрите <xref linkend="d-i-intro"/>.
zh_cn: 如果您想要更多的安装过程相关信息，请看 <xref linkend="d-i-intro"/>。
zh_tw: 如果您想要更多的安裝過程相關資訊，請看 <xref linkend="d-i-intro"/>。

source: Send us an installation report
el: Στείλτε μας μια αναφορά εγκατάστασης
pt: Envie-nos um relatório de instalação
ru: Отправьте нам отчёт об установке
zh_cn: 请给我们发一份安装报告
zh_tw: 請寄給我們一份安裝報告

source: If you successfully managed an installation with &d-i;, please take time to provide us with a report. There is a template named <filename>install-report.template</filename> in the <filename>/root</filename> directory of a freshly installed system. Please fill it out and file it as a bug against the package <classname>installation-reports</classname>, as explained in <xref linkend="submit-bug"/>.
el: Αν ολοκληρώσατε επιτυχώς μια εγκατάσταση με τον &d-i;, παρακαλείσθε να αφιερώσετε λίγο χρόνο για να στείλετε μια αναφορά. Υπάρχει ένα πρότυπο με το όνομα <filename>install-report.template</filename> στον κατάλογο <filename>/root</filename> σε ένα νεοεγκατεστημένο σύστημα. Παρακαλείσθε να το συμπληρώσετε και να το στείλετε σαν σφάλμα ενάντια στο πακέτο <classname>installation-reports</classname>, όπως εξηγείται στο <xref linkend="submit-bug" />.
pt: Se conseguiu terminar com sucesso a instalação com o &d-i;, por favor use algum tempo para nos fornecer um relatório. Existe um modelo denominado de <filename>install-report.template</filename> na directoria <filename>/root</filename> do sistema acabado de instalar. Por favor preencha-o e arquive-o como um bug do pacote <classname>installation-reports</classname>, como é explicado na <xref linkend="submit-bug"/>.
ru: Если вы успешно справились с установкой с помощью &d-i;, пожалуйста, найдите время и отправьте нам отчёт. В только что установленной системе в каталоге <filename>/root</filename> лежит файл шаблона <filename>install-report.template</filename>. Заполните его и отправьте как сообщение об ошибке пакета <classname>installation-reports</classname> (смотрите <xref linkend="submit-bug"/>.
zh_cn: 如果您成功地用 &d-i; 完成了安装，请您抽空给我们写一份报告吧。在新装好的系统里的有一个名为 <filename>install-report.template</filename> 的模板文件，它位于 <filename>/root</filename>目录下。请填好它，然后把它作为一个对 <classname>installation-reports</classname> 软件包的错误回报发送过来。至于提交错误回报的具体操作，在 <xref linkend="submit-bug"/>。
zh_tw: 如果您成功地用 &d-i; 完成了安裝，請您抽空給我們寫一份報告吧。在新裝好的系統裡的有一個名為 <filename>install-report.template</filename> 的樣板文件，它位於 <filename>/root</filename> 目錄下。請填好並將它以 <classname>installation-reports</classname> 軟體套件的錯誤回報發送過來。至於提交錯誤回報的細節，請參照 <xref linkend="submit-bug"/>。

source: If you did not reach base-config or ran into other trouble, you probably found a bug in debian-installer. To improve the installer it is necessary that we know about them, so please take the time to report them. You can use an installation report to report problems; if the install completely fails, see <xref linkend="problem-report"/>.
el: Αν δεν φτάσατε μέχρι το base-config ή αντιμετωπίσατε κάποιο άλλο πρόβλημα,είναι πιθανόν να βρήκατε ένα σφάλμα στον εγκαταστάτη. Για τη βελτίωση του εγκαταστάτη είναι απαραίτητο να γνωρίζουμε τα σφάλματα, γι' αυτό παρακαλείσθε να αφιερώσετε λίγο χρόνο για την αναφορά τους. Μπορείτε να χρησιμοποιήσετε μια αναφορά εγκατάστασης για να αναφέρετε προβλήματα. Αν η εγκατάσταση αποτύχει τελείως, συμβουλευτείτε το <xref linkend="problem-report" />.
pt: Se não chegou à base-config ou ocorreu outro problema, provavelmente encontrou um bug no instalador debian. Para melhorar o instalador é necessário que tenhamos conhecimento deles, por favor use algum tempo para os reportar. Poderá utilizar o relatório de instalação para nos reportar problemas; se a instalação falhar completamente, veja a <xref linkend="problem-report"/>.
ru: Если вы не добрались до base-config или столнулись с другой проблемой, то вероятно обнаружили ошибку в debian-installer. Для улучшения программы установки необходимо, чтобы мы узнали об этом, поэтому, пожалуйста потратьте время, чтобы сообщить об ошибке. Вы можете использовать отчёт об установке, чтобы сообщить о проблеме; если установка полностью провалилась, смотрите <xref linkend="problem-report"/>.
zh_cn: 如果您到不了 base-config 这一步，或者碰到了其它的麻烦，那么您也许发现了一个 debian-installler 的错误。要改进安装程序，就很有必要让我们知道这些异状，因此，请抽空把这些错误报告给我们。您也可以使用 installation report 来回报错误。如果安装彻底失败了，请参看 <xref linkend="problem-report"/>。
zh_tw: 如果您到不了 base-config 這一步，或者碰到了其它的問題，那麼您也許遇到了 debian-installler 的錯誤。請告訴我們這些問題以改進安裝程式，所以請抽空把這些錯誤報告給我們。您也可以使用 installation report 來回報錯誤。如果安裝徹底失敗了，請參閱 <xref linkend="problem-report"/>。

source: And finally..
el: Και τέλος..
pt: E finalmente..
ru: И напоследок...
zh_cn: 末了……
zh_tw: 最後......

source: We hope that your Debian installation is pleasant and that you find Debian useful. You might want to read <xref linkend="post-install"/>.
el: Ελπίζουμε ότι η εγκατάσταση σας είναι ευχάριστη και ότι βρίσκετε το Debian χρήσιμο. Καλό θα ήταν να διαβάσετε και το <xref linkend="post-install" />.
pt: Esperamos que a sua instalação de Debian seja agradável e que considere o Debian útil. Você pode querer ler o <xref linkend="post-install"/>.
ru: Мы надеемся, что установка Debian была приятной и что вы найдёте Debian полезным. Вероятно, вам пригодится информация из <xref linkend="post-install"/>.
zh_cn: 我们祝愿您的 Debian 安装顺利愉快，并希望您能发现 Debian 在您这里的用武之地。还有您也许可以读一下 <xref linkend="post-install"/>。
zh_tw: 我們希望您的 Debian 安裝順利愉快，並希望您能瞭解 Debian 好用之處。您或許想閱讀 <xref linkend="post-install"/>。
