Repository: xobs/debian-installer
Catalog: doc/manual/po/*/installation-howto.po
Languages: el, pt, ru, zh_cn, zh_tw

source: Installation Howto
el: Οδηγός εγκατάστασης
pt: Howto de Instalação
ru: Краткая инструкция по установке
zh_cn: 安装指南
zh_tw: 安裝 Howto

source: This document describes how to install &debian; &releasename; for the &arch-title; (<quote>&architecture;</quote>) with the new &d-i;. It is a quick walkthrough of the installation process which should contain all the information you will need for most installs. When more information can be useful, we will link to more detailed explanations in the <link linkend="debian_installation_guide">&debian; Installation Guide</link>.
el: Το έγγραφο αυτό περιγράφει πως να εγκαταστήσετε το &debian; &releasename; για την αρχιτεκτονική &arch-title; (<quote>&architecture;</quote>) με το νέο&d-i;. Αποτελεί ένα γρήγορο πέρασμα από τη διαδικασία εγκατάστασης και πρέπει να περιέχει ό,τι χρειάζεται για την πλειοψηφία των εγκαταστάσεων.Όπου χρειάζονται περισσότερες πληροφορίες, θα γίνεται παραπομπή σε λεπτομερέστερες εξηγήσεις στον <link linkend="debian_installation_guide">&debian;Οδηγό Εγκατάστασης</link>.
pt: Este documento descreve como instalar &debian; &releasename; para &arch-title; (<quote>&architecture;</quote>) com o novo &d-i;. É uma rápida passagem pelo processo de instalação que deve conter toda a informação que precisa para a maioria das instalações. Quando mais informação for necessária, visite o <link linkend="debian_installation_guide">Guia de Instalação &debian;</link> para explicações mais detalhadas.
ru: Данный документ описывает установку &debian; &releasename; на &arch-title; (<quote>&architecture;</quote>) с помощью нового &d-i;. Это краткое описание процесса установки, в нём содержится вся информация, необходимая для большинства установок. В тех местах, где полезно прочитать более обширное описание, будет приведена ссылка на соответствующую главу <link linkend="debian_installation_guide">руководства по установке &debian;</link>.
zh_cn: 本文介绍了如何在 &arch-title; (<quote>&architecture;</quote>) 架构的计算机上，使用新版的 &d-i; 安装 &debian; &releasename;。这是一次对安装过程的走马观花式的简介，但是它应该囊括了大多数情况下您进行安装所必须的信息。当有必要获得更多信息时，我们会有相应的较详尽的说明文档 <link linkend="debian_installation_guide">&debian;安装指南</link>。
zh_tw: 本文介紹了如何在 &arch-title; (<quote>&architecture;</quote>)架構的電腦上，使用新版 &d-i; 來安裝 &debian; &releasename;。我們簡要說明安裝過程，但會囊括了大多數情況下您進行安裝所需的訊息。當有必要取得更多訊息時，我們會有較詳盡的說明文件 <link linkend="debian_installation_guide">&debian;安裝指南</link>。

source: Preliminaries
el: Προκαταρκτικά
pt: Preliminares
ru: Предварительные сведения
zh_cn: 前言
zh_tw: 前言

source: <phrase condition="unofficial-build"> The debian-installer is still in a beta state. </phrase> If you encounter bugs during your install, please refer to <xref linkend="submit-bug"/> for instructions on how to report them. If you have questions which cannot be answered by this document, please direct them to the debian-boot mailing list (&email-debian-boot-list;) or ask on IRC (#debian-boot on the freenode network).
el: <phrase condition="unofficial-build">Ο Εγκαταστάτης είναι ακόμα σε έκδοση beta.</phrase> Αν αντιμετωπίσετε σφάλματα κατά την εγκατάσταση, δείτε το <xref linkend="submit-bug" /> για οδηγίες σχετικά με την αναφορά τους. Αν έχετε ερωτήσεις που δεν απαντιούνται σε αυτό το έγγραφο απευθυνθείτε στη λίστα αλληλογραφίας debian-boot (&email-debian-boot-list;), ή στο αντίστοιχο κανάλι IRC (#debian-boot στο δίκτυο freenode).
pt: <phrase condition="unofficial-build"> O instalador debian ainda está num estado beta. </phrase> Se encontrar bugs durante a instalação, por favor consulte a <xref linkend="submit-bug"/> para instruções em como relatá-los. Se tiver questões que não são respondidas por este documento, envie-as por favor para a lista de mail debian-boot (&email-debian-boot-list;) ou pergunte no IRC (#debian-boot na rede freenode).
ru: <phrase condition="unofficial-build">Debian-installer пока находится в состоянии тестирования. </phrase> Если вы обнаружите ошибки во время установки, загляните в <xref linkend="submit-bug"/>. Если у вас есть вопросы, на которые нет ответа в этом документе, смело задавайте их в списке рассылки debian-boot (&email-debian-boot-list;) или в IRC-канале (#debian-boot в сети freenode).
zh_cn: <phrase condition="unofficial-build"> debian-installer 仍然处于 beta 测试阶段。</phrase> 如果您在安装时碰到程序出错，请参考 <xref linkend="submit-bug"/> 回报错误。倘若本文档不能够回答您所有的疑问，那么请带着这些问题去 debian-boot 的邮件列表(&email-debian-boot-list;)问问看，或者您也可以在 irc (即 freenode 站点的 #debian-boot 频道)上直接提问。
zh_tw: <phrase condition="unofficial-build"> debian-installer 仍然處於 beta 測試階段。</phrase> 如果您在安裝時碰到程式出錯，請參考 <xref linkend="submit-bug"/> 回報錯誤。倘若本文件不能夠回答您所有的疑問，那麼請將這些問題發表在 debian-boot 的通信論壇(&email-debian-boot-list;)，或者您也可以在 IRC (即 freenode 網站的 #debian-boot 頻道)上直接提問。

source: Booting the installer
el: Ξεκινώντας τον Εγκαταστάτη
pt: Iniciar o instalador
ru: Загрузка программы установки
zh_cn: 安装套件的引导
zh_tw: 啟動安裝程式

source: <phrase condition="unofficial-build"> For some quick links to CD images, check out the <ulink url="&url-d-i;"> &d-i; home page</ulink>. </phrase> The debian-cd team provides builds of CD images using &d-i; on the <ulink url="&url-debian-cd;">Debian CD page</ulink>. For more information on where to get CDs, see <xref linkend="official-cdrom"/>.
el: <phrase condition="unofficial-build"> Για μερικούς συνδέσμους σε είδωλα CD, ελέγξτε την <ulink url="&url-d-i;">ιστοσελίδα του &d-i;</ulink>. </phrase> Η ομάδα debian-cd παρέχει είδωλα CD που χρησιμοποιούν τον &d-i; στην<ulink url="&url-debian-cd;">ιστοσελίδα Debian CD</ulink>. Για περισσότερες πληροφορίες σχετικά με την απόκτηση CD, δείτε το <xref linkend="official-cdrom" />.
pt: <phrase condition="unofficial-build"> Para um rápido acesso às imagens de CD, visite a <ulink url="&url-d-i;"> página inicial do &d-i;</ulink>. </phrase> A equipa do cd-debian fornece configurações das imagens de CD utilizando &d-i; na <ulink url="&url-debian-cd;">página Debian GNU/Linux em CDs</ulink>. Para mais informações em onde adquirir CDs, visite a <xref linkend="official-cdrom"/>.
ru: <phrase condition="unofficial-build"> Несколько ссылок на CD-образы есть на <ulink url="&url-d-i;">домашней странице &d-i;</ulink>. </phrase> CD-образы с &d-i;, подготовленные командой debian-cd можно найти на <ulink url="&url-debian-cd;">странице Debian CD</ulink>. Более подробно об этом написано в <xref linkend="official-cdrom"/>.
zh_cn: <phrase condition="unofficial-build"> 要想找到几个便捷的 CD 映像文件的链接，请看 <ulink url="&url-d-i;"> &d-i; 的主页</ulink>。</phrase> Debian-cd 小组在 <ulink url="&url-debian-cd;">Debian CD 页</ulink>上提供了使用 &d-i; CD 映像的已编译版本。如果您需要了解有关如何得到这些 CD 的更多信息，请看 <xref linkend="official-cdrom"/>。
zh_tw: <phrase condition="unofficial-build"> 在<ulink url="&url-d-i;"> &d-i; 的首頁</ulink>，你可看到幾個光碟映像檔的快速連結。</phrase> Debian-cd 小組在 <ulink url="&url-debian-cd;">Debian CD 網頁</ulink>中提供了使用 &d-i; 光碟映像檔的編譯版本。如果您需要關於取得這些光碟的資訊，請看<xref linkend="official-cdrom"/>。

source: Some installation methods require other images than CD images. <phrase condition="unofficial-build"> The <ulink url="&url-d-i;">&d-i; home page</ulink> has links to other images. </phrase> <xref linkend="where-files"/> explains how to find images on Debian mirrors.
el: Μερικές μέθοδοι εγκατάστασης απαιτούν άλλου είδους είδωλα, και όχι είδωλα CD. <phrase condition="unofficial-build"> Η <ulink url="&url-d-i;">ιστοσελίδα του &d-i;</ulink> έχει συνδέσμους σε τέτοια είδωλα.</phrase> Το <xref linkend="where-files" /> εξηγεί πως να βρείτε είδωλα σε αντικατοπτρισμούς Debian.
pt: Alguns métodos de instalação requerem outras imagens para além das de CD. <phrase condition="unofficial-build">A <ulink url="&url-d-i;">página inicial &d-i;</ulink> tem hiperligações para outras imagens.</phrase> A <xref linkend="where-files"/> explica como encontrar imagens nos Debian mirrors.
ru: Для некоторых методов установки требуются дополнительные образы помимо CD-образа. <phrase condition="unofficial-build"> На <ulink url="&url-d-i;">домашней странице &d-i;</ulink> находятся ссылки на такие образы.</phrase> В <xref linkend="where-files"/> описано, как их найти на зеркальных серверах Debian.
zh_cn: 有些安装方法需要其它种类的映像而非 CD 的映像。<phrase condition="unofficial-build"> <ulink url="&url-d-i;">&d-i; 的主页</ulink> 上有到其它种类的映像的链接。</phrase> <xref linkend="where-files"/> 会告诉您如何在 Debian 的映像站点找到那些映像文件。
zh_tw: 有些安裝方式需要其它種類的映像而非光碟映像檔。<phrase condition="unofficial-build"> <ulink url="&url-d-i;">&d-i; 的網頁</ulink> 上有其它映像檔的連結。</phrase> <xref linkend="where-files"/> 會告訴您如何在 Debian 的映像網站找到映像檔。

source: The subsections below will give the details about which images you should get for each possible means of installation.
el: Τα ακόλουθα τμήματα περιέχουν λεπτομέρειες σχετικά με τα είδωλα που χρειάζονται για κάθε είδος εγκατάστασης.
pt: As subsecções abaixo irão dar os detalhes sobre qual das imagens deverá utilizar para cada possível meio de instalação.
ru: В следующих подразделах указано, какие образы требуются для каждого конкретного вида установки.
zh_cn: 下面小节会就每种可能的安装方法，具体讲授如何获得所需的映像文件。
zh_tw: 下一節我們就各種可能的安裝方法，仔細解釋如何取得所需的映像檔。

source: CDROM
ru: Загрузка с CDROM
zh_tw: 光碟

source: There are two different netinst CD images which can be used to install &releasename; with the &d-i;. These images are intended to boot from CD and install additional packages over a network, hence the name 'netinst'. The difference between the two images is that on the full netinst image the base packages are included, whereas you have to download these from the web if you are using the business card image. If you'd rather, you can get a full size CD image which will not need the network to install. You only need the first CD of the set.
el: Υπάρχουν δύο διαφορετικά είδωλα netinst CD που μπορούν να χρησιμοποιηθούν για την εγκατάσταση του &releasename; με τον &d-i;. Αυτά τα είδωλα προορίζονται για εκκίνηση από συσκευή CD και εγκατάσταση των υπόλοιπων πακέτων μέσω δικτύου, εξ' ου και το όνομα 'netinst' (συντ. 'Δικτυακή Εγκατάσταση'). Η διαφορά μεταξύ των δύο ειδώλων είναι ότι στο πλήρες είδωλο netinst συμπεριλαμβάνονται τα βασικά πακέτα, ενώ στο είδωλο business card χρειάζεται να ληφθούν αυτά τα πακέτα από τον ιστό. Μια άλλη δυνατότητα,είναι η απόκτηση ενός πλήρους μεγέθους ειδώλου CD που δεν χρειάζεται δίκτυο για εγκατάσταση. Μόνο το πρώτο CD από το σετ είναι απαραίτητο.
pt: Existem duas imagens de CD para 'netinst' diferentes que podem ser utilizadas para instalar &releasename; com &d-i;. Estas imagens servem para iniciar a partir de CD e instalar pacotes adicionais a partir da rede, daí o nome 'netinst'. A diferença entre as duas imagens é que na imagem completa 'netinst' são incluídos os pacotes base, e na imagem business card tem de fazer download destes. Se preferir, pode adquirir uma imagem completa do CD que não precisará de rede para a instalação. Irá precisar apenas do primeiro CD do conjunto de CDs.
ru: Существуют два различных CD-netinst-образа для установки &releasename; с помощью &d-i;. Эти образы предназначены для загрузки с CD и установки дополнительных пакетов по сети, отсюда и название 'netinst'. Разница между ними в том, что полный netinst-образ включает базовые пакеты, а с business card их придётся загружать через сеть. При желании можно воспользоваться полным CD-образом, который не требует наличия сети для установки. Для этого достаточно первого диска из набора.
zh_cn: 现在有两种不同的 netinst CD 映像可以用来通过 &d-i; 安装 &releasename;。这些映像文件是被用来刻成光盘的。然后让电脑从光盘启动，再由安装程序从网络上下载安装其它的软件包。“netinst”的名字由此得来。两种映像的区别在于，在完整版的 netinst 映像上包含了基本的软件包，而使用名片版的映像安装则需要从网络上下载它们。如果喜欢的话，您可以下载一个标准大小的 CD 映像文件，用它的话就可以不借助网络安装了。这只需要一套光盘中的第一张就行了。
zh_tw: 現在有兩種不同的 netinst 光碟映像可以用 &d-i; 安裝 &releasename;。這些映像檔是為了讓電腦透過光碟機開機，再透過網路上下載安裝額外的軟體套件，'netinst' 的名字由此得來。兩種映像檔的不同在於完整版的 netinst 映像檔包含了基本的軟件套件，而名片版映像的安裝方式則需要透過網路下載套件。如果喜歡的話，您可以下載完整映像檔，就可以不需透過網路安裝，你只需要一套光碟中的第一片就行了。

source: Download whichever type you prefer and burn it to a CD. <phrase arch="i386">To boot the CD, you may need to change your BIOS configuration, as explained in <xref linkend="bios-setup"/>.</phrase> <phrase arch="powerpc"> To boot a PowerMac from CD, press the <keycap>c</keycap> key while booting. See <xref linkend="boot-cd"/> for other ways to boot from CD. </phrase>
el: Μεταφορτώστε τον τύπο ειδώλου που προτιμάτε και κάψτε το σε ένα άδειο CD. <phrase arch="i386">Για να εκκινήσετε από CD, ίσως χρειαστεί να αλλάξετε τη ρύθμιση του BIOS, όπως εξηγείται στο <xref linkend="bios-setup" />.</phrase> <phrase arch="powerpc"> Για να εκκινήσετε ένα PowerMac από CD, πατήστε το πλήκτρο <keycap>c</keycap> κατά τη διάρκεια εκκίνησης του υπολογιστή. Δείτε το <xref linkend="boot-cd" /> για εναλλακτικούς τρόπους εκκίνησης από CD.</phrase>
pt: Efectue o download de qualquer tipo que preferir e grave para um CD. <phrase arch="i386">Para iniciar a partir de CD, precisará de alterar a configuração da BIOS, como é explicado na <xref linkend="bios-setup"/>.</phrase> <phrase arch="powerpc"> Para iniciar um PowerMac a partir de CD, pressione a tecla <keycap>c</keycap> enquanto o sistema inicia. Visite <xref linkend="boot-cd"/> para outras formas de iniciar a partir de CD. </phrase>
ru: Загрузите любой понравившийся вам тип образа и запишите его на CD. <phrase arch="i386"> Чтобы загрузиться с CD, вам может понадобиться изменить конфигурацию BIOS. <xref linkend="bios-setup"/> описывает, как это сделать.</phrase><phrase arch="powerpc"> Для загрузки с CD на PowerMac, нажмите клавишу <keycap>c</keycap> во время загрузки. <xref linkend="boot-cd"/> описывает другие пути загрузки с CD. </phrase>
zh_cn: 您想用哪种办法装，就下载相应的映像文件，再把它刻成光盘。<phrase arch="i386">若要从光盘启动，您可能需要根据 <xref linkend="bios-setup"/> 的提示，修改 BIOS 设置。</phrase> <phrase arch="powerpc"> 若要从光盘启动您的 PowerMac，可以在它启动时摁着 <keycap>c</keycap> 键不放。参阅 <xref linkend="boot-cd"/> 可以获知其它从 CD 启动的方法。</phrase>
zh_tw: 您想用哪種辦法安裝，就下載相對應的映像檔，再燒成光碟。<phrase arch="i386"> 若要利用光碟進行開機動作，得先修改 BIOS 設定，方法參照 <xref linkend="bios-setup"/>。</phrase> <phrase arch="powerpc"> 若要利用光碟啟動 PowerMac ，在開機時按著 <keycap>c</keycap> 鍵不放。其他使用光碟開機的方法請參閱 <xref linkend="boot-cd"/>。</phrase>

source: Floppy
el: Δισκέττα (floppy)
pt: Disquete
ru: Загрузка с дискет
zh_cn: 软盘
zh_tw: 軟碟

source: If you can't boot from CD, you can download floppy images to install Debian. You need the <filename>floppy/boot.img</filename>, the <filename>floppy/root.img</filename> and possibly one of the driver disks.
el: Αν δεν είναι δυνατή η εκκίνηση από CD, μπορείτε να μεταφορτώσετε είδωλα δισκέττας για την εγκατάσταση του Debian. Χρειάζεστε το αρχείο <filename>floppy/boot.img</filename>, το <filename>floppy/root.img</filename> και πιθανόν ένα από τα είδωλα με τους οδηγούς (drivers).
pt: Se não consegue iniciar de CD, poderá efectuar o download das imagens de disquete para instalar o Debian. Vai precisar de <filename>floppy/boot.img</filename>, de <filename>floppy/root.img</filename> e possivelmente um dos discos de drivers.
ru: Если вы не можете загрузиться с CD, то можно загрузить образы дискет для установки Debian . Вам потребуется файлы <filename>floppy/boot.img</filename> и <filename>floppy/root.img</filename>, а также, возможно, один из дисков с драйверами.
zh_cn: 如果您无法从 CD 启动，不妨下载一些软盘的映像文件，用它们来安装 Debian。这时，您需要 <filename>floppy/boot.img</filename> 和 <filename>floppy/root.img</filename>，也许还要那些驱动盘中的某一张。
zh_tw: 如果您無法利用光碟進行開機動作，不妨下載一些軟碟的映像檔，用它們來安裝 Debian，包括 <filename>floppy/boot.img</filename> 、 <filename>floppy/root.img</filename>，也許還需要某張驅動程式磁片。

source: The boot floppy is the one with <filename>boot.img</filename> on it. This floppy, when booted, will prompt you to insert a second floppy &mdash; use the one with <filename>root.img</filename> on it.
el: Η δισκέττα εκκίνησης είναι η <filename>boot.img</filename>. Η δισκέττα αυτή, κατά την εκκίνηση, θα σας προτρέψει να εισάγετε μια δεύτερη δισκέττα &mdash; χρησιμοποιείστε τη δισκέττα <filename>root.img</filename>.
pt: A disquete de arranque é a que tem <filename>boot.img</filename>. Quando iniciar com esta disquete, ser-lhe-á dada a indicação para inserir a segunda disquete &mdash; utilize a que tem <filename>root.img</filename>.
ru: Образ загрузочной дискеты находится в файле <filename>boot.img</filename>. При загрузке с неё появится просьба вставить вторую дискету &mdash; вставьте ту, на которую записан <filename>root.img</filename>.
zh_cn: 启动软盘就是其上存有 <filename>boot.img</filename> 的一张软盘。当使用这张盘启动时，它会提示您插入第二张软盘 &mdash;，这时请使用里面存有 <filename>root.img</filename> 的那张盘。
zh_tw: 開機磁片指的是存有 <filename>boot.img</filename> 的那張。當使用這張磁片啟動時，它會提示您插入第二張磁片 &mdash;，這時插入存有 <filename>root.img</filename> 的那張磁片。

source: If you're planning to install over the network, you will usually need the <filename>floppy/net-drivers.img</filename>, which contains additional drivers for many ethernet cards, and support for PCMCIA.
el: Αν σχεδιάζετε να εγκαταστήσετε μέσω δικτύου, είναι πιθανό να χρειαστείτε το είδωλο <filename>floppy/net-drivers.img</filename>, που περιέχει επιπλέον οδηγούς για πολλές κάρτες δικτύου ethernet, καθώς και υποστήριξη για PCMCIA.
pt: Se planeia fazer a instalação através da rede, precisará de <filename>floppy/net-drivers.img</filename>, que tem os drivers adicionais para muitas placas de rede, e suporte para PCMCIA.
ru: При установки по сети обычно нужен файл <filename>floppy/net-drivers.img</filename>, который содержит дополнительные драйверы многих Ethernet-карт и поддержку PCMCIA.
zh_cn: 倘若您计划从网络安装，一般来说，您就要准备好 <filename>floppy/net-drivers.img</filename>，这里面包含了许多种以太网卡的驱动程序，同时它还加入了对 PCMCIA 的支持。
zh_tw: 倘若透過網路安裝，我們需要 <filename>floppy/net-drivers.img</filename>，裡面包含許多種乙太網卡的驅動程式，並支援 PCMCIA 。

source: If you have a CD, but cannot boot from it, then boot from floppies and use <filename>floppy/cd-drivers.img</filename> on a driver disk to complete the install using the CD.
el: Αν διαθέτετε ένα CD, αλλά δεν μπορείτε να εκκινήσετε με αυτό, τότε εκκινήστε με δισκέττες και χρησιμοποιήστε το είδωλο <filename>floppy/cd-drivers.img</filename> για να ολοκληρώσετε την εγκατάσταση χρησιμοποιώντας το CD.
pt: Se tem o CD, mas não consegue iniciar a partir dele, então inicie a partir de disquetes e utilize <filename>floppy/cd-drivers.img</filename> num disco de drivers para completar a instalação utilizando o CD.
ru: При наличии CD, с которого не получается загрузиться, загрузитесь с дискет и воспользуйтесь диском с драйверами <filename>floppy/cd-drivers.img</filename> для использования CD при установке.
zh_cn: 假如您有光驱，但是不能从它启动，那么您可以从软驱启动，再用存在驱动盘里的 <filename>floppy/cd-drivers.img</filename> 来接着完成基于光盘的安装。
zh_tw: 假如您有光碟，但無法利用它啟動，那麼您可以透過磁片啟動，再用存在驅動磁片裡的<filename>floppy/cd-drivers.img</filename> 接著完成透過光碟的安裝。

source: Floppy disks are one of the least reliable media around, so be prepared for lots of bad disks (see <xref linkend="unreliable-floppies"/>). Each <filename>.img</filename> file you downloaded goes on a single floppy; you can use the dd command to write it to /dev/fd0 or some other means (see <xref linkend="create-floppy"/> for details). Since you'll have more than one floppy, it's a good idea to label them.
el: Οι δισκέττες είναι από τα λιγότερο αξιόπιστα αφαιρούμενα μέσα, για αυτό ετοιμαστείτε για πολλά ελαττωματικά δισκάκια (βλ. <xref linkend="unreliable-floppies" />). Κάθε αρχείο <filename>.img</filename> που μεταφορτώσατε, αντιστοιχεί σε μία δισκέττα. Μπορείτε να χρησιμοποιήσετε την εντολή dd για να το γράψετε στο /dev/fd0 ή κάποιο άλλο μέσο (βλ. <xref linkend="create-floppy" /> για λεπτομέρειες). Επειδή θα έχετε περισσότερες από μία δισκέττες, είναι καλή ιδέα να τους βάλετε ετικέτες.
pt: As disquetes são um dos meios de menos confiança existentes, prepare-se portanto para muitas más imagens de disquete (visite a <xref linkend="unreliable-floppies"/>). Cada ficheiro <filename>.img</filename> para download cabe numa única disquete; poderá utilizar o comando dd para escrever para /dev/fd0 ou alguns outros meios (visite a <xref linkend="create-floppy"/> para detalhes). Dado que irá ficar com mais que uma disquete, é uma boa ideia etiqueta-las.
ru: Дискеты &mdash; одни из самых ненадёжных носителей, поэтому не удивляйтесь плохим дискетам (смотрите <xref linkend="unreliable-floppies"/>). Каждый загруженный файл<filename>.img</filename> имеет размер одной дискеты; можно воспользоваться командой dd для записи его на /dev/fd0 или на подобное устройство (подробней смотрите <xref linkend="create-floppy"/>). Так как вам понадобится более одной дискеты, то было бы неплохо их пометить.
zh_cn: 软盘是最不可靠的存储介质之一，因此您最好有碰到许多坏盘的准备(请参看 <xref linkend="unreliable-floppies"/>)。您所下载的每个 <filename>.img</filename> 文件其实就是一张软盘。您可以用 dd 命令把它写到 /dev/fd0，也可以用其他方法来做这件事(具体细节请参看 <xref linkend="create-floppy"/> )。既然您将会弄出好几张软盘，不妨给它们做上标签吧。
zh_tw: 磁片是最不可靠的儲存方式之一，因此您最好有碰到許多壞片的準備(請參看 <xref linkend="unreliable-floppies"/>)。您所下載的每個 <filename>.img</filename> 檔其實就是一張磁片。您可以用 dd 命令把它寫到 /dev/fd0 ，或是其他方法(細節請參看 <xref linkend="create-floppy"/> )。記得為這些磁片依序編號。

source: USB memory stick
ru: Загрузка с карты памяти USB
zh_cn: U 盘
zh_tw: USB 隨身碟

source: It's also possible to install from removable USB storage devices. For example a USB keychain can make a handy Debian install medium that you can take with you anywhere.
el: Η εγκατάσταση από αφαιρούμενη συσκευή αποθήκευσης USB είναι επίσης εφικτή.Για παράδειγμα, μια αλυσιδίτσα με ένα USB stick μπορεί να αποτελέσει ένα εύχρηστο μέσο εγκατάστασης Debian, που μπορεί να σας συνοδεύει παντού.
pt: É também possível instalar a partir de um dispositivo amovível USB. Um porta-chaves USB, por exemplo, pode dar para uma meio de instalação de Debian que poderá transportar para todo lado.
ru: Установка со съёмных USB устройств хранения также возможна. Например, из USB-брелка можно сделать удобный носитель установки Debian, который можно взять с собой куда угодно.
zh_cn: 我们也可以从移动 USB 存储设备来安装系统。比如说您带着一个 USB 的钥匙链走遍天涯海角的同时，它还可以成为方便称手的 Debian 安装介质。
zh_tw: 我們也可以透過 USB 隨身碟來安裝套件。無論到哪你都可帶著 USB 隨身碟，這是一個相當方便的 Debian 安裝工具。
