Repository: xobs/debian-installer
Catalog: doc/manual/po/*/install-methods.po
Languages: el, ko, pt, ru, zh_cn, zh_tw

source: For PXE booting, everything you should need is set up in the <filename>netboot/netboot.tar.gz</filename> tarball. Simply extract this tarball into the <command>tftpd</command> boot image directory. Make sure your dhcp server is configured to pass <filename>/pxelinux.0</filename> to <command>tftpd</command> as the filename to boot.
el: Για εκκίνηση με τη μέθοδο PXE, ό,τι χρειάζεστε βρίσκεται στο συμπιεσμένο αρχείο <filename>netboot/netboot.tar.gz</filename>. Απλά αποσυμπιέστε το αρχείο στον κατάλογο του ειδώλου εκκίνησης του <command>tftpd</command>. Βεβαιωθείτε ότι ο εξυπηρετητής dhcp έχει ρυθμιστεί να περάσει το <filename>/pxelinux.0</filename> στον δαίμονα <command>tftpd</command> σαν το όνομα του αρχείου για εκκίνηση.
ko: PXE 부팅의 경우, 필요한 모든 것이 <filename>netboot/netboot.tar.gz</filename> 압축 안에 준비되어 있습니다. 이 압축을 <command>tftpd</command> 부팅 이미지 디렉토리에서 풀기만 하십시오. <command>tftpd</command>에 부팅할 파일 이름으로 <filename>/pxelinux.0</filename>을 넘기도록 DHCP 서버에 설정하십시오.
pt: Para um arranque PXE, tudo o que deve precisar configurar está no tarball <filename>netboot/netboot.tar.gz</filename>. Apenas extraia este tarball para o directório da imagem de arranque <command>tftpd</command>. Certifique-se que o servidor dhcp está configurado para passar <filename>/pxelinux.0</filename> ao <command>tftpd</command> como o nome do ficheiro para arrancar.
ru: Для загрузки через PXE всё что нужно лежит в файле <filename>netboot/netboot.tar.gz</filename>. Просто распакуйте этот файл в каталог загрузочных образов <command>tftpd</command>. Убедитесь, что dhcp сервер передаёт <filename>/pxelinux.0</filename> <command>tftpd</command> в качестве имени загружаемого файла.
zh_cn: 对于用 PXE 引导来说，您所需的只是设置 <filename>netboot/netboot.tar.gz</filename> 压缩包。简单地将此包解压到 <command>tftpd</command> 引导映像目录下。并确保您的 DHCP 服务器的配置将会把 <filename>/pxelinux.0</filename> 以启动所需的文件名传递至<command>tftpd</command>。
zh_tw: 對於用 PXE 開機來說，您所需的只是設定 <filename>netboot/netboot.tar.gz</filename> 壓縮檔案。簡單地將此包解壓縮到 <command>tftpd</command> 開機映像目錄下。並確保您的 DHCP 伺服器的設定會把 <filename>/pxelinux.0</filename> 以開機所需的檔案名傳遞至 <command>tftpd</command>。

source: For PXE booting, everything you should need is set up in the <filename>netboot/netboot.tar.gz</filename> tarball. Simply extract this tarball into the <command>tftpd</command> boot image directory. Make sure your dhcp server is configured to pass <filename>/debian-installer/ia64/elilo.efi</filename> to <command>tftpd</command> as the filename to boot.
el: Για εκκίνηση με τη μέθοδο PXE, ό,τι χρειάζεστε βρίσκεται στο συμπιεσμένο αρχείο <filename>netboot/netboot.tar.gz</filename>. Απλά αποσυμπιέστε το αρχείο στον κατάλογο του ειδώλου εκκίνησης του <command>tftpd</command>. Βεβαιωθείτε ότι ο εξυπηρετητής dhcp είναι ρυθμισμένος να περνά το <filename>/debian-installer/ia64/elilo.efi</filename> στον <command>tftpd</command> σαν το όνομα του αρχείου εκκίνησης.
ko: PXE 부팅의 경우, 필요한 모든 것이 <filename>netboot/netboot.tar.gz</filename> 압축 안에 준비되어 있습니다. 이 압축을 <command>tftpd</command> 부팅 이미지 디렉토리에서 풀기만 하십시오. <command>tftpd</command>에 부팅할 파일 이름으로 <filename>/debian-installer/ia64/elilo.efi</filename>을 넘기도록 DHCP 서버에 설정하십시오.
pt: Para um arranque PXE, tudo o que deve precisar configurar está no tarball <filename>netboot/netboot.tar.gz</filename>. Apenas extraia este tarball para o directório da imagem de arranque <command>tftpd</command>. Certifique-se que o servidor dhcp está configurado para passar <filename>/debian-installer/ia64/elilo.efi</filename> ao <command>tftpd</command> como o nome do ficheiro para arrancar.
ru: Для загрузки через PXE, всё что нужно лежит в файле <filename>netboot/netboot.tar.gz</filename>. Просто распакуйте этот файл в каталог загрузочных образов <command>tftpd</command>. Убедитесь, что dhcp сервер передаёт <filename>/debian-installer/ia64/elilo.efi</filename> <command>tftpd</command> в качестве имени загружаемого файла.
zh_cn: 对于用 PXE 引导来说，您所需的只是设置 <filename>netboot/netboot.tar.gz</filename> 压缩包。简单地将此包解压到 <command>tftpd</command> 引导映像目录下。并确保您的 DHCP 服务器配置将会把 <filename>/debian-installer/ia64/elilo.efi</filename> 以启动所需的文件名传递至<command>tftpd</command>。
zh_tw: 對於用 PXE 開機來說，您所需的只是設定 <filename>netboot/netboot.tar.gz</filename> 壓縮檔案。簡單地將此包解壓縮到 <command>tftpd</command> 開機映像目錄下。 並確保您的 DHCP 伺服器設定會把 <filename>/debian-installer/ia64/elilo.efi</filename> 以開機所需的檔案名傳遞至<command>tftpd</command>。

source: DECstation TFTP Images
el: Είδωλα TFTP για DECstation
ko: DECstation TFTP 이미지
pt: Imagens TFTP DECstation
ru: TFTP образы для DECstation
zh_cn: DECstation TFTP 映像文件
zh_tw: DECstation TFTP 映像檔

source: For DECstations, there are tftpimage files for each subarchitecture, which contain both kernel and installer in one file. The naming convention is <replaceable>subarchitecture</replaceable>/netboot-boot.img. Copy the tftpimage file you would like to use to <userinput>/tftpboot/tftpboot.img</userinput> if you work with the example BOOTP/DHCP setups described above.
el: Για μηχανήματα DECstation, υπάρχουν αρχεία tftpimage για κάθε υποαρχιτεκτονική, που περιέχουν τόσο τον πυρήνα όσο και τον εγκαταστάτη σε ένα αρχείο. Η σύμβαση όσο αφορά την ονομασία είναι: <replaceable>subarchitecture</replaceable>/netboot-boot.img. Αντιγράψτε το αρχείο tftpimage που θα θέλατε να χρησιμοποιήσετε σαν <userinput>/tftpboot/tftpboot.img</userinput> αν δουλεύετε με τα παραδείγματα ρυθμίσεων για BOOTP/DHCP που περιγράψαμε παραπάνω.
ko: DECstations에서는, 각 서브 아키텍쳐마다 TFTP 이미지 파일이 있습니다. 각 이미지 파일에는 커널과 설치 프로그램이 한 파일에 들어 있습니다. 그 이름은 <replaceable>서브아키텍쳐</replaceable>/netboot-boot.img 식으로 되어 있습니다. 위에서 설명한 BOOTP/DHCP 설정대로 하시려면, 사용하려는 TFTP 이미지 파일을 <userinput>/tftpboot/tftpboot.img</userinput> 파일로 복사하십시오.
pt: Para DECstations, existem ficheiros tftpimage para cada sub-arquitectura, que contém ambos o kernel e o instalador num só ficheiro. A convenção do nome é <replaceable>subarchitecture</replaceable>/netboot-boot.img. Copie o ficheiro tftpimage que quer utilizar para <userinput>/tftpboot/tftpboot.img</userinput>, se trabalhar com o exemplo de configurações BOOTP/DHCP descritas acima.
ru: Для DECstation, для каждой субархитектуры существует свой файл tftpimage, который содержит ядро и программу установки. Правило именования:<replaceable>субархитектура</replaceable>/netboot-boot.img. Скопируйте файла tftpimage, который нужно использовать в <userinput>/tftpboot/tftpboot.img</userinput>, если вы работаете с настройками BOOTP/DHCP, как примере, приведённом выше.
zh_cn: 对于 DECstation 来说，对于每个子体系都有相应的 tftpimage 映像文件。这些单一文件包含了内核和安装程序。命名规则是 <replaceable>subarchitecture</replaceable>/netboot-boot.img。如果您是按照上述 BOOTP/DHCP 设置范例进行操作，请将想要使用的 tftpimage 文件拷贝至 <userinput>/tftpboot/tftpboot.img</userinput>。
zh_tw: 對於 DECstation 來說，對於每個子架構都有相應的 tftpimage 映像檔。這些單一檔案包含了核心和安裝程式。命名規則是 <replaceable>subarchitecture</replaceable>/netboot-boot.img。如果您是按照上述 BOOTP/DHCP 設定範例進行操作，請將想要使用的 tftpimage 檔案拷貝至 <userinput>/tftpboot/tftpboot.img</userinput>。

source: The DECstation firmware boots by TFTP with the command <userinput>boot <replaceable>#</replaceable>/tftp</userinput>, where <replaceable>#</replaceable> is the number of the TurboChannel device from which to boot. On most DECstations this is <quote>3</quote>. If the BOOTP/DHCP server does not supply the filename or you need to pass additional parameters, they can optionally be appended with the following syntax:
el: Το firmware για DECstation εκκινείται από το TFTP με την εντολή <userinput>boot <replaceable>#</replaceable>/tftp</userinput>, όπου <replaceable>#</replaceable> είναι ο αριθμός της συσκευής TurboChannel από την οποία θα εκκινήσουμε. Στα περισσότερα συστήματα DECstation αυτός ο αριθμός είναι <quote>3</quote>. Αν ο server BOOTP/DHCP δεν παρέχει το όνομα του αρχείου ή θα πρέπει εσείς να δώσετε επιπρόσθετα ορίσματα, αυτά μπορούν να δοθούν επιλεκτικά με την ακόλουθη σύνταξη:
ko: DECstation 펌웨어는 TFTP에서 <userinput>boot <replaceable>#</replaceable>/tftp</userinput> 명령으로 부팅합니다. 여기서 <replaceable>#</replaceable>은 부팅하려는 TurboChannel 장치의 번호입니다. 대부분의 DECstation에서 이 번호는 <quote>3</quote>입니다. BOOTP/DHCP 서버에서 파일 이름이 넘겨주지 않거나 파라미터를 추가로 더 넘겨야 한다면, 파라미터를 다음 문법에 따라 추가할 수 있습니다:
pt: O firmware DECstation arranca por TFTP com o comando <userinput>boot <replaceable>#</replaceable>/tftp</userinput>, onde <replaceable>#</replaceable> é o número do dispositivo TurboChannel do qual vai iniciar. Na maioria das DECstation é <quote>3</quote>. Se servidor BOOTP/DHCP não fornecer o nome do ficheiro ou necessitar de passar parâmetros adicionais, podem ser adicionados com a seguinte sintaxe:
ru: Микропрограмма DECstation производит загрузку с TFTP по команде <userinput>boot <replaceable>#</replaceable>/tftp</userinput>, где <replaceable>#</replaceable> это номер устройства TurboChannel с которого нужно загрузиться. На большинстве DECstation это номер <quote>3</quote>. Если сервер BOOTP/DHCP не передаёт имя файла или вам нужно передать дополнительные параметры, они могут быть добавлены с помощью в следующем виде:
zh_cn: DECstation 通过 <userinput>boot <replaceable>#</replaceable>/tftp</userinput> 命令来使用 TFTP 进行固件引导。这里 <replaceable>#</replaceable> 是用于引导的 TurboChannel 设备号。在大多数 DECstations 上，这个数字是<quote>3</quote>。如果 BOOTP/DHCP 服务器不提供文件名或者您需要传递附加的参数，他们可以按照如下语法加入：
zh_tw: DECstation 透過 <userinput>boot <replaceable>#</replaceable>/tftp</userinput> 指令來使用 TFTP 進行韌體開機。這裡 <replaceable>#</replaceable> 是用於開機的 TurboChannel 設備編號。在大多數 DECstations 上，這個數字是 <quote>3</quote>。 如果 BOOTP/DHCP 伺服器不提供檔案名或者您需要傳遞附加的參數，他們可以按照下列語法加入：

source: boot #/tftp/filename param1=value1 param2=value2 ...
ko: boot #/tftp/filename 파라미터1=값1 파라미터2=값2 ...

source: Several DECstation firmware revisions show a problem with regard to net booting: the transfer starts, but after some time it stops with an <computeroutput>a.out err</computeroutput>. This can have several reasons: <orderedlist> <listitem><para> The firmware does not respond to ARP requests during a TFTP transfer. This leads to an ARP timeout and the transfer stops. The solution is to add the MAC address of the Ethernet card in the DECstation statically to the ARP table of the TFTP server. This is done by running <userinput>arp -s <replaceable>IP-address</replaceable> <replaceable>MAC-address</replaceable></userinput> as root on the machine acting as TFTP server. The MAC-address of the DECstation can be read out by entering <command>cnfg</command> at the DECstation firmware prompt. </para></listitem> <listitem><para> The firmware has a size limit on the files that can be booted by TFTP. </para></listitem> </orderedlist> There are also firmware revisions that cannot boot via TFTP at all. An overview about the different firmware revisions can be found at the NetBSD web pages: <ulink url="http://www.netbsd.org/Ports/pmax/board-list.html#proms"></ulink>.
el: Αρκετές αναβαθμίσεις τέτοιων firmware φαίνεται να έχουν πρόβλημα σχετικά με τη δικτυακή εκκίνηση: η μεταφορά αρχίζει, αλλά μετά από λίγη ώρα σταματά με ένα σφάλμα <computeroutput>a.out err</computeroutput>. Αυτό μπορεί να έχει διάφορες αιτίες:<orderedlist><listitem><para> Το firmware δεν ανταποκρίνεται στις αιτήσεις ARP κατά τη διάρκεια μιας μεταφοράς με TFTP. Αυτό οδηγεί σε ένα ARP timeout και η μεταφορά σταματά. Η λύση γι' αυτό είναι να προσθέσουμε τη διεύθυνση MAC της κάρτας Ethernet στο σύστημα DECstation στατικά στον πίνακα ARP του server TFTP. Αυτό γίνεται τρέχοντας την εντολή <userinput>arp -s <replaceable>IP-address</replaceable> <replaceable>MAC-address</replaceable></userinput> σαν root στο μηχάνημα που λειτουργεί σαν server TFTP. H διεύθυνση MAC του DECstation μπορεί να τη δει κανείς εισάγοντας την εντολή <command>cnfg</command> στην προτροπή του firmware του DECstation.</para></listitem><listitem><para> Το firmware έχει ένα όριο μεγέθους για τα αρχεία που μπορούν να εκκινηθούν με TFTP.</para></listitem></orderedlist>Υπάρχουν ακόμα και εκδόσεις του firmware που δεν μπορούν να εκκινήσουν καθόλου μέσω TFTP. Μια επισκόπηση των διαφορετικών εκδόσεων firmware μπορούν να βρεθούν στις σελίδες του NetBSD: <ulink url="http://www.netbsd.org/Ports/pmax/board-list.html#proms"></ulink>.
ko: DECstation 펌웨어의 몇몇 버전에서는 네트워크 부팅과 관련해 문제가 나타납니다. 전송이 시작하지만 어느 정도 시간이 지나면 <computeroutput>a.out err</computeroutput>라고 나오면서 멈춥니다. 이 현상은 여러가지 이유가 있습니다: <orderedlist> <listitem><para> TFTP 전송중에 펌웨어가 ARP 요청에 응답하지 않습니다. 이렇게 되면 ARP 시간 초과가 발생해 전송이 끝납니다. 해결 방법은 TFTP 서버의 ARP 테이블에 DECstation에 달려 있는 이더넷 카드의 주소를 추가하는 것입니다. <userinput>arp -s <replaceable>IP주소</replaceable> <replaceable>MAC주소</replaceable></userinput> 명령을 TFTP 서버로 사용하는 기계에서 루트로 실행하십시오. DECstation의 MAC 주소는 DECstation의 펌웨어 프롬프트에서 <command>cnfg</command> 명령으로 알아 낼 수 있습니다. </para></listitem> <listitem><para> 펌웨어에 TFTP로 부팅할 수 있는 파일의 크기 제한이 있습니다. </para></listitem> </orderedlist> 아예 TFTP로 부팅할 수 없는 펌웨어 버전도 있습니다. 여러 가지 펌웨어 버전에 대한 개요는 NetBSD 웹 페이지에 있습니다: <ulink url="http://www.netbsd.org/Ports/pmax/board-list.html#proms"></ulink>
pt: Algumas revisões de firmware DECstation mostram um problema relacionado com o arranque a partir da rede: a transferência começa, mas após algum tempo ela pára com um <computeroutput>a.out err</computeroutput>. Isto pode derivar de várias razões: <orderedlist> <listitem><para> O firmware não responde a pedidos ARP durante a transferência TFTP. Isto leva a um timeout e a transferência pára. A solução é adicionar o MAC address da placa de Ethernet na DECstation estaticamente para a tabela ARP do servidor TFTP. Isto é feito executando <userinput>arp -s <replaceable>IP-address</replaceable> <replaceable>MAC-address</replaceable></userinput> como root na máquina que actua como servidor TFTP. O MAC-address da DECstation pode ser visto executando <command>cnfg</command> no prompt de DECstation firmware. </para></listitem> <listitem><para> O firmware tem um tamanho limite nos ficheiros que podem iniciar por TFTP. </para></listitem> </orderedlist> Existem também revisões de firmware que não podem ser iniciadas via TFPT. Uma visão geral sobre as diferentes revisões podem ser encontradas nas páginas web NetBSD: <ulink url="http://www.netbsd.org/Ports/pmax/board-list.html#proms"></ulink>.
ru: У некоторых версий микропрограмм DECstation обнаружились проблемы в отношении загрузке по сети: передача начинается, но через некоторое время останавливается с ошибкой<computeroutput>a.out err</computeroutput>. Это может происходить по следующим причинам: <orderedlist> <listitem><para> Микропрограмма не отвечает на ARP запрос во времяTFTP передачи. Это приводит ожиданию ARP и остановки передачи. Решением будет добавить MAC адрес Ethernet карты DECstation статически в ARP таблицу TFTP сервера. Это достигается командой<userinput>arp -s <replaceable>IP-адрес</replaceable> <replaceable>MAC-адрес</replaceable></userinput> от суперпользователя на машине, служащей TFTP сервером. MAC-адрес DECstation можно прочитать введя в приглашении микропрограммы DECstation <command>cnfg</command>. </para></listitem> <listitem><para> Микропрограмма имеет ограничение на размер файлов, которые можно загрузить черезy TFTP. </para></listitem> </orderedlist>Также, есть версии микропрограмм, которые совсем не могут производить загрузку поa TFTl.Описание различий версий микропрограмм можно найти на веб страницахe NetBSs: <ulink url="http://www.netbsd.org/Ports/pmax/board-list.html#proms"></ulink>.
zh_cn: 一些 DECstation 固件版本在网络引导中有一个问题：传输可以开始，但是过一段时间它就会停止并且产生一个 <computeroutput>a.out err</computeroutput>。这可能是由以下几个原因所造成的： <orderedlist> <listitem><para> 固件在一个 TFTP 传输中没有回应 ARP 请求，这导致一个 ARP 超时并且停止传输。解决方案是 将以太网卡的 MAC 地址静态加入到 TFTP 服务器的 ARP 表中。想要作到这点可以在 TFTP 服务器 上用 root 身份运行 <userinput>arp -s <replaceable>IP-address</replaceable> <replaceable>MAC-address</replaceable></userinput>。DECstation 的 MAC 地址能够通过在 DECstation 固件提示符下输入 <command>cnfg</command> 来获得。</para></listitem> <listitem><para> 固件对于这些更够通过 TFTP 引导的文件有一个尺寸限制。</para></listitem> </orderedlist> 有些固件版本根本不能通过 TFTP 引导。您可以在 NetBSD 网页上找到关于不同固件版本的综述： <ulink url="http://www.netbsd.org/Ports/pmax/board-list.html#proms"></ulink>。
zh_tw: 一些 DECstation 韌體版本在網路開機中有一個問題：傳輸可以開始，但是過一段時間它就會停止並且產生一個 <computeroutput>a.out err</computeroutput>。這可能是由以下幾個原因所造成的：<orderedlist> <listitem><para> 韌體在一個 TFTP 傳輸中沒有回應 ARP 請求，這導致一個 ARP 超時並且停止傳輸。解決方案是將以太網卡的 MAC 位址靜態加入到 TFTP 伺服器的 ARP 列表中。想要作到這點可以在 TFTP 伺服器上用 root 身份執行 <userinput>arp -s <replaceable>IP-address</replaceable> <replaceable>MAC-address</replaceable></userinput>。DECstation 的 MAC 位址能夠透過在 DECstation 韌體提示符號下輸入 <command>cnfg</command> 來取得。</para></listitem> <listitem><para> 韌體對於這些能透過 TFTP 開機的檔案有一個大小限制。</para></listitem> </orderedlist> 有些韌體版本根本不能透過 TFTP 開機。您可以在 NetBSD 網頁上找到關於不同韌體版本的概述：<ulink url="http://www.netbsd.org/Ports/pmax/board-list.html#proms"></ulink>。

source: Alpha TFTP Booting
el: Εκκίνηση με TFTP για Alpha
ko: Alpha TFTP 부팅
pt: Iniciar TFTP Alpha
ru: Загрузка Alpha по TFTP
zh_cn: Alpha TFTP 引导
zh_tw: Alpha TFTP 開機

source: On Alpha, you must specify the filename (as a relative path to the boot image directory) using the <userinput>-file</userinput> argument to the SRM <userinput>boot</userinput> command, or by setting the <userinput>BOOT_FILE</userinput> environment variable. Alternatively, the filename can be given via BOOTP (in ISC <command>dhcpd</command>, use the <userinput>filename</userinput> directive). Unlike Open Firmware, there is <emphasis>no default filename</emphasis> on SRM, so you <emphasis>must</emphasis> specify a filename by either one of these methods.
el: Στην αρχιτεκτονική Alpha, θα πρέπει να προσδιορίσετε το όνομα του αρχείου (σαν σχετική διαδρομή ως προς τον κατάλογο της εικόνας εκκίνησης) χρησιμοποιώντας το όρισμα <userinput>-file</userinput> στην εντολή του SRM <userinput>boot</userinput>, ή θέτοντας την μεταβλητή περιβάλλοντος <userinput>BOOT_FILE</userinput>. Εναλλακτικά, το όνομα αρχείου μπορεί να δοθεί μέσω BOOTP (στον δαίμονα ISC <command>dhcpd</command>, χρησιμοποιήστε το προστακτικό (directive) <userinput>filename</userinput>). Σε αντίθεση με το Open Firmware, δεν υπάρχει <emphasis>δεδομένο από πριν όνομα αρχείου</emphasis> στην SRM, οπότε <emphasis>πρέπει</emphasis> να προσδιορίσετε ένα τέτοιο όνομα με μια από τις δυο αυτές μεθόδους.
ko: Alpha에서는, SRM의 <userinput>boot</userinput> 명령에 <userinput>-file</userinput> 인자를 사용하거나, <userinput>BOOT_FILE</userinput> 환경 변수를 지정해 파일 이름을 지정해야 합니다. (부팅 이미지 디렉토리의 상대 경로) 아니면 다른 방법으로, BOOP를 통해 파일 이름을 넘겨줄 수 있습니다. (ISC <command>dhcpd</command>에서는 <userinput>filename</userinput>을 사용합니다) Open Firmware와는 달리, SRM에는 <emphasis>기본 파일 이름이 없습니다</emphasis>. 그래서 이러한 방법들 중의 하나를 이용해서 파일 이름을 <emphasis>지정해야 합니다</emphasis>.
pt: Em Alpha, deve especificar o nome do ficheiro (como caminho relativo à directoria de imagem de arranque) utilizando o argumento<userinput>-file</userinput> para o comando SRM <userinput>boot</userinput>, ou ajustando a variável de ambiente <userinput>BOOT_FILE</userinput>. Alternativamente, o nome do ficheiro pode ser dado via BOOTP (em ISC <command>dhcpd</command>, utilize a directiva <userinput>filename</userinput>). Ao contrário de Open Firmware, <emphasis>não há nome de ficheiro por omissão</emphasis> em SRM, <emphasis>tem de </emphasis> especificar o nome do ficheiro por um destes métodos.
ru: На Alpha, вы должны указать имя файла (относительно каталога загрузочных образов) с помощью аргумента <userinput>-file</userinput> команды SRM <userinput>boot</userinput>, или установив переменную среды <userinput>BOOT_FILE</userinput>. Или же, имя файла можно получить по BOOTP (в ISC <command>dhcpd</command>, используйте директиву <userinput>filename</userinput>). В отличие от Open Firmware, <emphasis>имя файла по умолчанию не задано</emphasis> в SRM, поэтому вы <emphasis>должны</emphasis> указать имя файла одним из этих методов.
zh_cn: 在 Alpha 上，您必须通过 <userinput>-file</userinput> 参数将文件名(与启动引导映像目录的相对路径形式)指定给 SRM 的<userinput>boot</userinput> 命令，或者设置 <userinput>BOOT_FILE</userinput> 环境变量。或者，也可以通过 BOOTP 给出文件名(在 ISC 的 <command>dhcpd</command> 中，使用 <userinput>filename</userinput> 指令)。与 Open Firmware 不同的是，这里的 SRM 中<emphasis>没有缺省文件名</emphasis>，因此您 <emphasis>必须</emphasis> 通过以上方法之一来指定一个文件名。
zh_tw: 在 Alpha 上，您必須透過 <userinput>-file</userinput> 參數將檔案名 (與開機映像目錄的相對路徑) 指定給 SRM 的 <userinput>boot</userinput> 指令，或者設定 <userinput>BOOT_FILE</userinput> 環境變數。或者，也可以透過 BOOTP 提供檔案名稱 (在 ISC 的 <command>dhcpd</command> 中，使用 <userinput>filename</userinput> 指令)。與 Open Firmware 不同的是，這裡的 SRM <emphasis>沒有預設檔案名稱</emphasis>，因此您<emphasis>必須</emphasis>透過以上方法之一來指定一個檔案名稱。

source: SPARC TFTP Booting
el: Εκκίνηση με TFTP για SPARC
ko: SPARC TFTP 부팅
pt: Iniciar SPARC TFTP
ru: Загрузка SPARC по TFTP
zh_cn: SPARC TFTP 引导
zh_tw: SPARC TFTP 開機
