Repository: xobs/debian-installer
Catalog: doc/manual/po/*/install-methods.po
Languages: el, ko, pt, ru, zh_cn, zh_tw

source: Unfortunately, these <command>MILO</command> images could not be tested and might not work for all subarchitectures. If you find it doesn't work for you, try copying the appropriate <command>MILO</command> binary onto the floppy (<ulink url="&disturlftp;main/disks-alpha/current/MILO/"></ulink>). Note that those <command>MILO</command>s don't support ext2 <quote>sparse superblocks</quote>, so you can't use them to load kernels from newly generated ext2 file systems. As a workaround, you can put your kernel onto the FAT partition next to the <command>MILO</command>.
el: Δυστυχώς, τα είδωλα αυτά <command>MILO</command> δεν μπόρεσαν να δοκιμαστούν και πιθανόν να μην δουλεύουν για όλες τις υποαρχιτεκτονικές. Αν βρείτε ότι δεν δουλεύουν για σας, προσπαθήστε αντιγράφοντας το κατάλληλο εκτελέσιμο <command>MILO</command> στη δισκέττα (<ulink url="&disturlftp;main/disks-alpha/current/MILO/"></ulink>). Σημειώστε ότι αυτά τα εκτελέσιμα <command>MILO</command> δεν υποστηρίζουν <quote>sparse superblocks</quote> για το σύστημα αρχείων ext2 , κατά συνέπεια δεν μπορείτε να τις χρησιμοποιήσετε για το φόρτωμα πυρήνων από πρόσφατα δημιουργημένα τέτοια συστήματα αρχείων. Σαν μια πρόχειρη λύση μπορείτε να βάλετε τον πυρήνα στο τμήμα FAT δίπλα στο <command>MILO</command>.
ko: 불행히도 이 <command>MILO</command> 이미지는 테스트를 할 수 없었고 동작하지 않는 서브 아키텍쳐가 있을 수도 있습니다. 이미지가 동작하지 않으면 해당 <command>MILO</command> 바이너리를 플로피에 복사해 보십시오. (<ulink url="&disturlftp;main/disks-alpha/current/MILO/"></ulink>) 단 이 <command>MILO</command>는 ext2의 <quote>sparse superblocks</quote>를 지원하지 않기 때문에, 새로 만든 ext2 파일 시스템에서는 커널을 읽어들일 수 없습니다. 이 문제를 피해가려면, 커널을 <command>MILO</command> 바로 다음에 있는 FAT 파티션에 넣으면 됩니다.
pt: Infelizmente, estas imagens <command>MILO</command> podem não ter sido testadas e podem não funcionar em todas as sub-arquitecturas. Se descobrir que não funcionam para si, tente copiar o binário apropriado do <command>MILO</command> para a disquete (<ulink url="&disturlftp;main/disks-alpha/current/MILO/"></ulink>). Note que os <command>MILO</command>s não suportam ext2 <quote>sparse superblocks</quote>, não os poderá utilizar para carregar o Kernel a partir de um sistema de ficheiros ext2 recentemente gerado. Como alternativa, pode colocar o Kernel numa partição FAT ao lado do <command>MILO</command>.
ru: К сожалению, эти образы <command>MILO</command> не удалось протестировать и они могут не работать на всех субархитектурах. Если вы это обнаружите, попытайтесь скопировать соответствующий двоичный файл <command>MILO</command> на дискету (<ulink url="&disturlftp;main/disks-alpha/current/MILO/"></ulink>). Заметим, что эти <command>MILO</command> не поддерживают ext2 <quote>sparse superblocks</quote>, поэтому вы не сможете использовать их для загрузки ядер с только что созданной файловой системы ext2. В качестве обходного решения, вы можете положить ядро на FAT раздел после <command>MILO</command>.
zh_cn: 抱歉的是，这些 <command>MILO</command> 映像文件未经过足够的测试，也许并不是在所有的子体系下都能正常运行。如果您发现它不能运行，请尝试将合适的 <command>MILO</command> 二进制文件拷贝到软盘中(<ulink url="&disturlftp;main/disks-alpha/current/MILO/"></ulink>)。注意，这些 <command>MILO</command> 不支持 ext2 的<quote>sparse superblocks</quote>，因此您不能从新生成的 ext2 文件系统中装载内核。作为一个变通方法，您可以把内核放到 FAT 分区中，紧跟着 <command>MILO</command>。
zh_tw: 抱歉的是，這些 <command>MILO</command> 映像文件未經過足夠的測試，也許並不是在所有的子架構下都能正常運行。 如果您發現它不能運行，請嘗試將合適的 <command>MILO</command> 二進位檔案拷貝到軟碟中(<ulink url="&disturlftp;main/disks-alpha/current/MILO/"></ulink>)。注意，這些 <command>MILO</command> 不支援 ext2 的 <quote>sparse superblocks</quote>，因此您不能從新生成的 ext2 檔案系統中裝載核心。作為一個變通方法，您可以把核心放到 FAT 分割區中，緊跟著 <command>MILO</command>。

source: <command>MILO</command> binaries are platform-specific. See <xref linkend="alpha-cpus"/> to determine the appropriate <command>MILO</command> image for your Alpha platform.
el: Τα εκτελέσιμα <command>MILO</command> είναι συγκεκριμένα για κάθε πλατφόρμα. Δείτε το <xref linkend="alpha-cpus"/> για να προσδιορίσετε την κατάλληλη εικόνα <command>MILO</command> για τη δική σας πλατφόρμα Alpha .
ko: <command>MILO</command> 바이너리는 플랫폼마다 다릅니다. 여러분의 Alpha 플랫폼에 맞는 <command>MILO</command> 이미지를 찾으려면 <xref linkend="alpha-cpus"/> 부분을 참고하십시오.
pt: Os binários <command>MILO</command> são específicos da plataforma. Visite <xref linkend="alpha-cpus"/> para determinar a imagem apropriada para a sua plataforma Alpha.
ru: Двоичные файлы <command>MILO</command> зависят от платформы. Смотрите <xref linkend="alpha-cpus"/>, чтобы определить нужный образ <command>MILO</command> подходящий под вашу Alpha платформу.
zh_cn: <command>MILO</command> 的二进制文件是依赖于具体平台的，请参见 <xref linkend="alpha-cpus"/> 来确认哪一个 <command>MILO</command> 映象适用于您的 Alpha 平台。
zh_tw: <command>MILO</command> 的二進位檔案是依賴於具體平台的，請參閱 <xref linkend="alpha-cpus"/> 來確認哪一個 <command>MILO</command> 映像檔適用於您的 Alpha 平台。

source: RiscPC Installation Files
el: Αρχεία εγκατάστασης για RiscPC
ko: RiscPC 설치 파일
pt: Ficheiros de Instalação RiscPC
ru: Файлы установки для RiscPC
zh_cn: RiscPC 的安装文件
zh_tw: RiscPC 的安裝檔案

source: The RiscPC installer is booted initially from RISC OS. All the necessary files are provided in one Zip archive, &rpc-install-kit;. Download this file onto the RISC OS machine, copy the <filename>linloader.!Boot</filename> components into place, and run <filename>!dInstall</filename>.
el: Ο εγκαταστάτης για RiscPC εκκινείται αρχικά από το RISC OS. Όλα τα απαραίτητα αρχεία δίνονται με ένα αρχείο Zip, &rpc-install-kit;. Κατεβάστε αυτό το αρχείο στο μηχάνημα σας RISC OS, αντιγράψτε τις συνιστώσες <filename>linloader.!Boot</filename> στη θέση τους , και τρέξτε το <filename>!dInstall</filename>.
ko: RiscPC 설치 프로그램은 처음에 RISC OS에서 부팅합니다. 필요한 파일은 모두 &rpc-install-kit; ZIP 파일 하나에 들어가 있습니다. 이 파일을 RISC OS 기계에 내려받아서, <filename>linloader.!Boot</filename> 컴포넌트를 적당한 위치에 복사하고 <filename>!dInstall</filename>을 실행하십시오.
pt: O instalador de RiscPC é arranca inicialmente a partir de RISC OS. Todos os ficheiros necessários são fornecidos num ficheiro Zip, &rpc-install-kit;. Faça download deste ficheiro para a máquina que tem o RISC OS, copie os componentes <filename>linloader.!Boot</filename> para o sítio, e execute <filename>!dInstall</filename>.
ru: Программа установки на RiscPC запускается прямо из RISC OS. Все необходимые файлы содержатся в одном zip архиве, &rpc-install-kit;. Загрузите этот файл на машину с RISC OS, скопируйте компоненты <filename>linloader.!Boot</filename> туда же и запустите <filename>!dInstall</filename>.
zh_cn: RiscPC 安装程序最初是从 RiSC OS 引导的。所有必需的文件都由一个名为 &rpc-install-kit; 的档案所提供，请将此文件下载到 RISC OS 机器中，将 <filename>linloader.!Boot</filename> 拷贝到合适的位置，然后运行 <filename>!dInstall</filename>。
zh_tw: RiscPC 安裝程式最初是從 RiSC OS 開機的。所有必需的文件都由一個名為 &rpc-install-kit; 的檔案所提供，請將此檔案下載到 RISC OS 機器中，將 <filename>linloader.!Boot</filename> 拷貝到合適的位置，然後執行 <filename>!dInstall</filename>。

source: NetWinder Installation Files
el: Αρχεία εγκατάστασης NetWinder
ko: NetWinder 설치 파일
pt: Ficheiros de Instalação NetWinder
ru: Файлы установки для NetWinder
zh_cn: NetWinder 的安装文件
zh_tw: NetWinder 的安裝檔案

source: The easiest way to boot a NetWinder is over the network, using the supplied TFTP image &netwinder-boot-img;.
el: Ο ευκολότερος τρόπος για να εκκινήσετε ένα σύστημα NetWinder είναι μέσω του δικτύου χρησιμοποιώντας το διατιθέμενο είδωλο TFTP &netwinder-boot-img;.
ko: NetWinder를 부팅하는 가장 쉬운 방법은, &netwinder-boot-img; TFTP 이미지를 이용해 네트워크에서 부팅하는 것입니다.
pt: A maneira mais simples de iniciar um NetWinder é através da rede, utilizando a imagem TFTP fornecida &netwinder-boot-img;.
ru: Простейший путь загрузки NetWinder &mdash; по сети изTFTP образа &netwinder-boot-img;.
zh_cn: 启动一台 NetWinder 最轻松的途径是使用所提供的 TFTP 映象文件 &netwinder-boot-img; 进行网络引导。
zh_tw: 啟動一台 NetWinder 最輕鬆的途徑是使用其提供的 TFTP 映像檔 &netwinder-boot-img; 進行網路開機。

source: CATS Installation Files
el: Αρχεία εγκατάστασης CATS
ko: CATS 설치 파일
pt: Ficheiros de Instalação CATS
ru: Файлы установки для CATS
zh_cn: CATS 的安装文件
zh_tw: CATS 的安裝檔案

source: The only supported boot method for CATS is to use the combined image &cats-boot-img;. This can be loaded from any device accessible to the Cyclone bootloader.
el: Η μόνη υποστηριζόμενη μέθοδος εκκίνησης ενός συστήματος CATS είναι με τη χρήση του σύνθετου ειδώλου&cats-boot-img; που μπορεί να φορτωθεί από οποιαδήποτε συσκευή προσβάσιμη από τον φορτωτή εκκίνησης Cyclone.
ko: CATS에서 지원하는 유일한 부팅 방법은 &cats-boot-img; 겸용 이미지를 사용하는 것입니다. Cyclone 부트로더에 접근할 수 있는 어떤 장치에서든 읽어들일 수 있습니다.
pt: O único método de arranque suportado em CATS é utilizando a imagem combinada &cats-boot-img;. Isto pode carregado a partir de qualquer dispositivo acessível ao gestor de arranque Cyclone.
ru: Для CATS поддерживается единственный метод загрузки с использованием объединённого образа &cats-boot-img;. Он может быть загружен с любого устройства, доступного из системного загрузчика Cyclone.
zh_cn: 在 CATS 上唯一被支持的引导方法是使用组合映像 &cats-boot-img;。它能从任何 Cyclone 启动引导器可以访问的设备上被装载。
zh_tw: 在 CATS 上唯一被支援的開機方法是使用組合映像 &cats-boot-img;。它能從任何 Cyclone boot-loader 可以存取的設備上被掛載。

source: Choosing a Kernel
el: Επιλέγοντας έναν πυρήνα
ko: 커널 고르기
pt: Escolher um Kernel
ru: Выбор ядра
zh_cn: 选择一个内核
zh_tw: 選擇一個核心

source: Some m68k subarchs have a choice of kernels to install. In general we recommend trying the most recent version first. If your subarch or machine needs to use a 2.2.x kernel, make sure you choose one of the images that supports 2.2.x kernels (see the <ulink url="&disturl;/main/installer-&architecture;/current/images/MANIFEST">MANIFEST</ulink>).
el: Μερικές υποαρχιτεκτονικές m68k δίνουν την επιλογή πυρήνα για την εγκατάσταση. Σε γενικές γραμμές συνιστούμε να δοκιμάσετε πρώτα τις πιο πρόσφατες εκδόσεις. Αν η υποαρχιτεκτονική ή το μηχάνημά σας χρειάζεται να χρησιμοποιήσει έναν πυρήνα 2.2.x, βεβαιωθείτε ότι επιλέξατε ένα από τα είδωλα που υποστηρίζει πυρήνες της σειράς 2.2.x (δείτε σχετικά το σύνδεσμο<ulink url="&disturl;/main/installer-&architecture;/current/images/MANIFEST">MANIFEST</ulink>).
ko: 일부 m68k 서브 아키텍쳐에서는 설치할 커널을 선택할 수 있습니다. 일반적인 경우라면 가장 최근의 버전을 처음에 시도해 보시길 권합니다. 해당 서브 아키텍쳐나 기계에서 2.2.x 커널이 필요한 경우에는, 2.2.x 커널을 지원하는 이미지를 사용하도록 하십시오. (<ulink url="&disturl;/main/installer-&architecture;/current/images/MANIFEST">MANIFEST</ulink>를 참고하십시오)
pt: Algumas sub-arquitecturas m68k têm kernels à escolha para instalar. Na generalidade nós recomendamos experimentar primeiro a versão mais recente. Se a sua sub-arquitectura ou máquina precisa utilizar um kernel 2.2.x, certifique-se de que escolhe uma das imagens que suportam kernels 2.2.x (visite <ulink url="&disturl;/main/installer-&architecture;/current/images/MANIFEST">MANIFEST</ulink>).
ru: Для некоторых суб-архитектур m68k есть выбор версии ядра для установки. В общих чертах, мы рекомендуем сначала попробовать самую новую версию. Если для вашей суб-архитектуры или машины требуется ядро 2.2.x, убедитесь, что вы выбрали один из образов, который поддерживает ядра 2.2.x (смотрите файл <ulink url="&disturl;/main/installer-&architecture;/current/images/MANIFEST">MANIFEST</ulink>).
zh_cn: 一些 m68k 子体系可以选择要安装的内核。一般来说我们推荐您首先尝试最新的版本。如果您的子体系系统或机器需要使用 2.2.x 版的内核，请确认您选择的是一个支持对应内核的映像。(请参见 <ulink url="&disturl;/main/installer-&architecture;/current/images/MANIFEST">MANIFEST</ulink>)。
zh_tw: 一些 m68k 子架構可以選擇要安裝的核心。一般來說我們建議您首先嘗試最新的版本。 如果您的子架構系統或機器需要使用 2.2.x 版的核心，請確認您選擇的是一個支援對應核心的映像檔。(請參閱 <ulink url="&disturl;/main/installer-&architecture;/current/images/MANIFEST">MANIFEST</ulink>)。

source: All of the m68k images for use with 2.2.x kernels, require the kernel parameter &ramdisksize;.
el: Όλα τα είδωλα του m68k για χρήση με πυρήνες 2.2.x, απαιτούν την παράμετρο πυρήνα &ramdisksize;.
ko: 모든 2.2.x 커널 m68k 이미지는 &ramdisksize; 커널 파라미터가 필요합니다.
pt: Todas as imagens m68k para utilizar com kernels 2.2.x, requerem o parâmetro de kernel &ramdisksize;.
ru: Все образы ядра версий 2.2.x для m68k требуют параметр ядра &ramdisksize;.
zh_cn: 所有使用 2.2.x 内核的 m68k 的映像都要求使用 &ramdisksize; 内核参数。
zh_tw: 所有使用 2.2.x 核心的 m68k 的映像檔都要求使用 &ramdisksize; 核心參數。

source: Creating an IPL tape
el: Δημιουργία μιας κασέτας IPL
ko: IPL 테이프 만들기
pt: Criar uma tape IPL
ru: Создание ленты IPL
zh_cn: 创建一个 IPL 磁带
zh_tw: 建立 IPL 磁帶

source: If you can't boot (IPL) from the CD-ROM and you are not using VM you need to create an IPL tape first. This is described in section 3.4.3 in the <ulink url="http://www.redbooks.ibm.com/pubs/pdfs/redbooks/sg246264.pdf"> Linux for IBM eServer zSeries and S/390: Distributions</ulink> Redbook. The files you need to write to the tape are (in this order): <filename>kernel.debian</filename>, <filename>parmfile.debian</filename> and <filename>initrd.debian</filename>. The files can be downloaded from the <filename>tape</filename> sub-directory, see <xref linkend="where-files"/>,
el: Αν δεν μπορείτε να εκκινήσετε το σύστημα (IPL) από ένα CD-ROM και δεν χρησιμοποιείτε VM θα πρέπει να δημιουργήσετε πρώτα μια κασέτα IPL. Αυτό περιγράφεται στην ενότητα 3.4.3 του βιβλίου <ulink url="http://www.redbooks.ibm.com/pubs/pdfs/redbooks/sg246264.pdf">Linux for IBM eServer zSeries and S/390: Distributions</ulink> Redbook. Τα αρχεία που χρειάζεται να γράψετε στην κασέτα είναι (με αυτή τη σειρά): <filename>kernel.debian</filename>, <filename>parmfile.debian</filename> και <filename>initrd.debian</filename>. Τα αρχεία μπορούν να κατέβουν από τον υποκατάλογο <filename>tape</filename>, δείτε το <xref linkend="where-files"/>,
ko: CD-ROM에서 부팅할 수 없고 (IPL) VM을 사용하는 게 아니라면 먼저 IPL 테이프를 만들어야 합니다. <ulink url="http://www.redbooks.ibm.com/pubs/pdfs/redbooks/sg246264.pdf"> Linux for IBM eServer zSeries and S/390: Distributions</ulink> Redbook의 3.4.3에 설명되어 있습니다. 테이프에 쓸 때 필요한 파일은 (순서대로): <filename>kernel.debian</filename>, <filename>parmfile.debian</filename>, <filename>initrd.debian</filename>입니다. 이 파일은 <filename>tape</filename> 서브 디렉토리에서 내려 받을 수 있습니다. <xref linkend="where-files"/> 부분을 참고하십시오.
pt: Se não pode iniciar (IPL) a partir de CD_ROM e não está a utilizar VM primeiro irá precisar de criar uma tape IPL. Isto é descrito na secção 3.4.3 no <ulink url="http://www.redbooks.ibm.com/pubs/pdfs/redbooks/sg246264.pdf"> Linux for IBM eServer zSeries and S/390: Distributions</ulink> Redbook. Os ficheiros que precisa de gravar para a tape são (por esta ordem): <filename>kernel.debian</filename>, <filename>parmfile.debian</filename> e <filename>initrd.debian</filename>. O download destes ficheiros pode ser feito a partir da sub-directoria <filename>tape</filename>, visite <xref linkend="where-files"/>,
ru: Если вы не смогли загрузить (IPL) с CD-ROM и не используете VM, то вам нужно создатьленту IPL. Это описано в разделе 3.4.3 в Redbook <ulink url="http://www.redbooks.ibm.com/pubs/pdfs/redbooks/sg246264.pdf"> Linux for IBM eServer zSeries and S/390: Distributions</ulink>. Файлы, которые требуется записать на ленту (в нужном порядке): <filename>kernel.debian</filename>, <filename>parmfile.debian</filename> и <filename>initrd.debian</filename>. Файлы можно найти в каталоге <filename>tape</filename>, смотрите <xref linkend="where-files"/>,
zh_cn: 如果您不能从光盘引导(IPL)并且没有使用 VM，您首先就需要创建一个 IPL 磁带。这在 <ulink url="http://www.redbooks.ibm.com/pubs/pdfs/redbooks/sg246264.pdf"> Linux for IBM eServer zSeries and S/390: Distributions</ulink> Redbook 的第 3.4.3 节中有描述。您需要写到磁带上的文件是(按以下顺序): <filename>kernel.debian</filename>、<filename>parmfile.debian</filename> 和 <filename>initrd.debian</filename>。这些文件可以从 <filename>tape</filename>子目录下载，请参见 <xref linkend="where-files"/>,
zh_tw: 如果您不能從光碟開機 (IPL) 並且沒有使用 VM，您首先就需要建立一個 IPL 磁帶。這在 <ulink url="http://www.redbooks.ibm.com/pubs/pdfs/redbooks/sg246264.pdf"> Linux for IBM eServer zSeries and S/390: Distributions</ulink> Redbook 的第 3.4.3 節中有描述。您需要寫到磁帶上的檔案有 (按以下順序):<filename>kernel.debian</filename>、<filename>parmfile.debian</filename> 和 <filename>initrd.debian</filename>。這些檔案可以從 <filename>tape</filename> 子目錄下載，請參閱 <xref linkend="where-files"/>,

source: Creating Floppies from Disk Images
el: Γράφοντας Δισκέτες από Είδωλα Δισκετών
ko: 디스크 이미지에서 플로피 만들기
pt: Criar Disquetes a partir de Imagens de Disco
ru: Создание дискет из образов дисков
zh_cn: 从软盘映像创建引导软盘
zh_tw: 利用軟碟映像檔建立開機磁片

source: Bootable floppy disks are generally used as a last resort to boot the installer on hardware that cannot boot from CD or by other means.
el: Εκκινήσιμες δισκέττες χρησιμοποιούνται γενικά σαν τελευταία λύση για την εκκίνηση του εγκαταστάτη σε συστήματα που δεν μπορούν να ξεκινήσουν από ένα CD ή από άλλο μέσο.
ko: 보통 CD나 다른 방법으로 부팅할 수 없는 하드웨어의 경우, 설치 프로그램을 부팅하는 마지막 방법으로 부팅 플로피 디스크를 사용합니다.
pt: Disquetes de arranque são geralmente utilizadas como último recurso para iniciar o instalador em hardware que não arranca de CD ou por outros meios.
ru: Загрузочные дискеты обычно используются в последнюю очередь, если больше никак нельзя загрузить программу установки на машине, которая не умеет загружаться с CD или каким-то другим способом.
zh_cn: 可启动的软盘一般被视为是在那些不能从光盘或其它方式启动的硬件上引导安装程序的最后一种方法。
zh_tw: 可開機的磁片一般被視為是在那些不能從光碟或其它方式啟動的硬體上開機安裝程式的最後一種方法。

source: Floppy disk booting reportedly fails on Mac USB floppy drives.
el: Σύμφωνα με αναφορές η εκκίνηση με δισκέττες αποτυχαίνει σε USB οδηγούς δισκεττών σε Mac.
ko: 알려진 바에 따르면, 플로피 디스크 부팅은 Mac USB 플로피 드라이브에서 실패합니다.
pt: É reportado que as disquetes de arranque falham nas drives de disquetes Mac ligadas por USB.
ru: Загрузка с дискет не работает в дисководах Mac USB.
zh_cn: 有报告说 Mac USB 软盘驱动器不支持引导软盘。
zh_tw: 有報告說 Mac USB 軟碟機不支援開機磁片。

source: Floppy disk booting is not supported on Amigas or 68k Macs.
el: Εκκίνηση από δισκέττες δεν υποστηρίζεται σε Amiga ή σε 68k Mac.
ko: 플로피 디스크 부팅은 Amiga 혹은 68k Mac에서 지원하지 않습니다.
pt: Em Amigas ou Macs 68k o arranque a partir de disquetes não é suportado.
ru: Загрузка с дискет не поддерживается на Amiga или 68k Mac.
zh_cn: Amigas 或者 68k Macs 的软盘引导方法也不被支持。
zh_tw: Amigas 或者 68k Macs 的軟碟開機也不被支援。

source: Disk images are files containing the complete contents of a floppy disk in <emphasis>raw</emphasis> form. Disk images, such as <filename>boot.img</filename>, cannot simply be copied to floppy drives. A special program is used to write the image files to floppy disk in <emphasis>raw</emphasis> mode. This is required because these images are raw representations of the disk; it is required to do a <emphasis>sector copy</emphasis> of the data from the file onto the floppy.
el: Τα είδωλα δισκετών είναι αρχεία που περιέχουν το πλήρες περιεχόμενο μιας δισκέττας σε <emphasis>raw</emphasis>μορφή. Τέτοια είδωλα, όπως ένα <filename>boot.img</filename>, δεν μπορούν απλά να αντιγραφούν σε έναν οδηγό δισκέττας. Απαιτείται η χρήση ενός ειδικού προγράμματος για να γραφεί ένα αρχείο ειδώλου σε δισκέττα σε <emphasis>raw</emphasis> κατάσταση απαιτείται η χρήση ενός ειδικού προγράμματος. Κι αυτό γιατί οι εικόνες αυτές είναι raw αναπαραστάσεις της δισκέττας. Απαιτείται να δημιουργηθεί ένα <emphasis>αντίγραφο τομέα</emphasis> των δεδομένων από το αρχείο στη δισκέττα.
ko: 디스크 이미지는 플로피 디스크의 모든 내용이 <emphasis>로우</emphasis> 형태로 들어 있는 파일입니다. <filename>boot.img</filename>같은 디스크 이미지는 플로피 드라이브에 그냥 복사할 수 없습니다. 이미지 파일을 플로피 디스크에 <emphasis>로우</emphasis> 모드로 쓰려면 특별한 프로그램을 사용합니다. 이미지 파일은 디스크 전체의 내용을 그대로 나타내는 파일이기 때문입니다. 파일의 데이터를 플로피에 <emphasis>섹터 복사</emphasis>해야 합니다.
pt: Imagens de disco são ficheiros que contêm o conteúdo completo das disquetes de arranque em formato <emphasis>raw</emphasis>. Imagens de disco, tais como <filename>boot.img</filename>, não podem simplesmente ser copiadas para disquetes. É utilizado um programa especial para escrever os ficheiros da imagem para disquetes em modo <emphasis>raw</emphasis>. Isto é necessário porque estas imagens são representações raw do disco; é necessário que seja feita uma <emphasis>cópia do sector</emphasis> dos dados deste ficheiro para a disquete.
ru: Образы дисков &mdash; это файлы, содержащие полный слепок дискеты в <emphasis>сыром</emphasis> виде. Образы дисков, такие как <filename>boot.img</filename>, нельзя скопировать на дискету обычным образом. Для этого нужно использовать специальную программу, которая пишет образы файлов на дискету в <emphasis>сыром</emphasis> режиме. Это обязательное условие, так как образы представляют собой сырое представление дискеты; требуется выполнение <emphasis>посекторного копирования</emphasis> данных из файла на дискету.
zh_cn: 软盘映像是一些包含完整的 <emphasis>原始</emphasis> 格式软盘内容的文件。类似 <filename>boot.img</filename> 这样的软盘映像不能直接拷贝到软盘中。有一个特殊的程序可以将它们按 <emphasis>原始</emphasis> 模式写入软盘。这是一个必须的步骤，因为这些映像 文件是一些原始的磁盘保存方式。所以需要把文件的数据 <emphasis>按扇区拷贝</emphasis> 放到软盘中。
zh_tw: 軟碟映像檔是一些包含完整的<emphasis>原始</emphasis>磁片內容與格式的檔案。類似 <filename>boot.img</filename> 這樣的軟碟映像檔不能直接拷貝到軟碟中。必須使用特殊的程式將它們按<emphasis>原始</emphasis>模式寫入磁片。這是一個必要的步驟，因為這些映像 文件是一些原始的磁碟保存方式。所以需要把文件的數據 <emphasis>按磁區拷貝</emphasis>到軟碟中。

source: There are different techniques for creating floppies from disk images, which depend on your platform. This section describes how to create floppies from disk images on different platforms.
el: Υπάρχουν διαφορετικές τεχνικές για τη δημιουργία δισκεττών από είδωλα δισκεττών, που εξαρτώνται από την πλατφόρμα σας. Αυτή η ενότητα περιγράφει πώς να δημιουργήσετε δισκέττες από είδωλα δισκεττών σε διαφορετικές πλατφόρμες.
ko: 디스크 이미지에서 플로피를 만드는 방법은 플랫폼에 따라 세 가지가 있습니다. 여기서는 여러 가지 플랫폼에서 디스크 이미지로 플로피를 만드는 방법을 설명합니다.
pt: Existem diferentes técnicas para criar disquetes a partir das imagens de disco, que dependem da sua plataforma. Esta secção descreve como criar disquetes a partir das imagens de disco em diferentes plataformas.
ru: Есть несколько техник (зависящих от платформы) по созданию дискет из образов дисков. В этом разделе описано, как создавать дискеты из образов дисков на различных платформах.
zh_cn: 根据平台的不同，有各种不同的方法来从软盘映像创建引导软盘。这一节将描述如何在不同平台上从软盘映像创建引导软盘。
zh_tw: 根據平台的不同，有各種不同的方法來從軟碟映像檔建立開機磁片。這一節將描述如何在不同平台上從從軟碟映像檔建立開機磁片。

source: No matter which method you use to create your floppies, you should remember to flip the write-protect tab on the floppies once you have written them, to ensure they are not damaged unintentionally.
el: Ανεξάρτητα από τη μέθοδο που θα χρησιμοποιήσετε για τη δημιουργία των δισκεττών σας, θα πρέπει να θυμηθείτε να εφαρμόσετε το κουμπί της προστασίας εγγραφής, μετά την εγγραφή τους, ώστε να σιγουρευτείτε ότι δεν θα καταστραφούν από αμέλεια.
ko: 플로피를 만들 때 어떤 방법을 사용하든 간에, 플로피를 쓴 다음에 쓰기 방지 탭을 걸어 놓아서 플로피 내용이 손상되지 않도록 하십시오.
pt: Não importa que método estiver a utilizar para criar as suas disquetes, assim que tiver escrito nelas deve lembrar-se de carregar na patilha de protecção contra escrita, para se assegurar que não serão involuntariamente danificadas.
ru: Неважно каким методом вы создадите дискеты, вы только должны помнить о переключении защиты от записи на дискетах после их создания, чтобы непреднамеренно не повредить их.
zh_cn: 无论您使用何种方法来建立引导软盘，您应该在建立以后记住打开写保护的开关，以便确保内容不会在无意被抹掉。
zh_tw: 無論您使用何種方法來建立開機磁片，您應該在建立以後記住打開防寫的開關，以確保內容不會在無意間被清除。

source: Writing Disk Images From a Linux or Unix System
el: Γράφοντας Είδωλα Δισκεττών από ένα σύστημα Linux ή Unix
ko: 리눅스나 UNIX 시스템에서 디스크 이미지 쓰기
pt: Escrever Imagens de Disco a partir de um Sistema Linux ou Unix
ru: Запись образов дисков из систем Linux или Unix
zh_cn: 从 Linux 或者 Unix 系统写软盘映像
zh_tw: 從 Linux 或者 Unix 系統寫入軟碟映像檔
