Repository: xobs/debian-installer
Catalog: doc/manual/po/*/install-methods.po
Languages: el, ko, pt, ru, zh_cn, zh_tw

source: Mount the partition (<userinput>mount /dev/sda1 /mnt</userinput>) and copy the following files from the Debian archives to the stick: <itemizedlist> <listitem><para> <filename>vmlinuz</filename> (kernel binary) </para></listitem> <listitem><para> <filename>initrd.gz</filename> (initial ramdisk image) </para></listitem> <listitem><para> <filename>syslinux.cfg</filename> (SYSLINUX configuration file) </para></listitem> <listitem><para> Optional kernel modules </para></listitem> </itemizedlist> If you want to rename the files, please note that <command>SYSLINUX</command> can only process DOS (8.3) file names.
el: Προσαρτήστε το τμήμα (<userinput>mount /dev/sda1/mnt</userinput>) και αντιγράψτε τα ακόλουθα αρχεία από τις αρχειοθήκες του Debian στο stick: <itemizedlist><listitem><para><filename>vmlinuz</filename> (εκτελέσιμο του πυρήνας)</para></listitem><listitem><para><filename>initrd.gz</filename> (αρχική εικόνα ramdisk)</para></listitem><listitem><para><filename>syslinux.cfg</filename> (αρχείο ρύθμισης του SYSLINUX )</para></listitem><listitem><para>Προαιρετικά modules του πυρήνα</para></listitem></itemizedlist>Αν θέλετε να ονομάσετε διαφορετικά τα αρχεία παρακαλούμε σημειώστε ότι το<command>SYSLINUX</command> μπορεί να επεξεργαστεί μόνο ονόματα αρχείων τύπου DOS(8.3).
ko: 파티션을 마운트하고 (<userinput>mount /dev/sda1 /mnt</userinput>) 데비안 아카이브에서 다음 파일을 스틱으로 복사하십시오: <itemizedlist> <listitem><para> <filename>vmlinuz</filename> (커널 바이너리) </para></listitem> <listitem><para> <filename>initrd.gz</filename> (최초 램디스크 이미지) </para></listitem> <listitem><para> <filename>syslinux.cfg</filename> (SYSLINUX 설정 파일 </para></listitem> <listitem><para> 추가 커널 모듈 </para></listitem> </itemizedlist> 파일 이름을 바꾸려면, <command>SYSLINUX</command>에서는 DOS 파일이름만 (8.3 방식) 사용할 수 있다는 점을 주의하십시오.
pt: Monte a partição (<userinput>mount /dev/sda1 /mnt</userinput>) e copie os seguintes ficheiros dos arquivos Debian para o stick: <itemizedlist> <listitem><para> <filename>vmlinuz</filename> (binário kernel) </para></listitem> <listitem><para> <filename>initrd.gz</filename> (imagem ramdisk inicial) </para></listitem> <listitem><para> <filename>syslinux.cfg</filename> (ficheiro de configuração SYSLINUX) </para></listitem> <listitem><para> Módulos de kernel opcionais </para></listitem> </itemizedlist> Se quiser renomear os ficheiros, tenha atenção que <command>SYSLINUX</command> apenas pode processar nomes de ficheiros DOS (8.3).
ru: Смонтировав раздел (<userinput>mount /dev/sda1 /mnt</userinput>), скопируйте следующие файлы из архива Debian: <itemizedlist> <listitem><para> <filename>vmlinuz</filename> (файл ядра) </para></listitem> <listitem><para> <filename>initrd.gz</filename> (образ ramdisk) </para></listitem> <listitem><para> <filename>syslinux.cfg</filename> (файл настройки SYSLINUX) </para></listitem> <listitem><para> необязательные модули ядра</para></listitem> </itemizedlist> Если вы хотите переименовать файлы, учтите, что <command>SYSLINUX</command> работает только с файловыми именами DOS (8.3).
zh_cn: 接下来就是挂载分区(<userinput>mount /dev/sda1 /mnt</userinput>)以及将下列文件从 Debain 文件库拷贝到闪盘上： <itemizedlist> <listitem><para> <filename>vmlinuz</filename> (内核二进制文件) </para></listitem> <listitem><para> <filename>initrd.gz</filename> (初始化内存映像) </para></listitem> <listitem><para> <filename>syslinux.cfg</filename> (SYSLINUX 配置文件) </para></listitem> <listitem><para> 可选的内核模块 </para></listitem> </itemizedlist> 如果您想给这些文件改名，请注意 <command>SYSLINUX</command> 只能处理 DOS (8.3) 格式的文件名。
zh_tw: 接下來就是掛載分割區 (<userinput>mount /dev/sda1 /mnt</userinput>) 以及將下列檔案從 Debain 檔案庫拷貝到儲存上：<itemizedlist> <listitem><para> <filename>vmlinuz</filename> (核心二進位檔案) </para></listitem> <listitem><para> <filename>initrd.gz</filename> (初始化記憶體映像檔) </para></listitem> <listitem><para> <filename>syslinux.cfg</filename> (SYSLINUX 設定檔案) </para></listitem> <listitem><para> 可選的核心模組 </para></listitem> </itemizedlist> 如果您想為這些檔名更名，請注意 <command>SYSLINUX</command> 只能處理 DOS (8.3) 格式的檔案名稱。

source: The <filename>syslinux.cfg</filename> configuration file should contain the following two lines: <informalexample><screen> default vmlinuz append initrd=initrd.gz ramdisk_size=12000 root=/dev/rd/0 init=/linuxrc rw </screen></informalexample> Please note that the <userinput>ramdisk_size</userinput> parameter may need to be increased, depending on the image you are booting. <phrase condition="sarge"> If the boot fails, you can try adding <userinput>devfs=mount,dall</userinput> to the <quote>append</quote> line. </phrase>
el: Το αρχείο ρυθμίσεων <filename>syslinux.cfg</filename> πρέπει να περιέχει τουλάχιστον τις ακόλουθες δύο γραμμές:<informalexample><screen> default vmlinuz append initrd=initrd.gz ramdisk_size=10000 root=/dev/rd/0 init=/linuxrc devfs=mount,dall rw </screen></informalexample> Προσέξτε ότι η παράμετρος <userinput>ramdisk_size</userinput> πιθανόν να πρέπει να μεγαλώσει ανάλογα με την εικόνα ramdisk που εκκινείτε. Αν η εκκίνηση αποτύχει, μπορείτε να δοκιμάσετε να προσθέσετε την παράμετρο <userinput>devfs=mount,dall</userinput> στη γραμμή <quote>append</quote>
ko: <filename>syslinux.cfg</filename> 설정 파일에는 다음 두 줄이 들어 있습니다: <informalexample><screen> default vmlinuz append initrd=initrd.gz ramdisk_size=12000 root=/dev/rd/0 init=/linuxrc rw </screen></informalexample> 부팅하는 이미지에 따라서는 <userinput>ramdisk_size</userinput> 파라미터 값을 늘려야 할 수도 있습니다. <phrase condition="sarge">부팅이 실패하면, <userinput>devfs=mount,dall</userinput> 파라미터를 <quote>뒤에</quote> 붙여 보십시오.</phrase>
pt: O ficheiro de configuração <filename>syslinux.cfg</filename> deve conter as duas linhas seguintes: <informalexample><screen> default vmlinuz append initrd=initrd.gz ramdisk_size=12000 root=/dev/rd/0 init=/linuxrc rw </screen></informalexample> Note, por favor, que o parâmetro <userinput>ramdisk_size</userinput> poderá necessitar ser aumentado, dependendo da imagem de que está a arrancar. <phrase condition="sarge"> Se o arranque falhar, poderá tentar adicionar <userinput>devfs=mount,dall</userinput> à linha <quote>adicionada</quote>. </phrase>
ru: Конфигурационный файл <filename>syslinux.cfg</filename> должен содержать две строки: <informalexample><screen> default vmlinuz append initrd=initrd.gz ramdisk_size=12000 root=/dev/rd/0 init=/linuxrc rw </screen></informalexample> Учтите, что может потребоваться увеличить параметр <userinput>ramdisk_size</userinput> в зависимости от загружаемого образа. <phrase condition="sarge">Если загрузка завершилась неудачно, попробуйте добавить <userinput>devfs=mount,dall</userinput> в строку <quote>append</quote>.</phrase>
zh_cn: <filename>syslinux.cfg</filename> 配置文件应该含有下列两行： <informalexample><screen> default vmlinuz append initrd=initrd.gz ramdisk_size=12000 root=/dev/rd/0 init=/linuxrc rw </screen></informalexample> 请注意，根据所启动的内存映像的大小，在必要的时候，您可能需要增大<userinput>ramdisk_size</userinput> 参数的数值。<phrase condition="sarge">如果引导失败，您可以尝试添加 <userinput>devfs=mount,dall</userinput> 到 <quote>append</quote> 那一行。</phrase>
zh_tw: <filename>syslinux.cfg</filename> 設定檔案應該含有下列兩行： <informalexample><screen> default vmlinuz append initrd=initrd.gz ramdisk_size=12000 root=/dev/rd/0 init=/linuxrc rw </screen></informalexample> 請注意，根據開機的映像大小，在必要的時候，您可能需要增大 <userinput>ramdisk_size</userinput> 參數的數值。<phrase condition="sarge">如果開機失敗，您可以嘗試添加 <userinput>devfs=mount,dall</userinput> 到 <quote>append</quote> 那一行。</phrase>

source: Most USB sticks do not come pre-configured in such a way that Open Firmware can boot from them, so you will need to repartition the stick. On Mac systems, run <userinput>mac-fdisk /dev/sda</userinput>, initialise a new partition map using the <userinput>i</userinput> command, and create a new partition of type Apple_Bootstrap using the <userinput>C</userinput> command. (Note that the first "partition" will always be the partition map itself.) Then type <informalexample><screen> $ hformat /dev/<replaceable>sda2</replaceable> </screen></informalexample> Take care that you use the correct device name for your USB stick. The <command>hformat</command> command is contained in the <classname>hfsutils</classname> Debian package.
el: Τα περισσότερα stick USB δεν έρχονται προ-ρυθμισμένα ώστε το Open Firmware να μπορεί να εκκινήσει από αυτά, οπότε θα πρέπει να επαναδιαμερίσετε το stick. Σε συστήματα Mac, τρέξτε την εντολή <userinput>mac-fdisk /dev/sda</userinput>, αρχικοποιήστε έναν καινούριο χάρτη διαμέρισης με την εντολή <userinput>i</userinput> και δηιουργήστε μια καινούρια κατάτμηση τύπου Apple_Bootstrap με την εντολή <userinput>C</userinput>. (Σημειώστε ότι η πρώτη "κατάτμηση" θα είναι πάντα ο ίδιος ο χάρτης διαμέρισης). Στη συνέχεια πληκτρολογήστε <informalexample><screen> $ hformat /dev/<replaceable>sda2</replaceable> </screen></informalexample> προσέχοντας ότι χρησιμοποιείτε το σωστό όνομα συσκευής για το stick USB. η εντολή <command>hformat</command> περιέχεται στο πακέτο του Debian <classname>hfsutils</classname>.
ko: USB 스틱 대부분은 Open Firmware가 부팅할 수 없는 방식으로 되어 있어서, USB 스틱을 다시 파티션해야 합니다. Mac 시스템에서는 <userinput>mac-fdisk /dev/sda</userinput>라고 실행하고, <userinput>i</userinput> 명령으로 새 파티션 맵을 초기화한 다음, <userinput>C</userinput> 명령으로 새로운 Apple_Bootstrap 파티션을 만듭니다. (맨 앞의 "파티션"은 항상 파티션 맵 자신입니다) 그리고 다음 명령을 실행하십시오: <informalexample><screen> $ hformat /dev/<replaceable>sda2</replaceable> </screen></informalexample> 주의해서 USB 스틱에 올바른 장치 이름을 사용하십시오. <command>hformat</command> 명령은 <classname>hfsutils</classname> 데비안 꾸러미에 들어 있습니다.
pt: A maioria dos sticks USB não vêm configurados de forma a que o Open Firmware possa iniciar a partir deles, então vai necessitar de reparticionar o stick. Em sistemas Mac, execute <userinput>mac-fdisk /dev/sda</userinput>, inicialize um novo mapa de partição utilizando o comando <userinput>i</userinput>, e crie uma nova partição do tipo Apple_Bootstrap utilizando o comando <userinput>C</userinput>. (Note que a primeira "partition" irá sempre ser o próprio mapa de partições.) Depois digite <informalexample><screen> $ hformat /dev/<replaceable>sda2</replaceable> </screen></informalexample> Certifique-se de que está a utilizar o nome do correcto do seu stick USB. O comando <command>hformat</command> está contido no pacote Debian <classname>hfsutils</classname>.
ru: С большинства карт памяти USB невозможно сразу загрузиться с помощью Open Firmware, поэтому вам придётся переразметить карту памяти. На системах Mac, запустите <userinput>mac-fdisk /dev/sda</userinput>, инициализируйте новую карту разделов с помощью команды <userinput>i</userinput> и создайте новый раздел с типом Apple_Bootstrap с помощью команды <userinput>C</userinput>. (Заметим, что первый "раздел" всегда будет сама карта разделов.) Затем введите <informalexample><screen> $ hformat /dev/<replaceable>sda2</replaceable> </screen></informalexample> Обязательно вводите правильное имя устройства USB. Команда <command>hformat</command> содержится в пакете Debian <classname>hfsutils</classname>.
zh_cn: 绝大多数 USB 盘的预设置都不能让 Open Firmware 从该盘进行引导，因此您需要为闪盘重新分区。在 Mac 系统上，执行 <userinput>mac-fdisk /dev/sda</userinput>，用 <userinput>i</userinput> 命令初始化新的分区映射，然后使用 <userinput>C</userinput> 命令创建一个新的类型为 Apple_Bootstrap 的分区。(要注意的是第一个分区总是分区映射本身。)然后键入 <informalexample><screen> $ hformat /dev/<replaceable>sda2</replaceable> </screen></informalexample> 注意使用正确的 USB 盘设备名称。<command>hformat</command> 命令包含在 <classname>hfsutils</classname> Debian 包中。
zh_tw: 絕大多數 USB 隨身碟的預設設定都不能讓 Open Firmware 從該儲存進行開機，因此您需要將儲存重新分割。在 Mac 系統上，執行 <userinput>mac-fdisk /dev/sda</userinput>，用 <userinput>i</userinput> 指令初始化新的分割映射，然後使用 <userinput>C</userinput> 指令建立一個類型為 Apple_Bootstrap 的新分割區。(要注意的是第一個分割區總是分割映射本身。) 然後鍵入 <informalexample><screen> $ hformat /dev/<replaceable>sda2</replaceable> </screen></informalexample> 注意請使用正確的 USB 隨身碟設備名稱。 <command>hformat</command> 指令包含在 <classname>hfsutils</classname> Debian 套件中。

source: In order to start the kernel after booting from the USB stick, we will put a boot loader on the stick. The <command>yaboot</command> boot loader can be installed on an HFS filesystem and can be reconfigured by just editing a text file. Any operating system which supports the HFS file system can be used to make changes to the configuration of the boot loader.
el: Για να ξεκινήσετε τον πυρήνα μετά την εκκίνηση από το USB stick, θα πρέπει να τοποθετήσετε έναν φορτωτή εκκίνησης στο stick. Ο φορτωτής εκκίνησης <command>yaboot</command> μπορεί να εγκατασταθεί σε ένα σύστημα αρχείων HFS και μπορεί να επαναρυθμιστεί απλά διορθώνοντας ένα αρχείο κειμένου. Οποιοδήποτε λειτουργικό σύστημα υποστηρίζει το σύστημα αρχείων HFS μπορεί να χρησιμοποιηθεί για να γίνουν αλλαγές στην ρύθμιση του φορτωτή εκκίνησης.
ko: USB 스틱에서 부팅한 다음 커널을 시작하려면, 부트 로더를 USB 스틱에 넣어야 합니다. <command>yaboot</command> 부트 로더를 HFS 파일 시스템에 설치해서 텍스트 파일 편집만으로 설정할 수 있습니다. HFS 파일 시스템을 지원하는 어떤 운영 체제라도 부트로더 설정을 바꾸는 데 이용할 수 있습니다.
pt: Com o intuito de iniciar o kernel após arrancar de stick USB, nós iremos colocar um gestor de arranque no stick. O gestor de arranque <command>yaboot</command> pode ser instalado no sistema de ficheiros HFS e pode ser reconfigurado apenas editando um ficheiro de texto. Qualquer sistema operativo que suporte um sistema de ficheiros HFS pode ser utilizado para fazer alterações à configuração do gestor de arranque.
ru: Чтобы запустить ядро после загрузки с карты памяти USB, мы поместим на устройство системный загрузчик. Системный загрузчик <command>yaboot</command> может быть установлен в файловую систему HFS и настроен простым редактированием текстового файла. Для изменения конфигурации системного загрузчика можно использовать любую операционную систему, которая поддерживает файловую систему HFS.
zh_cn: 为了能在 USB 闪盘引导后启动内核，我们要在 USB 闪盘上放入一个启动引导程序。<command>yaboot</command> 启动引导器可以被安装到 HFS 文件系统上，而且只需要编辑一个文本文件就能对其重新进行配置。任何支持 HFS 文件系统的操作系统可以用来改变启动引导器的配置文件。
zh_tw: 為了能在 USB 隨身碟開機後啟動核心，我們要在 USB 隨身碟上放入一個 boot-loader。<command>yaboot</command> boot-loader 可以被安裝到 HFS 檔案系統上，而且只需要編輯一個純文字檔就能更改設定。任何支援 HFS 檔案系統的作業系統可以用來改變 boot-loader 的設定檔。

source: The normal <command>ybin</command> tool that comes with <command>yaboot</command> does not yet understand USB storage devices, so you will have to install <command>yaboot</command> by hand using the <classname>hfsutils</classname> tools. Type <informalexample><screen> $ hmount /dev/sda2 $ hcopy -r /usr/lib/yaboot/yaboot : $ hattrib -c UNIX -t tbxi :yaboot $ hattrib -b : $ humount </screen></informalexample> Again, take care that you use the correct device name. The partition must not be otherwise mounted during this procedure. This procedure writes the boot loader to the partition, and uses the HFS utilities to mark it in such a way that Open Firmware will boot it. Having done this, the rest of the USB stick may be prepared using the normal Unix utilities.
el: Το συνηθισμένο εργαλείο <command>ybin</command> που έρχεται μαζί με το πακέτο <command>yaboot</command> δεν καταλαβαίνει από συσκευές αποθήκευσης USB, οπότε θα πρέπει να εγκαταστήσετε το <command>yaboot</command> με το χέρι χρησιμοποιώντας τα εργαλεία του <classname>hfsutils</classname>. Πληκτρολογήστε <informalexample><screen> $ hmount /dev/sda2 $ hcopy -r /usr/lib/yaboot/yaboot : $ hattrib -c UNIX -t tbxi :yaboot $ hattrib -b : $ humount </screen></informalexample> Και πάλι, προσέξτε να χρησιμοποιήσετε το σωστό όνομα για την συσκευή. Η κατάτμηση δεν θα πρέπει να προσαρτηθεί για κάποιον άλλο λόγο κατά τη διάρκεια αυτής της διαδικασίας, η οποία γράφει τον φορτωτή εκκίνησης στην κατάτμηση και χρησιμοποιεί τα εργαλεία για το HFS για να την "σημαδέψει" με τέτοιο τρόπο ώστε να μπορεί να εκκινηθεί από το Open Firmware. Έχοντας κάνει όλα αυτά, ο υπόλοιπος χώρος του stick USB μπορεί να προετοιμαστεί χρησιμοποιώντας τα συνηθισμένα εργαλεία του Unix.
ko: 보통 <command>yaboot</command>에 같이 들어 있는 <command>ybin</command>은 아직 USB 저장 장치를 인식하지 못합니다. 그래서 <classname>hfsutils</classname>을 이용해 <command>yaboot</command>를 수동으로 설치해야 합니다. 다음 명령을 실행하십시오: <informalexample><screen> $ hmount /dev/sda2 $ hcopy -r /usr/lib/yaboot/yaboot : $ hattrib -c UNIX -t tbxi :yaboot $ hattrib -b : $ humount </screen></informalexample> 다시 말하지만, 주의해서 올바른 장치 이름을 사용하십시오. 그렇지 않으면 위 명령 도중에 파티션을 마운트하지 못합니다. 위의 과정은 부트 로더를 파티션에 쓰고, HFS 유틸리티를 사용해 Open Firmware가 부팅할 수 있도록 표시합니다. 다 끝나면, 일반적인 유닉스 유틸리티를 사용해 USB 스틱의 나머지를 준비할 수 있습니다.
pt: A ferramenta <command>ybin</command> que por norma vem com o <command>yaboot</command> ainda não reconhece dispositivos de armazenamento USB, terá então de instalar, manualmente, <command>yaboot</command> utilizando as ferramentas <classname>hfsutils</classname>. Escreva <informalexample><screen> $ hmount /dev/sda2 $ hcopy -r /usr/lib/yaboot/yaboot : $ hattrib -c UNIX -t tbxi :yaboot $ hattrib -b : $ humount </screen></informalexample> Mais uma vez, certifique-se de que está a utilizar o nome correcto do dispositivo. A partição não deve ser montada de outra maneira durante este procedimento. Este procedimento escreve o gestor de arranque para a partição, e usa o utilitário HFS para marcá-lo de maneira a que Open Firmware inicie a partir dele. Tendo isto feito, O resto do stick USB pode ser preparado utilizando os utilitários Unix comuns.
ru: Обычная утилита <command>ybin</command>, идущая вместе с <command>yaboot</command>, не понимает карт памяти USB, поэтому вам нужно установить <command>yaboot</command> вручную с помощью утилит <classname>hfsutils</classname>. Введите <informalexample><screen> $ hmount /dev/sda2 $ hcopy -r /usr/lib/yaboot/yaboot : $ hattrib -c UNIX -t tbxi :yaboot $ hattrib -b : $ humount </screen></informalexample> Повторим, проверьте правильность имени вводимого устройства. Во время процедуры раздел не должен быть смонтирован. Эта процедура записывает системный загрузчик на раздел и с помощью утилит HFS метит его для возможности загрузки из Open Firmware. После этого, остальную работу с картой памяти USB можно выполнять с помощью обычных инструментов Unix.
zh_cn: 常用的 <command>ybin</command> 工具(随 <command>yaboot</command> 附带)并不能识别 USB 存储设备，因此您不得不手动安装 <command>yaboot</command>，这可以通过 <classname>hfsutils</classname> 工具来完成。用法如下： <informalexample><screen> $ hmount /dev/sda2 $ hcopy -r /usr/lib/yaboot/yaboot : $ hattrib -c UNIX -t tbxi :yaboot $ hattrib -b : $ humount </screen></informalexample> 再提醒一次，请确认您使用的是正确的设备名称。操作过程中一定不能挂载此分区。程序会向分区中写入启动引导器，并使用 HFS 工具向其添加标记，最终使得 Open Fireware 可以启动它。完成以上操作之后，USB 盘的其他部分就可以用普通的 Unix 工具来处理了。
zh_tw: 包含於 <command>yaboot</command> 之中的常用工具 <command>ybin</command> 並不能識別 USB 隨身碟設備，因此您不得不手動安裝 <command>yaboot</command>，這可以透過 <classname>hfsutils</classname> 工具來完成。用法如下： <informalexample><screen> $ hmount /dev/sda2 $ hcopy -r /usr/lib/yaboot/yaboot : $ hattrib -c UNIX -t tbxi :yaboot $ hattrib -b : $ humount </screen></informalexample> 再提醒一次，請確認您使用的是正確的設備名稱。操作過程中一定不能掛載此分割區。程式會把 boot-loader 寫入分割區，並使用 HFS 工具對其添加標記，使得 Open Fireware 可以以之開機。完成以上操作之後，USB 隨身碟的其他部分就可以用普通的 Unix 工具來處理了。

source: Mount the partition (<userinput>mount /dev/sda2 /mnt</userinput>) and copy the following files from the Debian archives to the stick:
el: Προσαρτήστε την κατάτμηση (<userinput>mount /dev/sda2 /mnt</userinput>) και αντιγράψτε τα παρακάτω αρχεία από τις αρχειοθήκες του Debian στο stick:
ko: 파티션을 마운트하고 (<userinput>mount /dev/sda2 /mnt</userinput>) 데비안 아카이브에서 다음 파일을 USB 스틱으로 복사하십시오:
pt: Monte a partição (<userinput>mount /dev/sda2 /mnt</userinput>) e copie para o stick os seguintes ficheiros dos arquivos Debian:
ru: Смонтируйте раздел (<userinput>mount /dev/sda2 /mnt</userinput>) и скопируйте следующие файлыиз архива Debian:
zh_cn: 接下来就是挂接分区(<userinput>mount /dev/sda2 /mnt</userinput>)以及将下列文件从 Debain 文件库拷贝到闪盘上：
zh_tw: 接下來就是掛載分割區 (<userinput>mount /dev/sda2 /mnt</userinput>) 以及將下列檔案從 Debain 檔案庫拷貝到儲存上：

source: <filename>vmlinux</filename> (kernel binary)
el: <filename>vmlinux</filename> (εκετελέσιμο αρχείο πυρήνα)
ko: <filename>vmlinux</filename> (커널 바이너리)
pt: <filename>vmlinux</filename> (binário do kernel)
ru: <filename>vmlinuх</filename> (файл ядра)
zh_cn: <filename>vmlinux</filename> (内核二进制文件)
zh_tw: <filename>vmlinux</filename> (核心二進位文件)

source: <filename>initrd.gz</filename> (initial ramdisk image)
el: <filename>initrd.gz</filename> (εικόνα αρχικού δίσκου μνήμης ramdisk)
ko: <filename>initrd.gz</filename> (최초 램디스크 이미지)
pt: <filename>initrd.gz</filename> (imagem ramdisk inicial)
ru: <filename>initrd.gz</filename> (образ ramdisk)
zh_cn: <filename>initrd.gz</filename> (初始化内存映像)
zh_tw: <filename>initrd.gz</filename> (初始化記憶體映像檔)

source: <filename>yaboot.conf</filename> (yaboot configuration file)
el: <filename>yaboot.conf</filename> (αρχείο ρυθμίσεων του yaboot)
ko: <filename>yaboot.conf</filename> (yaboot 설정 파일)
pt: <filename>yaboot.conf</filename> (ficheiro de configuração yaboot)
ru: <filename>yaboot.conf</filename> (конфигурационный файл yaboot)
zh_cn: <filename>yaboot.conf</filename> (yaboot 配置文件)
zh_tw: <filename>yaboot.conf</filename> (yaboot 設定檔案)

source: <filename>boot.msg</filename> (optional boot message)
el: <filename>boot.msg</filename> (προαιρετικό μήνυμα εκκίνησης)
ko: <filename>boot.msg</filename> (추가 부팅 메세지)
pt: <filename>boot.msg</filename> (mensagem opcional de arranque)
ru: <filename>boot.msg</filename> (необязательное загрузочное сообщение)
zh_cn: <filename>boot.msg</filename> (可选的启动信息)
zh_tw: <filename>boot.msg</filename> (可選的啟動資訊)

source: Optional kernel modules
el: Προαιρετικά αρθρώματα πυρήνα
ko: 추가 커널 모듈
pt: Módulos opcionais do kernel
ru: необязательные модули ядра
zh_cn: 可选的内核模块
zh_tw: 可選的核心模組
