Repository: xobs/debian-installer
Catalog: doc/manual/po/*/install-methods.po
Languages: el, ko, pt, ru, zh_cn, zh_tw

source: For PowerPC, if you have a NewWorld Power Macintosh machine, it is a good idea to use DHCP instead of BOOTP. Some of the latest machines are unable to boot using BOOTP.
el: Για την αρχιτεκτονική PowerPC, αν έχετε ένα μηχάνημα NewWorld Power Macintosh, είναι μια καλή ιδέα να χρησιμοποιήσετε DHCP αντί για BOOTP. Μερικά από τα πιο πρόσφατα μηχανήματα δεν μπορούν να εκκινήσουν με χρήση του BOOTP.
ko: PowerPC의 경우, NewWorld Power Macintosh 기계를 가지고 있다면, BOOTP 대신에 DHCP를 사용하는 게 좋습니다. 최근의 일부 기계들은 BOOTP로는 부팅할 수 없습니다.
pt: Para PowerPC, se tem uma máquina Macintosh Power NewWorld, é uma boa ideia usar DHCP em vez de BOOTP. Algumas das máquinas mais recentes não conseguem utilizar BOOTP.
ru: Для PowerPC, если вы имеете машину NewWorld Power Macintosh, лучше использовать DHCP вместо BOOTP. Некоторые из последних машин невозможно загрузить с помощью BOOTP.
zh_cn: 对于 PowerPC 来说，如果您有一台 NewWorld Power Macintosh 机器，使用 DHCP 来代替 BOOTP 比较好。有些最新的机器不能从 BOOTP 引导。
zh_tw: 對於 PowerPC 來說，如果您有一台 NewWorld Power Macintosh 機器，使用 DHCP 來代替 BOOTP 比較好。有些最新的機器不能從 BOOTP 開機。

source: Unlike the Open Firmware found on Sparc and PowerPC machines, the SRM console will <emphasis>not</emphasis> use RARP to obtain its IP address, and therefore you must use BOOTP for net booting your Alpha<footnote> <para> Alpha systems can also be net-booted using the DECNet MOP (Maintenance Operations Protocol), but this is not covered here. Presumably, your local OpenVMS operator will be happy to assist you should you have some burning need to use MOP to boot Linux on your Alpha. </para> </footnote>. You can also enter the IP configuration for network interfaces directly in the SRM console.
ko: Sparc과 PowerPC 기계에 들어 있는 Open Firmware와는 다르게, SRM 콘솔은 IP 주소를 가져올 때 RARP를 쓰지 <emphasis>않습니다</emphasis>. 그래서 Alpha를 네트워크 부팅할 때는 BOOTP를 사용해야 합니다. <footnote> <para> Alpha 시스템은 DECNet MOP(Maintenance Operations Protocol)을 사용하여 네크워크로부팅할 수 있습니다. 그러나 이 방법은 여기서 다루지 않습니다. 당신의 OpenVMS관리자는 당신이 Alpha에서 리눅스를 부팅하기 위하여 MOP를 사용하는 것에 대한 도움을 줄 것입니다</para> </footnote>SRM 콘솔에서 네트워크를 위한 IP 설정을 직접 입력할 수도 있습니다.
pt: Ao contrário do Open Firmware encontrado nas máquinas Sparc PowerPC, a consola SRM <emphasis>não</emphasis> irá utilizar RARP para obter o seu endereço IP, e portanto você deve usar BOOTP para arrancar o seu Alpha através da rede<footnote> <para> Os sistemas Alpha também podem arrancar através da rede utilizando o DECNet MOP (Maintenance Operations Protocol), mas este assunto não é coberto aqui. Presumivelmente, o seu operador local de OpenVMS ficará contente por o ajudar se você estiver a arder por utilizar MOP para arrancar Linux no seu Alpha. </para> </footnote>. Você pode também inserir a configuração IP para as interfaces de rede directamente na consola SRM.
ru: В отличие от Open Firmware в машинах Sparc и PowerPC, SRM консоль <emphasis>не</emphasis> будет использовать RARP для получения IP адреса, и поэтому вы должны использовать BOOTP для загрузки по сети вашей Alpha<footnote> <para> Кроме этого системы Alpha способны загружаться по сети с помощью DECNet MOP (Maintenance Operations Protocol), но в данном руководстве это не описывается. По-видимому, ваш оператор OpenVMS будет рад помочь с настройкой MOP, чтобы загрузить Linux на Alpha. </para> </footnote>. Также вы можете выполнить IP настройку для сетевых интерфейсов в SRM консоли.
zh_cn: 不像 Sparc 和 PowerPC 机器上的 Open Firmware, SRM 控制台将 <emphasis>不</emphasis> 使用 RARP 来获得它的 IP 地址。因此您必须使用 BOOTP 来从网络启动您的 Alpha 机器<footnote> <para> Alpha 系统也可以通过 DECNet MOP (Maintenance Operations Protocol) 从网络启动，但在此不作阐述。在您急切需要使用 MOP 来启动 Alpha 系统上的 Linux 时，估计 OpenVMS 操作员很乐意帮您完成。 </para> </footnote>。您也可以直接在 SRM 控制台中直接输入网络接口的 IP 配置。
zh_tw: 不像 Sparc 和 PowerPC 機器上的 Open Firmware , SRM 控制台將<emphasis>不</emphasis>使用 RARP 來取得它的 IP 位址。因此您必須使用 BOOTP 來從網路啟動您的 <footnote> <para>Alpha 機器。Alpha 系統也能使用 DECNet MOP (Maintenance Operations Protocol) 來進行網路開機，但是這裡不使用此技術。相信您的本地 OpenVMS 操作員樂於協助您燒錄，以便在您的 Alpha 機器上用 MOP 來開機 Linux。 </para> </footnote>。您也可以直接在 SRM 控制台中直接輸入網路介面的 IP 設定。

source: The Trivial File Transfer Protocol (TFTP) is used to serve the boot image to the client. Theoretically, any server, on any platform, which implements these protocols, may be used. In the examples in this section, we shall provide commands for SunOS 4.x, SunOS 5.x (a.k.a. Solaris), and GNU/Linux.
el: Το πρωτόκολλο TFTP (Trivial File Transfer Protocol) χρησιμοποιείται για το σερβίρισμα της εικόνας εκκίνησης στον "πελάτη". Θεωρητικά, οποιοσδήποτε server, σε οποιαδήποτε πλατφόρμα, που υλοποιεί αυτά τα πρωτόκολλα, μπορεί να χρησιμοποιηθεί. Στα παραδείγματα αυτής της ενότητας, θα δώσουμε εντολές για SunOS 4.x, SunOS 5.x (δηλ. το Solaris), και GNU/Linux.
ko: Trivial File Transfer Protocol은 (TFTP) 부팅 이미지를 클라이언트에게 넘겨줄 때 사용합니다. 이론상 이 프로토콜을 사용한다면 어떤 플랫폼의 어떤 서버라도 사용할 수 있습니다. 여기서는 SunOS 4.x, SunOS 5.x (Solaris), 그리고 GNU/Linux에서 사용하는 명령을 예로 듭니다.
pt: O Trivial File Transfer Protocol (TFTP) é utilizado para servir a imagem de arranque para o cliente. Teoricamente, qualquer servidor, em qualquer plataforma, que implemente estes protocolos, pode ser utilizado. Nos exemplos desta sessão, iremos disponibilizar comandos para for SunOS 4.x, SunOS 5.x (a.k.a. Solaris), e GNU/Linux.
ru: Trivial File Transfer Protocol (TFTP) используется для загрузки загрузочного образа на клиентскую машину. Теоретически, можно использовать любой сервер на любой платформе, которая реализует эти протоколы. В примерах этого раздела мы используем команды из SunOS 4.x, SunOS 5.x (так называемый Solaris) и GNU/Linux.
zh_cn: 普通文件传输协议(Trivial File Transfer Protocol (TFTP))被用于为客户提供引导映像。理论上，任意服务器，在任意平台上只要实现了这些协议就都能够被应用。在这一节的一些例子里面，我们将提供在 SunOS 4.x、SunOS 5.x (即 Solaris) 和 GNU/Linux 上面的一些操作例子。
zh_tw: 普通檔案傳輸協定 (Trivial File Transfer Protocol, TFTP) 能為客戶端提供開機映像。理論上，任何伺服器，在任何平台上只要實做這些協定就都能夠被應用。在這一節的一些例子裡面，我們將提供在 SunOS 4.x、SunOS 5.x (即 Solaris) 和 GNU/Linux 上面的一些操作例子。

source: To use the Pre-boot Execution Environment (PXE) method of TFTP booting, you will need a TFTP server with <userinput>tsize</userinput> support. On a &debian; server, the <classname>atftpd</classname> and <classname>tftpd-hpa</classname> packages qualify; we recommend <classname>tftpd-hpa</classname>.
el: Για να χρησιμοποιήσετε την μέθοδο Pre-boot Execution Environment (PXE) για εκκίνηση με TFTP, θα χρειαστείτε έναν εξυπηρετητή TFTP με υποστήριξη <userinput>tsize</userinput>. Σε έναν &debian; server, τα πακέτα <classname>atftpd</classname> είναι<classname>tftpd-hpa</classname> κατάλληλα; συνιστούμε επίσης το πακέτο <classname>tftpd-hpa</classname>.
ko: TFTP 부팅에서 Pre-boot Execution Environment (PXE) 방식을 사용하려면, <userinput>tsize</userinput>를 지원하는 TFTP 서버가 있어야 합니다. &debian; 서버에서는, <classname>atftpd</classname> 및 <classname>tftpd-hpa</classname> 꾸러미가 이 기능을 지원합니다. <classname>tftpd-hpa</classname>를 권장합니다.
pt: Para utilizar o método Pre-boot Execution Environment (PXE), vai necessitar de um servidor TFTP com suporte <userinput>tsize</userinput>. Num servidor &debian;, os pacotes <classname>atftpd</classname> e <classname>tftpd-hpa</classname> permitem-no; nós recomendamos <classname>tftpd-hpa</classname>.
ru: Для использования загрузки по TFTP в методе Pre-boot Execution Environment (PXE) , вам нужен TFTP сервер с поддержкой <userinput>tsize</userinput>. На сервере &debian; этому условию удовлетворяют пакеты <classname>atftpd</classname> и <classname>tftpd-hpa</classname>; мы рекомендуем <classname>tftpd-hpa</classname>.
zh_cn: 如果想用 TFTP 的 Pre-boot Execution Environment (PXE) 方式启动，您将需要一台支持 <userinput>tsize</userinput> 的 TFTP 服务器。在 &debian; 服务器上，<classname>atftpd</classname> 和 <classname>tftpd-hpa</classname> 包符合此要求，我们推荐 <classname>tftpd-hpa</classname>。
zh_tw: 如果想用 TFTP 的 Pre-boot Execution Environment (PXE) 方式啟動，您將需要一台支援 <userinput>tsize</userinput> 的 TFTP 伺服器。在 &debian; 伺服器上，<classname>atftpd</classname> 和 <classname>tftpd-hpa</classname>套件符合此要求，我們建議使用 <classname>tftpd-hpa</classname>。

source: Setting up RARP server
el: Ρυθμίζοντας έναν εξυπηρετητή RARP
ko: RARP 서버 준비하기
pt: Configurar o servidor RARP
ru: Настройка RARP сервера
zh_cn: 设置 RARP 服务器
zh_tw: 設置 RARP 伺服器

source: To setup RARP, you need to know the Ethernet address (a.k.a. the MAC address) of the client computers to be installed. If you don't know this information, you can <phrase arch="sparc"> pick it off the initial OpenPROM boot messages, use the OpenBoot <userinput>.enet-addr</userinput> command, or </phrase> boot into <quote>Rescue</quote> mode (e.g., from the rescue floppy) and use the command <userinput>/sbin/ifconfig eth0</userinput>.
el: Για να ρυθμίσετε έναν server RARP, θα πρέπει να ξέρετε την διεύθυνση Ethernet (αλλιώς διεύθυνση MAC) των συστημάτων πελατών όπου θα γίνουν οι εγκαταστάσεις. Αν δεν ξέρετε αυτήν την πληροφορία, μπορείτε:<phrase arch="sparc"> να την εντοπίσετε από τα αρχικά μηνύματα στην εκκίνηση της OpenPROM, να χρησιμοποιήσετε την εντολή OpenBoot <userinput>.enet-addr</userinput>, ή </phrase> να εκκινήσετε σε κατάσταση <quote>Rescue</quote> (πχ., από μια δισκέττα διάσωσης (rescue floppy) και να χρησιμοποιήσετε την εντολή <userinput>/sbin/ifconfig eth0</userinput>.
ko: RARP를 설정하려면, 설치하려는 클라언트 컴퓨터의 이더넷 주소를 (다른 말로 MAC 주소) 알아야 합니다. 이 정보를 모른다면, <phrase arch="sparc"> OpenPROM 부팅 메세지에서 보고 알아낼 수도 있고, OpenBoot <userinput>.enet-addr</userinput> 명령을 사용할 수도 있고, 아니면 </phrase> <quote>응급 복구</quote> 모드로 부팅해서 (예를 들어 응급 복구 플로피로) <userinput>/sbin/ifconfig eth0</userinput> 명령을 이용할 수 있습니다.
pt: Para configurar RARP, necessita saber o endereço de Ethernet (a.k.a. o endereço MAC) do computador cliente a ser instalado. Se não sabe esta informação, pode encontra-la <phrase arch="sparc"> nas mensagens de arranque do OpenPROM inicial, use o comando OpenBoot <userinput>.enet-addr</userinput>, ou </phrase> arranque no modo <quote>Rescue</quote> (ex.:, a partir da disquete de recuperação) e utilize o comando <userinput>/sbin/ifconfig eth0</userinput>.
ru: Для настройки RARP вам нужно знать Ethernet адрес (так называемый MAC адрес) клиентского компьютера, на который будет выполняться установка. Если вы не знаете адреса, то можете <phrase arch="sparc"> получить её из сообщений начальной загрузки OpenPROM, воспользоваться командой OpenBoot <userinput>.enet-addr</userinput> или </phrase> загрузиться в <quote>Rescue</quote> режиме (например, со спасательной дискеты) и выполнить команду <userinput>/sbin/ifconfig eth0</userinput>.
zh_cn: 为了设置 RARP ,您需要知道需要安装系统的客户机的以太网卡地址(网卡 MAC 地址)。如果您还不知道这个信息，可以<phrase arch="sparc">从 OpenPROM 的初始化引导信息中获得，请使用 OpenBoot <userinput>.enet-addr</userinput> 命令，或者</phrase> 启动进入<quote>Rescue</quote>模式(例如使用回复软盘)并且使用 <userinput>/sbin/ifconfig eth0</userinput> 命令。
zh_tw: 為了設置 RARP ,您需要知道欲安裝系統的客戶端的以太網卡位址 (網卡 MAC 位址)。 如果您還不知道這個資訊，可以<phrase arch="sparc">從 OpenPROM 的初始化開機資訊中取得，請使用 OpenBoot <userinput>.enet-addr</userinput> 指令，或者</phrase>開機進入 <quote>Rescue</quote> 模式 (例如使用回復軟碟) 並且使用 <userinput>/sbin/ifconfig eth0</userinput> 指令。

source: On a RARP server system using a Linux 2.2.x kernel, you need to populate the kernel's RARP table. To do this, run the following commands: <informalexample><screen> # <userinput>/sbin/rarp -s <replaceable>client-hostname</replaceable> <replaceable>client-enet-addr</replaceable></userinput> # <userinput>/usr/sbin/arp -s <replaceable>client-ip</replaceable> <replaceable>client-enet-addr</replaceable></userinput> </screen></informalexample> If you get <informalexample><screen> SIOCSRARP: Invalid argument </screen></informalexample> you probably need to load the RARP kernel module or else recompile the kernel to support RARP. Try <userinput>modprobe rarp</userinput> and then try the <command>rarp</command> command again.
el: Σε ένα σύστημα server RARP που χρησιμοποιεί πυρήνα Linux 2.2.x, θα πρέπει να "γεμίσετε" με τιμές τον πίνακα RARP του πυρήνα. Για να το κάνετε αυτό, τρέξτε τις ακόλουθες εντολές: <informalexample><screen> # <userinput>/sbin/rarp -s <replaceable>client-hostname</replaceable> <replaceable>client-enet-addr</replaceable></userinput> # <userinput>/usr/sbin/arp -s <replaceable>client-ip</replaceable> <replaceable>client-enet-addr</replaceable></userinput> </screen></informalexample> Αν πάρετε ένα μήνυμα λάθους <informalexample><screen> SIOCSRARP: Invalid argument </screen></informalexample> πιθανόν να πρέπει να φορτώσετε το RARP module του πυρήνα ή να ξαναχτίσετε τον πυρήνα με υποστήριξη για RARP. Δοκιμάστε την εντολή <userinput>modprobe rarp</userinput> και μετά την εντολή <command>rarp</command> ξανά.
ko: 리눅스 2.2.x 커널을 사용하는 RARP 서버 시스템에서는, 커널의 RARP 테이블을 조정해야 합니다. 그렇게 하려면 다음 명령을 실행하십시오: <informalexample><screen> # <userinput>/sbin/rarp -s <replaceable>client-hostname</replaceable> <replaceable>client-enet-addr</replaceable></userinput> # <userinput>/usr/sbin/arp -s <replaceable>client-ip</replaceable> <replaceable>client-enet-addr</replaceable></userinput> </screen></informalexample> 만약 다음과 같은 에러가 발생하면: <informalexample><screen> SIOCSRARP: Invalid argument </screen></informalexample> 그러면 RARP 커널 모듈을 읽어들이거나 RARP를 지원하도록 커널을 다시 컴파일해야 할 겁니다. <userinput>modprobe rarp</userinput> 명령을 실행하고 <command>rarp</command> 명령을 실행해 보십시오.
pt: Num sistema servidor RARP com um kernel Linux 2.2.x, você necessita de povoar a tabela RARP do kernel. Para fazer isto, execute os seguintes comandos: <informalexample><screen> # <userinput>/sbin/rarp -s <replaceable>client-hostname</replaceable> <replaceable>client-enet-addr</replaceable></userinput> # <userinput>/usr/sbin/arp -s <replaceable>client-ip</replaceable> <replaceable>client-enet-addr</replaceable></userinput> </screen></informalexample> Se obtiver <informalexample><screen> SIOCSRARP: Invalid argument </screen></informalexample> você provavelmente necessita de carregar o módulo RARP do kernel ou então recompilar o kernel para suportar RARP. Tente <userinput>modprobe rarp</userinput> e em seguida tente novamente o comando <command>rarp</command>.
ru: Если система с RARP сервером использует ядро Linux 2.2.x, то вам необходимо заполнить RARP таблицу ядра. Чтобы сделать это, выполните следующие команды: <informalexample><screen> # <userinput>/sbin/rarp -s <replaceable>client-hostname</replaceable> <replaceable>client-enet-addr</replaceable></userinput> # <userinput>/usr/sbin/arp -s <replaceable>client-ip</replaceable> <replaceable>client-enet-addr</replaceable></userinput> </screen></informalexample> Если вы получили <informalexample><screen> SIOCSRARP: Invalid argument </screen></informalexample> то вероятно, нужно загрузить модуль RARP ядра или пересобрать ядро с поддержкой RARP. Попробуйте <userinput>modprobe rarp </userinput>, а затем попробуйте команду <command>rarp</command> ещё раз.
zh_cn: 在使用 Linux 2.2.x 内核的 RARP 服务器系统上，您需要通以下的命令来植入内核 RARP 表： <informalexample><screen> # <userinput>/sbin/rarp -s <replaceable>client-hostname</replaceable> <replaceable>client-enet-addr</replaceable></userinput> # <userinput>/usr/sbin/arp -s <replaceable>client-ip</replaceable> <replaceable>client-enet-addr</replaceable></userinput> </screen></informalexample> 如果看到 <informalexample><screen> SIOCSRARP: Invalid argument </screen></informalexample> 您可能需要加载 RARP 内核模块或重新编译内核并使之支持 RARP。试试在运行 <userinput>modprobe rarp</userinput> 命令后再尝试一遍 <command>rarp</command> 命令。
zh_tw: 在使用 Linux 2.2.x 核心的 RARP 伺服器系統上，您需要以下的指令來載入核心 RARP 表： <informalexample><screen> # <userinput>/sbin/rarp -s <replaceable>client-hostname</replaceable> <replaceable>client-enet-addr</replaceable></userinput> # <userinput>/usr/sbin/arp -s <replaceable>client-ip</replaceable> <replaceable>client-enet-addr</replaceable></userinput> </screen></informalexample> 如果您得到如下資訊 <informalexample><screen> SIOCSRARP: Invalid argument </screen></informalexample> 您可能需要掛載 RARP 核心模組或重新編譯核心並使之支援 RARP。試試在執行 <userinput>modprobe rarp</userinput> 指令後再嘗試一遍 <command>rarp</command> 指令。

source: On a RARP server system using a Linux 2.4.x kernel, there is no RARP module, and you should instead use the <command>rarpd</command> program. The procedure is similar to that used under SunOS in the following paragraph.
el: Σε ένα σύστημα με RARP server που χρησιμοποιεί πυρήνα Linux 2.4.x, δεν υπάρχει RARP module, και θα έπρεπε αντί γι' αυτό να χρησιμοποιήσετε το πρόγραμμα <command>rarpd</command>. Η διαδικασία είναι παρόμοια με αυτήν που χρησιμοποιείται για το SunOS στην επόμενη παράγραφο.
ko: 리눅스 2.4.x 커널을 사용하는 RARP 서버 시스템에서는, RARP 모듈이 없는 대신 <command>rarpd</command> 프로그램을 사용해야 합니다. 그 다음 과정은 SunOS에서 사용하는 방법과 비슷합니다.
pt: Num sistema servidor RARP usando um kernel Linux 2.4.x, não existe nenhum módulo RARP, e você deve usar o programa <command>rarpd</command>. O procedimento é similar ao que é utilizado em SunOS no próximo parágrafo.
ru: В системе с RARP сервером использующей ядро Linux 2.4.x нет RARP модуля, а вместо него вы должны использовать программу <command>rarpd</command>. Процедура очень похожа на ту, которая используется в SunOS из следующего параграфа.
zh_cn: 使用 Linux 2.4.x 内核的 RARP 服务器系统上并没有 RARP 模块，您应该使用 <command>rarpd</command> 程序替代。操作过程很类似下面将提到的在 SunOS 上的用法。
zh_tw: 使用 Linux 2.4.x 核心的 RARP 伺服器系統上並沒有 RARP 模組，您應該使用 <command>rarpd</command> 程式替代。操作過程很類似下面將提到的在 SunOS 上的用法。

source: Under SunOS, you need to ensure that the Ethernet hardware address for the client is listed in the <quote>ethers</quote> database (either in the <filename>/etc/ethers</filename> file, or via NIS/NIS+) and in the <quote>hosts</quote> database. Then you need to start the RARP daemon. In SunOS 4, issue the command (as root): <userinput>/usr/etc/rarpd -a</userinput>; in SunOS 5, use <userinput>/usr/sbin/rarpd -a</userinput>.
el: Για το λειτουργικό σύστημα SunOS, πρέπει να σιγουρευτείτε ότι η διεύθυνση της κάρτας Ethernet για τον πελάτη περιλαμβάνεται στη βάση <quote>ethers</quote> (είτε στο αρχείο <filename>/etc/ethers</filename>, είτε μέσω NIS/NIS+) και στην βάση ``hosts''. Στη συνέχεια θα πρέπει να ξεκινήσετε τον δαίμονα RARP. Στο σύστημα SunOS 4, δώστε την εντολή (σαν χρήστης root): <userinput>/usr/etc/rarpd -a</userinput>; στο SunOS 5, χρησιμοποιήστε την εντολή <userinput>/usr/sbin/rarpd -a</userinput>.
ko: SunOS에서는, 클라이언트의 이더넷 하드웨어 주소가 <quote>ethers</quote> 데이터베이스 (<filename>/etc/ethers</filename> 파일이나 NIS/NIS+를 통해) 및 <quote>hosts</quote> 데이터베이스에 들어 있어야 합니다. 그 다음에 RARP 데몬을 시작합니다. SunOS 4에서는, 다음 명령을 (루트로) 실행하십시오: <userinput>/usr/etc/rarpd -a</userinput>. SunOS 5에서는 <userinput>/usr/sbin/rarpd -a</userinput> 명령을 사용하십시오.
pt: Em SunOS, necessita de assegurar que o endereço do hardware de Ethernet para o cliente é listado na base de dados <quote>ethers</quote> (seja no ficheiro <filename>/etc/ethers</filename>, ou via NIS/NIS+) e na base de dados <quote>hosts</quote>. Em seguida precisa de iniciar o daemon RARP. Em SunOS 4, execute o comando (como root): <userinput>/usr/etc/rarpd -a</userinput>; em SunOS 5, use <userinput>/usr/sbin/rarpd -a</userinput>.
ru: В SunOS вам нужно проверить, что аппаратный адрес Ethernet клиента содержится в базе данных <quote>ethers</quote> (или в файле <filename>/etc/ethers</filename> или через NIS/NIS+) и базе данных <quote>hosts</quote>. Затем, вам нужно запустить демона RARP. В SunOS 4 выполните команду (от суперпользователя): <userinput>/usr/etc/rarpd -a</userinput>; в SunOS 5 используйте <userinput>/usr/sbin/rarpd -a</userinput>.
zh_cn: 在 SunOS 里, 您需要确定客户机的以太网硬件地址已经列在<quote>ethers</quote>数据库(在 <filename>/etc/ethers</filename> 文件中或者通过 NIS/NIS+)和<quote>hosts</quote>数据库中，然后您需要启动 RARP 守护程序，在 SunOS 4 里，使用(以 root 身份)： <userinput>/usr/etc/rarpd -a</userinput> 命令；在 SunOS 5 里，则使用 <userinput>/usr/sbin/rarpd -a</userinput> 命令。
zh_tw: 在 SunOS 裡, 您需要確定客戶端的以太網硬體位址已經列在 <quote>ethers</quote> 資料庫(在 <filename>/etc/ethers</filename> 檔案中或者透過 NIS/NIS+)和 ``hosts'' 資料庫中，然後您需要啟動 RARP 伺服程式，在 SunOS 4 裡，使用(以 root 身份)： <userinput>/usr/etc/rarpd -a</userinput> 指令﹔在 SunOS 5 裡，則使用 <userinput>/usr/sbin/rarpd -a</userinput> 指令。

source: Setting up BOOTP server
el: Ρυθμίζοντας έναν εξυπηρετητή BOOTP
ko: BOOTP 서버 준비하기
pt: Configurar o servidor BOOTP
ru: Настройка BOOTP сервера
zh_cn: 设置 BOOTP 服务器
zh_tw: 設置 BOOTP 伺服器

source: There are two BOOTP servers available for GNU/Linux, the CMU <command>bootpd</command> and the other is actually a DHCP server, ISC <command>dhcpd</command>, which are contained in the <classname>bootp</classname> and <classname>dhcp</classname> packages in &debian;.
el: Υπάρχουν δύο εξυπηρετητές BOOTP διαθέσιμοι για το GNU/Linux, ο CMU <command>bootpd</command> ενώ ο άλλος είναι στην πραγματικότητα ένας DHCP server, ο ISC <command>dhcpd</command>, που περιλαμβάνονται στα πακέτα <classname>bootp</classname> και <classname>dhcp</classname> στο &debian;.
ko: GNU/Linux용 BOOTP 서버는 두 가지가 있습니다. CMU <command>bootpd</command>가 있고, 그 외의 프로그램은 실제로 DHCP서버인, ISC <command>dhcpd</command>가 있습니다. ISC <command>dhcpd</command>는 &debian;의 <classname>bootp</classname>와 <classname>dhcp</classname> 꾸러미에 들어 있습니다.
pt: Existem disponíveis dois servidores BOOTP para GNU/Linux, o CMU <command>bootpd</command> e o outro é um servidor DHCP, o ISC <command>dhcpd</command>, que estão nos pacotes <classname>bootp</classname> e <classname>dhcp</classname> em &debian;.
ru: В GNU/Linux есть два BOOTP сервера: CMU <command>bootpd</command> и ISC <command>dhcpd</command> (на самом деле DHCP сервер); они находятся в пакетах <classname>bootp</classname> и <classname>dhcp</classname>.
zh_cn: 在 GNU/Linux 下面有两种 BOOTP 服务器。他们是 CMU <command>bootpd</command>和另外一种实际上是 DHCP 服务器的程序 ISC <command>dhcpd</command>，他们被包含在 &debian; 的 <classname>bootp</classname> 和 <classname>dhcp</classname> 软件包中。
zh_tw: 在 GNU/Linux 下面有兩種 BOOTP 伺服器。他們是 CMU <command>bootpd</command> 和另外一種實際上是 DHCP 伺服器的程式 ISC <command>dhcpd</command>，他們被包含在 &debian; 的 <classname>bootp</classname> 和 <classname>dhcp</classname> 軟體套件中。
