Repository: xobs/debian-installer
Catalog: doc/manual/po/*/install-methods.po
Languages: el, ko, pt, ru, zh_cn, zh_tw

source: SPARC architectures for instance use the subarchitecture names, such as <quote>SUN4M</quote> or <quote>SUN4C</quote>; in some cases, the architecture is left blank, so the file the client looks for is just <filename>client-ip-in-hex</filename>. Thus, if your system subarchitecture is a SUN4C, and its IP is 192.168.1.3, the filename would be <filename>C0A80103.SUN4C</filename>. An easy way to determine this is to enter the following command in a shell (assuming the machine's intended IP is 10.0.0.4). <informalexample><screen> $ printf '%.2x%.2x%.2x%.2x\n' 10 0 0 4 </screen></informalexample> This will spit out the IP in hexadecimal; to get to the correct filename, you will need to change all letters to uppercase and if necessary append the subarchitecture name.
el: Αρχιτεκτονικές SPARC χρησιμοποιούν για παράδειγμα τα ονόματα των υποαρχιτεκτονικών, όπως τα <quote>SUN4M</quote> ή <quote>SUN4C</quote>; σε μερικές περιπτώσεις, η αρχιτεκτονική αφήνεται κενή, οπότε το αρχείο που αναζητά ο πελάτης (client) είναι απλά η δεκαεξαδική διεύθυνσή του IP <filename>client-ip-in-hex</filename>. Επομένως, αν η υποαρχιτεκτονική σας είναι ένα σύστημα SUN4C, και η διεύθυνσή του IP είναι 192.168.1.3, το όνομα του αρχείου θα είναι <filename>C0A80103.SUN4C</filename>. Ένας εύκολος τρόπος για να την προσδιορίσετε είναι εισάγοντας την ακόλουθη εντολή σε ένα κέλυφος (υποθέτοντας ότι η επιθυμητή/επιδιωκόμενη διεύθυνση IP είναι 10.0.0.4). <informalexample><screen> $ printf '%.2x%.2x%.2x%.2x\n' 10 0 0 4 </screen></informalexample> Αυτό θα επιστρέψει την διεύθυνση IP σε δεκαεξαδική μορφή; για να πάρετε το σωστό όνομα αρχείου, θα χρειαστεί να αλλάξετε όλα τα γράμματα σε κεφαλαία και αν απαραίτητο και αν απαραίτητο να προσθέσετε στο τέλος το όνομα της υποαρχιτεκτονικής.
ko: 예를 들어 sparc 아키텍쳐에서는 서브 아키텍쳐 이름을 사용합니다. <quote>SUN4M</quote>, <quote>SUN4C</quote>과 같이 씁니다. 만약 아키텍쳐를 비워두면, 클라이언트에서 <filename>16진수-클라이언트-IP</filename>를 파일 이름으로 사용합니다. 시스템의 서브 아키텍쳐가 SUN4C이고 IP가 192.168.1.3이라면, 파일 이름은 <filename>C0A80103.SUN4C</filename>입니다. 이름을 알아내기 쉬운 방법은 쉘에서 다음 명령을 실행하는 것입니다: (기계의 IP가 10.0.0.4라고 가정) <informalexample><screen> $ printf '%.2x%.2x%.2x%.2x\n' 10 0 0 4 </screen></informalexample> 이렇게 하면 IP를 16진수로 표시합니다. 파일 이름은 모든 글자를 대문자로 바꿔야 하고 필요하다면 서브 아키텍쳐 이름을 뒤에 붙입니다.
pt: As Arquitecturas SPARC por exemplo utilizam os nome de sub-arquitecturas, tais como <quote>SUN4M</quote> ou <quote>SUN4C</quote>; Em alguns casos, a sub-arquitectura é deixada em branco, para que o ficheiro que o cliente procura é apenas <filename>client-ip-in-hex</filename>. Assim, se a sub-arquitectura do seu sistema for SUN4C, e o seu IP é 192.168.1.3, o nome do ficheiros será <filename>C0A80103.SUN4C</filename>. Uma maneira simples de determinar isto é executando o seguinte comando na consola (assumindo que o IP pretendido para a máquina é 10.0.0.4). <informalexample><screen> $ printf '%.2x%.2x%.2x%.2x\n' 10 0 0 4 </screen></informalexample> Isto irá mandar o IP em hexadecimal; para obter o nome do ficheiro correcto, necessitará de alterar todas as letras para maiúsculas e se necessário adicionar o nome da sub-arquitectura.
ru: На SPARC архитектурах используются имена субархитектур, например <quote>SUN4M</quote> или <quote>SUN4C</quote>; в некоторых случаях, имя архитектуры оставляют пустым, для того чтобы имя файла клиент искал просто как <filename>ip-клиента-в-шестнадцатеричной-форме</filename>. То есть, если система с субархитектурой SUN4C и IP адресом 192.168.1.3, то имя файла будет <filename>C0A80103.SUN4C</filename>. Простой способ его определения &mdash; это ввести следующую команду в оболочке командной строки (предполагается, что машине назначен IP адрес равный 10.0.0.4).<informalexample><screen> $ printf '%.2x%.2x%.2x%.2x\n' 10 0 0 4 </screen></informalexample> Она выведет октеты IP адреса в шестнадцатеричном виде; для получения правильного имени файла, вам нужно сделать все буквы заглавными и если нужно, добавить имя субархитектуры.
zh_cn: SPARC 体系通常使用子体系名称，比如<quote>SUN4M</quote>或者<quote>SUN4C</quote>。在某些情况下，体系名字也被留为空白，这时客户端所需要的文件仅仅是 <filename>client-ip-in-hex</filename>。因此，如果您的系统子体系是 SUN4C，其 IP 是 192.168.1.3，则文件名为 <filename>C0A80103.SUN4C</filename>。一个简易的确认方法是在 shell 中输入下列命令(假设机器的 IP 为 10.0.0.4)。<informalexample><screen> $ printf '%.2x%.2x%.2x%.2x\n' 10 0 0 4 </screen></informalexample> 它将 IP 写成十六进制。要得到正确的文件名，您应该将所有的子母改成大写，并在必要时加上子体系名。
zh_tw: SPARC 架構通常使用子架構名稱，例如 <quote>SUN4M</quote> 或者 <quote>SUN4C</quote>。在某些情況下，架構名字被留為空白，這時客戶端所需要的檔案僅僅是<filename>十六進位的客戶端 IP</filename>。因此，如果您的系統子架構是 SUN4C，其 IP 是 192.168.1.3，則檔案名為 <filename>C0A80103.SUN4C</filename>。一個簡易的確認方法是在 shell 中輸入下列指令 (假設機器的 IP 為 10.0.0.4)。 <informalexample><screen> $ printf '%.2x%.2x%.2x%.2x\n' 10 0 0 4 </screen></informalexample> 它將 IP 寫成十六進制。要得到正確的檔案名稱，您應該將所有的字母改成大寫並在必要時加上子架構名。

source: You can also force some sparc systems to look for a specific file name by adding it to the end of the OpenPROM boot command, such as <userinput>boot net my-sparc.image</userinput>. This must still reside in the directory that the TFTP server looks in.
el: Μπορείτε επίσης να αναγκάσετε μερικά συστήματα sparc να κοιτάξουν για ένα συγκεκριμένο όνομα αρχείου προσθέτοντάς το στο τέλος της εντολής εκκίνησης OpenPROM, όπως για παράδειγμα <userinput>boot net my-sparc.image</userinput>. Αυτό το αρχείο πρέπει να βρίσκεται ακόμα στον κατάλογο όπου ψάχνει ο server TFTP.
ko: 일부 sparc 시스템은 OpenPROM 부팅 명령 뒤에 특정 파일이름을 붙여서 이 파일을 찾도록 만들 수 있습니다. 예를 들어 <userinput>boot net my-sparc.image</userinput>. 파일은 TFTP 서버가 찾는 디렉토리 안에 들어 있어야 합니다.
pt: Pode também forçar alguns sistemas sparc a procurar por um nome de ficheiro especifico adicionando-o no final do comando de arranque OpenPROM, tal como <userinput>boot net my-sparc.image</userinput>. Isto tem de residir na directoria onde o servidor TFTP procura.
ru: Также вы можете заставить некоторые sparc системы брать имя файла из последнего параметра команды загрузки OpenPROM, например <userinput>boot net my-sparc.image</userinput>. Он всё ещё должен располагаться в каталоге, в котором его будет искать TFTP сервер.
zh_cn: 您也可以通过把一个特定的文件名附加到 OpenPROM boot 命令的结尾来强制某些 SPARC 系统使用它。比如 <userinput>boot net my-sparc.image</userinput>。不过它仍然必须被请放置在 TFTP 服务器要查找的目录中。
zh_tw: 您也可以透過把一個特定的檔案名稱附加到 OpenPROM boot 指令的結尾來強制某些 SPARC 系統使用它。例如 <userinput>boot net my-sparc.image</userinput>。不過它仍然必須被放置在 TFTP 伺服器要查找的目錄中。

source: BVM/Motorola TFTP Booting
el: Εκκίνηση TFTP για BVM/Motorola
ko: BVM/Motorola TFTP 부팅
pt: Iniciar TFTP em BVM/Motorola
ru: Загрузка BVM/Motorola по TFTP
zh_cn: BVM/Motorola TFTP 引导
zh_tw: BVM/Motorola TFTP 開機

source: For BVM and Motorola VMEbus systems copy the files &bvme6000-tftp-files; to <filename>/tftpboot/</filename>.
el: Για συστήματα BVM και Motorola VMEbus αντιγράψετε τα αρχεία &bvme6000-tftp-files; στον κατάλογο <filename>/tftpboot/</filename>.
ko: BVM 및 Motorola VMEbus 시스템에서는 &bvme6000-tftp-files; 파일을 <filename>/tftpboot/</filename> 디렉토리에 복사하십시오.
pt: Para sistemas BVM e Motorola VMEbus copie os ficheiros &bvme6000-tftp-files; para <filename>/tftpboot/</filename>.
ru: Для систем BVM и Motorola VMEbus скопируйте файлы &bvme6000-tftp-files; в каталог<filename>/tftpboot/</filename>.
zh_cn: 对于 BVM 以及 Motorola VMEbus 系统来说，请先将 &bvme6000-tftp-files; 文件拷贝到 <filename>/tftpboot/</filename>。
zh_tw: 對於 BVM 以及 Motorola VMEbus 系統來說，請先將 &bvme6000-tftp-files; 檔案拷貝到 <filename>/tftpboot/</filename>。

source: Next, configure your boot ROMs or BOOTP server to initially load the <filename>tftplilo.bvme</filename> or <filename>tftplilo.mvme</filename> files from the TFTP server. Refer to the <filename>tftplilo.txt</filename> file for your subarchitecture for additional system-specific configuration information.
el: Στη συνέχεια, ρυθμίστε τις μνήμες ROM εκκίνησης ή τον εξυπηρετητή BOOTP ώστε να φορτώσουν αρχικά τα αρχεία <filename>tftplilo.bvme</filename> ή <filename>tftplilo.mvme</filename> από τον εξυπηρετητή TFTP. Αναφερθείτε στο αρχείο <filename>tftplilo.txt</filename> της υποαρχιτεκτονικής σας για περισσότερες πληροφορίες σχετικά με τις ρυθμίσεις για συγκεκριμένα συστήματα.
ko: 그 다음에, 최초에 <filename>tftplilo.bvme</filename> 혹은 <filename>tftplilo.mvme</filename> 파일을 TFTP 서버에서 읽어들이도록 부팅 ROM과 BOOTP 서버를 설정하십시오. 해당 시스템 관련 설정에 관한 추가 정보는 해당 서브 아키텍쳐의 <filename>tftplilo.txt</filename> 파일을 참고하십시오.
pt: Em seguida, configure as suas ROMs de arranque ou servidor BOOTP para inicialmente carregar os ficheiros <filename>tftplilo.bvme</filename> ou <filename>tftplilo.mvme</filename> para a sua sub-arquitectura para informação adicional da configuração do sistema.
ru: Затем, настройте загрузку в ROM или в BOOTP на начальную загрузку файлов <filename>tftplilo.bvme</filename> или <filename>tftplilo.mvme</filename> с TFTP сервера. Обратитесь к файлу <filename>tftplilo.txt</filename> для вашей субархитектуры за дополнительной специфичной конфигурационной информацией.
zh_cn: 接下来，配置您的启动引导 ROM 或 BOOTP 服务器，使其从 TFTP 服务器中初始装入 <filename>tftplilo.bvme</filename> 或者 <filename>tftplilo.mvme</filename> 文件。请阅读 <filename>tftplilo.txt</filename> 文件来获得更多的关于您所使用的子体系的系统特殊配置信息。
zh_tw: 接下來，設定您的開機 ROM 或 BOOTP 伺服器，使其從 TFTP 伺服器載入 <filename>tftplilo.bvme</filename> 或者 <filename>tftplilo.mvme</filename> 檔案。請閱讀 <filename>tftplilo.txt</filename> 文字檔來取得更多的關於您所使用的子架構的系統特殊配置資訊。

source: SGI Indys TFTP Booting
el: Εκκίνηση TFTP για SGI Indy
ko: SGI Indy TFTP 부팅
pt: Iniciar TFTP em SGI Indys
ru: Загрузка SGI Indy по TFTP
zh_cn: SGI Indys TFTP 引导
zh_tw: SGI Indys TFTP 開機

source: On SGI Indys you can rely on the <command>bootpd</command> to supply the name of the TFTP file. It is given either as the <userinput>bf=</userinput> in <filename>/etc/bootptab</filename> or as the <userinput>filename=</userinput> option in <filename>/etc/dhcpd.conf</filename>.
el: Σε συστήματα SGI Indy μπορείτε να στηριχθείτε στον δαίμονα <command>bootpd</command> για την προμήθεια του ονόματος του αρχείου TFTP. Δίνεται είτε σαν το δεδομένο <userinput>bf=</userinput> στο αρχείο <filename>/etc/bootptab</filename> ή σαν η επιλογή <userinput>filename=</userinput> στο αρχείο <filename>/etc/dhcpd.conf</filename>.
ko: SGI Indy에서는 <command>bootpd</command> 명령만을 이용해서 TFTP 파일 이름을 넙깁니다. 파일 이름은 <filename>/etc/bootptab</filename> 파일의 <userinput>bf=</userinput> 혹은 <filename>/etc/dhcpd.conf</filename> 파일의 <userinput>filename=</userinput> 옵션으로 지정합니다.
pt: Em Indys da SGI pode confiar em <command>bootpd</command> para fornecer o nome do ficheiro TFTP. É dado seja em <userinput>bf=</userinput> <filename>/etc/bootptab</filename> ou como opção <userinput>filename=</userinput> em <filename>/etc/dhcpd.conf</filename>.
ru: На SGI Indy вы можете положиться на <command>bootpd</command> передав имяTFTP файла. Оно задаётся или как <userinput>bf=</userinput> в <filename>/etc/bootptab</filename> или как параметр <userinput>filename=</userinput> в <filename>/etc/dhcpd.conf</filename>.
zh_cn: 在 SGI Indys 上您可以采用 <command>bootpd</command> 来给出 FTFP 文件的名字。它既可以是以 <userinput>bf=</userinput> 形式在 <filename>/etc/bootptab</filename> 文件中设定，也可以是以 <userinput>filename=</userinput> 选项形式出现于 <filename>/etc/dhcpd.conf</filename>。
zh_tw: 在 SGI Indys 上您可以採用 <command>bootpd</command> 來提供檔案名稱給 TFTP。它既可以是在 <filename>/etc/bootptab</filename> 檔案中設定 <userinput>bf=</userinput>，也可以是 <filename>/etc/dhcpd.conf</filename> 中的 <userinput>filename=</userinput>選項。

source: Broadcom BCM91250A TFTP Booting
el: Εκκίνηση TFTP με Broadcom BCM91250A
ko: Broadcom BCM91250A TFTP 부팅
pt: Iniciar TFTP em Broadcom BCM91250A
ru: Загрузка Broadcom BCM91250A по TFTP
zh_cn: Broadcom BCM91250A TFTP 引导
zh_tw: Broadcom BCM91250A TFTP 開機

source: You don't have to configure DHCP in a special way because you'll pass the full path of the file to the loaded to CFE.
el: Δεν χρειάζεται να κάνετε κάποια ειδική ρύθμιση για το DHCP επειδή θα περάσετε την πλήρη διαδρομή για το αρχείο που θα φορτωθεί στο CFE.
ko: CFE로 읽어들일 파일의 전체 경로를 넘기기 때문에 DHCP를 특별히 설정할 필요가 없습니다.
pt: Não tem de configurar o DHCP de uma maneira especial porque irá passar o caminho absoluto do ficheiro para o CFE.
ru: Не требуется как-то особенно настраивать DHCP, кроме как передать CFE полный путь к файлу для загрузки.
zh_cn: 您不需要通过特殊方法配置 DHCP，因为您将传递文件的完全路径至装载的 CFE 。
zh_tw: 您不需要透過特殊方法設定 DHCP，因為您要把要載入到 CFE 的檔案完全路徑傳送出去。

source: Automatic Installation
el: Αυτόματη Εγκατάσταση
ko: 자동 설치
pt: Instalação Automática
ru: Автоматическая установка
zh_cn: 自动化安装
zh_tw: 自動化安裝

source: For installing on multiple computers it's possible to do fully automatic installations. Debian packages intended for this include <classname>fai</classname> (which uses an install server), <classname>replicator</classname>, <classname>systemimager</classname>, <classname>autoinstall</classname>, and the Debian Installer itself.
el: Για εγκατάσταση σε πολλαπλούς υπολογιστές είναι δυνατό να πραγματοποιήσουμε πλήρως αυτοματοποιημένες εγκαταστάσεις. Πακέτα Debian που στοχεύουν σε αυτό περιλαμβάνουν: <classname>fai</classname> (που χρησιμοποιεί έναν εξυπηρετητή εγκατάστασης), <classname>replicator</classname>, <classname>systemimager</classname>, <classname>autoinstall</classname>, και τον ίδιο τον Debian Installer.
ko: 여러 컴퓨터에 설치하려면 완전 자동 설치를 사용할 수도 있습니다. 이런 목적을 위한 데비안 꾸러미는 <classname>fai</classname> (설치 서버 사용), <classname>replicator</classname>, <classname>systemimager</classname>, <classname>autoinstall</classname>이 있고, 데비안 설치 프로그램 자체를 사용할 수도 있습니다.
pt: Para instalar em vários computadores é possível fazer uma instalação completamente automática. Os pacotes Debian destinados a isto incluem <classname>fai</classname> (que utiliza um servidor de instalação), <classname>replicator</classname>, <classname>systemimager</classname>, <classname>autoinstall</classname>, e o próprio instalador Debian.
ru: Для установки на несколько компьютеров можно воспользоваться автоматической установкой. Необходимые пакеты Debian: <classname>fai</classname> (используется сервером установки), <classname>replicator</classname>, <classname>systemimager</classname>, <classname>autoinstall</classname> и сама программа установки Debian.
zh_cn: 对于有多台需要安装的计算机的情况，可以采用全自动安装的方式。用于此项任务的 Debian 软件包有 <classname>fai</classname>(需要使用一台安装服务器)，<classname>replicator</classname>、<classname>systemimager</classname>、<classname>autoinstall</classname>，以及 Debian 安装程序本身。
zh_tw: 對於有多台電腦需要安裝的情況，可以採用全自動安裝的方式。用於此項工作的 Debian 軟體套件有 <classname>fai</classname> (需要使用一台安裝伺服器)， <classname>replicator</classname>、 <classname>systemimager</classname>、 <classname>autoinstall</classname>，以及 Debian 安裝程式本身。

source: Automatic Installation Using the Debian Installer
el: Αυτόματη εγκατάσταση με χρήση του Debian Installer
ko: 데비안 설치 프로그램을 이용한 자동 설치
pt: Instalação Automática Utilizando o Instalador Debian
ru: Автоматическая установка с помощью программы установки Debian
zh_cn: 使用 Debian 安装程序进行自动安装
zh_tw: 使用 Debian 安裝程式進行自動安裝

source: The Debian Installer supports automating installs via preconfiguration files. A preconfiguration file can be loaded from the network or from removable media, and used to fill in answers to question asked during the installation process.
el: Ο Debian Installer υποστηρίζει αυτοματοποίηση εγκαταστάσεων με τη βοήθεια αρχείων προρύθμισης. Ένα τέτοιο αρχείο μπορεί να φορτωθεί από το δίκτυο ή από αφαιρούμενα μέσα και να χρησιμοποιηθεί για να δοθούν απαντήσεις σε ερωτήσεις στη διάρκεια της διαδικασίας εγκατάστασης.
ko: 데비안 설치 프로그램은 미리 설정해 놓은 파일을 이용해서 자동 설치를 지원합니다. 미리 설정해 놓은 파일은 네트워크 혹은 이동식 미디어로 읽어들일 수 있습니다. 이 파일 안에는 설치 과정에서 나오는 질문에 대한 대답들이 들어 있습니다.
pt: O Instalador Debian suporta instalações automáticas via ficheiros pré-configurados. Um ficheiro pré-configurado pode ser carregado a partir da rede ou a partir de um meio amovível, e utiliza-o para preencher as respostas às perguntas feitas durante o processo de instalação.
ru: Программа установки Debian поддерживает автоматическую установку через файл автоматической установки. Файл автоматической установки может быть загружен по сети или со сменного носителя, и используется для ответов на вопросы, задаваемые во время процесса установки.
zh_cn: Debian 安装程序支持通过预先配置文件进行自动安装。一个预配置文件可以从网络上或者可移动介质上被装载，并且被用来在安装过程中自动回答问题。
zh_tw: Debian 安裝程式支援透過預先設定檔進行自動安裝。一個預先設定檔可以從網路上或者可從移動媒介上載入，並且被用來在安裝過程中自動回答問題。

source: Although most dialogs used by &d-i; can be preseeded using this method, there are some notable exceptions. You can (re)partition an entire disk or use available free space on a disk; it is not possible to use existing partitions. You currently cannot use preseeding to set up RAID and LVM. <phrase condition="sarge">Also, with the exception of network driver modules, it is not possible to preconfigure kernel module parameters.</phrase>
el: Αν και οι περισσότεροι διάλογοι που χρησιμοποιούνται από τον &d-i; μπορούν να γίνουν preseeded χρησιμοποιώντας αυτή τη μέθοδο, υπάρχουν μερικές αξιοσημείωτες εξαιρέσεις. Είναι δυνατόν να (επανα)διαμερίσετε έναν ολόκληρο δίσκο ή να χρησιμοποιήσετε διαθέσιμο ελεύθερο χώρο σε έναν δίσκο, αλλά δεν είναι δυνατόν να χρησιμοποιήσετε υπάρχουσες κατατμήσεις. Δεν μπορείτε προς το παρόν να κάνετε preseeding για να διαμορφώσετε RAID ή LVM. <phrase condition="sarge"> Επίσης, και με την εξαίρεση των αρθρωμάτων των οδηγών δικτύου, δεν είναι δυνατόν να προρυθμίσετε τις παραμέτρους αρθρωμάτων του πυρήνα.</phrase>
ko: &d-i;에서 사용하는 대화 상자는 대부분 이 방법을 이용해 미리 설정되어 있지만, 몇가지 중요한 예외가 있습니다. 전체 디스크 혹은 빈 공간을 (다시) 파티션할 수 있습니다. 기존의 파티션을 이용할 수는 없습니다. 현재는 RAID나 LVM 설정을 미리 설정할 수 없습니다. <phrase condition="sarge">또 네트워크 드라이버 모듈을 제외하면 커널 모듈 파라미터는 미리 설정할 수 없습니다.</phrase>
pt: Embora a maioria das caixas de diálogo utilizadas pelo &d-i; possa ser feito o preseed utilizando este método, existem algumas notáveis excepções. Você pode (re)particionar um disco rígido completo ou utilizar o espaço livre num disco; não é possível utilizar partições existentes. Actualmente você não pode utilizar o preseed para configurar LVM e RAID. <phrase condition="sarge">Além disso, com a excepção dos módulos do driver de rede, não é possível pré-configurar parâmetros de módulos do kernel.</phrase>
ru: Хотя большинство диалогов &d-i; могут быть заполнены автоматически, есть несколько исключений. Вы можете переразмечать весь диск или использовать только его свободное пространство, но невозможно использовать существующие разделы. В настоящий момент невозможно автоматически настроить RAID и LVM. <phrase condition="sarge">Также, за исключением сетевых модулей ядра, невозможна предварительная настройка параметров модулей ядра.</phrase>
zh_cn: 虽然大多数 &d-i; 使用的对话框可以用这种方法预置，但还是有明显的例外。您可以(重新)分区整个硬盘或使用磁盘上可用的闲置空间; 但无法使用已存在的分区。当前还无法预先设置 RAID 和 LVM。<phrase condition="sarge">还有，网络驱动模块，也无法预先设置内核模块参数。</phrase>
zh_tw: 雖然大多 &d-i; 使用的對話框可以用這種方法預設，但還是有明顯的例外。目前還無法預設 RAID 和 LVM。另外還有，網路驅動模組，也無法預先設置核心模組參數。

source: The preconfiguration file is in the format used by the debconf-set-selections command. A well documented and working example that you can edit is in <xref linkend="example-preseed"/>.
el: Το αρχείο προρυθμίσεων είναι σε μορφή που χρησιμοποιείται από την εντολή debconf-set-selections. Ένα καλά τεκμηριωμένο και πραγματικό παράδειγμα που μπορείτε να εκδόσετε είναι το <xref linkend="example-preseed"/>.
ko: 미리 설정해 놓은 파일은 debconf-set-selections 명령에서 사용하는 형식으로 되어 있습니다. <xref linkend="example-preseed"/>에 보면 잘 설명되어 있고 동작하는 예제 파일이 있습니다.
pt: O ficheiro da pré-configuração está num formato utilizado pelo comando debconf-set-selections. Um exemplo bem documentado e funcional que pode editar encontra-se na <xref linkend="example-preseed"/>.
ru: Файл автоматической установки содержит команды, которые понимает программа debconf-set-selections. Хорошо документированный и рабочий пример, который вы можете отредактировать, находится в <xref linkend="example-preseed"/>.
zh_cn: 预配置文件是按照 debconf-set-selections 命令的格式写成的。这里有一个具有详尽注释并能正常工作的预配置文件例子：<xref linkend="example-preseed"/>。
zh_tw: 預先設定檔是按照 debconf-set-selections 指令的格式寫成的。這裡有一個具有詳盡註解並能正常工作的預先設定檔例子：<xref linkend="example-preseed"/>。
