Repository: xobs/debian-installer
Catalog: doc/manual/po/*/installation-howto.po
Languages: el, pt, ru, zh_cn, zh_tw

source: The easiest way to prepare your USB memory stick is to download <filename>hd-media/boot.img.gz</filename>, and use gunzip to extract the 128 MB image from that file. Write this image directly to your memory stick, which must be at least 128 mb in size. Of course this will destroy anything already on the memory stick. Then mount the memory stick, which will now have a FAT filesystem on it. Next, download a Debian netinst CD image, and copy that file to the memory stick; any filename is ok as long as it ends in <literal>.iso</literal>.
el: Ο ευκολότερος τρόπος προετοιμασίας του USB stick είναι με τη μεταφόρτωση του αρχείου<filename>hd-media/boot.img.gz</filename>, και τη χρήση της εντολής gunzip για την εξαγωγή του μεγέθους 128 MB ειδώλου από το αρχείο. Γράψτε το είδωλο αυτό απευθείας στο stick, το οποίο πρέπει να έχει χωρητικότητα τουλάχιστον 128 mb. Βεβαίως αυτό θα καταστρέψει όλα τα υπάρχοντα δεδομένα στο stick. Στη συνέχεια,προσαρτήστε το stick, το οποίο θα έχει πλέον ένα σύστημα αρχείων FAT. Κατόπιν, μεταφορτώστε ένα είδωλο CD Debian netinst, και αντιγράψτε αυτό το αρχείο στο stick. Μπορείτε να μετονομάσετε το είδωλο, φτάνει να διατηρήσετε την κατάληξη <literal>.iso</literal>.
pt: A maneira mais fácil de preparar o seu stick de memória USB é fazer o download de <filename>hd-media/boot.img.gz</filename>, e utilizar o gunzip para extrair a imagem de 128 MB desse ficheiro. Escreva essa imagem directamente para o seu stick de memória, que deve ter pelo menos 128 MB de capacidade. Naturalmente isto destruirá o que já estiver no stick de memória. Em seguida monte o stick de memória USB, que terá agora um sistema de ficheiros FAT. Em seguida, faça o download da imagem de CD Debian netinst, e copie esse ficheiro para o stick de memória; qualquer ficheiro é válido desde que termine em <literal>.iso</literal>.
ru: Самый лёгкий путь подготовки карты памяти USB &mdash; это загрузить <filename>hd-media/boot.img.gz</filename>, и использовать gunzip для распаковки образа размером в 128 МБ из этого файла. Запишите этот образ прямо на карту памяти, которая должна быть, по крайней мере, 128 МБ. Естественно, эта операция уничтожит все имеющиеся на ней данные. Затем смонтируйте карту памяти, которая теперь содержит файловую систему FAT . Далее, загрузите образ Debian netinst CD и скопируйте его на карту памяти; файл может называться как угодно, главное чтобы имя заканчивалось на <literal>.iso</literal>.
zh_cn: 要把您的 U 盘做成安装盘，最简单的办法就是下载 <filename>hd-media/boot.img.gz</filename>，然后用 gunzip 把这个文件解压，生成 128 MB 的映像文件。再把生成的映像文件直接写到 U盘。对了，这个 U 盘的容量至少要有 128 mb。当然了，上面所说的操作会把 U 盘里的原有数据全部毁掉。以后再挂载这个 U 盘的话，它上面就不再是 FAT 文件系统了。写完 U 盘后，接着要下载一个 Debian netinst CD 映像文件，再把这个映像拷贝到 U 盘里。哪个映像文件都可以用，只要它的文件名是 <literal>.iso</literal> 结尾的就行。
zh_tw: 要將 USB 隨身碟做成安裝工具，最簡單的辦法就是下載 <filename>hd-media/boot.img.gz</filename>，然後利用 gunzip 把這個檔案解壓，生成 128 MB 的映像檔，再將此映像檔寫到 USB 隨身碟， USB 隨身碟的容量至少要有 128 MB。上面所說的操作會把 USB 隨身碟裡的資料全部毀掉。以後掛載這個 USB 隨身碟的話，上面就不再是 FAT 檔案系統了。接下來我們要下載一個 Debian netinst 光碟映像檔，將這個映像檔拷貝到 USB 隨身碟。檔名沒有限制，只要結尾是 <literal>.iso</literal> 就可以。

source: There are other, more flexible ways to set up a memory stick to use the debian-installer, and it's possible to get it to work with smaller memory sticks. For details, see <xref linkend="boot-usb-files"/>.
el: Υπάρχουν κι άλλοι, πιο ευέλικτοι, τρόποι προετοιμασίας ενός memory stick ώστε να χρησιμοποιεί τον εγκαταστάτη debian, και είναι εφικτό να το επιτύχετε και για μικρότερου μεγέθους sticks. Για λεπτομέρειες δείτε το <xref linkend="boot-usb-files" />.
pt: Existem outras formas mais flexíveis para preparar o memory stick para utilizar o instalador debian, e é possível que funcione com um memory stick de menor capacidade. Para detalhes, visite a <xref linkend="boot-usb-files"/>.
ru: Существуют другие, более гибкие пути подготовки карт памяти для использования с debian-installer, также возможно использовать карту памяти меньшего объёма. Подробней смотрите <xref linkend="boot-usb-files"/>.
zh_cn: 除此之外，还有其它更为灵活的办法可以做出能启动 debian-installer 的 U 盘，同时也是有办法适用于较小容量的 U 盘的。欲知详情，请看 <xref linkend="boot-usb-files"/>。
zh_tw: 除此之外，還有其它更為彈性的方式可以做出能啟動 debian-installer 的 USB 隨身碟，且即使是較小容量的 USB 隨身碟亦可成功。欲知詳情，請看 <xref linkend="boot-usb-files"/>。

source: Some BIOSes can boot USB storage directly, and some cannot. You may need to configure your BIOS to boot from a <quote>removable drive</quote> or even a <quote>USB-ZIP</quote> to get it to boot from the USB device. If it doesn't, you can boot from one floppy and use the USB stick for the rest of the install. For helpful hints and details, see <xref linkend="usb-boot"/>.
el: Ορισμένα BIOS μπορούν να εκκινήσουν συσκευές αποθήκευσης USB απευθείας, ενώ άλλα όχι. Ίσως χρειαστεί να ρυθμίσετε το BIOS να εκκινήσει από <quote>removable drive</quote> ή ακόμα και <quote>USB-ZIP</quote> για να εκκινήσει από τη συσκευή USB. Αν δεν είναι εφικτό, μπορείτε να εκκινήσετε από μια δισκέττα και να χρησιμοποιήσετε το USB stick για το υπόλοιπο της εγκατάστασης. Για χρήσιμες συμβουλές και λεπτομέρειες, δείτε το <xref linkend="usb-boot" />.
pt: Algumas BIOS podem iniciar directamente de armazenamento USB, e outras não. Você pode ter de configurar a sua BIOS para iniciar de uma <quote>removable drive</quote> ou até de <quote>USB-ZIP</quote> para que inicie a partir do dispositivo USB. Se isso não acontecer, pode iniciar a partir de uma disquete e utilizar o stick USB para o resto da instalação. Para dicas úteis e detalhes, visite a <xref linkend="usb-boot"/>.
ru: Некоторые BIOS поддерживают загрузку непосредственно с USB, а некоторые нет. Вам может потребоваться настроить BIOS на загрузку с <literal>removable drive</literal> или даже с <literal>USB-ZIP</literal>, чтобы машина загрузилась с USB устройства. Если подобного пункта не существует, то вы можете загрузиться с одной дискеты, а для дальнейшей установки использовать карту памяти USB. Полезные подсказки и подробное описание смотрите в <xref linkend="usb-boot"/>.
zh_cn: 有些 BIOS 支持直接从 USB 的存储设备启动，但也有的 BIOS 不支持这种特性。您或许需要设置一下 BIOS 让您的机器从 <quote>removable drive</quote> 或是 <quote>USB-ZIP</quote> 启动，以使电脑能从 USB 设备启动。如果这样不奏效，您可以借助一张软盘启动，然后再用 U 盘完成后面的安装。您还可以发现一些有用的提示和具体的细节说明，参阅 <xref linkend="usb-boot"/>。
zh_tw: 有些 BIOS 支援直接透過 USB 隨身碟開機，但也有的 BIOS 不支援。您需要設定 BIOS 讓電腦從 <quote>removable drive</quote> 或是 <quote>USB-ZIP</quote> 開機，使得此電腦能從 USB 隨身碟啟動。如果這樣不奏效，您可以透過磁片開機，然後再用 USB 隨身碟完成之後的安裝。若需要一些有用的提示和細節說明，請參閱 <xref linkend="usb-boot"/>。

source: Booting Macintosh systems from USB storage devices involves manual use of Open Firmware. For directions, see <xref linkend="usb-boot"/>.
el: Για την εκκίνηση συστημάτων Macintosh από συσκευές αποθήκευσης USB απαιτείται χρήση του Open Firmware. Για οδηγίες, δείτε το <xref linkend="usb-boot" />.
pt: Iniciar sistemas Macintosh a partir de dispositivos USB envolve a utilização manual de Open Firmware. Para indicações, visite <xref linkend="usb-boot"/>.
ru: Загрузка систем Macintosh с устройств USB требует ручного использования Open Firmware. Подробнее смотрите <xref linkend="usb-boot"/>.
zh_cn: 从 Macintosh 系统上使用 USB 存储设备与使用 Open Fireware 相关。相关指导见 <xref linkend="usb-boot"/>。
zh_tw: 在 Macintosh 系統上使用 USB 隨身碟開機與手動使用 Open Fireware 有關。請參閱<xref linkend="usb-boot"/>。

source: Booting from network
el: Εκκίνηση από δίκτυο
pt: Iniciar a partir da rede
ru: Загрузка по сети
zh_cn: 从网络启动
zh_tw: 透過網路開機

source: It's also possible to boot &d-i; completely from the net. The various methods to netboot depend on your architecture and netboot setup. The files in <filename>netboot/</filename> can be used to netboot &d-i;.
el: Είναι δυνατόν να εκκινήσετε τον &d-i; απευθείας από το δίκτυο. Οι διάφορες μέθοδοι για αυτήν τη διαδικασία εξαρτώνται από την αρχιτεκτονική του υπολογιστή και τη ρύθμιση του netboot (συντ. "Δικτυακή Εκκίνηση"). Τα αρχεία στον κατάλογο <filename>netboot/</filename> μπορούν να χρησιμοποιηθούν για δικτυακή εκκίνηση του &d-i;.
pt: É também possível iniciar o &d-i; totalmente a partir da rede. Os vários métodos para netboot dependem da arquitectura e da configuração de netboot. Os ficheiros em <filename>netboot/</filename> podem ser utilizados para netboot &d-i;.
ru: &d-i; можно загрузить полностью из сети. Методы загрузки по сети (netboot) зависят от архитектуры и настройки сетевой загрузки. Файлы для загрузки &d-i; по сети лежат в каталоге <filename>netboot/</filename>.
zh_cn: 要完全从网络上启动(即 netboot) &d-i; 也是可行的。而具体采取哪种方法来从网络启动，这取决于您的硬件架构和网络启动的相关设置。在 <filename>netboot/</filename> 目录里的文件是用来从网络启动 &d-i; 的。
zh_tw: 要完全從網路上啟動(即 netboot) &d-i; 也是可行的。而採取哪種方法來從網路啟動取決於您的硬體架構和網路啟動的相關設定。在 <filename>netboot/</filename> 目錄裡的檔案是用來從網路啟動 &d-i; 。

source: Booting from hard disk
el: Εκκίνηση από σκληρό δίσκο
pt: Iniciar de disco rígido
ru: Загрузка с жёсткого диска
zh_cn: 从硬盘启动
zh_tw: 從硬碟開機

source: It's possible to boot the installer using no removable media, but just an existing hard disk, which can have a different OS on it. Download <filename>hd-media/initrd.gz</filename>, <filename>hd-media/vmlinuz</filename>, and a Debian CD image to the top-level directory of the hard disk. Make sure that the CD image has a filename ending in <literal>.iso</literal>. Now it's just a matter of booting linux with the initrd. <phrase arch="i386"> <xref linkend="boot-initrd"/> explains one way to do it. </phrase>
el: Είναι εφικτή η εκκίνηση του εγκαταστάτη χωρίς τη χρήση αφαιρούμενων μέσων, αλλά μόνο με έναν υπάρχον σκληρό δίσκο, που μπορεί να έχει ένα διαφορετικό λειτουργικό σύστημα. Μεταφορτώστε τα αρχεία <filename>hd-media/initrd.gz</filename>,<filename>hd-media/vmlinuz</filename>, και ένα είδωλο CD Debian στον κατάλογο υψηλότερου επιπέδου του σκληρού δίσκου. Σιγουρευτείτε ότι η εικόνα του CD έχει κατάληξη <literal>.iso</literal>. Τώρα είναι πλέον θέμα εκκίνησης του linux με το initrd.<phrase arch="i386">Το <xref linkend="boot-initrd" /> εξηγεί μία πιθανή μέθοδο.</phrase>
pt: É possível iniciar o instalador sem utilizar dispositivos amovíveis, mas apenas com o disco rígido existente, que poderá ter um sistema operativo diferente. Faça o download de <filename>hd-media/initrd.gz</filename>, <filename>hd-media/vmlinuz</filename>, e uma imagem de CD Debian para a directoria de raiz do seu disco rígido. Certifique-se que a imagem de CD tem um ficheiro cujo o nome termine em <literal>.iso</literal>. Agora é só uma questão de iniciar o linux com o initrd. <phrase arch="i386"> A <xref linkend="boot-initrd"/> explica uma maneira de o fazer. </phrase>
ru: Возможна загрузка программы установки не со сменного носителя, а просто с имеющегося жёсткого диска, который может содержать различные операционные системы. Загрузите файлы <filename>hd-media/initrd.gz</filename>, <filename>hd-media/vmlinuz</filename> и образ Debian CD в корневой каталог жёсткого диска. Проверьте, что образ CD имеет имя файла оканчивающееся на <literal>.iso</literal>. Теперь просто загрузите linux с помощью initrd. <phrase arch="i386"> <xref linkend="boot-initrd"/> показывает один вариант, как это сделать. </phrase>
zh_cn: 除了从移动介质启动安装套件，其实从手中现有的安装了其它操作系統的硬盘启动也是可行的。把 <filename>hd-media/initrd.gz</filename>、<filename>hd-media/vmlinuz</filename> 和一个 Debian CD 映像文件下载到硬盘最底层的目录里。请确保这个 CD 映像文件的文件名是以 <literal>.iso</literal> 结尾的。接下来的问题就是用 initrd 启动 linux 了。<phrase arch="i386"> <xref linkend="boot-initrd"/> 说明了如何做这件事。</phrase>
zh_tw: 除了從可移動媒介啟動安裝程式，亦可從現有的安裝了其它操作系統的硬碟啟動。將 <filename>hd-media/initrd.gz</filename>、<filename>hd-media/vmlinuz</filename> 和一個 Debian 光碟映像檔下載到硬碟最上層的目錄裡。請確保這個光碟映像檔的檔案名稱是 <literal>.iso</literal> 結尾。接下來就是用 initrd 啟動 linux 了。 <phrase arch="i386"> <xref linkend="boot-initrd"/> 說明如何達到這個目的。</phrase>

source: Installation
el: Εγκατάσταση
pt: Instalação
ru: Установка
zh_cn: 安装
zh_tw: 安裝

source: Once the installer starts, you will be greeted with an initial screen. Press &enterkey; to boot, or read the instructions for other boot methods and parameters (see <xref linkend="boot-parms"/>). <phrase arch="i386"> <phrase condition="sarge"> If you want a 2.6 kernel, type <userinput>linux26</userinput> at the <prompt>boot:</prompt> prompt. </phrase> <phrase condition="etch"> If you want a 2.4 kernel, type <userinput>install24</userinput> at the <prompt>boot:</prompt> prompt. </phrase> <footnote><para> <phrase condition="sarge"> The 2.6 kernel is available for most boot methods, but not when booting from a floppy. </phrase> <phrase condition="etch"> The 2.6 kernel is the default for most boot methods, but is not available when booting from a floppy. </phrase> </para></footnote> </phrase>
el: Αφού ξεκινήσει ο εγκαταστάτης, θα σας χαιρετήσει με μια αρχική οθόνη. Πατήστε το πλήκτρο &enterkey; για εκκίνηση, ή διαβάστε τις οδηγίες για πιθανές μεθόδους εκκίνησης και παραμέτρους (βλ. <xref linkend="boot-parms" />). <phrase arch="i386">Αν επιθυμείτε έναν πυρήνα 2.6, πληκτρολογήστε <userinput>linux26</userinput> στην προτροπή <prompt>boot:</prompt> <phrase condition="etch"> Αν θέλετε έναν πυρήνα 2.4, πληκτρολογήστε <userinput>install24</userinput> στο προτρεπτικό εκκίνησης <prompt>boot:</prompt>. </phrase> <footnote><para> <phrase condition="sarge"> Ο πυρήνας 2.6 είναι διαθέσιμος για τις περισσότερες από τις μεθόδους εκκίνησης, αλλά δεν είναι διαθέσιμος κατά την εκκίνηση από δισκέττα </phrase> <phrase condition="etch"> Ο πυρήνας 2.6 είναι ο προκαθορισμένος για τις περισσότερες μεθόδους εκκίνησης, αλλά δεν είναι διαθεσιμος κατά την εκκίνηση από δισκέττα.</phrase></para></footnote> </phrase>
pt: Uma vez que o instalador inicie, você será saudado com um ecrã inicial. carregue na tecla &enterkey; para arrancar, ou leia as instruções para os outros métodos e parâmetros (visite a <xref linkend="boot-parms"/>). <phrase arch="i386"> <phrase condition="sarge"> Se quiser um kernel 2.6, escreva <userinput>linux26</userinput> na prompt <prompt>boot:</prompt>. </phrase><footnote><para> <phrase condition="sarge"> O Kernel 2.6 está disponível para a maioria dos métodos de arranque, mas não para iniciar a partir de uma disquete. </phrase> <phrase condition="etch"> O kernel 2.6 é o padrão para a maioria dos métodos de arranque, mas não está disponível para arrancar a partir de uma disquete. </phrase> </para></footnote> </phrase>
ru: После запуска программа установки выводит приветствие. Нажмите &enterkey; для загрузки, или прочитайте инструкции про другие методы загрузки и параметры (смотрите <xref linkend="boot-parms"/>). <phrase arch="i386"> <phrase condition="sarge"> Если вы хотите использовать ядро 2.6, наберите <userinput>linux26</userinput> в строке приглашения <prompt>boot:</prompt>. </phrase> <phrase condition="etch"> Если вы хотите использовать ядро 2.4, наберите <userinput>install24</userinput> в строке приглашения <prompt>boot:</prompt>. </phrase> <footnote> <para> <phrase condition="sarge"> Ядро 2.6 доступно в большинстве методов загрузки, кроме загрузки с дискет. </phrase> <phrase condition="etch"> Ядро 2.6 является ядром по умолчанию в большинстве методов загрузки, кроме загрузки с дискет. </phrase></para> </footnote> </phrase>
zh_cn: 一旦安装套件开始运行后，会有一个初始画面迎接您。要启动的话，请按 &enterkey;；也可以先看一下其它的启动方式以及各种参数(参阅 <xref linkend="boot-parms"/>)。<phrase arch="i386"> <phrase condition="sarge">如果您希望用 2.6 的内核，在 <prompt>boot:</prompt> 提示符之后键入 <userinput>linux26</userinput>。</phrase> <phrase condition="etch"> 如果您希望使用 2.4 的内核，在 <prompt>boot:</prompt> 提示符之后键入 <userinput>linux24</userinput>。</phrase> <footnote><para> <phrase condition="sarge">除了软盘，2.6 内核可以在大多数启动方式中使用。</phrase> <phrase condition="etch"> 在多数启动方式下，默认使用 2.6 内核，但软盘启动时 2.6 内核不可用。</phrase> </para></footnote> </phrase>
zh_tw: 一旦開始安裝套件，螢幕會出現一個初始畫面。要開機啟動的話，請按 &enterkey;﹔也可以閱讀操作指南查看其它的啟動方式以及各種參數設定(請參閱 <xref linkend="boot-parms"/>)。<phrase arch="i386"> <phrase condition="sarge"> 如果您希望用核心版本為 2.6 的系統，在 <prompt>boot:</prompt> 提示符號之後鍵入 <userinput>linux26</userinput>。</phrase> <phrase condition="etch"> 如果您希望用核心版本為 2.4 的系統，在 <prompt>boot:</prompt> 提示符號之後鍵入 <userinput>install24</userinput>。</phrase> <footnote><para> <phrase condition="sarge"><footnote><para> 除了磁片開機，2.6 核心可以在大多數啟動方式中使用。</para></footnote> </phrase> <phrase condition="etch"> 幾乎所有啟動方式都預設使用 2.6 核心，但是以磁片開機時無法使用 2.6 核心。</phrase> </para></footnote> </phrase>

source: After a while you will be asked to select your language. Use the arrow keys to pick a language and press &enterkey; to continue. Next you'll be asked to select your country, with the choices including countries where your language is spoken. If it's not on the short list, a list of all the countries in the world is available.
el: Μετά από λίγο θα σας ζητηθεί η επιλογή της γλώσσας. Χρησιμοποιήστε τα πλήκτρα με τα βέλη για να διαλέξετε μία και πατήστε &enterkey; για να συνεχίσετε. Κατόπιν θα σας ζητηθεί η επιλογή χώρας, με τις επιλογές να περιλαμβάνουν χώρες στις οποίες ομιλείται η γλώσσα σας. Αν δεν βρίσκεται η χώρα σας στη σύντομη αυτή λίστα, είναι διαθέσιμη μια λίστα με όλες τις χώρες του κόσμου.
pt: Ao fim de algum tempo ir-lhe-à ser pedido para seleccionar o seu idioma. Utilize as teclas de cursor para escolher o idioma e pressione a tecla &enterkey; para continuar. Em seguida será questionado para seleccionar o país, com opções que incluem onde o seu idioma é falado. Se não o encontrar nessa pequena lista, está disponível uma lista com todos os países do mundo.
ru: Через некоторое время вас попросят выбрать язык. Используйте клавиши управления курсором для выбора языка и нажмите &enterkey;, чтобы продолжить. Затем вас попросят выбрать страну из списка стран, где говорят на этом языке. Если её нет в коротком списке, то доступен список стран всего мира.
zh_cn: 再过一会儿，您就会可以选择您所使用的语言了。用上下箭头键来选择一门语言，然后摁 &enterkey; 继续下面的步骤。接下来，您要选择您的国家，选项里包括了那些使用您所选语言的国家。如果在那个稍短的列表里找不到您要找的国家，还有一个含有世界上所有国家的列表以备选择。
zh_tw: 接下來畫面要求您選擇欲使用的語言。利用上下鍵來選擇語言，然後按 &enterkey; 以繼續下面的步驟。接下來，您要選擇您的國家，選項裡包括了那些使用您所選語言的國家。如果在列表中找不到您要找的國家，還有一個包含世界上所有國家的列表以供選擇。

source: You may be asked to confirm your keyboard layout. Choose the default unless you know better.
el: Μπορεί να σας ζητηθεί να επιβεβαιώσετε την διάταξη του πληκτρολογίου σας.Διαλέξτε την προεπιλεγμένη εκτός αν ξέρετε καλά τι κάνετε.
pt: Ser-lhe-á pedido para confirmar a disposição do teclado. Escolha o que está por omissão a menos que conheça melhor.
ru: Вас могут попросить выбрать раскладку клавиатуры. Выберите предлагаемую по умолчанию, если не знаете какая лучше.
zh_cn: 您还可能被要求确认一下您的键盘布局(keyboard layout)。请选择缺省的那个，除非您清楚更合适的布局。
zh_tw: 您還可能被要求確認一下您的鍵盤排列方式。選擇預設的那個方式，或是選擇更合適的一個。

source: Now sit back while debian-installer detects some of your hardware, and loads the rest of itself from CD, floppy, USB, etc.
el: Τώρα ο εγκαταστάτης θα ανιχνεύσει το υλικό του υπολογιστή, και θα φορτώσει το υπόλοιπο του από το CD, δισκέττα, USB, κλπ.
pt: Agora recoste-se enquanto o instalador debian detecta algum do seu hardware, e carrega o resto da instalação a partir de CD, disquete, USB, etc.
ru: Теперь можно отдохнуть, пока debian-installer определяет необходимое аппаратное обеспечение вашей машины, и загружает оставшуюся часть самого себя с CD, дискеты, USB и т.д.
zh_cn: 现在可以坐下来，松口气，休息一下了。这时 debian-installer 会侦测您的一部分硬件，并从 CD、软驱、USB 或其它设备里把它的其余部分加载进系统。
zh_tw: 現在可以休息一下了，這時 debian-installer 會偵測您的硬體，並從光碟、磁片、USB 隨身碟或其它設備裡將其餘部分載入系統。

source: Next the installer will try to detect your network hardware and set up networking by DHCP. If you are not on a network or do not have DHCP, you will be given the opportunity to configure the network manually.
el: Στη συνέχεια ο εγκαταστάτης θα προσπαθήσει να ανιχνεύσει το υλικό δικτύωσης και να ρυθμίσει το δίκτυο μέσω DHCP. Αν δε βρίσκεστε σε δίκτυο, ή δε διαθέτετε DHCP, θα σας δοθεί η ευκαιρία να ρυθμίσετε το δίκτυο χειροκίνητα.
pt: Em seguida o instalador tentará detectar o hardware de rede e preparar a ligação por DHCP. Se não estiver numa rede ou não tiver DHCP, ser-lhe-á dada a oportunidade para configurar a rede manualmente.
ru: Затем программа установки попытается определить сетевое аппаратное обеспечение и настроить сеть с помощью DHCP. Если у вас нет сети или вы не имеете DHCP, то вам будет предложено настроить сеть вручную.
zh_cn: 接下来，安装程序会想办法侦测您和网络相关的硬件，再用 DHCP 完成网络的设置。如果您没有连接网络，或是没有用 DHCP，那么您也可以手动配置网络。
zh_tw: 接下來，安裝程式會嘗試偵測網路相關硬體，透過 DHCP 完成網路的設定。如果電腦沒有連接網路，或是沒有用 DHCP，那麼您也可以手動設定網路。

source: Now it is time to partition your disks. First you will be given the opportunity to automatically partition either an entire drive, or free space on a drive. This is recommended for new users or anyone in a hurry, but if you do not want to autopartition, choose manual from the menu.
el: Έφτασε η στιγμή για την κατάτμηση (διαμέριση) των δίσκων. Αρχικά θα σας δοθεί η ευκαιρία να κατατμήσετε αυτόματα, είτε μια ολόκληρη συσκευή, είτε τον διαθέσιμο χώρο σε μια συσκευή. Αυτό συνίσταται σε νέους ή βιαστικούς χρήστες. Σε περίπτωση που δε θέλετε αυτόματη κατάτμηση, επιλέξτε χειροκίνητη από το μενού.
pt: Agora é altura de particionar os discos. Primeiro ir-lhe-à ser dado a oportunidade de particionar automaticamente o disco inteiro, ou um espaço livre num dispositivo. Isto é recomendado para novos utilizadores ou alguém com pressa, mas se não quiser um particionamento automático, escolha a opção manual do menu.
ru: Теперь пришло время разметки дисков. Сначала вам предложат автоматическую разметку всего диска или только свободного пространства. Этот режим рекомендуется для новичков или занятых людей, но если вы не хотите авторазметку, выберите ручной режим из меню.
zh_cn: 好，现在该对您的硬盘分区了。首先，您可以选择对整个驱动器或是驱动器上的空闲空间进行自动分区。我们推荐新手或者手头有急事的朋友使用自动分区。不过要是您不想用自动分区的话，请在菜单中选择手动分区。
zh_tw: 現在該對硬碟分割磁區了。首先，您可以選擇對整個硬碟或是硬碟上的空間進行自動分割。我們建議新手或者趕時間的使用者使用自動分區。要是您不想用自動分割磁區的話，請在選單中選擇手動分割。

source: If you have an existing DOS or Windows partition that you want to preserve, be very careful with automatic partitioning. If you choose manual partitioning, you can use the installer to resize existing FAT or NTFS partitions to create room for the Debian install: simply select the partition and specify its new size.
el: Αν διαθέτετε ήδη ένα τμήμα (διαμέρισμα) DOS ή Windows και θέλετε να το διατηρήσετε, να είστε ιδιαίτερα προσεκτικοί με την αυτόματη κατάτμηση. Αν επιλέξετε χειροκίνητη κατάτμηση, μπορείτε να χρησιμοποιήσετε τον εγκαταστάτη για να μικρύνετε το υπάρχον τμήμα FAT ή NTFS ώστε να δημιουργήσετε χώρο για την εγκατάσταση Debian: απλά επιλέξτε το τμήμα και ορίστε το νέο του μέγεθος.
pt: Se tiver uma partição de Windows ou DOS que quer preservar, seja cuidadoso com o particionamento automático. Se optar pelo particionamento manual, poderá utilizar o instalador para redimensionar as partições FAT ou NTFS existentes para criar espaço para instalar o Debian: seleccione a partição e especifique um novo tamanho.
ru: Если у вас есть разделы DOS или Windows, которые вы хотите сохранить, то будьте осторожны с автоматической разметкой. Если вы выберите разметку вручную, то сможете использовать программу установки для изменения размеров существующих разделов FAT или NTFS, чтобы создать место для установки Debian; просто выберите нужный раздел и укажите его новый размер.
zh_cn: 如果您有一个 DOS 或 Windows 分区并想保留它，要小心使用自动分区。如果您选择手动分区，可以使用安装程序重新设置 FAT 或 NTFS 分区的大小，分给 Debian 更多的安装空间：只需选择该分区，并指定它的新尺寸。
zh_tw: 如果您想保留一個既存的 DOS 或 Windows 磁區，要小心使用自動分割磁區。如果您選擇手動分割磁區，可以使用安裝程式重新設定既存 FAT 或 NTFS 分區的大小，分給 Debian 更多的安裝空間：只需選擇該分區，並指定新的大小。
