Repository: xobs/debian-installer
Catalog: doc/manual/po/*/install-methods.po
Languages: el, ko, pt, ru, zh_cn, zh_tw

source: An AppleScript, <application>Make Debian Floppy</application>, is available for burning floppies from the provided disk image files. It can be downloaded from <ulink url="ftp://ftp2.sourceforge.net/pub/sourceforge/d/de/debian-imac/MakeDebianFloppy.sit"></ulink>. To use it, just unstuff it on your desktop, and then drag any floppy image file to it. You must have Applescript installed and enabled in your extensions manager. Disk Copy will ask you to confirm that you wish to erase the floppy and proceed to write the file image to it.
el: Ένα AppleScript, το <application>Make Debian Floppy</application>, διατίθεται για την εγγραφή δισκεττών από τις διατιθέμενες εικόνες των δισκεττών. Μπορείτε να το κατεβάσετε από τον σύνδεσμο <ulink url="ftp://ftp2.sourceforge.net/pub/sourceforge/debian-imac/MakeDebianFloppy.sit"></ulink>. Για να το χρησιμοποιήσετε απλά αποσυμπιέστε το στην επιφάνεια εργασίας σας, και στη συνέχεια τραβήξτε οποιοδήποτε αρχείο εικόνας δίσκου σε αυτό. Θα πρέπει να έχετε το πρόγραμμα Applescript εγκατεστημένο και ενεργοποιημένο στον διαχειριστή επεκτάσεων. Το πρόγραμμα Disk Copy θα σας ζητήσει να επιβεβαιώσετε ότι θέλετε να διαγράψετε τη δισκέττα και να προχωρήσετε στην εγγραφή του αρχείου εικόνας σε αυτήν.
ko: 디스크 이미지 파일에서 플로피를 만드는 용도로 <application>Make Debian Floppy</application>라는 AppleScript가 있습니다. <ulink url="ftp://ftp2.sourceforge.net/pub/sourceforge/d/de/debian-imac/MakeDebianFloppy.sit"></ulink>에서 내려 받을 수 있습니다. 이 스크립트를 사용하려면, 데스크탑에 놓은 다음 플로피 이미지를 끌어다 놓으십시오. 확장 관리자에서 Applescript를 설치하고 사용해야 합니다. Disk Copy에서 현재 플로피를 지우고 해당 파일 이미지를 쓸 지 여부를 확인합니다.
pt: Está disponível um AppleScript, <application>Make Debian Floppy</application>, para gravar disquetes a partir dos ficheiros de imagens de disco fornecidos. Poderá ser efectuado o download a partir <ulink url="ftp://ftp2.sourceforge.net/pub/sourceforge/d/de/debian-imac/MakeDebianFloppy.sit"></ulink>. Para utilizar, basta descompactar para o ambiente de trabalho, e então arrastar para cima qualquer ficheiro de imagem de disquete. Tem de ter o Applescript instalado e disponibilizado no gestor de extensões. Disk Copy irá solicitar confirmação para apagar a disquete e continuar com a gravação da imagem para lá.
ru: Для создания дискет из файлов образов есть AppleScript, <application>Make Debian Floppy</application>. Его можно загрузить с <ulink url="ftp://ftp2.sourceforge.net/pub/sourceforge/d/de/debian-imac/MakeDebianFloppy.sit"></ulink>. Просто поместите его на рабочий стол, затем перетащите на него любой файл образа дискеты. У вас должен быть установлен и включён в менеджере расширений Applescript. Disk Copy попросит вас подтвердить, что вы хотите стереть дискету и записать на неё образ файла.
zh_cn: 这里有一个名为 <application>Make Debian Floppy</application> 的 AppleSrcipt 可以用来从所提供的磁盘映像制作软盘。它可以从 <ulink url="ftp://ftp2.sourceforge.net/pub/sourceforge/d/de/debian-imac/MakeDebianFloppy.sit"></ulink> 处下载。使用时只需要解压文件至桌面然后向其拖入您想刻录的映像文件。您必须已经安装了 Applescript 并在您的扩展管理器中开启它。Disk Copy 会要求您确认您的确想要清空磁盘并写入磁盘映像。
zh_tw: 這裡有一個名為 <application>Make Debian Floppy</application> 的 AppleSrcipt 可以由磁碟映像檔製作磁片。您可從 <ulink url="ftp://ftp2.sourceforge.net/pub/sourceforge/d/de/debian-imac/MakeDebianFloppy.sit"></ulink> 處下載之。使用時只需要解壓縮檔案至桌面然後將您想燒錄的映像檔拖拉到該程式。您必須安裝 Applescript 並在您的擴充套件管理員中開啟它。Disk Copy 會要求您確認清空磁碟並寫入磁碟映像檔。

source: You can also use the MacOS utility <command>Disk Copy</command> directly, or the freeware utility <command>suntar</command>. The <filename>root.bin</filename> file is an example of a floppy image. Use one of the following methods to create a floppy from the floppy image with these utilities.
el: Μπορείτε επίσης να χρησιμοποιήσετε κατευθείαν το εργαλείο του MacOS <command>Disk Copy</command>, ή το ελεύθερο εργαλείο <command>suntar</command>. Το αρχείο <filename>root.bin</filename> είναι ένα παράδειγμα μιας εικόνας δισκέττας. Χρησιμοποιήστε μια από τις ακόλουθες μεθόδους για τη δημιουργία μιας δισκέττας από μια εικόνα δισκέττας με αυτά τα εργαλεία.
ko: MacOS의 <command>Disk Copy</command> 유틸리티를 직접 사용할 수도 있고, 프리웨어인 <command>suntar</command> 유틸리티를 사용할 수도 있습니다. 플로피 이미지로 예를 들면 <filename>root.bin</filename>이 있습니다. 이 유틸리티로 플로피 이미지를 만드려면 다음 방법 중의 하나를 사용하십시오.
pt: Você pode também utilizar directamente o utilitário <command>Disk Copy</command> do MacOS, ou o <command>suntar</command> que é um utilitário livre. O ficheiro <filename>root.bin</filename> é um exemplo de uma imagem de disquete. Utilize um dos seguintes métodos para criar uma disquete a partir da imagem de disquetes com estes utilitários.
ru: Также, вы сразу можете использовать утилиту MacOS <command>Disk Copy</command> или свободную утилиту <command>suntar</command>. Файл <filename>root.bin</filename> это пример образа дискеты. Используйте один из следующих методов для создания дискеты из образа.
zh_cn: 您也可以直接使用 MacOS 工具 <command>Disk Copy</command> ，或者免费软件工具 <command>suntar</command>。<filename>root.bin</filename> 是一个软盘映像范例。您可以使用以下方法之一来利用这些工具将磁盘映像写入软盘。
zh_tw: 您也可以直接使用 MacOS 工具 <command>Disk Copy</command> ，或者免費軟體工具 <command>suntar</command>。<filename>root.bin</filename> 是一個軟碟映像檔範例。您可以使用這些工具和以下方法將磁碟映像寫入軟碟。

source: Writing Disk Images with <command>Disk Copy</command>
el: Εγγραφή Ειδώλων Δίσκων με το <command>Disk Copy</command>
ko: <command>Disk Copy</command>로 디스크 이미지 쓰기
pt: Gravar Imagens de Disco com <command>Disk Copy</command>
ru: Запись образов дисков с помощью <command>Disk Copy</command>
zh_cn: 写磁盘映像：使用<command>Disk Copy</command>
zh_tw: 寫入磁碟映像檔：使用<command>Disk Copy</command>

source: If you are creating the floppy image from files which were originally on the official &debian; CD, then the Type and Creator are already set correctly. The following <command>Creator-Changer</command> steps are only necessary if you downloaded the image files from a Debian mirror.
el: Αν δημιουργείτε το είδωλο δισκέττας από αρχεία που βρίσκονταν αρχικά στο επίσημο CD του &debian; τότε οι παράμετροι Type και Creator είναι ήδη σωστά ρυθμισμένοι. Τα παρακάτω <command>Creator-Changer</command> βήματα είναι απαραίτητα μόνο αν κατεβάσατε τα αρχεία από έναν κατοπτριστή αρχείων του Debian.
ko: 공식 &debian; CD에 있는 파일에서 플로피 이미지를 만들면, Type과 Creator가 이미 지정되어 있습니다. 다음의 <command>Creator-Changer</command> 단계는 데비안 미러에서 이미지 파일을 내려 받을 경우에만 상관 있습니다.
pt: Se está a criar as imagens de disquetes a partir de ficheiros que estavam originalmente no CD oficial &debian;, então o Type e Creator já estão definidos correctamente. Os seguintes passos, <command>Creator-Changer</command> apenas são necessários se fez o download da imagem a partir de um mirror Debian.
ru: Если вы создаёте дискету из образа файла, который взят с официального&debian; CD, то Тип и Создатель ужё установлены правильно. Следующие шаги <command>Creator-Changer</command> необходимы только если вы загрузили файлы образов с сервера-зеркала Debian.
zh_cn: 假如您是使用官方 &debian; 光盘上的软盘映像文件，那么 Type 和 Creator 已经设置正确。以下 <command>Creator-Changer</command> 步骤只针对从 Debian 镜像下载映像文件的情况。
zh_tw: 假如您是使用官方 &debian;光碟上的軟碟映像檔文件，那麼 Type 和 Creator 已經設置正確。 以下 <command>Creator-Changer</command> 步驟只針對從 Debian 鏡像站下載映像檔的情況。

source: Obtain <ulink url="&url-powerpc-creator-changer;">Creator-Changer</ulink> and use it to open the <filename>root.bin</filename> file.
el: Αποκτήστε το <ulink url="&url-powerpc-creator-changer;">Creator-Changer</ulink> και χρησιμοποιήστε το για να ανοίξετε το αρχείο <filename>root.bin</filename>file.
ko: <ulink url="&url-powerpc-creator-changer;">Creator-Changer</ulink>를 받아서 그걸 이용해 <filename>root.bin</filename> 파일을 여십시오.
pt: Obtenha <ulink url="&url-powerpc-creator-changer;">Creator-Changer</ulink> e utilize-o para abrir o ficheiro <filename>root.bin</filename>.
ru: Получите <ulink url="&url-powerpc-creator-changer;">Creator-Changer</ulink> и используйте его для открытия файла <filename>root.bin</filename>.
zh_cn: 取得 <ulink url="&url-powerpc-creator-changer;">Creator-Changer</ulink> 并且用它打开 <filename>root.bin</filename> 文件。
zh_tw: 取得 <ulink url="&url-powerpc-creator-changer;">Creator-Changer</ulink> 並且用它打開 <filename>root.bin</filename> 檔案。

source: Change the Creator to <userinput>ddsk</userinput> (Disk Copy), and the Type to <userinput>DDim</userinput> (binary floppy image). The case is sensitive for these fields.
el: Αλλάξτε την παράμετρο Creator σε <userinput>ddsk</userinput> (Disk Copy), και την παράμετρο Type σε <userinput>DDim</userinput> (binary floppy image). Προσέξτε ότι στα πεδία υπάρχει διάκριση κεφαλαίων-πεζών.
ko: Creator를 <userinput>ddsk</userinput>로 (Disk Copy) 바꾸고, Type을 <userinput>DDim</userinput>로 (binary floppy image) 바꿉니다. 대소문자를 구별합니다.
pt: Alterar o Creator para <userinput>ddsk</userinput> (Disk Copy), e o Type para <userinput>DDim</userinput> (imagem binária de disquete). Estes campos são sensíveis à capitalização.
ru: Измените Creator на <userinput>ddsk</userinput> (Disk Copy), а Type на <userinput>DDim</userinput> (двоичный образ дискеты). Регистр вводимых данных важен.
zh_cn: 将 Creator 改为 <userinput>ddsk</userinput> (Disk Copy)，并将 Type 改为 <userinput>DDim</userinput> (binary floppy image)。注意此处大小写敏感。
zh_tw: 將 Creator 改為 <userinput>ddsk</userinput> (Disk Copy)，並將 Type 改為 <userinput>DDim</userinput> (binary floppy image)。注意此處有大小寫區分。

source: <emphasis>Important:</emphasis> In the Finder, use <userinput>Get Info</userinput> to display the Finder information about the floppy image, and <quote>X</quote> the <userinput>File Locked</userinput> check box so that MacOS will be unable to remove the boot blocks if the image is accidentally mounted.
el: <emphasis>Σημείωση:</emphasis> Στον Finder, χρησιμοποιήστε <userinput>Get Info</userinput> για να εμφανίσετε την πληροφορία του Finder για το είδωλο της δισκέττας, και τσεκάρετε με <quote>X</quote> το κουτί <userinput>File Locked</userinput> ώστε το MacOS να μην μπορεί να απομακρύνει τα block εκκίνησης σε περίπτωση που το είδωλο προσαρτηθεί κατά τύχη.
ko: <emphasis>중요:</emphasis> Finder에서, <userinput>Get Info</userinput>를 사용해 플로피 이미지에 대한 Finder 정보를 표시하십시오. 그리고 <userinput>File Locked</userinput>에 <quote>X</quote> 표시하십시오. 그래야 MacOS에서 이미지를 마운트하더라도 부트 블록을 망가뜨리지 않습니다.
pt: <emphasis>Importante:</emphasis> No Finder, use <userinput>Get Info</userinput> para expôr a informação sobre a imagem de disquete encontrada pelo Finder, e marque com <quote>X</quote> a check box <userinput>File Locked</userinput> para que o MacOS fique impossibilitado de remover os blocos de arranque se a imagem for acidentalmente montada.
ru: <emphasis>Важно:</emphasis> В Finder, воспользуйтесь <userinput>Get Info</userinput> что посмотреть Finder информацию об образе дискеты, а в поле <userinput>File Locked</userinput> должен стоять <quote>X</quote>, чтобы MacOS не смог удалить загрузочные блоки, если образ будет случайно смонтирован.
zh_cn: <emphasis>注意：</emphasis> 在 Finder 中，使用 <userinput>Get Info</userinput> 来显示关于软盘映像的 Finder 信息，并在 <userinput>File Locked</userinput> 复选框中划上<quote>X</quote>。这样在映像意外的被挂载时 MacOS 将不会删除引导区。
zh_tw: <emphasis>注意：</emphasis> 在 Finder 中，使用 <userinput>Get Info</userinput> 來顯示軟碟映像檔的 Finder 資訊，並在 <userinput>File Locked</userinput> 複選欄中畫上 <quote>X</quote>。如此一來當映像檔被意外的掛載時 MacOS 才不會刪除開機區。

source: Obtain <command>Disk Copy</command>; if you have a MacOS system or CD it will very likely be there already, otherwise try <ulink url="&url-powerpc-diskcopy;"></ulink>.
el: Αποκτήστε το <command>Disk Copy</command>; αν έχετε ένα σύστημα MacOS ή CD είναι πιθανόν να έχετε ήδη το εργαλείο αυτό, διαφορετικά δοκιμάστε στο <ulink url="&url-powerpc-diskcopy;"></ulink>.
ko: <command>Disk Copy</command>를 구하십시오. MacOS 시스템이나 CD가 있으면 거기에 이미 <command>Disk Copy</command>가 들어 있을 겁니다. 없으면 <ulink url="&url-powerpc-diskcopy;"></ulink>에서 받으십시오.
pt: Obtenha <command>Disk Copy</command>; se tem um sistema MacOS ou CD é muito provável que já lá esteja, caso contrário tente em <ulink url="&url-powerpc-diskcopy;"></ulink>.
ru: Получите <command>Disk Copy</command>; если у вас система MacOS и есть CD, то скорее всего она уже есть, иначе попробуйте <ulink url="&url-powerpc-diskcopy;"></ulink>.
zh_cn: 获取 <command>Disk Copy</command>。如果您已经拥有了 MacOS 系统或光盘，它多半就已经被包含在其中，否则可以试试 <ulink url="&url-powerpc-diskcopy;"></ulink>。
zh_tw: 取得 <command>Disk Copy</command>。如果您已經擁有了 MacOS 系統或光碟，它多半就已經被包含在其中，否則可以試試 <ulink url="&url-powerpc-diskcopy;"></ulink>。

source: Run <command>Disk Copy</command>, and select <menuchoice> <guimenu>Utilities</guimenu> <guimenuitem>Make a Floppy</guimenuitem> </menuchoice>, then select the <emphasis>locked</emphasis> image file from the resulting dialog. It will ask you to insert a floppy, then ask if you really want to erase it. When done it should eject the floppy.
el: Τρέξτε το <command>Disk Copy</command>, και επιλέξτε <menuchoice> <guimenu>Utilities</guimenu> <guimenuitem>Make a Floppy</guimenuitem> </menuchoice> από το μενού <userinput>Utilities</userinput>, τότε επιλέξτε το <emphasis>κλειδωμένο</emphasis> αρχείο ειδώλου από τον διάλογο που εμφανίζεται. Θα σας ζητηθεί να εισάγετε μια δισκέττα και στη συνέχεια αν θέλετε πραγματικά να τη διαγράψετε. Όταν τελειώσετε θα αποβάλλει τη δισκέττα.
ko: <command>Disk Copy</command>를 실행하고, <menuchoice><guimenu>Utilities</guimenu> 메뉴에서 <guimenuitem>Make a Floppy</guimenuitem>를 선택하십시오.</menuchoice> 그리고 나타나는 대화 상자에서 <emphasis>잠긴 (locked)</emphasis> 이미지 파일을 선택하십시오. 플로피를 넣으라고 물어보고, 정말로 플로피를 지울 지 물어봅니다. 다 마치면 플로피가 튀어 나옵니다.
pt: Execute <command>Disk Copy</command>, e seleccione <menuchoice> <guimenu>Utilitiess</guimenu> <guimenuitem>Make a Floppy</guimenuitem> </menuchoice>, e depois seleccione o ficheiro da imagem <emphasis>locked</emphasis>. Ser-lhe-á pedido que insira uma disquete, em seguida ser-lhe-à perguntado se quer mesmo apagá-la. Quando terminado a disquete deverá ser ejectada.
ru: Запустите <command>Disk Copy</command>, и выберите <menuchoice><guimenu>Utilities</guimenu> <guimenuitem>Make a Floppy</guimenuitem> </menuchoice>, затем выберите <emphasis>locked</emphasis> файл образа в появившемся диалоговом окне. Вас попросят вставить дискету, затем спросят хотите ли вы стереть её содержимое. Когда всё закончится, дискета вылезет из дисковода.
zh_cn: 运行 <command>Disk Copy</command>，并且从 <userinput>Utilities</userinput> 菜单中选择 <guimenuitem>Make a Floppy</guimenuitem>，然后从对话框中选择 <emphasis>locked</emphasis> 的映像文件。它会要求您插入一张软盘，然后询问是否删除它。完成后它应该会弹出软盘。
zh_tw: 執行 <command>Disk Copy</command>，並且選擇 <menuchoice><guimenu>Utilities</guimenu> <guimenuitem>Make a Floppy</guimenuitem> </menuchoice>，然後從對話框中選擇 <emphasis>locked</emphasis> 的映像檔。它會要求您插入一張磁片，然後詢問是否刪除它。完成後它應該會退出磁片。

source: Writing Disk Images with <command>suntar</command>
el: Εγγραφή Ειδώλων Δίσκων με το <command>suntar</command>
ko: <command>suntar</command>로 디스크 이미지 쓰기
pt: Gravar Imagens de Disco com <command>suntar</command>
ru: Запись образов дисков с помощью <command>suntar</command>
zh_cn: 写磁盘映像：使用<command>suntar</command>
zh_tw: 寫入磁碟映像檔：使用<command>suntar</command>

source: Obtain <command>suntar</command> from <ulink url="&url-powerpc-suntar;"> </ulink>. Start the <command>suntar</command> program and select <quote>Overwrite Sectors...</quote> from the <userinput>Special</userinput> menu.
el: Αποκτήστε το πρόγραμμα <command>suntar</command> από το <ulink url="&url-powerpc-suntar;"></ulink>. Ξεκινήστε την εφαρμογή <command>suntar</command> και επιλέξτε <quote>Overwrite Sectors...</quote> από το μενού <userinput>Special</userinput>.
ko: <ulink url="&url-powerpc-suntar;"></ulink>에서 <command>suntar</command>를 내려받으십시오. <command>suntar</command> 프로그램을 실행하고 <userinput>Special</userinput> 메뉴에서 <quote>Overwrite Select...</quote>를 선택하십시오.
pt: Obtenha <command>suntar</command> em <ulink url="&url-powerpc-suntar;"> </ulink>. Inicie o programa <command>suntar</command> e seleccione <quote>Overwrite Sectors...</quote> do menu <userinput>Special</userinput>.
ru: Получите <command>suntar</command>из <ulink url="&url-powerpc-suntar;"> </ulink>. Запустите программу <command>suntar</command> и выберите <quote>Overwrite Sectors...</quote> из меню <userinput>Special</userinput>.
zh_cn: 获取 <command>suntar</command>，它在 <ulink url="&url-powerpc-suntar;"> </ulink> 中。运行 <command>suntar</command> 程序并且从 <userinput>Special</userinput> 菜单中选择<quote>Overwrite Sectors...</quote>。
zh_tw: 取得 <command>suntar</command>，它在 <ulink url="&url-powerpc-suntar;"> </ulink> 中。執行 <command>suntar</command> 程式並且從 <userinput>Special</userinput> 選單中選擇 <quote>Overwrite Sectors...</quote>。

source: Insert the floppy disk as requested, then hit &enterkey; (start at sector 0).
el: Εισάγετε τη δισκέττα όπως σας ζητείται, στη συνέχεια πατήστε &enterkey; (ξεκινώντας από τον τομέα 0).
ko: 플로피를 넣고, &enterkey;를 누르십시오. (섹터 0에서 시작)
pt: Insira a disquete conforme pedido, pressione a tecla &enterkey; (Começar no sector 0).
ru: Вставьте дискету, нажмите &enterkey; (начало с сектора 0).
zh_cn: 按照要求插入软盘，然后点击 &enterkey; (从0扇区开始)。
zh_tw: 按照要求插入軟碟，然後按下 &enterkey; (從0磁區開始)。

source: Select the <filename>root.bin</filename> file in the file-opening dialog.
el: Επιλέξτε το αρχείο <filename>root.bin</filename> στον διάλογο ανοίγματος-αρχείου.
ko: 파일 열기 창에서 <filename>root.bin</filename> 파일을 선택하십시오.
pt: Seleccione o ficheiro <filename>root.bin</filename> na caixa de diálogo de abertura de ficheiro.
ru: Выберите файл <filename>root.bin</filename> в появившемся диалоговом окне.
zh_cn: 在打开文件对话框中选择 <filename>root.bin</filename> 文件。
zh_tw: 在開啟檔案對話框中選擇 <filename>root.bin</filename> 檔案。

source: After the floppy has been created successfully, select <menuchoice> <guimenu>File</guimenu> <guimenuitem>Eject</guimenuitem> </menuchoice>. If there are any errors writing the floppy, simply toss that floppy and try another.
el: Μετά την πετυχημένη δημιουργία της δισκέττας, επιλέξτε <menuchoice> <guimenu>File</guimenu> <guimenuitem>Eject</guimenuitem> </menuchoice> από το μενού <userinput>File</userinput>. Αν υπάρχουν λάθη στην εγγραφή της δισκέττας, απλά δοκιμάστε με μια άλλη.
ko: 플로피를 성공적으로 만들었으면, <menuchoice><guimenu>File</guimenu> <guimenuitem>Eject</guimenuitem></menuchoice>를 선택하십시오. 플로피를 쓸 때 오류가 발생하면 그 플로피를 꺼내고 다른 플로피로 시도해 보십시오.
pt: Depois da disquete ser criada com sucesso, seleccione <menuchoice> <guimenu>File</guimenu> <guimenuitem>Eject</guimenuitem> </menuchoice>. Se existirem quaisquer erros durante a escrita na disquete, simplesmente deite-a fora e tente com outra.
ru: После успешного создания дискеты, выдерите <menuchoice> <guimenu>File</guimenu> <guimenuitem>Eject</guimenuitem> </menuchoice>. Если были какие-то ошибки при записи дискеты, просто выньте эту и вставьте другую дискету.
zh_cn: 当软盘被成功写入之后，选中 <menuchoice> <guimenu>File</guimenu> <guimenuitem>Eject</guimenuitem> </menuchoice>。如果写盘期间发生任何错误，请换别的软盘试试。
zh_tw: 當軟碟被成功寫入之後，選擇 <menuchoice> <guimenu>File</guimenu> <guimenuitem>Eject</guimenuitem> </menuchoice>。如果期間發生任何錯誤，請換別的軟碟試試。

source: Before using the floppy you created, <emphasis>set the write protect tab</emphasis>! Otherwise if you accidentally mount it in MacOS, MacOS will helpfully ruin it.
el: Πριν χρησιμοποιήσετε τη δισκέττα που δημιουργήσατε, <emphasis>βάλτε το tab προστασίας εγγραφής</emphasis>! Διαφορετικά αν την προσαρτήσετε τυχαία στο MacOS, το MacOS θα την καταστρέψει.
ko: 새로 만든 플로피를 사용하기 전에, <emphasis>쓰기 방지 탭을 거십시오</emphasis>! 그렇게 하지 않고 실수로 MacOS에서 마운트하게 되면, MacOS가 데이터를 망가뜨립니다.
pt: Antes de utilizar a disquete que criou, <emphasis>ajuste a patilha de protecção contra escrita</emphasis>! Caso contrário se você acidentalmente montá-la em MacOS, MacOS irá arruiná-la.
ru: Перед использованием созданной дискеты, <emphasis>установите защёлку защиты от записи</emphasis>! Иначе, если вы нечаянно смонтируете её в MacOS, MacOS просто испортит её.
zh_cn: 在使用您创建的软盘之前，<emphasis>请设置写保护标签</emphasis>！否则，如果您偶然在 MacOS 中挂载了它，MacOS 将会将其毁坏。
zh_tw: 在使用您建立的軟碟之前，<emphasis>請設定防寫保護標籤</emphasis>！否則，如果您偶然在 MacOS 中掛載了它，MacOS 將會將其毀壞。

source: Preparing Files for USB Memory Stick Booting
el: Προετοιμασία Αρχείων για Εκκίνηση από ένα USB Stick μνήμης
ko: USB 메모리 스틱 부팅에 필요한 파일 준비하기
pt: Preparar Ficheiros para iniciar a partir de USB Memory Stick
ru: Подготовка файлов для загрузки с карты памяти USB
zh_cn: 为从 USB 闪盘引导准备文件
zh_tw: 準備從 USB 隨身碟開機的檔案

source: For preparing the USB stick you will need a system where GNU/Linux is already running and where USB is supported. You should ensure that the usb-storage kernel module is loaded (<userinput>modprobe usb-storage</userinput>) and try to find out which SCSI device the USB stick has been mapped to (in this example <filename>/dev/sda</filename> is used). To write to your stick, you will probably have to turn off its write protection switch.
el: Για την προετοιμασία του USB stick θα χρειαστείτε ένα σύστημα που τρέχει ήδη GNU/Linux και υποστηρίζει USB. Πρέπει να βεβαιωθείτε ότι το usb-storage kernel module είναι φορτωμένο (<userinput>modprobeusb-storage</userinput>) και προσπαθήστε να βρείτε σε ποια συσκευή SCSI έχει αντιστοιχiσθεί το USB stick (στο παράδειγμα μας χρησιμοποιούμε τη συσκευή<filename>/dev/sda</filename>). Για να γράψετε στο stick, θα πρέπει πιθανόν να απενεργοποιήσετε την προστασία εγγραφής.
ko: USB 스틱을 준비하려면 GNU/Linux가 동작하고 USB를 지원하는 시스템이 필요합니다. usb-storage 커널 모듈을 읽어들이고 (<userinput>modprobe usb-storage</userinput>) 어떤 SCSI 장치로 USB 스틱이 매핑되었는 지 (이 예에서는 <filename>/dev/sda</filename>를 사용) 알아야 합니다. USB 메모리 스틱에 쓰려면, 쓰기 방지 스위치를 풀어 놓아야 할 수도 있습니다.
pt: Para preparar o stick USB você precisará de um sistema GNU/Linux que já esteja em funcionamento e onde seja suportado USB. Você deve assegurar-se que o módulo do kernel usb-storage é carregado (<userinput>modprobe usb-storage</userinput>) e tente descobrir para qual dispositivo SCSI foi mapeado o stick USB (neste exemplo é utilizado o <filename>/dev/sda</filename>). Para gravar para o seu stick, provavelmente terá de desligar a protecção de escrita.
ru: Для подготовки карты памяти USB вам нужна система с запущенной GNU/Linux с поддержкой USB. Убедитесь, что загружен модуль ядра usb-storage (<userinput>modprobe usb-storage</userinput>) и попытайтесь выяснить на какое устройство SCSI отображена карта памяти USB (в примере используется <filename>/dev/sda</filename>). Также выключите защиту от записи.
zh_cn: 您需要一台运行支持 USB 的 GNU/Linux 系统来为 USB 闪盘引导准备文件。您应该确定 usb-storage 内核模块已经被加载(<userinput>modprobe usb-storage</userinput>) 然后尝试找出 USB 闪盘被映射到的哪个 SCSI 设备(在此以 <filename>/dev/sda</filename> 为例)。为了写入您的闪盘，您可能需要关闭它的写保护开关。
zh_tw: 您需要一台運行支援 USB 的 GNU/Linux 系統來為 USB 隨身碟準備開機檔案。 您應該確定 usb-storage 核心模組已經被載入 (<userinput>modprobe usb-storage</userinput>) 然後嘗試找出 USB 隨身碟被映射到的哪個 SCSI 設備 (在此以 <filename>/dev/sda</filename> 為例)。為了寫入您的儲存，您可能需要關閉它的防寫保護開關。

source: Note, that the USB stick should be at least 128 MB in size (smaller setups are possible if you follow <xref linkend="usb-copy-flexible"/>).
el: Σημειώστε ότι το USB stick πρέπει να έχει μέγεθος τουλάχιστον 128 MB (διαφορετικά setups είναι δυνατά αν ακολουθήσετε το <xref linkend="usb-copy-flexible"/>).
ko: 단 USB 스틱은 크기가 최소 128MB는 되어야 합니다. (<xref linkend="usb-copy-flexible"/>에 쓰여 있는 대로 하면 더 작아도 가능합니다)
pt: Nota, o stick USB deverá ter no mínimo capacidade para 128 MB (são possíveis configurações menores se seguir a <xref linkend="usb-copy-flexible"/>).
ru: Заметим, что карта памяти USB должна быть как минимум 128МБ (установка на меньший размер возможна после прочтения <xref linkend="usb-copy-flexible"/>).
zh_cn: 注意，准备的 USB 闪盘应该至少有 128MB 的容量(在更小的尺寸安装也是可能的，请参考 <xref linkend="usb-copy-flexible"/>)。
zh_tw: 注意，USB 隨身碟應該至少有 128MB 的容量 (在更小的大小安裝也是可能的，請參閱 <xref linkend="usb-copy-flexible"/>)。

source: Copying the files &mdash; the easy way
el: Αντιγράψτε τα αρχεία &mdash; ο εύκολος τρόπος
ko: 파일 복사하기 &mdash; 쉬운 방법
pt: Copiar ficheiros &mdash; a maneira simples
ru: Копирование файлов &mdash; лёгкий путь
zh_cn: 复制文件 &mdash; 轻松的途径
zh_tw: 複製檔案 &mdash; 簡單的方法
