Repository: xobs/debian-installer
Catalog: doc/manual/po/*/install-methods.po
Languages: el, ko, pt, ru, zh_cn, zh_tw

source: There is an all-in-one file <filename>hd-media/boot.img.gz</filename> which contains all the installer files (including the kernel) as well as <command>SYSLINUX</command> and its configuration file. You only have to extract it directly to your USB stick: <informalexample><screen> # zcat boot.img.gz &gt; /dev/<replaceable>sda</replaceable> </screen></informalexample> Of course this will destroy anything already on the device, so take care that you use the correct device name for your USB stick.
el: Υπάρχει ένα συγκεντρωτικό αρχείο <filename>hd-media/boot.img.gz</filename> που περιέχει όλα τα αρχεία του εγκαταστάτη (μαζί με τον πυρήνα) καθώς και το <command>SYSLINUX</command> και τα αρχεία ρύθμισης του. Το μόνο που έχετε να κάνετε είναι να αποσυμπιέσετε το αρχείο κατευθείαν στο USB stick: <informalexample><screen> # zcat boot.img.gz &gt; /dev/<replaceable>sda</replaceable> </screen></informalexample> Αυτό θα καταστρέψει φυσικά οτιδήποτε υπάρχει ήδη στη συσκευή, οπότε πρέπει να προσέξετε ιδιαίτερα ότι χρησιμοποιείτε το σωστό όνομα συσκευής για το USB stick.
ko: <filename>hd-media/boot.img.gz</filename> 파일에는 <command>SYSLINUX</command>와 그 설정 파일들은 물론, 모든 설치 프로그램 파일들이 (커널 포함) 다 들어 있습니다. 이 파일을 풀어서 USB 스틱에 저장해 놓기만 하면 됩니다: <informalexample><screen> # zcat boot.img.gz &gt; /dev/<replaceable>sda</replaceable> </screen></informalexample> 물론 이렇게 하면 장치에 들어 있는 내용이 지워집니다. 그래서 USB 스틱의 장치 이름을 올바르게 사용하도록 주의하십시오.
pt: Existe um ficheiro tudo-em-um <filename>hd-media/boot.img.gz</filename> que contém todos os ficheiros do instalador (incluindo o kernel) assim como <command>SYSLINUX</command> e o seu ficheiro de configuração. Você apenas terá de o descompactar directamente para o stick USB: <informalexample><screen> # zcat boot.img.gz &gt; /dev/<replaceable>sda</replaceable> </screen></informalexample> claro que isto destruirá qualquer ficheiros que se encontre no dispositivo, certifique-se de que está a utilizar o nome de dispositivo correcto para o seu stick USB.
ru: Существует файл "всё-в-одном" &mdash; <filename>hd-media/boot.img.gz</filename>, который содержит все файлы установки (включая ядро), а также <command>SYSLINUX</command> и его файл конфигурации. Вам нужно просто распаковать его прямо на карту памяти USB: <informalexample><screen> # zcat boot.img.gz &gt; /dev/<replaceable>sda</replaceable> </screen></informalexample> Естественно, это уничтожит все данные на устройстве, поэтому не ошибитесь с именем карты памяти USB.
zh_cn: 这里有一个单一文件 <filename>hd-media/boot.img.gz</filename> ，其中包含了所有的安装程序文件(包括内核)，以及 <command>SYSLINUX</command> 和它的配置文件。您只需要把它直接解压到您的 USB 闪盘内即可： <informalexample><screen> # zcat boot.img.gz &gt; /dev/<replaceable>sda</replaceable> </screen></informalexample> 当然，这会删除设备上现存的所有内容，因此请仔细检查您使用的是正确的 USB 闪盘设备名称。
zh_tw: 這裡有一個單一檔案 <filename>hd-media/boot.img.gz</filename>，其中包含了所有的安裝程式文件 (包括核心)，以及 <command>SYSLINUX</command> 和它的設定檔案。您只需要把它直接解壓縮到您的 USB 隨身碟內即可：<informalexample><screen> # zcat boot.img.gz &gt; /dev/<replaceable>sda</replaceable> </screen></informalexample> 當然，這會刪除設備上現存的所有內容，因此請仔細檢查您使用的是正確的 USB 隨身碟設備名稱。

source: There is an all-in-one file <filename>hd-media/boot.img.gz</filename> which contains all the installer files (including the kernel) as well as <command>yaboot</command> and its configuration file. Create a partition of type "Apple_Bootstrap" on your USB stick using <command>mac-fdisk</command>'s <userinput>C</userinput> command and extract the image directly to that: <informalexample><screen> # zcat boot.img.gz &gt; /dev/<replaceable>sda2</replaceable> </screen></informalexample> Of course this will destroy anything already on the device, so take care that you use the correct device name for your USB stick.
el: Μετά από αυτό, προσαρτήστε το USB stick μνήμης (<userinput>mount /dev/sda/mnt</userinput>), που θα έχει τώρα ένα FAT σύστημα αρχείων FAT, και αντιγράψτε σε αυτό την εικόνα ενός Debian netinst ή businesscard ISO. Σημειώστε ότι το ονομάτων αρχείων αυτών πρέπει να τελειώνει σε <filename>.iso</filename>.Αποπροσαρτήστε το stick (<userinput>umount /mnt</userinput>) και έχετε τελειώσει.
ko: <filename>hd-media/boot.img.gz</filename> 파일에는 <command>yaboot</command>와 그 설정 파일들은 물론, 모든 설치 프로그램 파일들이 (커널 포함) 다 들어 있습니다. <command>mac-fdisk</command>의 <userinput>C</userinput> 명령으로 "Apple_Bootstrap" 타입의 파티션을 USB 스틱에 만들고 이미지를 다음 명령으로 풀어 놓으십시오: <informalexample><screen> # zcat boot.img.gz &gt; /dev/<replaceable>sda2</replaceable> </screen></informalexample> 물론 이렇게 하면 장치에 들어 있는 내용이 지워집니다. 그래서 USB 스틱의 장치 이름을 올바르게 사용하도록 주의하십시오.
pt: Existe um ficheiro todos em um <filename>hd-media/boot.img.gz</filename> que contém todos os ficheiros da instalador (incluindo o kernel) tal como o <command>yaboot</command> e o seu ficheiro de configuração. Crie uma partição do tipo "Apple_Bootstrap" no seu stick USB utilizando o comando <command>mac-fdisk</command>'s <userinput>C</userinput> e descompacte a imagem directamente para lá: <informalexample><screen> # zcat boot.img.gz &gt; /dev/<replaceable>sda2</replaceable> </screen></informalexample> claro que isto destruirá quaisquer ficheiros que se encontrem no dispositivo, certifique-se portanto de que está a utilizar o nome correcto do dispositivo para o stick USB.
ru: Существует файл "всё-в-одном" <filename>hd-media/boot.img.gz</filename>, который содержит все файлы установки (включая ядро), а также <command>yaboot</command> и его файл конфигурации. На карте памяти USB создайте раздел с типом "Apple_Bootstrap" с помощью команды <command>mac-fdisk</command> <userinput>C</userinput> и распакуйте образ на этот раздел: <informalexample><screen> # zcat boot.img.gz &gt; /dev/<replaceable>sda2</replaceable> </screen></informalexample> Естественно, это уничтожит все данные на устройстве, поэтому не ошибитесь с именем карты памяти USB.
zh_cn: 这里有一个单一文件 <filename>hd-media/boot.img.gz</filename> ，其中包含了所有的安装程序文件(包括内核)，以及 <command>yaboot</command> 和它的配置文件。您可以使用 <command>mac-fdisk</command> 的 <userinput>C</userinput> 命令在您的 USB 闪盘上创建一个类型为“Apple_Bootstrap”的分区，然后直接解开映像文件到： <informalexample><screen> # zcat boot.img.gz &gt; /dev/<replaceable>sda2</replaceable> </screen></informalexample> 当然，这会删除设备上现存的所有内容，因此请仔细检查您使用的是正确的 USB 闪盘设备名称。
zh_tw: 這裡有一個單一文件 <filename>hd-media/boot.img.gz</filename> ，其中包含了所有的安裝程式文件(包括核心)，以及 <command>yaboot</command> 和它的設定檔。您可以使用 <command>mac-fdisk</command> 的 <userinput>C</userinput> 指令在您的 USB 隨身碟上建立一個類型為 ``Apple_Bootstrap'' 的分割區，然後直接解開映像文件到： <informalexample><screen> # zcat boot.img.gz &gt; /dev/<replaceable>sda2</replaceable> </screen></informalexample> 當然，這會刪除設備上現存的所有內容，因此請仔細檢查您使用的是正確的 USB 隨身碟設備名稱。

source: After that, mount the USB memory stick (<userinput>mount <replaceable arch="i386">/dev/sda</replaceable> <replaceable arch="powerpc">/dev/sda2</replaceable> /mnt</userinput>), which will now have <phrase arch="i386">a FAT filesystem</phrase> <phrase arch="powerpc">an HFS filesystem</phrase> on it, and copy a Debian netinst or businesscard ISO image to it. Please note that the file name must end in <filename>.iso</filename>. Unmount the stick (<userinput>umount /mnt</userinput>) and you are done.
el: Μετά από αυτό, προσαρτήστε το USB stick μνήμης (<userinput>mount <replaceable arch="i386">/dev/sda</replaceable> <replaceable arch="powerpc">/dev/sda2</replaceable> /mnt</userinput>), που θα έχει τώρα ένα <phrase arch="i386"> FAT</phrase> <phrase arch="powerpc">HFS</phrase> σύστημα αρχείων, και αντιγράψτε σε αυτό το είδωλο ενός Debian netinst ή businesscard ISO. Σημειώστε ότι το όνομα των αρχείων αυτών πρέπει να τελειώνει σε <filename>.iso</filename>.Αποπροσαρτήστε το stick (<userinput>umount /mnt</userinput>) και έχετε τελειώσει.
ko: 그 다음 USB 메모리 스틱을 마운트하십시오. (<userinput>mount <replaceable arch="i386">/dev/sda</replaceable> <replaceable arch="powerpc">/dev/sda2</replaceable> /mnt</userinput>) 이 USB 메모리 스틱에는 <phrase arch="i386">a FAT filesystem</phrase><phrase arch="powerpc">an HFS filesystem</phrase>이 들어 있고, 그 안에 데비안 네트워크 설치 ISO 이미지 혹은 비지니스 카드 ISO 이미지가 들어 있습니다. 파일 이름이 <filename>.iso</filename>로 끝나야 한다는 것에 주의하십시오. 다 끝나면 마운트 해제하십시오. (<userinput>umount /mnt</userinput>)
pt: Em seguida, monte o stick de memória USB (<userinput>mount <replaceable arch="i386">/dev/sda</replaceable> <replaceable arch="powerpc">/dev/sda2</replaceable> /mnt</userinput>), que terá a partir de agora <phrase arch="i386">um sistema de ficheiros FAT</phrase> <phrase arch="powerpc">ou um sistema de ficheiros HFS</phrase>, e copie para lá uma imagem ISO Debian netinst ou uma businesscard. O nome do ficheiro tem de terminar em <filename>.iso</filename>. Desmonte o stick (<userinput>umount /mnt</userinput>) e pronto está feito.
ru: После этого, смонтируйте карту памяти USB (<userinput>mount <replaceable arch="i386">/dev/sda</replaceable> <replaceable arch="powerpc">/dev/sda2</replaceable> /mnt</userinput>), которая теперь имеет <phrase arch="i386">файловую систему FAT</phrase> <phrase arch="powerpc">файловую систему HFS</phrase> и скопируйте на неё ISO образ Debian netinst или businesscard. Имя файла должно заканчиваться обязательно на <filename>.iso</filename>. Размонтируйте устройство (<userinput>umount /mnt</userinput>) и всё готово.
zh_cn: 然后，挂载 USB 闪盘(<userinput>mount <replaceable arch="i386">/dev/sda</replaceable> <replaceable arch="powerpc">/dev/sda2</replaceable> /mnt</userinput>)，它上面应该已经具有 <phrase arch="i386">一个 FAT 文件系统</phrase> <phrase arch="powerpc">一个 HFS 文件系统</phrase> ，您再将一个 Debian netinst(网络安装) 或 businesscard(名片) ISO 映像拷贝到盘上。请注意文件名必须以 <filename>.iso</filename> 结尾。卸载闪盘(<userinput>umount /mnt</userinput>)后结束。
zh_tw: 然後，掛載 USB 隨身碟 (<userinput>mount <replaceable arch="i386">/dev/sda</replaceable> <replaceable arch="powerpc">/dev/sda2</replaceable> /mnt</userinput>)，它上面應該已經具有<phrase arch="i386">一個 FAT 檔案系統</phrase> <phrase arch="powerpc">一個 HFS 檔案系統</phrase>，您再將一個 Debian netinst (網路安裝) 或 businesscard (名片型安裝) ISO 映像檔拷貝到隨身碟上。請注意檔案名稱必須以 <filename>.iso</filename> 結尾。卸載隨身碟 (<userinput>umount /mnt</userinput>) 後結束。

source: Copying the files &mdash; the flexible way
el: Αντιγράψτε τα αρχεία &mdash; ο ευέλικτος τρόπος
ko: 파일 복사하기 &mdash; 유연한 방법
pt: Copiar os ficheiro &mdash; a maneira flexível
ru: Копирование файлов &mdash; гибкий путь
zh_cn: 复制文件 &mdash; 灵活的方法
zh_tw: 複製檔案 &mdash; 靈活的方法

source: If you like more flexibility or just want to know what's going on, you should use the following method to put the files on your stick.
el: Αν θέλετε μεγαλύτερη ευελιξία ή απλά θέλετε να ξέρετε τι ακριβώς συμβαίνει, θα πρέπει να χρησιμοποιήσετε την ακόλουθη μέθοδο για την τοποθέτηση των αρχείων στο stick.
ko: 좀 더 유연한 방법이 좋다면, 아니면 무슨 일이 일어나고 있는지 보고 싶기라도 하다면, 다음 방법으로 파일을 USB 스틱에 집어 넣으십시오.
pt: Se você aprecia maior flexibilidade ou apenas quer saber o que se está a passar, deve utilizar o seguinte método para colocar os ficheiros no stick.
ru: Если вам хочется большей гибкости или вы просто хотите знать, что на самом деле происходит, то можете воспользоваться следующим методом записи файлов на карту памяти.
zh_cn: 如果您需要更多的灵活性或者只是想了解其间发生了什么，您应该使用如下的方法来把文件放到您的闪盘。
zh_tw: 如果您需要更多的靈活性或者只是想瞭解其間發生了什麼，您應該使用下面的方法來把檔案放到您的隨身碟上。

source: USB stick partitioning on &arch-title;
el: Κατάτμηση ενός USB stick σε &arch-title;
ko: &arch-title;에서 USB 스틱 파티션하기
pt: Particionamento do stick USB em &arch-title;
ru: Разметка карты памяти USB на архитектуре &arch-title;
zh_cn: 在 &arch-title; 上为 USB 闪盘分区
zh_tw: &arch-title; 上的 USB 隨身碟分割區

source: We will show how to setup the memory stick to use the first partition, instead of the entire device.
el: Θα δείξουμε πώς μπορείτε να ρυθμίσετε το stick μνήμης ώστε να χρησιμοποιήσει το πρώτο τμήμα αντί ολόκληρης της συσκευής.
ko: 다음은 메모리 스틱에서 전체 장치를 사용하지 않고, 첫 번째 파티션을 사용하는 방법입니다.
pt: Iremos demonstrar como preparar o memory stick para utilizar a primeira partição, em vez de todo o dispositivo.
ru: Мы покажем как использовать на карте памяти только первый раздел, а не всё устройство.
zh_cn: 我们将展示如何使用闪盘的第一个分区，而不是整个设备。
zh_tw: 我們將展示如何使用隨身碟的第一個分割區，而不是整個設備。

source: Since most USB sticks come pre-configured with a single FAT16 partition, you probably won't have to repartition or reformat the stick. If you have to do that anyway, use <command>cfdisk</command> or any other partitioning tool for creating a FAT16 partition and then create the filesystem using: <informalexample><screen> # mkdosfs /dev/<replaceable>sda1</replaceable> </screen></informalexample> Take care that you use the correct device name for your USB stick. The <command>mkdosfs</command> command is contained in the <classname>dosfstools</classname> Debian package.
el: Από τη στιγμή που τα περισσότερα USB stick έρχονται προρυθμισμένα με ένα μοναδικό τμήμα FAT16, το πιθανότερο είναι ότι δεν θα χρειαστεί να επανακατατμήσετε ή επαναμορφοποιήσετε το stick. Αν πρέπει παρόλα αυτά να κάνετε κάτι τέτοιο, χρησιμοποιήστε το <command>cfdisk</command> ή ένα οποιοδήποτε άλλο εργαλείο κατάτμησης για να δημιουργήσετε ένα τμήμα FAT16 και μετά πληκτρολογήστε: <informalexample><screen> # mkdosfs /dev/<replaceable>sda1</replaceable> </screen></informalexample> Προσέξτε και πάλι να χρησιμοποιήσετε το σωστό όνομα συσκευής για το USBstick. Η εντολή <command>mkdosfs</command> περιέχεται στο πακέτο <classname>dosfstools</classname>.
ko: 대부분의 USB 장치는 한 개의 FAT16 파티션으로 미리 포맷되어 있기 때문에, 다시 파티션 하거나 다시 포맷할 필요가 없습니다. 해야 한다면, <command>cfdisk</command>나 다른 파티션 도구를 이용해 FAT16 파티션을 만들고 다음 명령으로 파일 시스템을 만드십시오: <informalexample><screen> # mkdosfs /dev/<replaceable>sda1</replaceable> </screen></informalexample> USB 스틱의 장치명을 올바르게 사용해야 합니다. <command>mkdosfs</command> 명령은 <classname>dosfstools</classname> 데비안 꾸러미에 들어 있습니다.
pt: Dado que a maioria dos sticks USB vêm pré-configurados com uma única partição FAT16, provavelmente não terá de reparticionar ou reformatar o stick. Se o tiver de fazer de qualquer maneira, utilize <command>cfdisk</command> ou qualquer outra ferramenta de particionamento para criar uma partição FAT16 e então criar o sistema de ficheiros utilizando: <informalexample><screen> # mkdosfs /dev/<replaceable>sda1</replaceable> </screen></informalexample> Certifique-se de que utiliza o nome correcto do seu dispositivo USB. O comando <command>mkdosfs</command> está contido no pacote Debian <classname>dosfstools</classname>.
ru: Так как большинство карт памяти USB продаются только с единственным разделом FAT16 вам, вероятно, не хочется переразмечать или форматировать устройство. Если вам всё равно это нужно сделать, воспользуйтесь <command>cfdisk</command> или любой другой утилитой разметки для создания раздела FAT16, а затем создайте файловую систему:<informalexample><screen> # mkdosfs /dev/<replaceable>sda1</replaceable> </screen></informalexample> Обязательно вводите правильное имя карты памяти USB. Команда <command>mkdosfs</command> содержится в пакете Debian <classname>dosfstools</classname>.
zh_cn: 由于大多数 USB 闪盘预先设置了一个单独的 FAT16 分区，您可能不需要重新分区或者格式化 USB 闪盘。如果您必须这么做，请使用 <command>cfdisk</command> 或者其他的分区工具来创建一个 FAT16 分区并且输入: <informalexample><screen> # mkdosfs /dev/<replaceable>sda1</replaceable> </screen></informalexample> 注意使用正确的 USB 盘设备名称。<command>mkdosfs</command> 命令包含在 <classname>dosfstools</classname> Debian 包中。
zh_tw: 由於大多數 USB 隨身碟預先設置了一個單獨的 FAT16 分割區， 您可能不需要重新分割或者格式化 USB 隨身碟。如果您必須這麼做，請使用 <command>cfdisk</command> 或者其他的分割工具來建立一個 FAT16 分割區並且輸入:<informalexample><screen> # mkdosfs /dev/<replaceable>sda1</replaceable> </screen></informalexample> 注意使用正確的 USB 隨身碟設備名稱。 <command>mkdosfs</command> 指令包含在 <classname>dosfstools</classname> Debian 套件中。

source: In order to start the kernel after booting from the USB stick, we will put a boot loader on the stick. Although any boot loader (e.g. <command>LILO</command>) should work, it's convenient to use <command>SYSLINUX</command>, since it uses a FAT16 partition and can be reconfigured by just editing a text file. Any operating system which supports the FAT file system can be used to make changes to the configuration of the boot loader.
el: Για να ξεκινήσουμε τον πυρήνα αμέσως μετά την εκκίνηση από το USB stick, θα πρέπει να βάλουμε έναν φορτωτή εκκίνησης στο stick. Αν και οποιοσδήποτε φορτωτής εκκίνησης (πχ. <command>LILO</command>) θα δούλευε, είναι πιο βολικό να χρησιμοποιήσετε το <command>SYSLINUX</command>, μιας και χρησιμοποιεί τμήμα με FAT16 και μπορεί να προρυθμιστεί με την απλή διόρθωση ενός αρχείου κειμένου. Οποιοδήποτε λειτουργικό σύστημα που υποστηρίζει το σύστημα αρχείων FAT μπορεί να χρησιμοποιηθεί για να γίνουν αλλαγές στη ρύθμιση του φορτωτή εκκίνησης.
ko: USB 스틱에서 부팅한 다음 커널을 시작하려면 부트 로더를 USB 스틱에 넣어야 합니다. 그 어떤 부트 로더라도 (예를 들어 <command>LILO</command>) 동작하지만, <command>SYSLINUX</command>를 사용하는 게 편리합니다. <command>SYSLINUX</command>는 FAT16 파티션을 사용하고 텍스트 파일을 편집하는 것만으로 설정을 바꿀 수 있기 때문입니다. FAT 파일 시스템을 지원하는 어떤 운영 체제라도 부트 로더를 설정할 때 이용할 수 있습니다.
pt: Com o intuito de iniciar o kernel após arrancar a partir do stick USB, nós iremos colocar o gestor de arranque no stick. Apesar de qualquer gestor de arranque servir (por exemplo o <command>LILO</command>), é conveniente utilizar o <command>SYSLINUX</command>, dado que utiliza uma partição FAT16 e pode ser simplesmente reconfigurada editanto um ficheiro de texto. Qualquer sistema operativo que suporte um sistema de ficheiros FAT pode ser utilizado para fazer alterações à configuração do gestor de arranque.
ru: Для запуска ядра после загрузки карты памяти USB, мы поместим на неё системный загрузчик. Хотя должен работать любой системный загрузчик (например <command>LILO</command>), удобнее использовать <command>SYSLINUX</command>, так как он использует раздел FAT16 и настраивается простым редактированием текстового файла. Для изменения конфигурации системного загрузчика можно использовать любую операционную систему, которая поддерживает файловую систему FAT.
zh_cn: 为了能在 USB 闪盘引导后启动内核，我们要在 USB 闪盘上放入一个启动引导程序。尽管任何引导装载程序(比如 <command>LILO</command>)都应该可以胜任这个工作，不过还是使用 <command>SYSLINUX</command> 更方便。主要原因是是它可以使用 FAT16 分区，而且只需要编辑一个文本文件就能对其进行配置。任何支持 FAT 文件系统的操作系统可以用来改变启动引导器的配置文件。
zh_tw: 為了能在 USB 隨身碟開機後啟動核心，我們要在 USB 隨身碟上放入一個 boot-loader。儘管任何 boot-loader (例如 <command>LILO</command>) 都應該可以勝任這個工作，不過還是使用 <command>SYSLINUX</command> 更方便。主要原因是是它可以使用 FAT16 分割區，而且只需要編輯一個文字檔案就能對其進行設定。任何支援 FAT 檔案系統的操作系統可以用來改變 boot-loader 的設定檔案。

source: To put <command>SYSLINUX</command> on the FAT16 partition on your USB stick, install the <classname>syslinux</classname> and <classname>mtools</classname> packages on your system, and do: <informalexample><screen> # syslinux /dev/<replaceable>sda1</replaceable> </screen></informalexample> Again, take care that you use the correct device name. The partition must not be mounted when starting <command>SYSLINUX</command>. This procedure writes a boot sector to the partition and creates the file <filename>ldlinux.sys</filename> which contains the boot loader code.
el: Για να βάλετε το <command>SYSLINUX</command> στο τμήμα με το FAT16 στο USB stick σας, εγκαταστήστε τα πακέτα <classname>syslinux</classname> και <classname>mtools</classname> στο σύστημά σας και πληκτρολογήστε<informalexample><screen> # syslinux /dev/<replaceable>sda1</replaceable> </screen></informalexample> Και πάλι φροντίστε να χρησιμοποιήσετε το σωστό όνομα για τη συσκευή σας. Το τμήμα δεν πρέπει να είναι προσαρτημένο κατά την εκκίνηση του <command>SYSLINUX</command>. Η διαδικασία αυτή γράφει έναν τομέα εκκίνησης στο τμήμα και δημιουργεί το αρχείο <filename>ldlinux.sys</filename> που περιέχει τον κώδικα του φορτωτή εκκίνησης.
ko: <command>SYSLINUX</command>를 USB 스틱의 FAT16 파티션에 넣으려면, <classname>syslinux</classname>와 <classname>mtools</classname> 꾸러미를 설치하고, 다음 명령을 실행합니다: <informalexample><screen> # syslinux /dev/<replaceable>sda1</replaceable> </screen></informalexample> 다시 말하지만, 신경 써서 장치 이름을 올바르게 쓰십시오. <command>SYSLINUX</command>를 실행할 때 그 파티션을 마운트하면 안 됩니다. 이 명령은 파티션에 부트 섹터를 쓰고, 부트로더 코드가 들어 있는 <filename>ldlinux.sys</filename> 파일을 만듭니다.
pt: Para colocar <command>SYSLINUX</command> na partição FAT16 do seu stick USB, instale os pacotes <classname>syslinux</classname> e <classname>mtools</classname> no seu sistema, e faça: <informalexample><screen> # syslinux /dev/<replaceable>sda1</replaceable> </screen></informalexample> Mais uma vez certifique-se de que utiliza o nome correcto do dispositivo. A partição não deve ser montada quando <command>SYSLINUX</command> iniciar. Este procedimento escreve um sector de arranque para a partição e cria o ficheiro <filename>ldlinux.sys</filename> que contém o código do gestor de arranque.
ru: Чтобы поместить <command>SYSLINUX</command> на раздел FAT16 карты памяти USB, установите в систему пакеты <classname>syslinux</classname> и <classname>mtools</classname> и введите <informalexample><screen> # syslinux /dev/<replaceable>sda1</replaceable> </screen></informalexample> Ещё раз отметим: не ошибитесь в имени устройства. Раздел не должен быть смонтирован при запуске <command>SYSLINUX</command>. Эта процедура переписывает загрузочный сектор раздела и создаёт файл <filename>ldlinux.sys</filename>, который содержит код системного загрузчика.
zh_cn: 为了把 <command>SYSLINUX</command> 放到您的 USB 闪盘的 FAT16 分区上，请在您的系统中安装 <classname>syslinux</classname> 和 <classname>mtools</classname> 包，然后执行： <informalexample><screen> # syslinux /dev/<replaceable>sda1</replaceable> </screen></informalexample> 再提醒一次，请确认您使用的是正确的设备名称。还有，一定不能在启动 <command>SYSLINUX</command> 的时候挂载该分区，因为在操作过程中会向分区的引导扇区写入数据并且创建包含启动引导器代码的 <filename>ldlinux.sys</filename> 文件。
zh_tw: 為了把 <command>SYSLINUX</command> 放到您的 USB 隨身碟的 FAT16 分割區上，請在您的系統中安裝 <classname>syslinux</classname> 和 <classname>mtools</classname> 套件，然後執行：<informalexample><screen> # syslinux /dev/<replaceable>sda1</replaceable> </screen></informalexample> 再提醒一次，請確認您使用的是正確的設備名稱。還有，一定不能在啟動 <command>SYSLINUX</command> 的時候掛載該分割區，因為在操作過程中會向分割區的開機磁區寫入資料並且建立包含 boot-loader 代碼的 <filename>ldlinux.sys</filename> 檔案。
