Repository: xobs/debian-installer
Catalog: doc/manual/po/*/install-methods.po
Languages: el, ko, pt, ru, zh_cn, zh_tw

source: The <filename>boot-floppy-hfs</filename> floppy uses <application>miBoot</application> to launch Linux installation, but <application>miBoot</application> cannot easily be used for hard disk booting. <application>BootX</application>, launched from MacOS, supports booting from files placed on the hard disk. <application>BootX</application> can also be used to dual-boot MacOS and Linux after your Debian installation is complete. For the Performa 6360, it appears that <command>quik</command> cannot make the hard disk bootable. So <application>BootX</application> is required on that model.
el: Η δισκέττα <filename>boot-floppy-hfs</filename> χρησιμοποιεί την εφαρμογή <application>miBoot</application> για την έναρξη της εγκατάστασης του Linux, που δεν μπορεί όμως να χρησιμοποιηθεί για την εκκίνηση του σκληρού δίσκου. Το <application>BootX</application>, που εκκινείται από το MacOS, υποστηρίζει εκκίνηση από αρχεία τοποθετημένα στο σκληρό δίσκο και μπορεί επίσης να χρησιμοποιηθεί για τη διπλή εκκίνηση του MacOS και του Linux μετά την ολοκλήρωση της εγκατάστασης του Debian. Για το μοντέλο Performa 6360, φαίνεται ότι η εντολή <command>quik</command> δεν μπορεί να καταστήσει το δίσκο εκκινήσιμο. Κατά συνέπεια το <application>BootX</application> είναι απαραίτητο γι αυτό το μοντέλο.
ko: <filename>boot-floppy-hfs</filename> 플로피는 <application>miBoot</application>를 사용해 리눅스 설치를 시작합니다. 하지만 <application>miBoot</application>는 하드 디스크 부팅에는 쉽사리 사용할 수 없습니다. MacOS에서 시작하는 <application>BootX</application>는 하드 디스크에 들어 있는 파일에서 부팅하는 기능을 지원합니다. <application>BootX</application>는 데비안 설치를 한 다음에도 MacOS와 리눅스 사이에 선택 부팅하는 데 쓸 수도 있습니다. Performa 6360의 경우, <command>quik</command>로는 하드 디스크를 부팅 가능하게 만들 수 없습니다. 그래서 이 모델에서는 <application>BootX</application>가 필요합니다.
pt: A disquete <filename>boot-floppy-hfs</filename> utiliza <application>miBoot</application> para iniciar a instalação de linux, mas <application>miBoot</application> não pode facilmente ser utilizado para iniciar a partir de um disco rígido. <application>BootX</application> pode também ser usado para MacOS dual-boot e linux após a sua instalação Debian estar completa. Para Performa 6360, parece que <command>quik</command> não pode iniciar a partir do disco rígido. Portanto <application>BootX</application> é requerido nesse modelo.
ru: Дискета <filename>boot-floppy-hfs</filename> использует <application>miBoot</application> для запуска установки Linux, но <application>miBoot</application> не может быть легко использована для загрузки с жёсткого диска. <application>BootX</application>, запущенная из MacOS, поддерживает загрузку из файлов, расположенных на жёстком диске. <application>BootX</application> может также использоваться в качестве двойной загрузки MacOS и Linux после завершения установки Debian. На Performa 6360, кажется, <command>quik</command> не может выполнять загрузку с жёсткого диска. Поэтому для этой модели нужно использовать <application>BootX</application>.
zh_cn: <filename>boot-floppy-hfs</filename> 软盘使用 <application>miBoot</application> 来启动 Linux 安装，但是 <application>miBoot</application> 不易用于从硬盘引导。运行于 MacOS 的 <application>BootX</application> 支持从硬盘上的文件进行引导。<application>BootX</application> 也能在安装完 Debian 后用于 MacOS 和 Linux 的双重引导。对于 Performa 6360 来说，<command>quik</command> 看上去不能让硬盘可引导。因此 <application>BootX</application> 对于该型号来说是必须的。
zh_tw: <filename>boot-floppy-hfs</filename> 軟碟使用 <application>miBoot</application> 來啟動 Linux 安裝，但是 <application>miBoot</application> 不易用於從硬碟開機。運作於 MacOS 的 <application>BootX</application> 支援從硬碟上的檔案進行開機。<application>BootX</application> 也能在安裝完 Debian 後用於 MacOS 和 Linux 的雙重開機。對於 Performa 6360 來說，<command>quik</command> 看上去不能讓硬碟可開機。因此 <application>BootX</application> 對於該型號來說是必須的。

source: Download and unstuff the <application>BootX</application> distribution, available from <ulink url="&url-powerpc-bootx;"></ulink>, or in the <filename>dists/woody/main/disks-powerpc/current/powermac</filename> directory on Debian http/ftp mirrors and official Debian CDs. Use <application>Stuffit Expander</application> to extract it from its archive. Within the package, there is an empty folder called <filename>Linux Kernels</filename>. Download <filename>linux.bin</filename> and <filename>ramdisk.image.gz</filename> from the <filename>disks-powerpc/current/powermac</filename> folder, and place them in the <filename>Linux Kernels</filename> folder. Then place the <filename>Linux Kernels</filename> folder in the active System Folder.
el: Κατεβάστε και αποσυμπιέστε τη διανομή του <application>BootX</application>, διαθέσιμη στο <ulink url="&url-powerpc-bootx;"></ulink>, ή στον κατάλογο <filename>dists/woody/main/disks-powerpc/current/powermac</filename> των http/ftp καθρεφτών του Debian και στα επίσημα Debian CD. Χρησιμοποιήστε το <application>Stuffit Expander</application> για την εξαγωγή των αρχείων από το συμπιεσμένο αρχείο. Μέσα στο πακέτο υπάρχει ένας κενός φάκελος που ονομάζεται <filename>Linux Kernels</filename>. Κατεβάστε τα <filename>linux.bin</filename> και <filename>ramdisk.image.gz</filename> από τον κατάλογο <filename>disks-powerpc/current/powermac</filename>, και τοποθετήστε τα στον κατάλογο <filename>Linux Kernels</filename> και τοποθετήστε τον τελευταίο στο ενεργό System Folder.
ko: <application>BootX</application>를 내려 받아서 압축을 푸십시오. <ulink url="&url-powerpc-bootx;"></ulink>, 혹은 데비안 http/ftp 미러나 공식 데비안 CD의 <filename>dists/woody/main/disks-powerpc/current/powermac</filename> 디렉토리에 들어 있습니다. 압축 파일을 풀려면 <application>Stuffit Expander</application>를 사용하십시오. 꾸러미 안을 보면, <filename>Linux Kernels</filename>라는 빈 폴더가 있습니다. <filename>disks-powerpc/current/powermac</filename> 폴더에서 <filename>linux.bin</filename> 및 <filename>ramdisk.image.gz</filename> 파일을 받아서, <filename>Linux Kernels</filename> 폴더에 넣으십시오. 그리고 <filename>Linux Kernels</filename> 폴더를 활성 시스템 폴더에 넣으십시오.
pt: Faça o download e descomprima a distribuição <application>BootX</application>, disponível a partir de <ulink url="&url-powerpc-bootx;"></ulink>, ou na directoria <filename>dists/woody/main/disks-powerpc/current/powermac</filename> nos mirrors http/ftp Debian e nos CD's oficiais de Debian. Utilize <application>Stuffit Expander</application> para extraí-lo do seu arquivo. Dentro do pacote está um directório vazio com o nome de <filename>Linux Kernels</filename>. Faça download do <filename>linux.bin</filename> e <filename>ramdisk.image.gz</filename> a partir do directório <filename>disks-powerpc/current/powermac</filename>, e coloque-os no directório <filename>Linux Kernels</filename>. Coloque então o directório <filename>Linux Kernels</filename> no directório activo System Folder.
ru: Загрузите и распакуйте дистрибутив <application>BootX</application>, доступный из<ulink url="&url-powerpc-bootx;"></ulink>, или в каталоге<filename>dists/woody/main/disks-powerpc/current/powermac</filename> на серверах-зеркалах Debian http/ftp и официальных Debian CD. Воспользуйтесь<application>Stuffit Expander</application> чтобы распаковать его из архива. В месте пакета появится пустой каталог с именем <filename>Linux Kernels</filename>. Загрузите<filename>linux.bin</filename> и <filename>ramdisk.image.gz</filename> из каталога <filename>disks-powerpc/current/powermac</filename>, и поместите их в каталог <filename>Linux Kernels</filename>. Затем переместите каталог <filename>Linux Kernels</filename> в активный System Folder.
zh_cn: 请下载并且解压 <application>BootX</application> 发布版本。它可以从 <ulink url="&url-powerpc-bootx;"></ulink>，或者 Debian http/ftp 镜像以及官方 Debian 光盘的 <filename>dists/woody/main/disks-powerpc/current/powermac</filename> 目录下得到。可以用 <application>Stuffit Expander</application> 来把它从打包档案中解开。在这个包中，有一个名为 <filename>Linux Kernels</filename> 的空文件夹。请下载 <filename>linux.bin</filename> 和 <filename>ramdisk.image.gz</filename> (位于 <filename>disks-powerpc/current/powermac</filename> 文件夹)，然后把他们放到 <filename>Linux Kernels</filename> 文件夹中，然后把 <filename>Linux Kernels</filename> 文件夹放到活动的系统文件夹中。
zh_tw: 請下載並且解壓 <application>BootX</application> 發佈套件。它可以從 <ulink url="&url-powerpc-bootx;"></ulink>，或者 Debian http/ftp 鏡像以及官方 Debian光碟的 <filename>dists/woody/main/disks-powerpc/current/powermac</filename> 目錄下得到。可以用 <application>Stuffit Expander</application> 來把它從打包檔案中解開。在這個包中，有一個名為 <filename>Linux Kernels</filename> 的空目錄。請下載 <filename>linux.bin</filename> 和 <filename>ramdisk.image.gz</filename> (位於 <filename>disks-powerpc/current/powermac</filename> 目錄)，然後把他們放到 <filename>Linux Kernels</filename> 目錄中，然後把 <filename>Linux Kernels</filename> 目錄放到活動的系統目錄中。

source: Hard Disk Installer Booting for NewWorld Macs
el: Εκκίνηση του Εγκαταστάτη από το σκληρό δίσκο για NewWorld Macs
ko: NewWorld Mac에서 하드 디스크 설치 프로그램 부팅
pt: Arrancar o Instalador a partir do Disco Rígido em Macs NewWorld
ru: Загрузка программы установки с жёсткого диска для NewWorld Mac
zh_cn: 在 NewWorld Macs 上启动硬盘安装程序
zh_tw: NewWorld Macs 下啟動硬碟安裝程式

source: NewWorld PowerMacs support booting from a network or an ISO9660 CD-ROM, as well as loading ELF binaries directly from the hard disk. These machines will boot Linux directly via <command>yaboot</command>, which supports loading a kernel and RAMdisk directly from an ext2 partition, as well as dual-booting with MacOS. Hard disk booting of the installer is particularly appropriate for newer machines without floppy drives. <command>BootX</command> is not supported and must not be used on NewWorld PowerMacs.
el: Οι NewWorld PowerMac υποστηρίζουν εκκίνηση από το δίκτυο ή από ένα ISO9660 CD-ROM, καθώς και τη φόρτωση ELF εκτελέσιμων κατευθείαν από το δίσκο. Τα μηχανήματα αυτά θα ξεκινήσουν κατευθείαν μέσω του <command>yaboot</command>, που υποστηρίζει το φόρτωμα του πυρήνα και ενός δίσκου RAM κατευθείαν από ένα τμήμα ext2, καθώς και διπλή εκκίνηση με το MacOS. Εκκίνηση του εγκαταστάτη από το δίσκο είναι ιδιαίτερα κατάλληλη για νεώτερα μηχανήματα χωρίς οδηγούς δισκέττας. Το <command>BootX</command> δεν υποστηρίζεται και δεν πρέπει να χρησιμοποιείται σε NewWorld PowerMac συστήματα.
ko: NewWorld PowerMac은 하드 디스크에서 직접 ELF 바이너리를 읽어들이는 것 외에, 네트워크나 ISO9660 CD-ROM을 이용한 부팅을 지원합니다. 이러한 기계에서는 <command>yaboot</command>로 직접 리눅스를 부팅합니다. <command>yaboot</command>는 MacOS와의 선택 부팅도 지원하고 ext2 파티션에서 직접 커널과 램디스크를 읽어들이는 기능을 지원합니다. 설치 프로그램의 하드 디스크 부팅은 특히 플로피 드라이브가 없는 최신 기계에서 좋습니다. <command>BootX</command>는 지원하지 않고 NewWorld PowerMac에서는 사용해서는 안 됩니다.
pt: PowerMacs NewWorld suportam iniciar a partir da rede ou de um CD-ROM ISO9660, assim como carregar binários ELF directamente do disco rígido. Estas máquinas irão arrancar de Linux directamente através de <command>yaboot</command>, que suporta carregar um kernel e RAMdisk directamente de uma partição ext2, tal como o dual-booting com MacOS. Iniciar o instalador a partir do disco rígido é particularmente apropriado para máquinas recentes sem drive de disquetes. <command>BootX</command> não é suportado e não deve ser utilizado em PowerMacs NewWorld.
ru: NewWorld PowerMac поддерживают загрузку по сети или с ISO9660 CD-ROM, а также позволяют загружать бинарные ELF файлы непосредственно с жёсткого диска. Эти машинызагружают Linux прямо из <command>yaboot</command>, который поддерживает загрузку ядра и RAM диска прямо из раздела ext2, а также двойную загрузку с MacOS. Загрузка программы установки с жёсткого диска в первую очередь предназначена для новых машин без дисководов гибких дисков. <command>BootX</command> не поддерживается и не должен использоваться на NewWorld PowerMac.
zh_cn: NewWorld PowerMacs 支持从网络或者 ISO9660 格式光盘进行引导，或者直接从硬盘上载入 ELF 二进制文件。这类机器可以直接使用 <command>yaboot</command>引导。它既支持直接从 ext2 分区中装入内核和内存虚拟磁盘，也支持和 MacOS 的双重引导。硬盘引导特别适合最新的没有软驱的机器。<command>BootX</command> 则不被支持，也一定不能用在 NewWorld PowerMacs 上。
zh_tw: NewWorld PowerMacs 支援從網路或者 ISO9660 格式光碟進行開機，或者直接從硬碟上載入 ELF 二進位文件。這類機器可以直接使用 <command>yaboot</command> 開機。它既支援直接從 ext2 分割區中裝入核心和記憶體虛擬磁碟，也支援和 MacOS 的雙重開機。硬碟開機特別適合最新的沒有軟碟機的機器。<command>BootX</command> 則不被支援，也一定不能用在 NewWorld PowerMacs 上。

source: <emphasis>Copy</emphasis> (not move) the following four files which you downloaded earlier from the Debian archives, onto the root level of your hard drive (this can be accomplished by <keycap>option</keycap>-dragging each file to the hard drive icon).
el: <emphasis>Αντιγράψτε</emphasis> (και όχι να μεταφέρετε) τα ακόλουθα τέσσερα αρχεία που κατεβάσατε νωρίτερα από τις αρχειοθήκες του Debian, στο ριζικό επίπεδο του δίσκου σας (κάτι που επιτυγχάνεται με <keycap>option</keycap>-dragging κάθε αρχείου στο εικονίδιο του σκληρού δίσκου).
ko: 앞에서 데비안 아카이브에서 내려받은, 다음 4개 파일을 하드 디스크의 맨 위 디렉토리로 <emphasis>복사</emphasis>(옮기는 게 아님)하십시오. (각 파일을 <keycap>option</keycap> 키를 누르고 하드 드라이브 아이콘으로 끌어오면 됩니다.)
pt: <emphasis>Copie</emphasis> (não mova) os seguintes quatro ficheiros que fez download anteriormente dos arquivos Debian, para o nível de root do seu disco rígido (isto pode ser feito com <keycap>option</keycap>-arrastando cada ficheiro para o ícone do disco rígido).
ru: <emphasis>Скопируйте</emphasis> (не перемещайте) следующие четыре файла, которые вы загрузили ранее из архивов Debian, в корневой каталог жёсткого диска(это может быть выполнено с помощью <keycap>option</keycap>-перетаскиваниякаждого файла на иконку жёсткого диска).
zh_cn: <emphasis>拷贝</emphasis>(而非移动)您早先从 Debian 存档下载的下列四个文件到您硬盘的根目录上(这个可以用按住 <keycap>option</keycap> 键然后拖动每个文件到硬盘图标的方法来完成)。
zh_tw: <emphasis>拷貝</emphasis> (而非移動) 您早先從 Debian 檔案庫下載的下列四個檔案到您硬碟的根目錄上 (這個可以用按住 <keycap>option</keycap> 鍵然後拖曳每個檔案到硬碟圖示的方法來完成)。

source: Make a note of the partition number of the MacOS partition where you place these files. If you have the MacOS <command>pdisk</command> program, you can use the L command to check for the partition number. You will need this partition number for the command you type at the Open Firmware prompt when you boot the installer.
el: Σημειώστε τον αριθμό του τμήματος MacOS στην οποία τοποθετήσατε τα αρχεία. Αν έχετε το πρόγραμμα <command>pdisk</command> για MacOS, μπορείτε να χρησιμοποιήσετε την εντολή L για τον έλεγχο του αριθμού αυτού, τον οποίο θα χρειαστείτε για την εντολή που θα πληκτρολογήσετε στην προτροπή του Open Firmware κατά την εκκίνηση του εγκαταστάτη.
ko: 이 파일은 넣어 둔 MacOS 파티션의 파티션 번호를 적어 놓으십시오. MacOS의 <command>pdisk</command> 프로그램이 있으면, L 명령으로 파티션 번호를 알아낼 수 있습니다. 이 파티션 번호는 나중에 Open Firmware 프롬프트에서 설치 프로그램을 부팅하는 명령에서 사용합니다.
pt: Tome nota do número da partição do MacOS onde colocou estes ficheiros. Se tem o programa <command>pdisk</command> de MacOS, pode utilizar o comando L para verificar o número da partição. Vai necessitar desse número para o comando que vai escrever na prompt do Open Firmware quando iniciar o instalador.
ru: Запомните номер раздела MacOS, куда вы поместили эти файлы. Если у вас есть MacOS программа <command>pdisk</command>, то вы можете воспользоваться командойL, чтобы узнать номер раздела. Вам потребуется этот номер раздела для ввода в команду приглашения Open Firmware, когда вы будете загружать программу установки.
zh_cn: 记下您存放这些文件的 MacOS 分区号。如果您有 MacOS 的 <command>pdisk</command> 程序，您可以使用 L 命令检查分区号。当引导安装程序的时候，您需要这个分区号码用于在 Open Firmware 提示符下面输入命令。
zh_tw: 記下您存放這些文件的 MacOS 分割區號。如果您有 MacOS 的 <command>pdisk</command> 程式，您可以使用 L 指令檢查分割區號。當開機安裝程式的時候，您需要這個分割區號碼用於在 Open Firmware 提示符號下面輸入指令。

source: To boot the installer, proceed to <xref linkend="boot-newworld"/>.
el: Για την εκκίνηση του εγκαταστάτη προχωρήστε στην ενότητα <xref linkend="boot-newworld"/>.
ko: 설치 프로그램을 부팅하려면, <xref linkend="boot-newworld"/> 부분으로 계속 진행하십시오.
pt: Para iniciar o instalador, prossiga para a <xref linkend="boot-newworld"/>.
ru: Продолжение загрузки программу установки читайте в <xref linkend="boot-newworld"/>.
zh_cn: 要引导安装程序，请进入 <xref linkend="boot-newworld"/>。
zh_tw: 要啟動安裝程式，請進入 <xref linkend="boot-newworld"/>。

source: Preparing Files for TFTP Net Booting
el: Προετοιμασία Αρχείων για δικτυακή εκκίνηση με TFTP
ko: TFTP 네트워크 부팅에 필요한 파일 준비하기
pt: Preparar Ficheiros para arranque pela Rede via TFTP
ru: Подготовка файлов для загрузки по TFTP
zh_cn: 为使用 TFTP 网络引导准备文件
zh_tw: 準備以 TFTP 網路開機用的檔案

source: If your machine is connected to a local area network, you may be able to boot it over the network from another machine, using TFTP. If you intend to boot the installation system from another machine, the boot files will need to be placed in specific locations on that machine, and the machine configured to support booting of your specific machine.
el: Αν το μηχάνημά σας είναι συνδεδεμένο σε ένα τοπικό δίκτυο (local area network), μπορείτε ίσως να το εκκινήσετε από ένα άλλο μηχάνημα μέσω του δικτύου αυτού χρησιμοποιώντας TFTP. Αν προτίθεστε να εκκινήσετε το σύστημα εγκατάστασης από ένα άλλο μηχάνημα, τα αρχεία εκκίνησης θα πρέπει να τοποθετηθούν σε συγκεκριμένες θέσεις στο μηχάνημα αυτό, το οποίο πρέπει επίσης να είναι ρυθμισμένο ώστε να υποστηρίζει την εκκίνηση του συγκεκριμένου μηχανήματός σας.
ko: LAN에 연결되어 있다면, 네트워크를 통해 TFTP를 사용해서 다른 기계에서 부팅할 수도 있습니다. 다른 기계에서 설치 시스템을 부팅하려고 한다면, 부팅 파일을 특정 위치에 복사해 놓고, 해당 기계의 부팅을 지원하도록 설정해 놓아야 합니다.
pt: Se a sua máquina está ligada a uma rede local, pode ser capaz de a arrancar através da rede a partir de outra máquina, utilizando TFTP. Se tenciona iniciar a instalação do sistema a partir de outra máquina, será necessário colocar os ficheiros de arranque numa localização específica dessa máquina, e a máquina configurada para suportar o arranque da sua máquina especifica.
ru: Если ваша машина подключена к локальной сети, то вы можете загрузить её по сети с другой машины через TFTP. Для этого на удалённую машину в определённое место вам нужно поместить загрузочные файлы и настроить поддержку загрузки вашей машины.
zh_cn: 如果您的机器连接到了一个局域网，您可以从网络上的另外一台机器上面通过 TFTP 来引导它。如果您倾向从另外一台机器上面引导安装系统，则引导文件需要放在那台机器上面的某个特殊地方，并且配置好能够能够支持对您的机器进行引导。
zh_tw: 如果您的機器連接到了一個區域網路，您可以從網路上的另外一台機器上面透過 TFTP 來開機。如果您傾向從另外一台機器上面啟動安裝系統，則開機檔案需要放在那台機器上面的某個特殊地方，並且設定您的機器從該機器進行開機。

source: You need to setup a TFTP server, and for many machines, a BOOTP server <phrase condition="supports-rarp">, or RARP server</phrase> <phrase condition="supports-dhcp">, or DHCP server</phrase>.
el: Θα πρέπει να στήσετε έναν εξυπηρετητή TFTP, και για περισσότερα μηχανήματα έναν εξυπηρετητή BOOTP <phrase condition="supports-rarp">, ή έναν εξυπηρετητή RARP</phrase> <phrase condition="supports-dhcp">, ή έναν εξυπηρετητή DHCP</phrase>.
ko: TFTP 서버를 설정해야 합니다. 그리고 많은 기계에서 BOOTP 서버<phrase condition="supports-rarp"> 아니면 RARP 서버</phrase><phrase condition="supports-dhcp">, 아니면 DHCP 서버</phrase>를 설정해야 합니다.
pt: Precisa configurar o servidor TFTP, e para muitas máquinas, um servidor BOOTP <phrase condition="supports-rarp">, ou servidor RARP</phrase> <phrase condition="supports-dhcp">, ou um servidor DHCP</phrase>.
ru: Вам нужно настроить TFTP сервер, а если машин много, то BOOTP сервер<phrase condition="supports-rarp"> или RARP сервер</phrase> <phrase condition="supports-dhcp"> или DHCP сервер</phrase>.
zh_cn: 您需要设置一台 TFTP 服务器，并且对于很多机器来说，还需要一台 BOOTP 服务器 <phrase condition="supports-rarp">，或 RARP 服务器</phrase> <phrase condition="supports-dhcp">，又或 DHCP 服务器</phrase>。
zh_tw: 您需要設置一台 TFTP 伺服器，對於很多機器來說，還需要一台 BOOTP 伺服器 <phrase condition="supports-rarp">，或 RARP 伺服器</phrase> <phrase condition="supports-dhcp">，又或 DHCP 伺服器</phrase>。

source: <phrase condition="supports-rarp">The Reverse Address Resolution Protocol (RARP) is one way to tell your client what IP address to use for itself. Another way is to use the BOOTP protocol. </phrase> <phrase condition="supports-bootp">BOOTP is an IP protocol that informs a computer of its IP address and where on the network to obtain a boot image. </phrase> <phrase arch="m68k"> Yet another alternative exists on VMEbus systems: the IP address can be manually configured in boot ROM. </phrase> <phrase condition="supports-dhcp">The DHCP (Dynamic Host Configuration Protocol) is a more flexible, backwards-compatible extension of BOOTP. Some systems can only be configured via DHCP. </phrase>
el: <phrase condition="supports-rarp">Το Reverse Address Resolution Protocol (RARP) είναι ένας τρόπος να πείτε στον client ποια διεύθυνση IP να χρησιμοποιήσει ο ίδιος. Ένας άλλος τρόπος είναι να χρησιμοποιήσετε το πρωτόκολλο BOOTP. </phrase> <phrase condition="supports-bootp">Το BOOTP είναι ένα πρωτόκολλο IP που πληροφορεί έναν υπολογιστή για το ποια είναι η διεύθυνση του IP και από πού στο δίκτυο να αποκτήσει μια εικόνα εκκίνησης. </phrase><phrase arch="m68k"> Μια άλλη εναλλακτική λύση σε συστήματα VMEbus: η διεύθυνση IP μπορεί να δοθεί χειροκίνητα στην μνήμη εκκίνησης ROM. </phrase><phrase condition="supports-dhcp">Το πρωτόκολλο DHCP (Dynamic Host Configuration Protocol) είναι μια πιο ευέλικτη και συμβατή προς τα πίσω επέκταση του πρωτοκόλλου BOOTP. Κάποια συστήματα μπορούν να ρυθμιστούν μόνο μέσω του πρωτοκόλλου αυτού. </phrase>
ko: <phrase condition="supports-rarp">Reverse Address Resolution Protocol은 (RARP) 어떤 클라이언트에게 어떤 IP 주소를 사용해야 하는 지 알려주는 한 방법입니다. 또 다른 방법은 BOOP 프로토콜을 사용하는 것입니다. </phrase> <phrase condition="supports-bootp">BOOTP는 컴퓨터에게 그 IP 주소 및 네트워크의 어디에서 부팅 이미지를 가져와야 하는 지 알려주는 IP 프로토콜입니다. </phrase> <phrase arch="m68k"> VMEbus 시스템에서는 또 다른 방법이 있습니다. 부팅 ROM에 IP 주소를 수동으로 설정할 수 있습니다. </phrase> <phrase condition="supports-dhcp">DHCP는 (Dynamic Host Configuration Protocol) 더 유연하며, BOOTP와 호환되는 확장 기능입니다. 일부 시스템은 DHCP를 이용해야만 설정할 수 있습니다. </phrase>
pt: <phrase condition="supports-rarp"> O Reverse Address Resolution Protocol (RARP) é uma maneira de informar o cliente qual o IP deve usar. Outra maneira é utilizar o protocolo BOOTP. </phrase> <phrase condition="supports-bootp">BOOTP é um protocolo IP que informa o computador do seu endereço IP e em que local da rede pode obter uma imagem de arranque.</phrase> <phrase arch="m68k"> Ainda assim existe outra alternativa no sistema VMEbus: o endereço IP pode ser manualmente configurado na ROM de arranque. </phrase> <phrase condition="supports-dhcp"> O DHCP (Dynamic Host Configuration Protocol) é mais flexível, compatível com extensões anteriores do BOOTP. Alguns sistemas apenas podem ser configurados via DHCP. </phrase>
ru: <phrase condition="supports-rarp">Reverse Address Resolution Protocol (RARP) &mdash; это один из путей указать клиенту какой адрес IP для него предназначен. Другой способ &mdash; использовать BOOTP протокол. </phrase> <phrase condition="supports-bootp">BOOTP &mdash; это IP протокол, который информирует компьютер о его IP адресе и где в сети получить загрузочный образ. </phrase> <phrase arch="m68k"> Другая альтернатива есть на системах VMEbus: IP адрес можно вручную настроить в boot ROM. </phrase> <phrase condition="supports-dhcp">DHCP (Dynamic Host Configuration Protocol) более гибок и обратно совместим с BOOTP. Некоторые системы могут быть настроены только через DHCP.</phrase>
zh_cn: <phrase condition="supports-rarp">反向地址解析协议( The Reverse Address Resolution Protocol (RARP)) 是一种告诉您的客户它自己 IP 地址的方法。另外一种方法是采用 BOOTP 协议。</phrase> <phrase condition="supports-bootp">BOOTP 是一种 IP 协议，用来告诉一台计算机它自己 IP 地址以及从网络何处获得启动映像。</phrase> <phrase arch="m68k">在 VMEbus 系统上面的另外一种选择是：IP 地址可以能够在引导 ROM 中手工配置。</phrase> <phrase condition="supports-dhcp">DHCP (动态主机配置协议 Dynamic Host Configuration Protocol) 是一个更灵活，向后兼容的 BOOTP 拓展。有一些系统只能通过 DHCP 来配置。</phrase>
zh_tw: <phrase condition="supports-rarp">反向位址解析協議 (The Reverse Address Resolution Protocol, RARP) 是一種告訴您的客戶它自己 IP 位址的方法。另外一種方法是 BOOTP 通訊協定。</phrase> <phrase condition="supports-bootp">BOOTP 是一種 IP 通訊協定，用來告訴電腦它自己的 IP 位址以及從網路何處取得啟動映像。</phrase> <phrase arch="m68k">在 VMEbus 系統上面的另外一種選擇是：IP 位址可以在開機 ROM 中手動設定。</phrase> <phrase condition="supports-dhcp">DHCP (動態主機設定協定 Dynamic Host Configuration Protocol) 是一個更靈活，向後相容的 BOOTP 延伸。有一些系統只能透過 DHCP 來配置。</phrase>
