Repository: xobs/debian-installer
Catalog: doc/manual/po/*/install-methods.po
Languages: el, ko, pt, ru, zh_cn, zh_tw

source: The <filename>yaboot.conf</filename> configuration file should contain the following lines: <informalexample><screen> default=install root=/dev/ram message=/boot.msg image=/vmlinux label=install initrd=/initrd.gz initrd-size=10000<phrase condition="sarge"> append="devfs=mount,dall --"</phrase> read-only </screen></informalexample> Please note that the <userinput>initrd-size</userinput> parameter may need to be increased, depending on the image you are booting.
el: Το αρχείο ρυθμίσεων <filename>yaboot.conf</filename> πρέπει να περιέχει τις ακόλουθες γραμμές: <informalexample><screen> default=install root=/dev/ram message=/boot.msg image=/vmlinux label=install initrd=/initrd.gz initrd-size=10000<phrase condition="sarge"> append="devfs=mount,dall --"</phrase> read-only </screen></informalexample> Παρακαλούμε προσέξτε ότι η παράμετρος <userinput>initrd-size</userinput> πιθανόν να πρέπει να αυξηθεί ανάλογα με την εικόνα ramdisk που εκκινείτε.
ko: <filename>yaboot.conf</filename> 설정 파일에는 다음 줄이 들어 있습니다: <informalexample><screen> default=install root=/dev/ram message=/boot.msg image=/vmlinux label=install initrd=/initrd.gz initrd-size=10000<phrase condition="sarge"> append="devfs=mount,dall --"</phrase> read-only </screen></informalexample> <userinput>initrd-size</userinput> 파라미터는 부팅하려는 이미지에 따라 크기를 늘려야 할 수도 있습니다.
pt: O ficheiro de configuração <filename>yaboot.conf</filename> deve conter as seguintes linhas:<informalexample><screen> default=install root=/dev/ram message=/boot.msg image=/vmlinux label=install initrd=/initrd.gz initrd-size=10000<phrase condition="sarge"> append="devfs=mount,dall --"</phrase> read-only </screen></informalexample> Por favor note que o parâmetro <userinput>initrd-size</userinput> pode necessitar ser aumentado, dependendo da imagem de que está a iniciar.
ru: Конфигурационный файл <filename>yaboot.conf</filename> должен содержать следующие строки: <informalexample><screen> default=install root=/dev/ram message=/boot.msg image=/vmlinux label=install initrd=/initrd.gz initrd-size=10000<phrase condition="sarge"> append="devfs=mount,dall --"</phrase> read-only </screen></informalexample> Учтите, что может потребоваться увеличить параметр <userinput>initrd-size</userinput>, в зависимости от загружаемого образа.
zh_cn: <filename>yaboot.conf</filename> 配置文件应该含有以下几行： <informalexample><screen> default=install root=/dev/ram message=/boot.msg image=/vmlinux label=install initrd=/initrd.gz initrd-size=10000<phrase condition="sarge"> append="devfs=mount,dall --"</phrase> read-only </screen></informalexample> 请注意，在必要的时候，您可能需要增大<userinput>initrd-size</userinput> 参数的数值，这完全取决于您所使用的内存映像的大小。
zh_tw: <filename>yaboot.conf</filename> 設定檔應該含有以下幾行：<informalexample><screen> default=install root=/dev/ram message=/boot.msg image=/vmlinux label=install initrd=/initrd.gz initrd-size=10000<phrase condition="sarge"> append="devfs=mount,dall --"</phrase> read-only </screen></informalexample> 請注意，在必要的時候，您可能需要增大<userinput>initrd-size</userinput> 參數的數值，這完全取決於您所使用的記憶體映像的大小。

source: Adding an ISO image
el: Προσθήκη ενός ειδώλου ISO
ko: ISo 이미지 추가하기
pt: Adicionar uma imagem ISO
ru: Добавление ISO образа
zh_cn: 添加 ISO 映像
zh_tw: 添加 ISO 映像

source: Now you should put any Debian ISO image (businesscard, netinst or even a full one) onto your stick (if it fits). The file name of such an image must end in <filename>.iso</filename>.
el: Τώρα θα πρέπει να τοποθετήσετε οποιοδήποτε είδωλο από Debian ISO (businesscard, netinst ή και το πλήρες CD) στο stick σας (εφόσον χωράει). Το όνομα του αρχείου πρέπει να τελειώνει σε <filename>.iso</filename>.
ko: 데비안 ISO 이미지를 (비지니스 카드, 네트워크 설치 아니면 완전한 버전이라도) USB 스틱에 (들어간다면) 넣습니다. 이미지의 파일 이름은 <filename>.iso</filename>로 끝나야 합니다.
pt: Agora você deve colocar uma imagem Debian ISO (businesscard, netinst ou até uma completa) no seu stick (se couber). O nome do ficheiro de tal imagem deve terminar em <filename>.iso</filename>.
ru: Теперь вы должны положить на карту памяти какой-нибудь ISO образ Debian (businesscard, netinst или даже образ первого CD) (если он влезет). Имя файла образа обязательно должно заканчиваться на <filename>.iso</filename>.
zh_cn: 现在您需要把任意一个 Debian ISO 映像(businesscard、netinst 或者甚至是完全版)放入您的 USB 闪盘内(如果它装得下的话)。这样的一个映像文件的后缀名必须是 <filename>.iso</filename>。
zh_tw: 現在您需要把任意一個 Debian ISO 映像 (businesscard、netinst 或者甚至是完全版) 放入您的 USB 隨身碟內 (如果它裝得下的話)。這樣的一個映像檔的副檔名必須是 <filename>.iso</filename>。

source: If you want to install over the network, without using an ISO image, you will of course skip the previous step. Moreover you will have to use the initial ramdisk from the <filename>netboot</filename> directory instead of the one from <filename>hd-media</filename>, because <filename>hd-media/initrd.gz</filename> does not have network support.
el: Αν θέλετε να κάνετε εγκατάσταση πάνω από το δίκτυο, χωρίς την χρήση ενός ειδώλου ISO, προφανώς θα παραλείψετε το προηγούμενο βήμα. Επιπλέον θα πρέπει να χρησιμοποιήσετε το αρχικό είδωλο ramdisk από τον κατάλογο <filename>netboot</filename> αντί του καταλόγου <filename>hd-media</filename>, επειδή το είδωλο <filename>hd-media/initrd.gz</filename> δεν έχει υποστήριξη για δίκτυο.
ko: ISO 이미지 없이 네트워크로 설치하려면, 앞의 단계를 건너 뛰십시오. 또 최초 램디스크로 <filename>hd-media</filename> 디렉토리에 있는 파일 말고, <filename>netboot</filename> 디렉토리에 있는 파일을 사용해야 합니다. <filename>hd-media/initrd.gz</filename> 이미지는 네트워크를 지원하지 않습니다.
pt: Se quiser instalar através da rede, sem utilizar uma imagem ISO, saltará naturalmente o passo anterior. Além disso você terá de usar a ramdisk inicial da directoria <filename>netboot</filename> em vez daquela do <filename>hd-media</filename>, porque <filename>hd-media/initrd.gz</filename> não tem suporte para rede.
ru: Если вы хотите выполнять установку через сеть, без использования ISO образа, вам естественно нужно пропустить предыдущий шаг. Кроме того, вам нужно использовать ramdisk из каталога <filename>netboot</filename>, а не из <filename>hd-media</filename>, так как в <filename>hd-media/initrd.gz</filename> нет поддержки сети.
zh_cn: 如果您想直接通过网络安装而不使用 ISO 映像，当然就可以跳过上述步骤。并且您必须要使用 <filename>netboot</filename> 目录中的初始化内存映像来取代来自 <filename>hd-media</filename> 的相同文件。这是因为 <filename>hd-media/initrd.gz</filename> 并不包含网络支持。
zh_tw: 如果您想直接透過網路安裝而不使用 ISO 映像，當然就可以跳過上述步驟。並且您必須要使用 <filename>netboot</filename> 目錄中的初始化記憶體映像來取代來自 <filename>hd-media</filename> 的相同檔案。這是因為 <filename>hd-media/initrd.gz</filename> 並不包含網路支援。

source: When you are done, unmount the USB memory stick (<userinput>umount /mnt</userinput>) and activate its write protection switch.
el: Όταν τελειώσετε, αποπροσαρτήστε το USB stick μνήμης (<userinput>umount /mnt</userinput>) και ενεργοποιήστε την προστασία εγγραφής.
ko: 다 끝나면, USB 메모리 스틱의 마운트를 해제하고 (<userinput>umount /mnt</userinput>) 쓰기 방지 스위치를 거십시오?
pt: Quando terminar, desmonte o stick de memória USB (<userinput>umount /mnt</userinput>) e active a sua protecção de escrita.
ru: После завершения копирования, размонтируйте карту памяти USB (<userinput>umount /mnt</userinput>) и включите защиту от записи.
zh_cn: 当您完成后，卸载 USB 闪盘(<userinput>umount /mnt</userinput>)并打开写保护。
zh_tw: 當您完成後，卸載 USB 隨身碟 (<userinput>umount /mnt</userinput>) 並打開防寫保護。

source: Booting the USB stick
el: Εκκίνηση από το USB stick
ko: USB 스틱 부팅하기
pt: Arrancar do stick USB
ru: Загрузка с карты памяти USB
zh_cn: 从 USB 闪盘启动
zh_tw: 以 USB 隨身碟開機

source: If your system refuses to boot from the memory stick, the stick may contain an invalid master boot record (MBR). To fix this, use the <command>install-mbr</command> command from the package <classname>mbr</classname>:
el: Αν το σύστημά σας αρνείται να εκκινήσει, τότε το stick ίσως περιέχει ένα μη έγκυρο Κύριο Αρχείο Εκκίνησης (MBR). Για να το διορθώσετε αυτό, χρησιμοποιήστε την εντολή <command>install-mbr</command> από το πακέτο <classname>mbr</classname>:
ko: 메모리 스틱에서 부팅하지 못한다면, USB 스틱의 master boot record가 (MBR) 잘못되었을 수 있습니다. 바로잡으려면 <classname>mbr</classname> 꾸러미에서 <command>install-mbr</command> 명령을 사용하십시오:
pt: Se o seu sistema se recusa a arrancar a partir do stick de memória, este stick pode conter um master boot record (MBR) inválido. Para solucionar isto, utilize o comando <command>install-mbr</command> do pacote <classname>mbr</classname>:
ru: Если машина не хочет загружаться с карты памяти USB, то одной из причин может быть неправильная главная загрузочная запись (MBR). Чтобы исправить её, используйте команду <command>install-mbr</command> из пакета <classname>mbr</classname>:
zh_cn: 如果您的系统拒绝从 USB 闪盘引导，那么可能是因为它含有无效的主引导扇区记录(MBR)。您可以使用 <command>install-mbr</command> 命令来修复这个问题，该命令来自 <classname>mbr</classname> 软件包：
zh_tw: 如果您的系統拒絕從 USB 隨身碟開機，那麼可能是因為它含有無效的主開機磁區記錄 (MBR)。您可以使用 <command>install-mbr</command> 指令來修復這個問題，該指令來自 <classname>mbr</classname> 軟體套件：

source: Preparing Files for Hard Disk Booting
el: Προετοιμασία των αρχείων για Εκκίνηση από Σκληρό Δίσκο
ko: 하드 디스크 부팅에 필요한 파일 준비하기
pt: Preparar Ficheiros para Arrancar a Partir de Disco Rígido.
ru: Подготовка файлов для загрузки с жёсткого диска
zh_cn: 为从硬盘引导准备文件
zh_tw: 準備從硬碟開機的檔案

source: The installer may be booted using boot files placed on an existing hard drive partition, either launched from another operating system or by invoking a boot loader directly from the BIOS.
el: O εγκαταστάτης μπορεί να ξεκινήσει χρησιμοποιώντας αρχεία εκκίνησης τοποθετημένα σε ένα υπάρχον τμήμα του σκληρού δίσκου και που ενεργοποιούνται είτε μέσα από ένα άλλο λειτουργικό σύστημα είτε καλώντας έναν φορτωτή εκκίνησης (boot loader) κατευθείαν από το BIOS.
ko: 설치 프로그램은 기존 하드 드라이브 파티션에 들어 있는 부팅 파일을 이용해서 부팅할 수 있습니다. 다른 운영체제를 통해서 실행할 수도 있고, 아니면 BIOS에서 직접 부트 로더를 실행할 수도 있습니다.
pt: O instalador pode ser iniciado utilizando os ficheiros de arranque colocados numa partição do disco rígido, quer seja lançado a partir de outro sistema operativo ou invocando directamente o gestor de arranque da BIOS.
ru: Программа установки может быть загружена из файлов, размещённых на существующем разделе жёсткого диска, или запущена из другой операционной системы или вызовом системного загрузчика прямо из BIOS.
zh_cn: 安装程序可以从硬盘分区上面用引导文件引导。它们可以在其它操作系统下面启动，或者直接使用 BIOS 提供的引导装载程序直接启动。
zh_tw: 安裝程式可以從硬碟分割區上面用開機文件開機。它們可以在其它作業系統下面啟動，或者直接使用 BIOS 提供的 boot-loader 直接啟動。

source: A full, <quote>pure network</quote> installation can be achieved using this technique. This avoids all hassles of removable media, like finding and burning CD images or struggling with too numerous and unreliable floppy disks.
el: Μια πλήρης,<quote>καθαρά δικτυακή</quote> εγκατάσταση μπορεί να γίνει χρησιμοποιώντας αυτή την τεχνική. Κάτι που παρακάμπτει όλες τις δυσκολίες των αφαιρέσιμων μέσων, όπως την εύρεση και εγγραφή εικόνων CD ή το παίδεμα με πολυάριθμες και αναξιόπιστες δισκέττες.
ko: <quote>네트워크만</quote> 사용해 완전히 설치하려면 이 방법을 사용하면 됩니다. 네트워크 설치를 사용하면 CD 이미지를 찾아서 구울 필요도 없고, 여러 장의 불안한 플로피와 씨름할 필요도 없습니다.
pt: Uma instalação completa <quote>pure network</quote> pode ser conseguida utilizando esta técnica. Isto evita todo o aborrecimento do media amovível, tal como encontrar e gravar imagens de CD ou lutar com demasiadas e não fiáveis imagens de disquetes.
ru: <quote>Полностью сетевой</quote> установки можно достичь с помощью этой техники. Она позволяет избежать всех неприятностей со сменными носителями, например поиск и прожиг CD образов или борьбы с кучей нечитаемых дискет.
zh_cn: 采用这个技术可以实现完全的<quote>纯网络</quote>的安装方式。这样可以避免一些使用可移动介质带来的的缺点，比如寻找和刻录光盘映像或是与大量且不可靠的软盘纠缠不清。
zh_tw: 採用這個技術可以實現完全的<quote>純網路</quote>的安裝方式。這樣可以避免一些使用可移動媒介帶來的的缺點，例如尋找和燒錄光碟映像或是與大量且不可靠的軟碟糾纏不清。

source: The installer cannot boot from files on an NTFS file system.
el: Ο εγκαταστάτης δεν μπορεί να ξεκινήσει από αρχεία σε ένα NTFS σύστημα αρχείων.
ko: 설치 프로그램은 NTFS 파일시스템의 파일에서는 부팅할 수 없습니다.
pt: O instalador não pode arrancar a partir dos ficheiros num sistema de ficheiros NTFS.
ru: Программа установки не может загрузиться из файлов, расположенных в файловой системе NTFS.
zh_cn: 安装程序无法从 NTFS 文件系统上进行引导。
zh_tw: 安裝程式無法在 NTFS 檔案系統上開機。

source: The installer cannot boot from files on an HFS+ file system. MacOS System 8.1 and above may use HFS+ file systems; NewWorld PowerMacs all use HFS+. To determine whether your existing file system is HFS+, select <userinput>Get Info</userinput> for the volume in question. HFS file systems appear as <userinput>Mac OS Standard</userinput>, while HFS+ file systems say <userinput>Mac OS Extended</userinput>. You must have an HFS partition in order to exchange files between MacOS and Linux, in particular the installation files you download.
el: Ο εγκαταστάτης δεν μπορεί να ξεκινήσει όταν τα αρχεία είναι σε HFS+ σύστημα αρχείων που τα λειτουργικά συστήματα MacOS System 8.1 και μετέπειτα ίσως χρησιμοποιούν. Όλοι οι NewWorld PowerMac χρησιμοποιούν HFS+. Για να προσδιορίσετε αν το υπάρχον σύστημα αρχείων σας είναι HFS+, επιλέξτε <userinput>Get Info</userinput> για τον εν λόγω δίσκο. Συστήματα αρχείων HFS εμφανίζονται σαν <userinput>Mac OS Standard</userinput>, ενώ αυτά που είναι HFS+ έχουν την ένδειξη <userinput>Mac OS Extended</userinput>. Πρέπει να έχετε ένα τμήμα με HFS για να μπορέσετε να ανταλλάξετε αρχεία μεταξύ του MacOS και του Linux, και συγκεκριμένα τα αρχεία που κατεβάζετε.
ko: 설치 프로그램은 HFS+ 파일 시스템에서는 부팅할 수 없습니다. MacOS 시스템 8.1과 그 후의 버전은 HFS+ 파일 시스템을 사용할 수도 있습니다. NewWorld PowerMac은 전부 HFS+를 사용합니다. 기존 파일 시스템이 HFS+인지 아닌지 알아보려면, 해당 볼륨에서 <userinput>Get Info</userinput>를 선택하십시오. HFS 파일 시스템은 <userinput>Mac OS Standard</userinput>라고 나오고, HFS+ 파일 시스템은 <userinput>Mac OS Extended</userinput>라고 나옵니다. MacOS와 리눅스 사이에 파일을 교환하려면 HFS 파티션을 만들어야 합니다. 특히 설치에 쓸 파일들을 내려 받을 때 이 파티션이 필요합니다.
pt: O instalador não pode iniciar dos ficheiros num sistema de ficheiros HFS+. O sistema MacOS 8.1 e abaixo pode utilizar o sistema de ficheiros HFS+; NewWorld PowerMacs utilizam todos HFS+. Para determinar se os seu sistema de ficheiros é HFS+, seleccione <userinput>Get Info</userinput> para o volume em questão. O sistema de ficheiros HFS aparecem como <userinput>Mac OS Standard</userinput>, enquanto sistemas de ficheiros HFS+ são conhecidos como <userinput>Mac OS Extended</userinput>. Você deve ter uma partição HFS com o intuito de trocar ficheiros entre MacOS e Linux, em particular os ficheiros de instalação dos quais fez download.
ru: Программа установки не может загрузиться из файлов, расположенных на файловой системе HFS+. Система MacOS 8.1 и выше может использовать файловую систему HFS+; все NewWorld PowerMac используют HFS+. Чтобы определить, что используемая файловая системаHFS+, выберите <userinput>Get Info</userinput> для тома в вопросе. Файловые системы HFS называются <userinput>Mac OS Standard</userinput>, а файловые системы HFS+ <userinput>Mac OS Extended</userinput>. Вы должны иметь HFS раздел для обмена файлами между MacOS и Linux, в особенности, для загрузки файлов установки.
zh_cn: 安装程序无法从 HFS+ 文件系统进行引导。MacOS System 8.1 及之后的系统可能使用 HFS+ 文件系统，NewWorld PowerMacs 则全部使用 HFS+。要确认您的系统是否是 HFS+，请选择 <userinput>Get Info</userinput> 来查看相关卷信息。HFS 文件系统文件系统显示为 <userinput>Mac OS Standard</userinput>，而 HFS+ 文件系统将显示为 <userinput>Mac OS Extended</userinput>。您必须使用一个 HFS 分区来在 MacOS 和 Linux 之间交换文件，特别是那些您下载的安装文件。
zh_tw: 安裝程式無法從 HFS+ 檔案系統進行開機。MacOS System 8.1 及之後的系統可能使 用 HFS+ 檔案系統，NewWorld PowerMacs 則全部使用 HFS+。要確認您的系統是否是 HFS+，請選擇 <userinput>Get Info</userinput> 來查看相關資訊。HFS 檔案系統會顯示為 <userinput>Mac OS Standard</userinput>，而 HFS+ 檔案系統將顯示為 <userinput>Mac OS Extended</userinput>。您必須使用一個 HFS 分割區來在 MacOS 和 Linux 之間交換檔案，特別是那些您下載的安裝檔案。

source: Different programs are used for hard disk installation system booting, depending on whether the system is a <quote>NewWorld</quote> or an <quote>OldWorld</quote> model.
el: Ανάλογα με το αν το σύστημά σας είναι <quote>NewWorld</quote> ή <quote>OldWorld</quote> Mac, χρησιμοποιούνται διαφορετικά προγράμματα για εγκατάσταση από το σκληρό δίσκο.
ko: 시스템이 <quote>NewWorld</quote> 모델인지 <quote>OldWorld</quote> 모델인지에 따라, 하드 디스크로 설치 시스템을 부팅할 때 여러 가지 프로그램을 사용합니다.
pt: Diferentes programas são utilizados para iniciar uma instalação de um disco rígido, dependendo se o sistema é do modelo <quote>NewWorld</quote> ou um <quote>OldWorld</quote>.
ru: Для загрузки системы установки с жёсткого диска используются различные программы, в зависимости от модели: <quote>NewWorld</quote> или <quote>OldWorld</quote>.
zh_cn: 根据您的系统是<quote>NewWorld</quote>还是<quote>OldWorld</quote>型号，硬盘安装程序的引导将使用不同的安装文件。
zh_tw: 根據您的系統是 <quote>NewWorld</quote> 或 <quote>OldWorld</quote> 型號，硬碟安裝程式開機時將使用不同的安裝檔案。

source: Hard disk installer booting using <command>LILO</command> or <command>GRUB</command>
el: Εκκίνηση του εγκαταστάτη από το σκληρό δίσκο με χρήση <command>LILO</command> ή <command>GRUB</command>
ko: <command>LILO</command> 혹은 <command>GRUB</command>을 이용한 하드 디스크 설치 프로그램 부팅
pt: Arrancar o Instalador de disco rígido com o <command>LILO</command> ou <command>GRUB</command>
ru: Загрузка программы установки с жёсткого диска с помощью <command>LILO</command> или <command>GRUB</command>
zh_cn: 硬盘安装程序引导使用 <command>LILO</command> 或 <command>GRUB</command>
zh_tw: 使用 <command>LILO</command> 或 <command>GRUB</command>啟動硬碟安裝程式

source: This section explains how to add to or even replace an existing linux installation using either <command>LILO</command> or <command>GRUB</command>.
el: Η ενότητα αυτή εξηγεί πώς να προσθέσετε ή ακόμα και να αντικαταστήσετε την υπάρχουσα εγκατάστασή σας του Linux χρησιμοποιώντας είτε το <command>LILO</command> ή το <command>GRUB</command>.
ko: 여기서는 <command>LILO</command> 혹은 <command>GRUB</command>을 이용해 기존에 설치한 리눅스에 새로 추가하거나 아니면 기존 리눅스를 덮어 쓰는 방법을 설명합니다.
pt: Esta secção explica como adicionar ou substituir uma instalação de Linux existente utilizando tanto o <command>LILO</command> como o <command>GRUB</command>.
ru: Этот раздел описывает как добавить или даже заменить существующую установку linux с помощью <command>LILO</command> или <command>GRUB</command>.
zh_cn: 这一节将解释如何增加或者甚至替换现有的 linux 安装，通过 <command>LILO</command> 或 <command>GRUB</command>。
zh_tw: 這一節將解釋如何透過 <command>LILO</command> 或 <command>GRUB</command> 增加或者甚至替換現有的 linux 安裝。

source: At boot time, both bootloaders support loading in memory not only the kernel, but also a disk image. This RAM disk can be used as the root file-system by the kernel.
el: Στη διάρκεια της εκκίνησης, και οι δύο φορτωτές εκκίνησης υποστηρίζουν το φόρτωμα στην μνήμη όχι μόνο του πυρήνα αλλά και ενός ειδώλου δίσκου (disk image). Αυτός ο δίσκος RAM μπορεί να χρησιμοποιηθεί σαν ριζικό σύστημα αρχείων από τον πυρήνα.
ko: 부팅할 때 부트 로더 두 가지 모두 커널은 물론이고, 디스크 이미지도 메모리에 올리는 기능을 지원합니다. 이 로우 디스크는 커널의 루트 파일 시스템으로 사용할 수 있습니다.
pt: Na altura do arranque, ambos os gestores de arranque suportam carregar para a memória, não apenas o kernel, mas também a imagem de disco. Este disco RAM pode ser utilizado pelo kernel como sistema de ficheiros root.
ru: Во время загрузки оба системных загрузчика способны загружать в память не только ядро, но и образ диска. Этот RAMdisk может использоваться ядром в качестве корневой файловой системы.
zh_cn: 在启动时，两种引导器都支持将内核和磁盘映像加载到内存中。这个内存虚拟磁盘可以被用做内核的根文件系统。
zh_tw: 在開機時，兩種 boot-loader 都支援將核心和磁碟映像掛載到記憶體中。這個記憶體虛擬磁碟可以被用做核心的根檔案系統。

source: Copy the following files from the Debian archives to a convenient location on your hard drive, for instance to <filename>/boot/newinstall/</filename>.
el: Αντιγράψτε τα ακόλουθα αρχεία από τις αρχειοθήκες του Debian σε μια βολική τοποθεσία στο σκληρό σας δίσκο, για παράδειγμα στο <filename>/boot/newinstall/</filename>.
ko: 데비안 아카이브의 다음 파일을 하드 드라이브의 편리한 위치로 복사하십시오. 예를 들어 <filename>/boot/newinstall/</filename>같은 위치로 복사하십시오.
pt: Copie os seguintes ficheiros dos arquivos Debian para uma localização conveniente no seu disco, por exemplo para a <filename>/boot/newinstall/</filename>.
ru: Скопируйте следующие файлы из архива Debian в удобное место на жёстком диске, например в <filename>/boot/newinstall/</filename>.
zh_cn: 将以下文件从 Debian 存档中拷贝到硬盘中比较方便的地方，比如 <filename>/boot/newinstall/</filename>。
zh_tw: 將以下檔案從 Debian 檔案庫中拷貝到硬碟中比較方便的地方，例如 <filename>/boot/newinstall/</filename>。

source: <filename>vmlinuz</filename> (kernel binary)
el: <filename>vmlinuz</filename> (αρχείο πυρήνα)
ko: <filename>vmlinuz</filename> (커널 바이너리)
pt: <filename>vmlinuz</filename> (binário kernel)
ru: <filename>vmlinuz</filename> (файл ядра)
zh_cn: <filename>vmlinuz</filename>(内核二进制文件)
zh_tw: <filename>vmlinuz</filename>(核心二進位文件)

source: <filename>initrd.gz</filename> (ramdisk image)
el: <filename>initrd.gz</filename> (είδωλο δίσκου μνήμης)
ko: <filename>initrd.gz</filename> (램디스크 이미지)
pt: <filename>initrd.gz</filename> (imagem ramdisk)
ru: <filename>initrd.gz</filename> (образ ramdisk)
zh_cn: <filename>initrd.gz</filename> (内存虚拟磁盘映像)
zh_tw: <filename>initrd.gz</filename> (記憶體虛擬磁碟映像)

source: Finally, to configure the bootloader proceed to <xref linkend="boot-initrd"/>.
el: Τέλος, για να ρυθμίσετε τον φορτωτή εκκίνησης προχωρήστε στην ενότητα <xref linkend="boot-initrd"/>.
ko: 마지막으로 부트 로더를 설정하려면 <xref linkend="boot-initrd"/> 부분으로 진행하십시오.
pt: Finalmente, para configurar o gestor de arranque prossiga para a <xref linkend="boot-initrd"/>.
ru: Настройте системный загрузчик следуя указаниям <xref linkend="boot-initrd"/>.
zh_cn: 最后，要配置启动引导器，请进入 <xref linkend="boot-initrd"/>。
zh_tw: 最後，要設定 boot-loader，請進入 <xref linkend="boot-initrd"/>。

source: Hard Disk Installer Booting for OldWorld Macs
el: Εκκίνηση του Εγκαταστάτη από το σκληρό δίσκο για OldWorld Macs
ko: OldWorld Mac에서 하드 디스크 설치 프로그램 부팅
pt: Instalador para Disco Rígido para Macs OldWorld
ru: Загрузка программы установки с жёсткого диска для OldWorld Mac
zh_cn: 在 OldWorld Macs 上引导硬盘安装程序
zh_tw: OldWorld Macs 上的硬碟開機安裝程式
