Repository: xobs/debian-installer
Catalog: doc/manual/po/*/install-methods.po
Languages: el, ko, pt, ru, zh_cn, zh_tw

source: To write the floppy disk image files to the floppy disks, you will probably need root access to the system. Place a good, blank floppy in the floppy drive. Next, use the command <informalexample><screen> $ dd if=<replaceable>filename</replaceable> of=/dev/fd0 bs=1024 conv=sync ; sync </screen></informalexample> where <replaceable>filename</replaceable> is one of the floppy disk image files (see <xref linkend="downloading-files"/> for what <replaceable>filename</replaceable> should be). <filename>/dev/fd0</filename> is a commonly used name of the floppy disk device, it may be different on your workstation <phrase arch="sparc">(on Solaris, it is <filename>/dev/fd/0</filename>)</phrase>. The command may return to the prompt before Unix has finished writing the floppy disk, so look for the disk-in-use light on the floppy drive and be sure that the light is out and the disk has stopped revolving before you remove it from the drive. On some systems, you'll have to run a command to eject the floppy from the drive <phrase arch="sparc">(on Solaris, use <command>eject</command>, see the manual page)</phrase>.
el: Για να γράψετε ένα είδωλο δισκέττας σε δισκέττα, πιθανόν να χρειαστείτε πρόσβαση σαν χρήστης root στο σύστημα. Τοποθετήστε μια καλή, κενή δισκέττα στον οδηγό. Στη συνέχεια χρησιμοποιήστε την εντολή <informalexample><screen> dd if=<replaceable>file</replaceable> of=/dev/fd0 bs=1024 conv=sync ; sync </screen></informalexample> όπου <replaceable>file</replaceable> είναι ένα από τα αρχεία των ειδώλων δείτε <xref linkend="downloading-files"/> για το τι μπορεί να είναι το αρχείο <replaceable>file</replaceable>). Το <filename>/dev/fd0</filename> είναι ένα κοινά χρησιμοποιούμενο όνομα για μια συσκευή δισκέττας, που μπορεί να είναι διαφορετικό στο σταθμό εργασίας σας <phrase arch="sparc">(στο Solaris, είναι <filename>/dev/fd/0</filename>)</phrase>.Η εντολή μπορεί να επιστρέψει στο προτρεπτικό (prompt) πριν να ολοκληρωθεί από το Unix η εγγραφή της δισκέττας, οπότε θα πρέπει να κοιτάξετε για τη φωτεινή ένδειξη του "δισκου σε λειτουργία" και βεβαιωθείτε ότι αυτό έχει σβήσει και ότι η δισκέττα έχει σταματήσει να περιστρέφεται πριν να την απομακρύνετε από τη συσκευή. Σε κάποια συστήματα θα πρέπει να τρέξετε μια εντολή για την εξαγωγή της δισκέττας από τη συσκευή. <phrase arch="sparc">(στο Solaris, χρησιμοποιήστε <command>eject</command>, δείτε την σελίδα οδηγιών χρήσης) </phrase>.
ko: 플로피 디스크 이미지 파일을 플로피 디스크에 쓰려면, 보통은 시스템의 루트 권한이 있어야 합니다. 비어 있는 플로피를 플로피 드라이브에 넣으십시오. 그리고 다음 명령을 사용하십시오: <informalexample><screen> $ dd if=<replaceable>파일이름</replaceable> of=/dev/fd0 bs=1024 conv=sync ; sync </screen></informalexample> 여기서 <replaceable>파일이름</replaceable>은 플로피 디스크 이미지 파일의 이름입니다. (<replaceable>파일이름</replaceable>을 뭐라고 해야 할 지는 <xref linkend="downloading-files"/> 부분을 참고하십시오) 플로피 디스크 장치 이름으로는 <filename>/dev/fd0</filename>을 가장 많이 씁니다. 워크스테이션에서는 다를 수도 있습니다. <phrase arch="sparc">(Solaris에서는 <filename>/dev/fd/0</filename>입니다.)</phrase> 플로피 디스크에 데이터를 다 쓰기도 전에 명령어가 끝나서 프롬프트가 나올 수도 있기 때문에, 플로피 디스크가 사용중이라는 불이 깜박이는 지 잘 살펴 보시고 깜박이지 않을 때 플로피를 드라이브에서 빼야 합니다. 어떤 시스템에서는 플로피를 빼려면 플로피를 꺼내는 별도의 명령을 실행해야 합니다. <phrase arch="sparc">(Solaris에서는 <command>eject</command> 명령을 사용하십시오. 매뉴얼 페이지를 참고하십시오.)</phrase>
pt: Para escrever os ficheiros de imagem de disquete para as disquetes, você provavelmente necessitará de aceder ao sistema como root. Coloque uma disquete vazia em boas condições na drive de disquetes. Em seguida utilize o comando <informalexample><screen> $ dd if=<replaceable>ficheiro</replaceable> of=/dev/fd0 bs=1024 conv=sync ; sync </screen></informalexample> onde <replaceable>ficheiro</replaceable> é um dos ficheiros da imagem de disco (veja <xref linkend="downloading-files"/> para saber onde deve estar o <replaceable>ficheiro</replaceable>). <filename>/dev/fd0</filename> é o nome normalmente utilizado para o dispositivo de disquetes, pode ser diferente na sua máquina <phrase arch="sparc">(no Solaris, é <filename>/dev/fd/0</filename>)</phrase>. O comando pode libertar a linha de comandos antes do Unix ter terminado de escrever na disquete, verifique se a luz de utilização na drive de disquetes está apagada e se o disco parou antes de remover a disquete da drive. Em alguns sistemas, terá de executar um comando para ejectar a disquete <phrase arch="sparc">(no Solaris, execute <command>eject</command>, visite a página do manual)</phrase>.
ru: Для записи дисковых образов файлов на дискеты, вам вероятно понадобятся права суперпользователя. Вставьте хорошую, чистую дискету в дисковод. Затем введите команду <informalexample><screen> $ dd if=<replaceable>файл</replaceable> of=/dev/fd0 bs=1024 conv=sync ; sync </screen></informalexample> где <replaceable>файл</replaceable> &mdash; это один из файловых образов дискет (смотрите в <xref linkend="downloading-files"/> какой <replaceable>файл</replaceable> нужен). <filename>/dev/fd0</filename> &mdash; это имя устройства дисковода, оно может отличаться от используемого на вашей машине<phrase arch="sparc"> (в Solaris это<filename>/dev/fd/0</filename>)</phrase>. Команда может завершиться раньше, чем Unix завершит запись на дискету, поэтому следите за лампой дисковода и перед вытаскиванием дискеты убедитесь, что лампа погасла и диск перестал вращаться. На некоторых системах нужно выдать команду вытаскивания дискеты из дисковода<phrase arch="sparc"> (в Solaris используется команда <command>eject</command>, смотрите страницу руководства)</phrase>.
zh_cn: 为了把软盘映像写入软盘，您可能需要系统的 root 访问权限。在软驱中放入一张优质的空白软盘，然后使用命令 <informalexample><screen> $ dd if=<replaceable>filename</replaceable> of=/dev/fd0 bs=1024 conv=sync ; sync </screen></informalexample> 其中 <replaceable>filename</replaceable> 是一个软盘映像文件(请参阅 <xref linkend="downloading-files"/> 来获知应该使用哪个 <replaceable>filename</replaceable>)。<filename>/dev/fd0</filename> 是一个常见的软驱设备名。可能在您的工作站上面有所不同 <phrase arch="sparc">(在 Solaris 系统上是 <filename>/dev/fd/0</filename>)</phrase>。这个命令也许在写软盘任务结束之前就会返回到命令符下。请观察软盘驱动器上面的磁盘使用灯，并且确保在您拔出软盘的时候灯已熄灭。在某些系统上，您可能需要运行一条命令来弹出软盘 <phrase arch="sparc">(在 Solaris 系统中使用 <command>eject</command> 命令，请参见其手册)</phrase>。
zh_tw: 為了把軟碟映像檔寫入軟碟，您可能需要系統的 root 存取權限。在軟碟機中放入一張優質的空白軟碟，然後使用指令 <informalexample><screen> $ dd if=<replaceable>filename</replaceable> of=/dev/fd0 bs=1024 conv=sync ; sync </screen></informalexample> 其中 <replaceable>filename</replaceable> 是一個軟碟映像檔案(請參閱 <xref linkend="downloading-files"/> 來獲知應該使用哪個 <replaceable>filename</replaceable>)。<filename>/dev/fd0</filename> 是一個常見的軟碟機設備名。可能在您的工作站上面有所不同 <phrase arch="sparc">(在 Solaris 系統上是 <filename>/dev/fd/0</filename>)</phrase>。這個指令也許在寫入軟碟任務結束之前就會返回到指令提示號下。請觀察軟碟機上面的使用燈，並且確保在您拔出軟碟的時候燈已熄滅。在某些系統上，您可能需要下指令來退出磁片 <phrase arch="sparc">(在 Solaris 系統中使用 <command>eject</command> 命令，請參閱其手冊)</phrase>。

source: Some systems attempt to automatically mount a floppy disk when you place it in the drive. You might have to disable this feature before the workstation will allow you to write a floppy in <emphasis>raw mode</emphasis>. Unfortunately, how to accomplish this will vary based on your operating system. <phrase arch="sparc"> On Solaris, you can work around volume management to get raw access to the floppy. First, make sure that the floppy is auto-mounted (using <command>volcheck</command> or the equivalent command in the file manager). Then use a <command>dd</command> command of the form given above, just replace <filename>/dev/fd0</filename> with <filename>/vol/rdsk/<replaceable>floppy_name</replaceable></filename>, where <replaceable>floppy_name</replaceable> is the name the floppy disk was given when it was formatted (unnamed floppies default to the name <filename>unnamed_floppy</filename>). On other systems, ask your system administrator. </phrase>
el: Κάποια συστήματα προσπαθούν να προσαρτήσουν αυτόματα μια δισκέττα όταν την τοποθετείτε στη συσκευή. Πιθανόν να πρέπει να απενεργοποιήσετε το χαρακτηριστικό αυτό πριν να σας επιτρέψει ο σταθμός εργασίας σας να γράψετε μια δισκέττα σε <emphasis>raw μορφή</emphasis>. Δυστυχώς, το πώς θα το πετύχετε αυτό αλλάζει ανάλογα με το λειτουργικό σύστημά σας..<phrase arch="sparc"> Στο Solaris, μπορείτε να "παίξετε" με τη διαχείριση των δίσκων για να έχετε raw πρόσβαση στη δισκέττα. Πρώτα, σιγουρευτείτε ότι η δισκέττα προσαρτάται αυτόματα (χρησιμοποιώντας την εντολή <command>volcheck</command> ή την ισοδύναμή της στο διαχειριστή αρχείων). Μετά χρησιμοποιήστε μια εντολή <command>dd</command> του τύπου που είδαμε παραπάνω αντικαθιστώντας απλά το όνομα της συσκευής <filename>/dev/fd0</filename> με το <filename>/vol/rdsk/<replaceable>floppy_name</replaceable></filename>, όπου <replaceable>floppy_name</replaceable> είναι το όνομα που δόθηκε στη δισκέττα κατά την μορφοποίησή της (δισκέττες χωρίς μια τέτοια ονομασία παίρνουν εξ ορισμού το όνομα <filename>unnamed_floppy</filename>). Για άλλα συστήματα ρωτήστε τον διαχειριστή του συστήματός σας. </phrase>
ko: 어떤 시스템에서는 드라이브에 플로피 디스크를 넣으면 자동으로 마운트합니다. <emphasis>로우 모드</emphasis>로 플로피를 쓰려면 그 전에 이 기능을 꺼야 합니다. 불행히도, 이 기능을 끄는 방법은 운영 체제마다 다 다릅니다. <phrase arch="sparc">Solaris에서 플로피 디스크에 로우 모드로 접근하려면 볼륨 관리 기능을 피해가면 됩니다. 먼저 플로피가 자동 마운트되도록 하십시오. (<command>volcheck</command>나 파일 관리자의 해당 명령 사용) 그리고 <command>dd</command> 명령을 위에서 쓴 방법대로 쓰시고, 거기에서 <filename>/dev/fd0</filename>을 <filename>/vol/rdsk/<replaceable>플로피이름</replaceable></filename>이라고 바꾸십시오. (<replaceable>플로피이름</replaceable>은 포맷할 때 만든 플로피 이름입니다. 이름 없는 플로피는 기본값이 <filename>unnamed_floppy</filename>) 그 외의 시스템에서는 시스템 관리자에게 문의하십시오. </phrase>
pt: Alguns sistemas tentam automaticamente montar a disquete quando esta é colocada na drive. Você poderá ter de desactivar esta característica antes da máquina permitir efectuar a gravação da disquete em <emphasis>modo raw</emphasis>. Infelizmente, isto poderá variar consoante o sistema operativo. <phrase arch="sparc">No Solaris, você poderá encontrar uma maneira de conseguir acesso raw à disquete na gestão de volumes. Primeiro, certifique-se que a disquete é automaticamente montada (utilizando <command>volcheck</command> ou um comando equivalente no gestor de ficheiros). Execute então o comando <command>dd</command> da forma dada acima, substitua somente <filename>/dev/fd0</filename> por <filename>/vol/rdsk/<replaceable>nome da disquete</replaceable></filename>, onde <replaceable>nome da disquete</replaceable> é o nome dado à disquete na altura da sua formatação (o nome por omissão das disquetes é <filename>unnamed_floppy</filename>). Noutros sistemas, pergunte ao seu administrador de sistema. </phrase>
ru: Некоторые системы пытаются автоматически смонтировать дискету после появления её в дисководе. Вам может потребоваться выключить это свойство, иначе рабочая станция не позволит вам запись на дискету в <emphasis>сыром режиме</emphasis>. К сожалению, как этого достичь зависит от операционной системы. <phrase arch="sparc"> В Solaris для получения сырого доступа к дискете вы можете воспользоваться управлением тома. Во-первых, убедитесь, что дискета смонтирована автоматически (с помощью команды <command>volcheck</command> и её эквивалентом из менеджера файлов). Затем, воспользуйтесь командой <command>dd</command> как было показано выше, просто заменив <filename>/dev/fd0</filename> на <filename>/vol/rdsk/<replaceable>floppy_name</replaceable></filename>, где<replaceable>floppy_name</replaceable> это имя дисковода, которое было задано при форматировании (безимянные дискеты имеют имя по умолчанию<filename>unnamed_floppy</filename>).По другим системам, спросите вашего системного администратора. </phrase>
zh_cn: 有些系统会在您放入软盘时自动尝试对其进行挂载。若要让工作站允许您对软盘进行 <emphasis>原始模式</emphasis> 写入操作，您可能必须关闭此功能。不幸的是，如何关闭此功能的方法 完全取决于具体的操作系统。<phrase arch="sparc"> 在 Solaris 上，您可以利用卷管理来获得对软驱的原始访问权。首先，确信软盘已经被自动挂载(使用 <command>volcheck</command> 或者文件管理器中的类似命令)。然后安照上面给出的形式使用 <command>dd</command> 命令，只是把 <filename>/dev/fd0</filename> 替换成 <filename>/vol/rdsk/<replaceable>floppy_name</replaceable></filename>，这里 <replaceable>floppy_name</replaceable> 是软盘在格式化时所定的名字。(未命名的软盘默认使用 <filename>unnamed_floppy</filename>)。至于其他系统，请咨询您的系统管理员)。</phrase>
zh_tw: 有些系統會在您放入軟碟時自動嘗試對其進行掛載。若要讓工作站允許您對軟碟進行 <emphasis>原始模式</emphasis>寫入操作，您可能要關閉此功能。不幸的是，如何關閉此功能的方法完全取決於作業系統。<phrase arch="sparc"> 在 Solaris 上，您可以利用磁碟設備管理程式來取得對軟碟機的原始存取權。首先，確信軟碟已經被自動掛載 (使用 <command>volcheck</command> 或者檔案管理中的類似指令)。然後安照上面給出的形式使用 <command>dd</command> 指令，只是把 <filename>/dev/fd0</filename> 替換成 <filename>/vol/rdsk/<replaceable>floppy_name</replaceable></filename>，這裡 <replaceable>floppy_name</replaceable> 是軟碟在格式化時所定的名字。(未命名的軟碟預設使用 <filename>unnamed_floppy</filename>)。至於其他系統，請咨詢您的系統管理員)。</phrase>

source: If writing a floppy on powerpc Linux, you will need to eject it. The <command>eject</command> program handles this nicely; you might need to install it.
el: Αν γράφετε μια δισκέττα σε powerpc Linux,θα χρειαστεί να την εξάγετε. Το πρόγραμμα <command>eject</command> το κάνει αυτό με πολύ όμορφο τρόπο, καλό θα είναι να το εγκαταστήσετε.
ko: powerpc 리눅스에서 플로피를 쓰는 경우, 플로피를 꺼내는 명령을 사용해야 합니다. <command>eject</command> 프로그램을 사용합니다. 이 프로그램을 따로 설치해야 할 수도 있습니다.
pt: Se está a escrever nas disquetes num Linux em powerpc, necessitará de as ejectar. O programa <command>eject</command> é o apropriado; você pode ter de o instalar.
ru: Если запись производится на powerpc Linux, то вам нужно извлечь её. Программа<command>eject</command> отлично справляется этим; вам может потребоваться её установка.
zh_cn: 如果想在 powerpc Linux 上写入一张软盘，您将必须弹出它。<command>eject</command> 命令能够很好地对此进行控制，当然您可能需要先安装它。
zh_tw: 如果想在 powerpc Linux 上寫入軟碟，您將必須將之退出。<command>eject</command> 指令能夠對此進行控制，當然您可能需要先安裝它。

source: Writing Disk Images From DOS, Windows, or OS/2
el: Γράφοντας είδωλα δισκεττών σε DOS, Windows, ή OS/2
ko: DOS, Windows, OS/2에서 디스크 이미지 쓰기
pt: Gravar Imagens de Disco a partir de DOS, Windows, ou OS/2
ru: Запись образов дисков из DOS, Windows или OS/2
zh_cn: 在 DOS、Windows、或者 OS/2 下写磁盘映像
zh_tw: 在 DOS、Windows、或者 OS/2 下寫入磁碟映像檔

source: If you have access to an i386 machine, you can use one of the following programs to copy images to floppies.
el: Αν έχετε πρόσβαση σε ένα μηχάνημα i386, μπορείτε να χρησιμοποιήσετε ένα από τα παρακάτω προγράμματα για να αντιγράψετε τις εικόνες στις δισκέττες.
ko: i386 기계의 경우는, 다음 명령 중의 하나를 이용해 이미지를 플로피로 복사하십시오.
pt: Se você tem acesso a uma máquina i386, pode utilizar um dos seguintes programas para copiar imagens para disquetes.
ru: Если у вас есть доступ к машине с архитектурой i386, то для копирования образов на дискеты вы можете воспользоваться одной из программ, упомянутых ниже.
zh_cn: 如果您能操作一台 i386 机器，您可以使用如下方法之一往软盘拷贝映像文件。
zh_tw: 如果您能操作一台 i386 機器，您可以使用如下方法之一把映像檔拷貝到軟碟上。

source: The <command>rawrite1</command> and <command>rawrite2</command> programs can be used under MS-DOS. To use these programs, first make sure that you are booted into DOS. Trying to use these programs from within a DOS box in Windows, or double-clicking on these programs from the Windows Explorer is <emphasis>not</emphasis> expected to work.
el: Τα προγράμματα <command>rawrite1</command> και <command>rawrite2</command> μπορούν να χρησιμοποιηθούν με το MS-DOS. Για να χρησιμοποιήσετε τα προγράμματα αυτά πρώτα σιγουρευτείτε ότι έχετε εκκινήσει σε DOS. Προσπαθήστε να τα χρησιμοποιήσετε μέσα από ένα παράθυρο DOS στα Windows, καθώς ένα διπλό κλικ στα προγράμματα αυτά από τον Windows Explorer <emphasis>δεν</emphasis> αναμένεται να δουλέψει.
ko: MS-DOS에서는 <command>rawrite1</command> 및 <command>rawrite2</command> 프로그램을 사용할 수 있습니다. Windows에서는 DOS 창에서 사용하십시오. Windows 탐색기에서 이 프로그램을 두번 클릭해 봤자 동작하지 <emphasis>않습니다</emphasis>.
pt: Os programas <command>rawrite1</command> e <command>rawrite2</command> podem ser utilizados em MS-DOS. <emphasis>Não</emphasis> é esperado que funcionem se tentar utilizar estes programas numa consola DOS no Windows ou fazendo duplo-click a partir do Explorador do Windows.
ru: В MS-DOS можно использовать программы <command>rawrite1</command> и <command>rawrite2</command>. Сначала убедитесь, что вы загрузились в DOS. Попытка использовать эти программы в DOS-окне под Windows или с помощью двойного щелчка мышью из Проводника Windows, скорее всего <emphasis>не</emphasis> сработает.
zh_cn: <command>rawrite1</command> 和 <command>rawrite2</command> 程序可在 MS-DOS 下使用。如果想使用这些程序，首先要确定您是从 DOS 启动。在 Windows 的 DOS 窗口或者在 文件浏览器中双击使用这些程序是 <emphasis>不能</emphasis> 运行的。
zh_tw: <command>rawrite1</command> 和 <command>rawrite2</command> 程式可在 MS-DOS 下使用。如果想使用這些程式，首先要確定您是從 DOS 啟動。在 Windows 的 DOS 視窗或者在檔案瀏覽器中雙擊使用這些程式是<emphasis>不能</emphasis>執行的。

source: The <command>rwwrtwin</command> program runs on Windows 95, NT, 98, 2000, ME, XP and probably later versions. To use it you will need to unpack diskio.dll in the same directory.
el: Το πρόγραμμα <command>rwwrtwin</command> τρέχει σε Windows 95, NT, 98, 2000, ME, XP και πιθανά μεταγενέστερες εκδόσεις. Για να το χρησιμοποιήσετε θα πρέπει να αποσυμπιέσετε την βιβλιοθήκη diskio.dll στον ίδιο κατάλογο.
ko: <command>rwwrtwin</command> 프로그램은 Windows 95, NT, 98, 2000, ME, XP에서 (그리고 아마도 그 이후 버전에서도) 동작합니다. 사용하려면 같은 디렉토리에서 diskio.dll 파일을 풀어야 합니다.
pt: O programa <command>rwwrtwin</command> corre em Windows 95, NT, 98, 2000, ME, XP e provavelmente em versões posteriores. Para o utilizar terá de descompactar diskio.dll no mesmo directório.
ru: Программа <command>rwwrtwin</command> работает под Windows 95, NT, 98, 2000, ME, XP и, вероятно, с более поздними версиями. Для её использования вам надо распаковать diskio.dll в тот же самый каталог.
zh_cn: <command>rwwrtwin</command> 程序可以在 Windows 95、NT、98、2000、ME、XP 甚至可能最新的版本上运行。要使用它您需要解压 diskio.dll 至相同目录下。
zh_tw: <command>rwwrtwin</command> 程式可以在 Windows 95、NT、98、2000、ME、XP 甚至最新的版本上運行。要使用它您需要解壓 diskio.dll 至相同目錄下。

source: These tools can be found on the Official Debian CD-ROMs under the <filename>/tools</filename> directory.
el: Τα εργαλεία αυτά μπορούν να βρεθούν στα επίσημα CD-ROM του Debian και κάτω από τον κατάλογο <filename>/tools</filename>.
ko: 이 도구는 공식 데비안 CD-ROM의 <filename>/tools</filename> 디렉토리 아래에 있습니다.
pt: Estes utilitários podem ser encontrados nos CD-ROMs Oficiais de Debian na directoria <filename>/tools</filename>.
ru: Эти утилиты можно найти на официальных компакт-дисках Debian CD-ROM в каталоге <filename>/tools</filename>.
zh_cn: 这些工具可以在官方 Debian 光盘中找到。他们位于 <filename>/tools</filename> 目录下。
zh_tw: 這些工具可以在官方 Debian光碟中找到。他們位於 <filename>/tools</filename> 目錄下。

source: Writing Disk Images on Atari Systems
el: Εγγραφή ειδώλων δισκέττας σε συστήματα Atari
ko: Atari 시스템에서 디스크 이미지 쓰기
pt: Gravar Imagens de Disco em Sistemas Atari
ru: Создание образов дисков на машинах Atari
zh_cn: 在 Atari 系统上写磁盘映像
zh_tw: 在 Atari 系統上寫入磁碟映像檔

source: You'll find the &rawwrite.ttp; program in the same directory as the floppy disk images. Start the program by double clicking on the program icon, and type in the name of the floppy image file you want written to the floppy at the TOS program command line dialog box.
el: Θα βρείτε το πρόγραμμα &rawwrite.ttp; στον ίδιο κατάλογο όπου βρίσκονται οι εικόνες των δισκεττών. Ξεκινήστε το πρόγραμμα με διπλό κλικ πάνω στο εικονίδιο του προγράμματος, και πληκτρολογήστε το όνομα της εικόνας δισκέττας που θέλετε να γραφτεί στη δισκέττα στη γραμμή εντολών της κονσόλας του προγράμματος TOS.
ko: &rawwrite.ttp; 프로그램이 플로피 디스크 이미지와 같은 디렉토리에 들어 있습니다. 프로그램 아이콘에 두번 클릭해서 실행하고, TOS 프로그램의 명령행 대화 상자에서 플로피에 사용하려는 플로피 이미지 파일의 이름을 입력하십시오.
pt: Irá encontrar o programa &rawwrite.ttp; na mesma directoria que as imagens de disquetes. Inicie o programa fazendo duplo click no ícone do programa, e na caixa de diálogo da linha de comando escreva o nome do ficheiro da imagem de disquete que quer escrever para a disquete.
ru: В том же каталоге что и образы дискет вы найдёте программу &rawwrite.ttp;. Запустите программу двойным щелчком по иконке программы, и наберите имя файла образа, который хотите записать на дискету в командной строке диалогового окна программы TOS.
zh_cn: 您可以在与软盘映像相同的目录下找到 &rawwrite.ttp;。双击程序图标，在 TOS 程序 命令行输入框内键入您想写入软盘的软盘映像文件名。
zh_tw: 您可以在與軟碟映像檔相同的目錄下找到 &rawwrite.ttp;。雙擊程式圖示，在 TOS 程式 指令列輸入框內鍵入您想寫入軟碟的軟碟映像檔名。

source: Writing Disk Images on Macintosh Systems
el: Εγγραφή ειδώλων δισκεττών σε συστήματα Macintosh
ko: Macintosh 시스템에서 디스크 이미지 쓰기
pt: Gravar Imagens de Disco em Sistemas Macintosh
ru: Запись образов дисков на системах Macintosh
zh_cn: 在 Macintosh 系统上写磁盘映像
zh_tw: 在 Macintosh 系統上寫入磁碟映像檔

source: There is no MacOS application to write images to floppy disks (and there would be no point in doing this as you can't use these floppies to boot the installation system or install kernel and modules from on Macintosh). However, these files are needed for the installation of the operating system and modules, later in the process.
el: Δεν υπάρχει εφαρμογή στο λειτουργικό MacOS για την εγγραφή εικόνων δισκεττών σε δισκέττα (και δεν υπάρχει νόημα στο να κάνετε κάτι τέτοιο καθώς δεν μπορείτε να χρησιμοποιήσετε αυτές τις δισκέττες για να ξεκινήσετε το σύστημα εγκατάστασης ή να εγκαταστήσετε τον πυρήνα ή τα modules στον Macintosh). Παρ' όλα αυτά, τα αρχεία είναι απαραίτητα για την εγκατάσταση του λειτουργικού συστήματος και των modules, αργότερα στην πορεία της εγκατάστασης.
ko: 플로피 디스크에 이미지를 쓸 수 있는 MacOS 프로그램은 없습니다. (그래서 Macintosh에서 설치 시스템을 부팅하거나 커널이나 모듈 설치할 때 플로피 디스크를 사용할 방법이 없습니다) 하지만 이 파일들은 나중 단계에서 운영체제와 모듈을 설치할 때 필요합니다.
pt: Não existe nenhuma aplicação MacOS para gravar imagens para disquetes (e não haverá motivo em fazer isto dado que não pode utilizar estas disquetes para iniciar a instalação do sistema ou instalar o kernel e módulos num Macintosh). Contudo, estes ficheiros serão mais tarde necessários para instalar o sistema operativo e módulos.
ru: Для MacOS не существует приложения для записи образов на дискеты (и не существует метода как это сделать, так как вы не можете использовать дискеты для загрузки программы установки или для установки ядра и модулей из Macintosh). Однако, эти файлы понадобятся позже для установки операционной системы и модулей.
zh_cn: 没有一个 MacOS 应用程序可以用于将映像文件写到软盘(而且这也没有什么意义，因为您也不能在 Macintosh 系统上用软盘引导安装系统来安装内核以及模块)。但是，这些文件也被用来在后面的安装过程中安装操作系统和模块。
zh_tw: 沒有一個 MacOS 應用程式可以將映像檔寫到軟碟 (而且這也沒有什麼意義，因為您也不能在 Macintosh 系統上用軟碟啟動安裝系統來安裝核心以及模組)。但是，後續在安裝作業系統和模組時需要這些檔案。

source: Writing Disk Images From MacOS
el: Εγγραφή ειδώλων δισκέττας από το MacOS
ko: MacOS에서 디스크 이미지 쓰기
pt: Gravar Imagens de Disco a partir de MacOS
ru: Запись образов дисков из MacOS
zh_cn: 在 MacOS 上写磁盘映像
zh_tw: 在 MacOS 上寫入磁碟映像檔
