Repository: xobs/debian-installer
Catalog: doc/manual/po/*/install-methods.po
Languages: el, ko, pt, ru, zh_cn, zh_tw

source: To use CMU <command>bootpd</command>, you must first uncomment (or add) the relevant line in <filename>/etc/inetd.conf</filename>. On &debian;, you can run <userinput>update-inetd --enable bootps</userinput>, then <userinput>/etc/init.d/inetd reload</userinput> to do so. Elsewhere, the line in question should look like: <informalexample><screen> bootps dgram udp wait root /usr/sbin/bootpd bootpd -i -t 120 </screen></informalexample> Now, you must create an <filename>/etc/bootptab</filename> file. This has the same sort of familiar and cryptic format as the good old BSD <filename>printcap</filename>, <filename>termcap</filename>, and <filename>disktab</filename> files. See the <filename>bootptab</filename> manual page for more information. For CMU <command>bootpd</command>, you will need to know the hardware (MAC) address of the client. Here is an example <filename>/etc/bootptab</filename>: <informalexample><screen> client:\ hd=/tftpboot:\ bf=tftpboot.img:\ ip=192.168.1.90:\ sm=255.255.255.0:\ sa=192.168.1.1:\ ha=0123456789AB: </screen></informalexample> You will need to change at least the <quote>ha</quote> option, which specifies the hardware address of the client. The <quote>bf</quote> option specifies the file a client should retrieve via TFTP; see <xref linkend="tftp-images"/> for more details. <phrase arch="mips"> On SGI Indys you can just enter the command monitor and type <userinput>printenv</userinput>. The value of the <userinput>eaddr</userinput> variable is the machine's MAC address. </phrase>
el: Για να χρησιμοποιήσετε τον CMU <command>bootpd</command>, πρέπει πρώτα να <quote>αποσχολιάσετε</quote> (ή να προσθέσετε) την σχετική γραμμή στο αρχείο <filename>/etc/inetd.conf</filename>. Στο &debian;, μπορείτε να τρέξετε την εντολή <userinput>update-inetd --enable bootps</userinput>, και μετά <userinput>/etc/init.d/inetd reload</userinput> ώστε να ενεργοποιηθούν οι αλλαγές. Σε άλλα συστήματα, η ζητούμενη γραμμή πρέπει να είναι όπως: <informalexample><screen> bootps dgram udp wait root /usr/sbin/bootpd bootpd -i -t 120 </screen></informalexample> Τώρα, θα πρέπει να δημιουργήσετε ένα αρχείο <filename>/etc/bootptab</filename>, το οποίο έχει ανάλογη με την οικεία και "κρυπτογραφημένη" μορφή των παλιών καλών BSD αρχείων <filename>printcap</filename>, <filename>termcap</filename>, και <filename>disktab</filename>. Δείτε την σελίδα χρήσης του <filename>bootptab</filename> για περισσότερες πληροφορίες. Για τον server CMU <command>bootpd</command>, θα πρέπει να ξέρετε την διεύθυνση MAC του συστήματος "πελάτη". Εδώ είναι ένα παράδειγμα αρχείου <filename>/etc/bootptab</filename>: <informalexample><screen> client:\ hd=/tftpboot:\ bf=tftpboot.img:\ ip=192.168.1.90:\ sm=255.255.255.0:\ sa=192.168.1.1:\ ha=0123456789AB: </screen></informalexample> Θα πρέπει να αλλάξετε τουλάχιστον την επιλογή <quote>ha</quote>, που προσδιορίζει την διεύθυνση υλικού του πελάτη. Η επιλογή <quote>bf</quote> προσδιορίζει το αρχείο που θα έπρεπε ένας πελάτης να ανακτήσει μέσω TFTP. Δείτε το σύνδεσμο <xref linkend="tftp-images"/> για περισσότερες πληροφορίες. <phrase arch="mips"> Σε συστήματα SGI Indy μπορείτε απλά να μπείτε στην οθόνη εντολών και να πληκτρολογήσετε <userinput>printenv</userinput>. Η τιμή της μεταβλητής <userinput>eaddr</userinput> είναι η διεύθυνση MAC του πελάτη.</phrase>
ko: CMU <command>bootpd</command>를 사용하려면, <filename>/etc/inetd.conf</filename>에서 관련된 줄의 코멘트를 없애거나 한 줄을 추가해야 합니다. &debian;에선 <userinput>update-inetd --enable bootps</userinput>를 실행한 다음 적용하려면 <userinput>/etc/init.d/inetd reload</userinput> 명령을 실행합니다. 그 줄은 다음과 같은 모양입니다: <informalexample><screen> bootps dgram udp wait root /usr/sbin/bootpd bootpd -i -t 120 </screen></informalexample> 이제 <filename>/etc/bootptab</filename> 파일을 만들어야 합니다. 이 파일은 과거의 BSD <filename>printcap</filename>, <filename>termcap</filename>, <filename>disktab</filename> 파일과 같이 익숙하면서도 의미를 알기 어려운 형식으로 되어 있습니다. 더 자세한 정보는 <filename>bootptab</filename> 매뉴얼 페이지를 참고하십시오. CMU <command>bootpd</command>에서는, 클라이언트의 하드웨어 (MAC) 주소를 알아야 합니다. 다음은 <filename>/etc/bootptab</filename>의 예입니다: <informalexample><screen> 클라이언트:\ hd=/tftpboot:\ bf=tftpboot.img:\ ip=192.168.1.90:\ sm=255.255.255.0:\ sa=192.168.1.1:\ ha=0123456789AB: </screen></informalexample> 위에서 최소한 <quote>ha</quote> 옵션은 바꿔야 합니다. 이 옵션은 클라이언트의 하드웨어 주소를 나타냅니다. <quote>bf</quote> 옵션은 TFTP로 클라이언트가 받게 될 파일을 지정합니다. 자세한 정보는 <xref linkend="tftp-images"/> 부분을 참고하십시오. <phrase arch="mips"> SGI Indy에서는 커맨드 모니터로 들어가서 <userinput>printenv</userinput>라고 입력하면 됩니다. <userinput>eaddr</userinput> 변수의 값이 MAC 주소입니다. </phrase>
pt: Para utilizar o CMU <command>bootpd</command>, primeiro você tem de retirar o comentário (ou adicionar) da linha relevante em <filename>/etc/inetd.conf</filename>. Em &debian;, você pode executar <userinput>update-inetd --enable bootps</userinput>, para o fazer. Caso contrário, a linha em questão deve parecer-se com: <informalexample><screen> bootps dgram udp wait root /usr/sbin/bootpd bootpd -i -t 120 </screen></informalexample>Agora, você tem de criar um ficheiro <filename>/etc/bootptab</filename>. Este tem de ser do mesmo tipo do familiar e críptico formato dos bons velhos ficheiros de BSD <filename>printcap</filename>, <filename>termcap</filename>, e <filename>disktab</filename>. Para mais informações veja a página do manual de <filename>bootptab</filename>. Para o CMU <command>bootpd</command>, você vai necessitar saber o endereço (MAC) de hardware do cliente. Aqui está um <filename>/etc/bootptab</filename> de exemplo: <informalexample><screen> client:\ hd=/tftpboot:\ bf=tftpboot.img:\ ip=192.168.1.90:\ sm=255.255.255.0:\ sa=192.168.1.1:\ ha=0123456789AB: </screen></informalexample>Você tem de alterar pelo menos a opção <quote>ha</quote>, que especifica o endereço de hardware do cliente. A opção <quote>bf</quote> especifica o ficheiro que o cliente deve obter via TFTP; para mais detalhes veja a <xref linkend="tftp-images"/>. <phrase arch="mips">Em Indys da SGI você pode apenas entrar no monitor de comandos e escrever <userinput>printenv</userinput>. O valor da variável <userinput>eaddr</userinput> é o endereço MAC da máquina. </phrase>
ru: Чтобы использовать CMU <command>bootpd</command>, во-первых, вы должны раскомментировать (или добавить) соответствующую строку в <filename>/etc/inetd.conf</filename>. Для этого в &debian; вы можете запустить <userinput>update-inetd --enable bootps</userinput>, затем <userinput>/etc/init.d/inetd reload</userinput>. Или же можно добавить следующую строку вручную: <informalexample><screen> bootps dgram udp wait root /usr/sbin/bootpd bootpd -i -t 120 </screen></informalexample>Теперь вы должны создать файл <filename>/etc/bootptab</filename>. Внутри он напоминает хорошо знакомый и загадочный формат старых добрых BSD файлов <filename>printcap</filename>, <filename>termcap</filename> и <filename>disktab</filename>. Подробности смотрите на странице руководства <filename>bootptab</filename>. Для CMU <command>bootpd</command> вам нужно знать аппаратный адрес (MAC) клиента. Вот пример <filename>/etc/bootptab</filename>: <informalexample><screen> client:\ hd=/tftpboot:\ bf=tftpboot.img:\ ip=192.168.1.90:\ sm=255.255.255.0:\ sa=192.168.1.1:\ ha=0123456789AB: </screen></informalexample>Нужно изменить по крайней мере параметр <quote>ha</quote>, который содержит аппаратный адрес клиента. Параметр <quote>bf</quote> содержит файл, который клиент должен получить по TFTP; подробности смотрите в <xref linkend="tftp-images"/>. <phrase arch="mips"> На SGI Indy вы можете просто войти в командный монитор и набрать <userinput>printenv</userinput>. Значение переменной <userinput>eaddr</userinput> содержит MAC адрес машины.</phrase>
zh_cn: 为了使用 CMU <command>bootpd</command>，您必须首先将 <filename>/etc/inetd.conf</filename> 中相关的注释标记去掉(或者加入一些新行)。在 &debian; 里，您可以运行 <userinput>update-inetd --enable bootps</userinput>，然后执行 <userinput>/etc/init.d/inetd reload</userinput> 来实现此任务。在其它系统中，这个行应该看起来像这样： <informalexample><screen> bootps dgram udp wait root /usr/sbin/bootpd bootpd -i -t 120 </screen></informalexample> 现在，您必须创建一个 <filename>/etc/bootptab</filename> 文件。它具有和一些老 BSD 文件很相似并使用相同的加密格式。这些文件包括 <filename>printcap</filename>、<filename>termcap</filename>，和 <filename>disktab</filename>。参见 <filename>bootptab</filename> 的手册页以获得更多的信息。对于 CMU <command>bootpd</command>，您将需要知道客户机硬件的(MAC)地址。这里有一个示例 <filename>/etc/bootptab</filename>： <informalexample><screen> client:\\n hd=/tftpboot:\\n bf=tftpboot.img:\\n ip=192.168.1.90:\\n sm=255.255.255.0:\\n sa=192.168.1.1:\\n ha=0123456789AB: </screen></informalexample> 您至少需要修改<quote>ha</quote>选项，它指定了客户机的硬件地址。<quote>bf</quote>选项则指定了一个客户机应该通过 TFTP 取得的文件名称。请从 <xref linkend="tftp-images"/> 处获得更多的信息。<phrase arch="mips"> 在 SGI Indys 上，您可以仅仅只是进入命令监视器然后输入 <userinput>printenv</userinput>。<userinput>eaddr</userinput> 的值就是机器的 MAC 地址。</phrase>
zh_tw: 要使用 CMU <command>bootpd</command>，您必須先將 <filename>/etc/inetd.conf</filename> 中相關的註釋標記去掉 (或者加入一些新行)。在 &debian; 裡，您可以執行 <userinput>update-inetd --enable bootps</userinput>，然後執行 <userinput>/etc/init.d/inetd reload</userinput> 來完成此工作。在其它系統中，這行設定應該看起來像這樣：<informalexample><screen> bootps dgram udp wait root /usr/sbin/bootpd bootpd -i -t 120 </screen></informalexample> 現在，您必須建立一個 <filename>/etc/bootptab</filename> 檔案。它具有和一些老 BSD 檔案相似並使用相同的加密格式。這些檔案包括 <filename>printcap</filename>、<filename>termcap</filename>，和 <filename>disktab</filename>。請參閱 <filename>bootptab</filename> 的手冊以獲得更多的資訊。對於 CMU <command>bootpd</command>，您將需要知道客戶端硬的體 (MAC) 位址。這裡有一個範例 <filename>/etc/bootptab</filename>： <informalexample><screen> client:\\n hd=/tftpboot:\\n bf=tftpboot.img:\\n ip=192.168.1.90:\\n sm=255.255.255.0:\\n sa=192.168.1.1:\\n ha=0123456789AB: </screen></informalexample> 您至少需要修改 <quote>ha</quote> 選項，它指定了客戶端的硬體地址。<quote>bf</quote> 選項則指定了一個客戶端應該透過 TFTP 取得的檔案名稱。請從 <xref linkend="tftp-images"/> 處取得更多的資訊。 <phrase arch="mips"> 在 SGI Indys 上，您可以僅僅只是進入指令監視器然後輸入 <userinput>printenv</userinput>。 <userinput>eaddr</userinput> 的值就是機器的 MAC 位址。 </phrase>

source: By contrast, setting up BOOTP with ISC <command>dhcpd</command> is really easy, because it treats BOOTP clients as a moderately special case of DHCP clients. Some architectures require a complex configuration for booting clients via BOOTP. If yours is one of those, read the section <xref linkend="dhcpd"/>. Otherwise, you will probably be able to get away with simply adding the <userinput>allow bootp</userinput> directive to the configuration block for the subnet containing the client, and restart <command>dhcpd</command> with <userinput>/etc/init.d/dhcpd restart</userinput>.
el: Αντίθετα, η ρύθμιση του BOOTP με τον ISC server <command>dhcpd</command> είναι πραγματικά εύκολη, γιατί αντιμετωπίζει τους πελάτες BOOTP σαν μια σχετικά ειδική περίπτωση πελατών DHCP. Μερικές αρχιτεκτονικές απαιτούν μια πολύπλοκη ρύθμιση για την εκκίνηση πελατών μέσω BOOTP. Αν η δική σας είναι μια από αυτές, διαβάστε την ενότητα <xref linkend="dhcpd"/>. Διαφορετικά, μπορείτε πιθανόν να τα καταφέρετε απλά προσθέτοντας το προστακτικό <userinput>allow bootp</userinput> στο κομμάτι των ρυθμίσεων για το υποδίκτυο που περιέχει τον πελάτη, και επενεκκινήστε τον server <command>dhcpd</command> με την εντολή <userinput>/etc/init.d/dhcpd restart</userinput>.
ko: 반대로, ISC <command>dhcpd</command> 설정은 정말 쉽습니다. BOOTP 클라이언트를 DHCP 클라이언트의 일종의 특별한 케이스로 취급하기 때문입니다. 일부 아키텍쳐에서는 BOOTP로 부팅하게 하려면 복잡한 설정이 필요합니다. 그러한 아키텍쳐의 경우는 <xref linkend="dhcpd"/> 부분을 참고하십시오. 그게 아니라면 <userinput>allow bootp</userinput>를 클라이언트가 들어 있는 서브넷의 설정 부분에 집어 넣고, <userinput>/etc/init.d/dhcpd restart</userinput> 명령으로 <command>dhcpd</command>를 다시 시작하면 됩니다.
pt: Por contraste, configurar BOOTP com ISC <command>dhcpd</command> é realmente fácil, porque trata os clientes BOOTP como casos moderadamente especiais de clientes DHCP. Algumas arquitecturas requerem uma configuração complexa para iniciarem clientes via BOOTP. Se o seu caso é um desses, leia a secção <xref linkend="dhcpd"/>. Caso contrário, irá provavelmente ser capaz de conseguir com um simples adicionar de directiva <userinput>allow bootp</userinput> para o bloco de configuração para a subnet que contém o cliente, e reiniciar <command>dhcpd</command> com <userinput>/etc/init.d/dhcpd restart</userinput>.
ru: Настройка BOOTP в ISC <command>dhcpd</command> очень проста, так как он считает клиента BOOTP, как один из вариантов клиента DHCP. Некоторые архитектуры требуют сложной конфигурации для загрузки клиентов по BOOTP. Если у вас один из таких случаев, прочитайте раздел <xref linkend="dhcpd"/>. Если нет, то достаточно просто добавить директиву <userinput>allow bootp</userinput> в конфигурационный блок подсети, содержащей клиента и перезапустить <command>dhcpd</command> командой <userinput>/etc/init.d/dhcpd restart</userinput>.
zh_cn: 相反，通过 ISC <command>dhcpd</command> 设置 BOOTP 就非常容易。因为它把 BOOTP 客户程序看成一个特殊的 DHCP 客户端。部分体系结构需要经过复杂的设置才能从 BOOTP 启动客户端。如果您的机器属于这种情况，请阅读<xref linkend="dhcpd"/>。否则，您大概只需要将 <userinput>allow bootp</userinput> 指令添加到包含客户机的子网的配置部分，并重新启动 <command>dhcpd</command> 就可以了，重启的命令是：<userinput>/etc/init.d/dhcpd restart</userinput>。
zh_tw: 透過 ISC <command>dhcpd</command> 設定 BOOTP 反而非常容易。因為它把 BOOTP 客戶端程式看成一個特殊的 DHCP 客戶端。部分架構結構需要經過複雜的設定才能從 BOOTP 啟動客戶端。如果您的機器屬於這種情況，請閱讀 <xref linkend="dhcpd"/>。否則，您大概只需要將 <userinput>allow bootp</userinput> 指令添加到包含客戶機的子網域的配定部分，並重新啟動 <command>dhcpd</command> 就可以了，重啟的指令是：<userinput>/etc/init.d/dhcpd restart</userinput>。

source: Setting up a DHCP server
el: Ρυθμίζοντας έναν εξυπηρετητή DHCP
ko: DHCP 서버 설정하기
pt: Configurar um servidor DHCP
ru: Настройка DHCP сервера
zh_cn: 设置 DHCP 服务器
zh_tw: 設置 DHCP 伺服器

source: One free software DHCP server is ISC <command>dhcpd</command>. In &debian;, this is available in the <classname>dhcp</classname> package. Here is a sample configuration file for it (usually <filename>/etc/dhcpd.conf</filename>): <informalexample><screen> option domain-name "example.com"; option domain-name-servers ns1.example.com; option subnet-mask 255.255.255.0; default-lease-time 600; max-lease-time 7200; server-name "servername"; subnet 192.168.1.0 netmask 255.255.255.0 { range 192.168.1.200 192.168.1.253; option routers 192.168.1.1; } host clientname { filename "/tftpboot/tftpboot.img"; server-name "servername"; next-server servername; hardware ethernet 01:23:45:67:89:AB; fixed-address 192.168.1.90; } </screen></informalexample> Note: the new (and preferred) <classname>dhcp3</classname> package uses <filename>/etc/dhcp3/dhcpd.conf</filename>.
el: Ένας server DHCP που είναι ελεύθερο λογισμικό είναι ο <command>dhcpd</command>. Στο &debian;, είναι διαθέσιμος στο πακέτο <classname>dhcp</classname>.Αυτό είναι ένα παράδειγμα αρχείου ρυθμίσεων για τον server αυτόν (συνήθως το αρχείο <filename>/etc/dhcpd.conf</filename>): <informalexample><screen> option domain-name "example.com"; option domain-name-servers ns1.example.com; option subnet-mask 255.255.255.0; default-lease-time 600; max-lease-time 7200; server-name "servername"; subnet 192.168.1.0 netmask 255.255.255.0 { range 192.168.1.200 192.168.1.253; option routers 192.168.1.1; } host clientname { filename "/tftpboot/tftpboot.img"; server-name "servername"; next-server servername; hardware ethernet 01:23:45:67:89:AB; fixed-address 192.168.1.90; } </screen></informalexample> Σημείωση: το καινούριο (και προτιμητέο) πακέτο <classname>dhcp3</classname> χρησιμοποιεί το αρχείο <filename>/etc/dhcp3/dhcpd.conf</filename>.
ko: 자유 소프트웨어 DHCP 서버로 ISC <command>dhcpd</command>가 있습니다. &debian;에서 ISC <command>dhcpd</command>는 <classname>dhcp</classname> 꾸러미 안에 들어 있습니다. 다음은 간단한 설정 파일 예제입니다 (<filename>/etc/dhcpd.conf</filename>): <informalexample><screen> option domain-name "example.com"; option domain-name-servers ns1.example.com; option subnet-mask 255.255.255.0; default-lease-time 600; max-lease-time 7200; server-name "servername"; subnet 192.168.1.0 netmask 255.255.255.0 { range 192.168.1.200 192.168.1.253; option routers 192.168.1.1; } host clientname { filename "/tftpboot/tftpboot.img"; server-name "servername"; next-server servername; hardware ethernet 01:23:45:67:89:AB; fixed-address 192.168.1.90; } </screen></informalexample> 주의: 최근의 (권장) <classname>dhcp3</classname> 꾸러미는 <filename>/etc/dhcp3/dhcpd.conf</filename> 파일을 사용합니다.
pt: Um software livre de servidor DHCP é o <command>dhcpd</command> do ISC. Em &debian;, isto está disponível no pacote <classname>dhcp</classname>. Aqui está um exemplo de um ficheiro de configuração para ele (normalmente <filename>/etc/dhcpd.conf</filename>): <informalexample><screen> option domain-name "example.com"; option domain-name-servers ns1.example.com; option subnet-mask 255.255.255.0; default-lease-time 600; max-lease-time 7200; server-name "servername"; subnet 192.168.1.0 netmask 255.255.255.0 { range 192.168.1.200 192.168.1.253; option routers 192.168.1.1; } host clientname { filename "/tftpboot/tftpboot.img"; server-name "servername"; next-server servername; hardware ethernet 01:23:45:67:89:AB; fixed-address 192.168.1.90; } </screen></informalexample> Nota: O novo (e preferêncial) pacote <classname>dhcp3</classname> utiliza <filename>/etc/dhcp3/dhcpd.conf</filename>.
ru: Есть один свободный DHCP сервер &mdash; это ISC <command>dhcpd</command>. В &debian; он доступен из пакета <classname>dhcp</classname>. Вот пример его конфигурационного файла (обычно <filename>/etc/dhcpd.conf</filename>): <informalexample><screen> option domain-name "example.com"; option domain-name-servers ns1.example.com; option subnet-mask 255.255.255.0; default-lease-time 600; max-lease-time 7200; server-name "servername"; subnet 192.168.1.0 netmask 255.255.255.0 { range 192.168.1.200 192.168.1.253; option routers 192.168.1.1; } host clientname { filename "/tftpboot/tftpboot.img"; server-name "servername"; next-server servername; hardware ethernet 01:23:45:67:89:AB; fixed-address 192.168.1.90; } </screen></informalexample> Замечание: новый (и предпочтительный) пакет <classname>dhcp3</classname> использует <filename>/etc/dhcp3/dhcpd.conf</filename>.
zh_cn: ISC <command>dhcpd</command> 是一种自由软件 DHCP 服务器。在 &debian; 里，它被包含在 <classname>dhcp</classname> 软件包中。这里有它的一个配置文件的范例(通常是 <filename>/etc/dhcpd.conf</filename>)： <informalexample><screen> option domain-name "example.com"; option domain-name-servers ns1.example.com; option subnet-mask 255.255.255.0; default-lease-time 600; max-lease-time 7200; server-name "servername"; subnet 192.168.1.0 netmask 255.255.255.0 { range 192.168.1.200 192.168.1.253; option routers 192.168.1.1; } host clientname { filename "/tftpboot/tftpboot.img"; server-name "servername"; next-server servername; hardware ethernet 01:23:45:67:89:AB; fixed-address 192.168.1.90; } </screen></informalexample> 注意：新的(并且是推荐的) <classname>dhcp3</classname> 软件包使用 <filename>/etc/dhcp3/dhcpd.conf</filename>作为其配置文件。
zh_tw: ISC <command>dhcpd</command> 是一種自由軟體 DHCP 伺服器。在 &debian; 裡，它被包含在 <classname>dhcp</classname> 軟體套件中。這裡有它的一個設定檔的範例(通常是 <filename>/etc/dhcpd.conf</filename>)：<informalexample><screen> option domain-name "example.com"; option domain-name-servers ns1.example.com; option subnet-mask 255.255.255.0; default-lease-time 600; max-lease-time 7200; server-name "servername"; subnet 192.168.1.0 netmask 255.255.255.0 { range 192.168.1.200 192.168.1.253; option routers 192.168.1.1; } host clientname { filename "/tftpboot/tftpboot.img"; server-name "servername"; next-server servername; hardware ethernet 01:23:45:67:89:AB; fixed-address 192.168.1.90; } </screen></informalexample> 註：新的(並且是建議的) <classname>dhcp3</classname> 軟體套件使用 <filename>/etc/dhcp3/dhcpd.conf</filename>作為其設定檔。

source: In this example, there is one server <replaceable>servername</replaceable> which performs all of the work of DHCP server, TFTP server, and network gateway. You will almost certainly need to change the domain-name options, as well as the server name and client hardware address. The <replaceable>filename</replaceable> option should be the name of the file which will be retrieved via TFTP.
ko: 이 예제에서는, DHCP 서버, TFTP 서버, 네트워크 게이트웨이 역할을 모두 하는 <replaceable>servername</replaceable>이라는 서버가 있다고 가정합니다. domain-name 옵션도 바꾸고, 서버 이름과 클라이언트 하드웨어 주소도 바꿔야 합니다. <replaceable>filename</replaceable> 옵션은 TFTP로 가져오려는 파일의 이름입니다.
pt: Neste exemplo, existe um servidor <replaceable>servername</replaceable> que executa todo o trabalho de servidor DHCP, de servidor TFTP e gateway de rede. Vai precisar quase de certeza de alterar as opções de domain-name, tal como o nome do servidor e o endereço de hardware do cliente. A opção <replaceable>filename</replaceable> deve ser o nome do ficheiro obtido via TFTP.
ru: В этом примере определён единственный сервер <replaceable>servername</replaceable>, который работает в качестве DHCP, TFTP серверов и шлюза сети. Вам почти наверняка нужно изменить опцию domain-name, а также имя сервера и аппаратный адрес клиента. Опция <replaceable>filename</replaceable> должна содержать имя файла, который нужно получить по TFTP.
zh_cn: 在这个例子中，一台服务器 <replaceable>servername</replaceable> 负责执行包括 DHCP 服务器、TFTP 服务器和网关在内的所有工作。您需要修改域名选项，以及服务器名和客户端硬件地址。<replaceable>filename</replaceable> 选项应该是将要从 TFTP 获取的文件名。
zh_tw: 在這個例子中，一台伺服器 <replaceable>servername</replaceable> 負責執行包括 DHCP 伺服器、TFTP 伺服器和閘道器在內的所有工作。您需要修改網域名稱選項，以及伺服器名稱和客戶端硬體位址。<replaceable>filename</replaceable> 選項應是要從 TFTP 取得的檔案名稱。

source: After you have edited the <command>dhcpd</command> configuration file, restart it with <userinput>/etc/init.d/dhcpd restart</userinput>.
el: Μετά την έκδοση του αρχείου ρυθμίσεων του <command>dhcpd</command>, επανεκκινήστε τον εξυπηρετητή με την εντολή <userinput>/etc/init.d/dhcpd restart</userinput>.
ko: <command>dhcpd</command> 설정 파일을 편집한 다음에, <userinput>/etc/init.d/dhcpd restart</userinput> 명령으로 <command>dhcpd</command>를 다시 시작하십시오.
pt: Após ter editado o ficheiro de configuração <command>dhcpd</command>, reinicie-o com <userinput>/etc/init.d/dhcpd restart</userinput>.
ru: После редактирования конфигурационного файла <command>dhcpd</command>, перезагрузите сервер командой <userinput>/etc/init.d/dhcpd restart</userinput>.
zh_cn: 在编辑了 <command>dhcpd</command> 配置文件后，您需要使用下面的命令重新启动它：<userinput>/etc/init.d/dhcpd restart</userinput>作为其配置文件。
zh_tw: 在編輯了 <command>dhcpd</command> 設定檔後，您需要使用下面的指令重新啟動它：<userinput>/etc/init.d/dhcpd restart</userinput>。

source: Enabling PXE Booting in the DHCP configuration
el: Ενεργοποίηση Εκκίνησης με τη μέθοδο PXE στη ρύθμιση του DHCP
ko: DHCP 설정에서 PXE 부팅하게 만들기
pt: Possibilitar o Arranque PXE na configuração DHCP
ru: Включение загрузки PXE в конфигурацию DHCP
zh_cn: 在 DHCP 配置中打开 PXE 引导功能
zh_tw: 在 DHCP 設定中打開 PXE 開機功能
