Repository: xobs/debian-installer
Catalog: doc/manual/po/*/install-methods.po
Languages: el, ko, pt, ru, zh_cn, zh_tw

source: Alternatively, one way to get a complete file listing all the values that can be preseeded is to do a manual install, and then use <filename>debconf-get-selections</filename>, from the <classname>debconf-utils</classname> package, to dump both the debconf database and the cdebconf database in /var/log/debian-installer/cdebconf to a single file: <informalexample><screen> $ debconf-get-selections --installer &gt; <replaceable>file</replaceable> $ debconf-get-selections &gt;&gt; <replaceable>file</replaceable> </screen></informalexample> However, a file generated in this manner will have some items that should not be preseeded, and the file in <xref linkend="example-preseed"/> is a better starting place for most users.
el: Εναλλακτικά, ένας τρόπος να πάρετε μια πλήρη λίστα με όλες τις τιμές που μπορούν να γίνουν preseeded είναι να κάνετε μια χειροκίνητη εγκατάσταση, και μετά να χρησιμοποιήσετε την εντολή <filename>debconf-get-selections</filename>, από το πακέτο <classname>debconf-utils</classname> για να περάσετε τόσο την βάση του debconf όσο και του cdebconf που είναι στον κατάλογο var/log/debian-installer/cdebconf σε ένα μοναδικό αρχείο:<informalexample><screen> $ debconf-get-selections --installer &gt; <replaceable>file</replaceable> $ debconf-get-selections &gt;&gt; <replaceable>file</replaceable> </screen></informalexample> Το αρχείο όμως που δημιουργείται με τον τρόπο αυτό περιέχει και μερικά αντικείμενα που που δεν θα πρέπει να γίνουν preseeded, οπότε το αρχείο στο <xref linkend="example-preseed"/> είναι ένα καλλίτερο σημείο εκκίνησης για τους περισσότερους χρήστες.
ko: 그게 아니면, 미리 설정할 수 있는 값들의 모든 목록이 들어 있는 파일을 만드는 한 가지 방법은, 수동으로 설치한 다음 <classname>debconf-utils</classname> 꾸러미에 들어 있는 <filename>debconf-get-selections</filename>를 사용하는 것입니다. 이 명령은 debconf 데이터베이스와 /var/log/debian-installer/cdebconf 안에 있는 cdebconf 데이터베이스를 한 개 파일로 만듭니다: <informalexample><screen> $ debconf-get-selections --installer &gt; <replaceable>file</replaceable> $ debconf-get-selections &gt;&gt; <replaceable>file</replaceable> </screen></informalexample> 하지만, 이렇게 만든 파일에는 미리 설정하면 안 되는 것도 들어 있습니다. <xref linkend="example-preseed"/>에 들어 있는 파일이 대부분의 사용자가 시작하기에 더 나은 방법입니다.
pt: Alternativamente, uma maneira de conseguir uma lista completa de todos os valores que podem ser pré-carregados é fazer uma instalação manual, e depois utilizar <filename>debconf-get-selections</filename>, a partir do pacote <classname>debconf-utils</classname>, para enviar as bases de dados de debconf e cdebconf em /var/log/debian-installer/cdebconf para um único ficheiro: <informalexample><screen> $ debconf-get-selections --installer &gt; <replaceable>file</replaceable> $ debconf-get-selections &gt;&gt; <replaceable>file</replaceable> </screen></informalexample> Contudo, um ficheiro gerado desta maneira terá alguns itens que não devem ser pré-carregados, e o ficheiro na <xref linkend="example-preseed"/> é o melhor local de começo para a maioria dos utilizadores.
ru: Кроме того, единственный способ получить полный список всех значений, которые можно использовать в файле автоматической установки &mdash; это выполнить один раз установку вручную, а затем воспользоваться <filename>debconf-get-selections</filename> из пакета <classname>debconf-utils</classname>, чтобы совместить базы данных debconf и cdebconf из /var/log/debian-installer/cdebconf в один файл: <informalexample><screen> $ debconf-get-selections --installer &gt; <replaceable>file</replaceable> $ debconf-get-selections &gt;&gt; <replaceable>file</replaceable> </screen></informalexample> Однако, созданный таким образом файл будет содержать некоторые элементы, которые не должны обрабатываться, и файл в <xref linkend="example-preseed"/> &mdash; лучшее место для начала для большинства пользователей.
zh_cn: 除此之外，要得到一个包含所有可被预设置的项目的完整文件，您可以进行手动安装，然后使用 <filename>debconf-get-selections</filename> 命令(它来自 <classname>debconf-utils</classname>软件包)将 debconf 数据库和位于 /var/log/debian-installer/cdebconf 的 cdebconf 数据库的内容导出至一个单一的文件： <informalexample><screen> $ debconf-get-selections --installer &gt; <replaceable>文件</replaceable> $ debconf-get-selections &gt;&gt; <replaceable>文件</replaceable> </screen></informalexample> 但是，按照这些方法生成的文件将会包含一些不应该被预设置的项目，因此 <xref linkend="example-preseed"/> 中的文件对于大多数用户来说是一个更好的起点。
zh_tw: 除此之外，要得到一個包含所有可被預設項目的完整文件，您可以進行手動安裝，然後使用 <filename>debconf-get-selections</filename> 指令 (它來自 <classname>debconf-utils</classname>軟體套件) 將 debconf 資料庫和位於 /var/log/debian-installer/cdebconf 的資料庫的內容導出至一個單一的檔案：<informalexample><screen> $ debconf-get-selections --installer &gt; <replaceable>檔案名稱</replaceable> $ debconf-get-selections &gt;&gt; <replaceable>檔案名稱</replaceable> </screen></informalexample> 但是，按照些方法生成的檔案將會包含一些不應該被預先設定的項目，因此 <xref linkend="example-preseed"/> 中的檔案對於大多數使用者來說是一個更好的起點。

source: Once you have a preconfiguration file, you can edit it if necessary, and place it on a web server, or copy it onto the installer's boot media. Wherever you place the file, you need to pass a parameter to the installer at boot time to tell it to use the file.
el: Από την στιγμή που έχετε ένα αρχείο προρυθμίσεων, μπορείτε να το εκδόσετε αν θέλετε και να το ανεβάσετε σε έναν διακομιστή ιστοσελίδων, ή να το αντιγράψετε στο μέσο εκκίνησης του installer. Όπου και να το τοποθετήσετε θα πρέπει να δώσετε μια παράμετρο στον installer κατά την εκκίνηση ώστε να ενημερωθεί ότι πρέπει να χρησιμοποιήσει αυτό το αρχείο.
ko: 미리 설정해 놓은 파일이 있으면, 이 파일을 필요에 따라 편집하고, 웹 서버에 넣던지, 설치 프로그램의 부팅 미디어에 복사해 놓을 수도 있습니다. 이 파일을 어디에 놓든 이 파일을 이용하라는 사실을 부팅할 때 파라미터로 넘겨야 합니다.
pt: Uma vez que tenha um ficheiro pré-configurado, você pode edita-lo se necessário, e colocá-lo num servidor web, ou copiá-lo para um instalador num meio de arranque. Seja lá onde colocar o ficheiro, necessita de passar o parâmetro para o instalador na altura do arranque para utilizar o ficheiro.
ru: Как только у вас появился файл автоматической установки, вы можете отредактировать его по своему усмотрению и поместить его на веб сервер или скопировать его на загрузочный носитель с программой установки. После размещения файла нужно передать его как параметр программе установки во время загрузки.
zh_cn: 一旦您有了一个预配置文件，可以在需要时编辑它，并且上传至一个 web 服务器，或者拷贝至安装程序的启动引导介质。无论您将此文件放置在哪里，都需要在启动安装程序时向它传递一个参数来告诉它使用这个文件。
zh_tw: 一旦您有了一個預先設定檔，可以在需要時編輯它，並且上傳至網頁伺服器，或者拷貝至安裝程式的開機媒介。無論您將此檔案放在哪裡，都需要傳遞一個參數給安裝程式來使其使用個檔案。

source: To make the installer use a preconfiguration file downloaded from the network, add preseed/url=http://url/to/preseed.cfg to the kernel boot parameters. Of course the preconfiguration will not take effect until the installer manages to set up the network to download the file, so this is most useful if the installer can set up the network via DHCP without asking any questions. You may want to set the installation priority to critical to avoid any questions while the network is being configured. See <xref linkend="installer-args"/>.
el: Για να κάνετε τον installer να χρησιμοποιήσει ένα αρχείο προρυθμίσεων που κατεβάσατε από το δίκτυο, προσθέστε το preseed/url=http://url/to/preseed.cfg στις παραμέτρους εκκίνησης του πυρήνα. Φυσικά οι προρυθμίσεις δεν μπορούν να ενεργοποιηθούν μέχρι ο installer να μπορέσει να ρυθμίσει το δίκτυο, οπότε η μέθοδος αυτή είναι κυρίως χρήσιμη εφόσον ο installer μπορεί να ρυθμίσει το δίκτυο μέσω DHCP χωρίς την διατύπωση ερωτήσεων. Πιθανόν να θέλετε να θέσετε την προτεραιότητα της εγκατάστασης σε "κρίσιμη" για την αποφυγή ερωτήσεων κατά το διάστημα ρύθμισης του δικτύου. Κοιτάξτε το <xref linkend="installer-args"/>.
ko: 설치 프로그램에서 미리 설정해 놓은 파일을 네트워크에서 내려받도록 하려면, preseed/url=http://url/to/preseed.cfg 파라미터를 커널 부팅 파리미터로 넘깁니다. 물론 이 파일은 설치 프로그램에서 네트워크를 설정하고 이 파일을 내려받을 때까지는 효과가 없습니다. 그래서 이런 방법은 설치 프로그램에서 DHCP를 통해 네트워크를 설정할 수 있을 경우에 가장 유용합니다. 설치 우선순위를 "중요"로 해서 네트워크를 설정할 때까지 아무 질문도 하지 않도록 할 수 있습니다. <xref linkend="installer-args"/> 부분을 참고하십시오.
pt: Para fazer o instalador utilizar o ficheiro pré-configurado, conseguido através de download da rede, adicione preseed/url=http://url/to/preseed.cfg aos parâmetros de arranque do kernel. Claro que a pré-configuração não terá efeito até o instalador conseguir configurar a rede para fazer download do ficheiro, isto é portanto muito útil se o instalador conseguir configurar a rede via DHCP sem fazer nenhuma pergunta. Pode querer configurar a prioridade de instalação para evitar qualquer questão enquanto a rede está a ser configurada. Veja na <xref linkend="installer-args"/>.
ru: Чтобы программа установки загружала файл автоматической установки из сети, добавьте preseed/url=http://url/to/preseed.cfg к параметрам загрузки ядра. Естественно, автоматическая установка не начнётся пока программа установки не настроит сеть, чтобы загрузить этот файл, поэтому лучше чтобы программа установки настроила сеть по DHCP автоматически. Вы можете захотеть установить приоритет установки в критический, чтобы избежать лишних вопросов пока сеть не будет настроена. Смотрите <xref linkend="installer-args"/>.
zh_cn: 要让安装程序使用一个从网络下载的预配置文件，请将 preseed/url=http://url/to/config 加入内核启动参数。当然这个预配置文件，只有安装程序能够管理网络并下载文件后才能起作用，因此如果安装程序能够通过 DHCP 设置网络而不需要询问任何问题的话，此方法会更有用。如果您已经被设置好了网络，可能还会想将安装优先级调至关键来避免任何提问。请参见 <xref linkend="installer-args"/>。
zh_tw: 要讓安裝程式使用一個從網路下載的預先設定檔，請將 preseed/url=http://url/to/config 加入核心啟動參數。當然這個預先設定檔，只有安裝程式能夠管理網路並下載檔案後才能起作用，因此如果安裝程式能夠透過 DHCP 設置網路而不需要詢問任何問題的話，此方法會更有用。如果您已經設置好了網路，可能還會想將安裝優先順序調至關鍵級來避免任何問題。請參閱 <xref linkend="installer-args"/>。

source: To place a preconfiguration file on a CD, you would need to remaster the ISO image to include your preconfiguration file. See the manual page for mkisofs for details. Alternatively, put the preseed file on a floppy, and use preseed/file=/floppy/preseed.cfg
el: Για να βάλετε ένα αρχείο προρυθμίσεων σε ένα CD, θα πρέπει να επανεκδώσετε το ISO image ώστε να συμπεριλάβει το αρχείο σας. Δείτε τη σελίδα βοήθειας του mkisofs για λεπτομέρειες. Εναλλακτικά, βάλτε το preseed αρχείο σε μια δισκέττα, και χρησιμοποιήστε το όρισμα preseed/file=/floppy/preseed.cfg
ko: CD에 미리 설정해 놓은 파일을 넣으려면, 미리 설정해 놓은 파일을 포함하도록 ISO 이미지를 다시 만들어야 할 것입니다. 자세한 방법은 mkisofs 매뉴얼 페이지를 참고하십시오. 다른 방법으로는, 미리 설정해 놓은 파일을 플로피에 넣고, preseed/file=/floppy/preseed.cfg 파라미터를 사용하는 것입니다.
pt: Para colocar um ficheiro de pré-configuração num CD, necessita de recriar a imagem ISO para incluir o seu ficheiro pré-configurado. Veja a página do manual de mkisofs para mais detalhes. Alternativamente, coloque o ficheiro preseed numa disquete, e utilize preseed/file=/floppy/preseed.cfg
ru: Чтобы добавить файл автоматической установки на CD, вам потребуется изменить ISO образ. Подробности смотрите на странице руководства mkisofs. Или же запишите файл автоматической установки на дискету и используйте preseed/file=/floppy/preseed.cfg
zh_cn: 要将预配置文件放置在光盘中，您将需要重新生成 ISO 映像以包括您的预配置文件。请阅读 mkisofs 的手册来获得细节信息。另外，您也可以将预配置文件放置在一张软盘中，然后使用 preseed/file=/floppy/preseed.cfg 参数。
zh_tw: 要將預先設定檔放在光碟中，您將需要重新製作 ISO 映像把您的預先設定檔納入。請閱讀 mkisofs 的手冊來取得細節資訊。另外，您也可以將預先設定檔放在一張軟碟中，然後使用 preseed/file=/floppy/preseed.cfg 參數。

source: If you'll be booting from a USB memory stick, then you can simply copy your preconfiguration file onto the memory stick's filesystem, and edit the syslinux.cfg file to add preseed/file=/hd-media/preseed.cfg to the kernel boot parameters.
el: Αν πρόκειται να εκκινήσετε από ένα USB stick μνήμης, τότε μπορείτε απλά να αντιγράψετε το αρχείο με τις προρυθμίσεις στο σύστημα αρχείων του stick μνήμης, και εκδώστε το αρχείο syslinux.cfg ώστε να προσθέσετε την preseed/file=/hd-media/preseed.cfg στις παραμέτρους εκκίνησης του πυρήνα.
ko: USB 메모리 스틱에서 부팅한다면, 미리 설정해 놓은 파일을 메모리 스틱의 파일 시스템에 복사해 놓기만 하면 됩니다. 그 다음에 syslinux.cfg 파일을 편집해서 커널 부팅 파라미터에 preseed/file=/hd-media/preseed.cfg 파라미터를 넣으십시오.
pt: Se vai arrancar a partir de um USB memory stick, então pode simplesmente copiar o ficheiro de pré-configuração para o sistema de ficheiros do memory stick, e editar o ficheiro syslinux.cfg para adicionar preseed/file=/hd-media/preseed.cfg aos parâmetros de arranque do kernel.
ru: Если вы можете загружаться с карты памяти USB, то просто скопируйте файл автоматической установки в файловую систему карты памяти, и отредактируйте файл syslinux.cfg добавив preseed/file=/hd-media/preseed.cfg в параметра загрузки ядра.
zh_cn: 如果您要从 USB 闪盘上启动，那您可以简单拷贝您的预配置文件至闪盘的文件系统中，并编辑 syslinux.cfg 文件来加入 preseed/file=/hd-media/preseed.cfg 至内核启动参数。
zh_tw: 如果您要從 USB 隨身碟上開機，那您可以簡單拷貝您的預先設定檔至儲存的檔案系統中，並編輯 syslinux.cfg 檔案，加入 preseed/file=/hd-media/preseed.cfg 至核心啟動參數。

source: Using Preseeding to Change Default Values
el: Χρησιμοποιώντας Preseeding για την αλλαγή των προκαθορισμένων τιμών
ko: 미리 설정 파일을 이용해 기본값 바꾸기
pt: Utilizar o Preseed para Alterar Valores por Omissão
ru: Использование автоматической установки для изменения значений по умолчанию
zh_cn: 使用预置修改默认值
zh_tw: 使用預先設定來改變預設值

source: It is also possible to use preseeding to change the default answer for a question, but still have the question asked. To do this the <firstterm>seen</firstterm> flag must be reset to <quote>false</quote> after setting the value for a template.
el: Είναι δυνατόν ακόμα να χρησιμοποιήσετε preseeding για να αλλάξετε τις προκαθορισμένες απαντήσεις σε μια ερώτηση, εξακολουθώντας να έχετε την ερώτηση διαθέσιμη. Για να το κάνετε αυτό θα πρέπει να επαναθέσετε την σημαία <firstterm>seen</firstterm> στην τιμή <quote>false</quote> μετά την ρύθμιση της τιμής σε ένα πρότυπο.
ko: 미리 설정 파일을 이용해 질문에 대한 기본 답변을 바꾸면서, 질문은 물어보도록 할 수 있습니다. 그렇게 하려면 템플리트에서 값을 설정한 다음에 <firstterm>seen</firstterm> 플래그를 <quote>false</quote>로 다시 만들어야 합니다.
pt: Também é possível utilizar o preseed para alterar a resposta por omissão de uma questão, mas será na mesma colocada a questão. Para fazer isto tem de ser feito reset para <quote>false</quote> à flag <firstterm>seen</firstterm> após definir o valor para um template.
ru: Дополнительно, автоматическую установку можно использовать для изменения ответов по умолчанию на вопросы, которые при таком использовании будут задаваться. Для этого, присвойте флагу <firstterm>seen</firstterm> значение <quote>false</quote>после установки значения в шаблоне.
zh_cn: 可以使用预置修改问题的默认答案，但仍然会问问题。在为模板设置值之后，<firstterm>seen</firstterm>标识必须被重置为<quote>false</quote>。
zh_tw: 您也能使用預先設定來回答預設的對話框，對話框仍會秀出。想要使用此功能必須在預先設定樣板之後把<firstterm>seen</firstterm> 設為 <quote>false</quote>

source: d-i foo/bar string value d-i foo/bar seen false
pt: d-i·foo/bar·string·valor d-i·foo/bar·seen·false
ru: d-i foo/bar параметр значение d-i foo/bar seen false
