Repository: xobs/debian-installer
Catalog: doc/manual/po/*/install-methods.po
Languages: el, ko, pt, ru, zh_cn, zh_tw

source: Here is another example for a <filename>dhcp.conf</filename> using the Pre-boot Execution Environment (PXE) method of TFTP. <informalexample><screen> option domain-name "example.com"; default-lease-time 600; max-lease-time 7200; allow booting; allow bootp; # The next paragraph needs to be modified to fit your case subnet 192.168.1.0 netmask 255.255.255.0 { range 192.168.1.200 192.168.1.253; option broadcast-address 192.168.1.255; # the gateway address which can be different # (access to the internet for instance) option routers 192.168.1.1; # indicate the dns you want to use option domain-name-servers 192.168.1.3; } group { next-server 192.168.1.3; host tftpclient { # tftp client hardware address hardware ethernet 00:10:DC:27:6C:15; filename "/tftpboot/pxelinux.0"; } } </screen></informalexample> Note that for PXE booting, the client filename <filename>pxelinux.0</filename> is a boot loader, not a kernel image (see <xref linkend="tftp-images"/> below).
el: Εδώ έχουμε άλλο ένα παράδειγμα αρχείου <filename>dhcp.conf</filename> που χρησιμοποιεί την μέθοδο Pre-boot Execution Environment (PXE) για το TFTP.<informalexample><screen> option domain-name "example.com"; default-lease-time 600; max-lease-time 7200; allow booting; allow bootp; # Η επόμενη παράγραφος θα πρέπει να τροποποιηθεί ώστε να ταιριάζει στην περίπτωσή σας subnet 192.168.1.0 netmask 255.255.255.0 { range 192.168.1.200 192.168.1.253; option broadcast-address 192.168.1.255; # the gateway address which can be different # (access to the internet for instance) option routers 192.168.1.1; # indicate the dns you want to use option domain-name-servers 192.168.1.3; } group { next-server 192.168.1.3; host tftpclient { # tftp client hardware address hardware ethernet 00:10:DC:27:6C:15; filename "/tftpboot/pxelinux.0"; } } </screen></informalexample> Σημειώστε ότι για εκκίνηση με τη μέθοδο PXE, το όνομα αρχείου του πελάτη <filename>pxelinux.0</filename> είναι ένας φορτωτής εκκίνησης, και όχι μια εικόνα πυρήνα (δείτε την ενότητα <xref linkend="tftp-images"/> παρακάτω)
ko: 다음은 TFTP의 Pre-boot Execution Environment (PXE) 방식을 이용한 <filename>dhcp.conf</filename>의 예입니다. <informalexample><screen> option domain-name "example.com"; default-lease-time 600; max-lease-time 7200; allow booting; allow bootp; # 다음 부분은 여러분 경우에 맞춰 바꿔야 합니다 subnet 192.168.1.0 netmask 255.255.255.0 { range 192.168.1.200 192.168.1.253; option broadcast-address 192.168.1.255; # 게이트웨이 주소입니다. # (예를 들어 인터넷에 접근하는 방법에 따라 다를 수도 있습니다) option routers 192.168.1.1; # 사용하려는 DNS option domain-name-servers 192.168.1.3; } group { next-server 192.168.1.3; host tftpclient { # TFTP 클라이언트 하드웨어 주소 hardware ethernet 00:10:DC:27:6C:15; filename "/tftpboot/pxelinux.0"; } } </screen></informalexample> PXE 부팅의 경우, 커널 이미지가 아니라 클라이언트 파일 이름 <filename>pxelinux.0</filename>이 부트 로더입니다. (아래의 <xref linkend="tftp-images"/> 부분 참고)
pt: Aqui está outro exemplo para um <filename>dhcp.conf</filename> utilizando o método Pre-boot Execution Environment (PXE) de TFTP. <informalexample><screen> option domain-name "example.com"; default-lease-time 600; max-lease-time 7200; allow booting; allow bootp; # O próximo parágrafo necessita ser alterado para se adequar com o seu caso subnet 192.168.1.0 netmask 255.255.255.0 { range 192.168.1.200 192.168.1.253; option broadcast-address 192.168.1.255; # O endereço de gateway que pode ser diferente # (acesso à internet por exemplo) option routers 192.168.1.1; # indica o dns que quer utilizar option domain-name-servers 192.168.1.3; } group { next-server 192.168.1.3; host tftpclient { # endereço de harware do cliente tftp hardware ethernet 00:10:DC:27:6C:15; filename "/tftpboot/pxelinux.0"; } } </screen></informalexample> Note que para um arranque PXE, o ficheiro cliente com o nome de <filename>pxelinux.0</filename>, é o gestor de arranque, não uma imagem de kernel (veja a <xref linkend="tftp-images"/> abaixo).
ru: Вот другой пример <filename>dhcp.conf</filename>, который можно использовать, если включён метод предстартового выполнения среды (PXE) по TFTP. <informalexample><screen> option domain-name "example.com"; default-lease-time 600; max-lease-time 7200; allow booting; allow bootp; # The next paragraph needs to be modified to fit your case subnet 192.168.1.0 netmask 255.255.255.0 { range 192.168.1.200 192.168.1.253; option broadcast-address 192.168.1.255; # the gateway address which can be different # (access to the internet for instance) option routers 192.168.1.1; # indicate the dns you want to use option domain-name-servers 192.168.1.3; } group { next-server 192.168.1.3; host tftpclient { # tftp client hardware address hardware ethernet 00:10:DC:27:6C:15; filename "/tftpboot/pxelinux.0"; } } </screen></informalexample> Заметим, что для PXE загрузки в filename клиента <filename>pxelinux.0</filename> записан системный загрузчик, а не образ ядра (смотрите ниже <xref linkend="tftp-images"/>).
zh_cn: 这里是另外一个采用 TFTP 的 Pre-boot Execution Environment (PXE) 方法的 <filename>dhcp.conf</filename> 配置例子。 <informalexample><screen> option domain-name "example.com"; default-lease-time 600; max-lease-time 7200; allow booting; allow bootp; # The next paragraph needs to be modified to fit your case subnet 192.168.1.0 netmask 255.255.255.0 { range 192.168.1.200 192.168.1.253; option subnet-mask 255.255.255.0; option broadcast-address 192.168.1.255; # the gateway address which can be different # (access to the internet for instance) option routers 192.168.1.1; # indicate the dns you want to use option domain-name-servers 192.168.1.3; } group { next-server 192.168.1.3; host tftpclient { # tftp client hardware address hardware ethernet 00:10:DC:27:6C:15; filename "/tftpboot/pxelinux.0"; } } </screen></informalexample> 注意对于 PXE 引导来说，客户端文件名 <filename>pxelinux.0</filename> 是一个启动引导器，而非一个内核映象(参见下面的<xref linkend="tftp-images"/> )。
zh_tw: 這是另外一個採用 TFTP Pre-boot Execution Environment (PXE) 方法的 <filename>dhcp.conf</filename> 配置範例。 <informalexample><screen> option domain-name "example.com"; default-lease-time 600; max-lease-time 7200; allow booting; allow bootp; # 接下來的片段需要您自己修改成你所需要的 subnet 192.168.1.0 netmask 255.255.255.0 { range 192.168.1.200 192.168.1.253; option subnet-mask 255.255.255.0; option broadcast-address 192.168.1.255; # 閘道的位址可以不一樣 # (例如連到網際網路) option routers 192.168.1.1; # 設定您要使用的DNS option domain-name-servers 192.168.1.3; } group { next-server 192.168.1.3; host tftpclient { # tftp 客戶端的硬體位址 hardware ethernet 00:10:DC:27:6C:15; filename "/tftpboot/pxelinux.0"; } } </screen></informalexample> 注意對於 PXE 開機來說，客戶端檔案名 <filename>pxelinux.0</filename> 是一個 boot-loader，而非一個核心映像 (參閱下面的<xref linkend="tftp-images"/> )。

source: Enabling the TFTP Server
el: Ενεργοποίηση του εξυπηρετητή TFTP
ko: TFTP Server 사용하기
pt: Disponibilizar o Servidor TFTP
ru: Включение TFTP сервера
zh_cn: 开启 TFTP 服务器
zh_tw: 啟用 TFTP 伺服器

source: To get the TFTP server ready to go, you should first make sure that <command>tftpd</command> is enabled. This is usually enabled by having something like the following line in <filename>/etc/inetd.conf</filename>: <informalexample><screen> tftp dgram udp wait nobody /usr/sbin/tcpd in.tftpd /tftpboot </screen></informalexample> Debian packages will in general set this up correctly by default when they are installed.
el: Για να προετοιμάσετε τον TFTP server, θα πρέπει πρώτα να βεβαιωθείτε ότι ο δαίμονας <command>tftpd</command> είναι ενεργοποιημένος. Αυτή η ενεργοποίηση γίνεται συνήθως περιλαμβάνοντας μια γραμμή όπως η ακόλουθη στο αρχείο <filename>/etc/inetd.conf</filename>: <informalexample><screen> tftp dgram udp wait nobody /usr/sbin/tcpd in.tftpd /tftpboot </screen></informalexample> Τα πακέτα Debian θα κάνουν αυτές τις ρυθμίσεις σωστά από την πρώτη στιγμή με την εγκατάστασή τους.
ko: TFTP 서버를 준비하려면, 먼저 <command>tftpd</command> 서버를 사용도록 해야 합니다. 보통 다음과 같은 줄을 <filename>/etc/inetd.conf</filename>에 넣으면 됩니다: <informalexample><screen> tftp dgram udp wait nobody /usr/sbin/tcpd in.tftpd /tftpboot </screen></informalexample> 데비안 꾸러미의 경우에는 설치만 하면 기본적으로 이런 설정이 들어갑니다.
pt: Para ter o servidor TFTP pronto a funcionar, deve primeiro certificar-se que é permitido executar <command>tftpd</command>. Isto é usualmente permitido tendo algo como a seguinte linha em <filename>/etc/inetd.conf</filename>: <informalexample><screen> tftp dgram udp wait nobody /usr/sbin/tcpd in.tftpd /tftpboot </screen></informalexample> Os pacotes Debian em geral irão configura-lo correctamente, por omissão, quando são instalados.
ru: Для запуска TFTP сервера вы должны убедиться, что <command>tftpd</command> включён. Обычно, это делается добавлением в <filename>/etc/inetd.conf</filename> строки вида: <informalexample><screen> tftp dgram udp wait nobody /usr/sbin/tcpd in.tftpd /tftpboot </screen></informalexample> Пакеты Debian сами создают такую строку при установке.
zh_cn: 要准备好 TFTP 服务器，您首先需要确定 <command>tftpd</command> 已经启动。这通常可以在 <filename>/etc/inetd.conf</filename>添加如下字句来实现： <informalexample><screen> tftp dgram udp wait nobody /usr/sbin/tcpd in.tftpd /tftpboot </screen></informalexample> Debian 包通常在安装后会自动把这条设置好。
zh_tw: 要準備好 TFTP 伺服器，您首先需要確定 <command>tftpd</command> 已經啟動。這通常可以在 <filename>/etc/inetd.conf</filename> 加入下列設定來完成： <informalexample><screen> tftp dgram udp wait nobody /usr/sbin/tcpd in.tftpd /tftpboot </screen></informalexample> Debian 套件通常在安裝後會自動把這條設定好。

source: Look in that file and remember the directory which is used as the argument of <command>in.tftpd</command>; you'll need that below. The <userinput>-l</userinput> argument enables some versions of <command>in.tftpd</command> to log all requests to the system logs; this is useful for diagnosing boot errors. If you've had to change <filename>/etc/inetd.conf</filename>, you'll have to notify the running <command>inetd</command> process that the file has changed. On a Debian machine, run <userinput>/etc/init.d/inetd reload</userinput>; on other machines, find out the process ID for <command>inetd</command>, and run <userinput>kill -HUP <replaceable>inetd-pid</replaceable></userinput>.
el: Κοιτάξτε το αρχείο αυτό και φροντίστε να θυμάστε τον κατάλογο που χρησιμοποιείται σαν όρισμα του <command>in.tftpd</command> καθώς θα το χρειαστείτε στη συνέχεια. Το όρισμα <userinput>-l</userinput> επιτρέπει σε κάποιες εκδόσεις του <command>in.tftpd</command> να καταγράφει όλες τις αιτήσεις που δέχεται στα αρχεία καταγραφής του συστήματος, κάτι που είναι χρήσιμο στη διάγνωση λαθών κατά την εκκίνηση. Αν πρέπει για κάποιο λόγο να αλλάξετε το αρχείο <filename>/etc/inetd.conf</filename>, θα πρέπει να ενημερώσετε γι' αυτό τον δαίμονα <command>inetd</command> που τρέχει για την αλλαγή αυτή. Σε ένα μηχάνημα Debian, τρέξτε <userinput>/etc/init.d/inetd reload</userinput>; σε άλλα μηχανήματα, βρείτε τον αριθμό της διαδικασίας για τον <command>inetd</command>, και τρέξτε <userinput>kill -HUP <replaceable>inetd-pid</replaceable></userinput>.
ko: 이 파일을 보고 <command>in.tftpd</command>의 인자로 사용하는 디렉토리를 기억해 두십시오. 아래에서 이 디렉토리 이름이 필요합니다. <command>in.tftpd</command> 일부 버전에서는, <userinput>-l</userinput> 옵션을 쓰면 모든 요청을 시스템 로그에 기록합니다. 이 옵션은 부팅 오류의 원인을 파악하는 데 유용합니다. <filename>/etc/inetd.conf</filename> 파일을 고쳤다면, 고쳤다는 사실을 <command>inetd</command> 프로세스에 알려야 합니다. 데비안 기계에서는 <userinput>/etc/init.d/inetd reload</userinput> 명령을 실행하고, 다른 곳에서는 <command>inetd</command>의 프로세스 ID를 찾아서 <userinput>kill -HUP <replaceable>inetd-pid</replaceable></userinput> 명령을 실행합니다.
pt: Procure nesse ficheiro e lembre-se da directoria que é utilizada como argumento do <command>in.tftpd</command>; que irá necessitar abaixo. O argumento <userinput>-l</userinput> permite que algumas versões registem todos os pedidos aos logs de sistema; isto é útil para diagnosticar erros de arranque. Se tiver de alterar o <filename>/etc/inetd.conf</filename>, terá de notificar o processo <command>inetd</command> que o ficheiro foi alterado. Numa máquina Debian, execute <userinput>/etc/init.d/inetd reload</userinput>; noutras máquinas, procure o ID do processo de <command>inetd</command>, e execute <userinput>kill -HUP <replaceable>inetd-pid</replaceable></userinput>.
ru: Загляните в этот файл и запомните каталог, который используется в качестве аргумента <command>in.tftpd</command>&mdash; он вам потребуется далее. Аргумент <userinput>-l</userinput> в некоторых версиях <command>in.tftpd</command> включает запись протокола всех обращений в системные журналы &mdash; это полезно для диагностики ошибок. Если вы изменили <filename>/etc/inetd.conf</filename>, вам нужно об этом сказать запущенному процессу <command>inetd</command>. На машине Debian выполните <userinput>/etc/init.d/inetd reload</userinput>; на других машинах определите ID процесса <command>inetd</command> и запустите <userinput>kill -HUP <replaceable>inetd-pid</replaceable></userinput>.
zh_cn: 检查那个文件并且记住被用作 <command>in.tftpd</command> 的参数的目录，您接下来将会需要它。<userinput>-l</userinput> 参数能够让某些版本的 <command>in.tftpd</command> 将所有的请求记录到系统日志中。这将在检查错误的时候会很有用。如果您必须修改 <filename>/etc/inetd.conf</filename>，您将必须提醒正在运行的 <command>inetd</command>进程该文件已经被改变。在 Debian 系统中，您应该执行 <userinput>/etc/init.d/inetd reload</userinput>；而在其它系统中，找到 <command>inetd</command> 所对应的进程 ID，并且运行 <userinput>kill -HUP <replaceable>inetd-pid</replaceable></userinput>。
zh_tw: 檢查那個檔案並且記住被用作 <command>in.tftpd</command> 參數的目錄，您接下來將會需要它。<userinput>-l</userinput> 參數能夠讓某些版本的 <command>in.tftpd</command> 將所有請求記錄到系統日誌中。這在檢查錯誤的時候會很有用。如果您必須修改 <filename>/etc/inetd.conf</filename>，您將必須提醒正在運作的 <command>inetd</command> 程序該檔案已經被改變。在 Debian 系統中，您應該執行 <userinput>/etc/init.d/inetd reload</userinput>﹔而在其它系統中，找到 <command>inetd</command> 所對應的程序 ID，並且執行 <userinput>kill -HUP <replaceable>inetd-pid</replaceable></userinput>。

source: If you intend to install Debian on an SGI machine and your TFTP server is a GNU/Linux box running Linux 2.4, you'll need to set the following on your server: <informalexample><screen> # echo 1 &gt; /proc/sys/net/ipv4/ip_no_pmtu_disc </screen></informalexample> to turn off Path MTU discovery, otherwise the Indy's PROM can't download the kernel. Furthermore, make sure TFTP packets are sent from a source port no greater than 32767, or the download will stall after the first packet. Again, it's Linux 2.4.X tripping this bug in the PROM, and you can avoid it by setting <informalexample><screen> # echo "2048 32767" &gt; /proc/sys/net/ipv4/ip_local_port_range </screen></informalexample> to adjust the range of source ports the Linux TFTP server uses.
el: Αν προτίθεστε να εγκαταστήσετε το Debian σε ένα μηχάνημα SGI και ο εξυπηρετητής σας TFTP είναι ένα κουτί GNU/Linux με πυρήνα 2.4, θα πρέπει να ρυθμίσετε τα ακόλουθα στον εξυπηρετητή σας: <informalexample><screen> # echo 1 &gt; /proc/sys/net/ipv4/ip_no_pmtu_disc </screen></informalexample> για να απενεργοποιήσετε το Path MTU discovery, διαφορετικά η μνήμη PROM του Indy δεν μπορεί να κατεβάσει τον πυρήνα. Επιπλέον, σιγουρευτείτε ότι τα πακέτα TFTP στέλνονται από μια πόρτα στην πηγή όχι μεγαλύτερη από την 32767, διαφορετικά το κατέβασμα θα "κολλήσει" μετά το πρώτο πακέτο. Και πάλι, είναι ο πυρήνας Linux 2.4.X που μεταφέρει αυτό το σφάλμα στην PROM και μπορείτε να το αποφύγετε βάζοντας <informalexample><screen> # echo "2048 32767" > /proc/sys/net/ipv4/ip_local_port_range </screen></informalexample> για την προσαρμογή του εύρους των θυρών που χρησιμοποιεί ο εξυπηρετητής TFTP στο Linux.
ko: 데비안을 SGI 기계에 설치하려 하고, TFTP 서버가 리눅스 2.4로 동작하는 GNU/Linux인 경우, 서버에서 다음을 설정해야 합니다: <informalexample><screen> # echo 1 &gt; /proc/sys/net/ipv4/ip_no_pmtu_disc </screen></informalexample> 이 명령은 Path MTU discovery 기능을 끕니다. 이 기능을 끄지 하지 않으면 Indy의 PROM이 커널을 내려받지 못합니다. 또 32767보다 높지 않은 포트에서 TFTP 패킷을 보내도록 만드십시오. 그렇지 않으면 첫 번째 패킷을 받은 다음에 멈춰버립니다. 이 문제는 PROM의 버그를 리눅스 2.4.x에서 들춰내는 것입니다. 다음 명령으로 이런 현상을 피할 수 있습니다: <informalexample><screen> # echo "2048 32767" &gt; /proc/sys/net/ipv4/ip_local_port_range </screen></informalexample> 이 명령은 리눅스 TFTP 서버에서 사용할 포트의 범위를 조정합니다.
pt: Se tenciona instalar Debian numa máquina SGI e o seu servidor é uma máquina GNU/Linux utilizando um Linux 2.4, necessitará de configurar o seguinte no servidor <informalexample><screen> # echo 1 &gt; /proc/sys/net/ipv4/ip_no_pmtu_disc </screen></informalexample> para desligar o Path MTU discovery, caso contrário o Indy's PROM não consegue fazer o download do kernel. Além disso, assegure-se que os pacotes TFTP são enviados a partir de um source port não maior que 32767, ou o download irá ficar bloqueado após o primeiro pacote. Mais uma vez, o Linux 2.4.X despoleta este bug na PROM, pode evitá-lo configurando <informalexample><screen> # echo "2048 32767" &gt; /proc/sys/net/ipv4/ip_local_port_range </screen></informalexample> para ajustar a gama de source ports que o servidor TFTP de Linux utiliza.
ru: Если вы хотите установить Debian на машину SGI, а ваш TFTP сервер работает на GNU/Linux с ядром Linux 2.4, то на сервере вам нужно выполнить: <informalexample><screen> # echo 1 &gt; /proc/sys/net/ipv4/ip_no_pmtu_disc </screen></informalexample> чтобы отключить обнаружение Path MTU, иначе Indy PROM не сможет загрузить ядро. Кроме того, убедитесь, что TFTP пакеты посылаются с портом источника не выше 32767 или загрузка остановится после первого пакета. Ещё раз, это ошибка Linux 2.4.X при работе с PROM, и вы можете избежать этого, выполнив настройку <informalexample><screen> # echo "2048 32767" &gt; /proc/sys/net/ipv4/ip_local_port_range </screen></informalexample>, которая регулирует диапазон портов источника используемого Linux TFTP сервером.
zh_cn: 如果您想要在一台 SGI 上安装 Debian 并且您的 TFTP 服务器是一台运行 Linux 2.4 的 GNU/Linux，您需要对服务器进行如下设置： <informalexample><screen> # echo 1 &gt; /proc/sys/net/ipv4/ip_no_pmtu_disc </screen></informalexample> 来关闭 Path MTU 查询，否则 Indy 的 PROM 不能下载内核。而且，您还要确保 TFTP 数据包是从一个小于 32767 的端口送出，否则在第一包之后，下载将停止。重申一下，这是由于 Linux 2.4.X 触发了 PROM 里的一个 bug。您可以通过如下设置： <informalexample><screen> # echo "2048 32767" &gt; /proc/sys/net/ipv4/ip_local_port_range </screen></informalexample> 调整 Linux TFTP 服务器使用的源端口范围以避开这个错误。
zh_tw: 如果您想要在一台 SGI 上安裝 Debian 並且您的 TFTP 伺服器是在 Linux 2.4 的 GNU/Linux 上運作，您需要對伺服器進行如下設定：<informalexample><screen> # echo 1 &gt; /proc/sys/net/ipv4/ip_no_pmtu_disc </screen></informalexample> 來關閉 Path MTU 查詢，否則 Indy 的 PROM 不能下載核心。而且，您還要確保 TFTP 封包是從一個小於 32767 的連接埠送出，否則在第一個封包之後，下載將停止。重申一下，這是由於 Linux 2.4.X 觸發了 PROM 裡的一個 臭蟲。您可以透過如下設定：<informalexample><screen> # echo "2048 32767" &gt; /proc/sys/net/ipv4/ip_local_port_range </screen></informalexample> 調整 Linux TFTP 伺服器使用的來源連接埠範圍以避開這個錯誤。

source: Move TFTP Images Into Place
el: Μεταφορά των ειδώλων TFTP στη θέση τους
ko: TFTP 이미지를 적당한 위치에 옮기기
pt: Mover Imagens TFTP Para o Lugar
ru: Копирование TFTP образов в каталог TFTP сервера
zh_cn: 将 TFTP 映像放到适当的位置
zh_tw: 將 TFTP 映像放到適當的位置

source: Next, place the TFTP boot image you need, as found in <xref linkend="where-files"/>, in the <command>tftpd</command> boot image directory. Generally, this directory will be <filename>/tftpboot</filename>. You'll have to make a link from that file to the file which <command>tftpd</command> will use for booting a particular client. Unfortunately, the file name is determined by the TFTP client, and there are no strong standards.
el: Στη συνέχεια, τοποθετήστε την εικόνα εκκίνησης του TFTP, όπως βρίσκεται στο <xref linkend="where-files"/>, στον κατάλογο των ειδώλων εκκίνησης του <command>tftpd</command>. Γενικά, ο κατάλογος αυτός θα είναι ο <filename>/tftpboot</filename>. Θα πρέπει να δημιουργήσετε έναν σύνδεσμο από το αρχείο αυτό στο αρχείο που ο εξυπηρετητής <command>tftpd</command> θα χρησιμοποιήσει για την εκκίνηση ενός συγκεκριμένου πελάτη. Δυστυχώς, το αρχείο αυτό καθορίζεται από τον πελάτη του TFTP, και δεν υπάρχουν γι' αυτό σταθερά πρότυπα.
ko: 그 다음에, 필요한 TFTP 부팅 이미지를 <xref linkend="where-files"/>에 쓰여 있는 것처럼 <command>tftpd</command> 부팅 이미지 디렉토리에 복사해 놓으십시오. 보통 이 디렉토리는 <filename>/tftpboot</filename>입니다. 이 파일에서, <command>tftpd</command>가 특정 클라이언트를 부팅할 때 사용하는 특정 파일로 링크를 만들어야 할 것입니다. 불행히도 그 파일의 이름은 TFTP 클라이언트가 결정하고, 어떤 표준도 없습니다.
pt: Em seguida, coloque a imagem de arranque do TFTP, conforme encontrada na <xref linkend="where-files"/>, no directório de imagem de arranque <command>tftpd</command>. Por norma este directório será <filename>/tftpboot</filename>. Terá de fazer um link a partir desse ficheiro para o ficheiro que o <command>tftpd</command> irá utilizar para iniciar um cliente em particular. Infelizmente, o nome do ficheiro é determinado pelo cliente TFTP, e não existem standards sólidos.
ru: Далее, поместите нужный загрузочный образ TFTP из <xref linkend="where-files"/> в каталог загрузочных образов <command>tftpd</command>. Как правило, этот каталог называется <filename>/tftpboot</filename>. Вы можете сделать ссылку на этот файл для файла, который <command>tftpd</command> будет передавать для загрузки определённому клиенту. К сожалению, имя файла определяется TFTP клиентом и никак не стандартизовано.
zh_cn: 接下来，将在 <xref linkend="where-files"/>中找到的 TFTP 启动映像放置到<command>tftpd</command>引导映像目录中。一般来说，这个目录将是 <filename>/tftpboot</filename>。您必须将该文件链接到 <command>tftpd</command> 所使用的引导特定客户端的文件名。不幸的是，这个文件名完全决定于 TFTP 客户程序，并且没有一个强制的标准。
zh_tw: 接下來，將在 <xref linkend="where-files"/> 中找到的 TFTP 開機映像放到<command>tftpd</command> 開機映像目錄中。一般來說，這個目錄將是 <filename>/tftpboot</filename>。您必須將該檔案鏈結到 <command>tftpd</command> 用來啟動客戶端的檔案名稱。不幸的是，這個檔案名稱完全決定於 TFTP 客戶端程式，並且沒有一個強制的標準。

source: On NewWorld Power Macintosh machines, you will need to set up the <command>yaboot</command> boot loader as the TFTP boot image. <command>Yaboot</command> will then retrieve the kernel and RAMdisk images via TFTP itself. For net booting, use the <filename>yaboot-netboot.conf</filename>. Just rename this to <filename>yaboot.conf</filename> in the TFTP directory.
el: Σε μηχανήματα NewWorld Power Macintosh, θα πρέπει να ρυθμίσετε τον φορτωτή εκκίνησης <command>yaboot</command> σαν την εικόνα εκκίνησης του TFTP. Το <command>Yaboot</command> θα ανακτήσει τότε τα είδωλα του πυρήνα και του δίσκου RAM (RAMdisk) μέσω του ίδιου του TFTP. Για δικτυακή εκκίνηση, χρησιμοποιήστε το αρχείο <filename>yaboot-netboot.conf</filename>. Απλά μετονομάστε το σε <filename>yaboot.conf</filename> στον κατάλογο του TFTP.
ko: NewWorld Power Macintosh 기계에서는, TFTP 부팅 이미지로 <command>yaboot</command>를 설정해야 합니다. <command>yaboot</command>는 커널과 램디스크를 TFTP를 통해 가져옵니다. 네트워크 부팅의 경우, <filename>yaboot-netboot.conf</filename>를 사용하십시오. 이 파일을 TFTP 디렉토리의 <filename>yaboot.conf</filename>로 이름을 바꾸십시오.
pt: Em máquinas Macintosh Power NewWorld, necessitará de configurar o gestor de arranque <command>yaboot</command> como a imagem de arranque TFTP. <command>Yaboot</command> irá então buscar a imagem do kernel e RAMdisk através do próprio TFTP. Para um arranque a partir da rede, utilize <filename>yaboot-netboot.conf</filename>. Renomeie-o apenas para <filename>yaboot.conf</filename> dentro da directoria TFTP.
ru: На машинах NewWorld Power Macintosh вам нужно настроить системный загрузчик<command>yaboot</command> на загрузочный образ TFTP. <command>Yaboot</command> затем получит образы ядра и RAMdisk через TFTP сам. Для сетевой загрузки, используйте <filename>yaboot-netboot.conf</filename>. Просто переименуйте его в <filename>yaboot.conf</filename> в каталоге TFTP.
zh_cn: 在 NewWorld Power Macintosh 上，您需要设置 <command>yaboot</command>引导装载器作为 TFTP 引导映像。<command>Yaboot</command> 接下来将通过 TFTP 来获到内核和内存虚拟磁盘映像。对于网络引导，请使用 <filename>yaboot-netboot.conf</filename>。只需要将其改名为 <filename>yaboot.conf</filename> 并且放入 TFTP 目录。
zh_tw: 在 NewWorld Power Macintosh 上，您需要設定 <command>yaboot</command> boot-loader作為 TFTP 開機映像。接著，<command>Yaboot</command> 將透過 TFTP 來取得核心和記憶體虛擬磁碟映像。對於網路開機，請使用 <filename>yaboot-netboot.conf</filename>。只需要將其更名為 <filename>yaboot.conf</filename> 並且放入 TFTP 目錄。
