Repository: xobs/debian-installer
Catalog: doc/manual/po/*/install-methods.po
Languages: el, ko, pt, ru, zh_cn, zh_tw

source: Obtaining System Installation Media
el: Αποκτώντας τα Μέσα Εγκατάστασης του Συστήματος
ko: 시스템 설치 미디어 얻기
pt: Obter o Meio de Instalação do Sistema
ru: Получение носителя с дистрибутивом
zh_cn: 获取系统安装介质
zh_tw: 取得系統安裝媒介

source: Official &debian; CD-ROM Sets
el: Επίσημες Συλλογές των CD-ROM του &debian;
ko: 공식 &debian; CD-ROM 세트
pt: Conjuntos Oficiais de CD-ROM's &debian;
ru: Официальный набор компакт-дисков &debian;
zh_cn: 官方的 &debian; 光盘套装
zh_tw: &debian; 官方光碟套件

source: By far the easiest way to install &debian; is from an Official Debian CD-ROM Set. You can buy a set from a vendor (see the <ulink url="&url-debian-cd-vendors;">CD vendors page</ulink>). You may also download the CD-ROM images from a Debian mirror and make your own set, if you have a fast network connection and a CD burner (see the <ulink url="&url-debian-cd;">Debian CD page</ulink> for detailed instructions). If you have a Debian CD set and CDs are bootable on your machine, you can skip right to <xref linkend="boot-installer"/>; much effort has been expended to ensure the files most people need are there on the CD. Although a full set of binary packages requires several CDs, it is unlikely you will need packages on the third CD and above. You may also consider using the DVD version, which saves a lot of space on your shelf and you avoid the CD shuffling marathon.
el: Ο ευκολότερος με διαφορά τρόπος για να εγκαταστήσετε το &debian; είναι από ένα Επίσημο σετ CD-ROM του Debian. Μπορείτε να αγοράσετε ένα τέτοιο σετ από έναν προμηθευτή (δείτε τη σελίδα <ulink url="&url-debian-cd-vendors;">CD vendors page</ulink>). Μπορείτε επίσης να κατεβάσετε είδωλα των CD-ROM από έναν κατοπτριστή αρχείων του Debian και να φτιάξετε έτσι το δικό σας σετ, αν έχετε μια γρήγορη δικτυακή σύνδεση και έναν εγγραφέα CD (δείτε τη σελίδα <ulink url="&url-debian-cd;">Debian CD</ulink>για λεπτομερείς οδηγίες). Αν έχετε ένα σετ Debian CD και τα CD είναι εκκινήσιμα από το μηχάνημά σας, μπορείτε να προχωρήσετε κατευθείαν στην ενότητα <xref linkend="boot-installer"/>; έχει καταβληθεί μεγάλη προσπάθεια ώστε να εξασφαλιστεί ότι τα αρχεία που οι περισσότεροι χρήστες θα χρειαστούν βρίσκονται στα CD. Αν και ένα πλήρες σύνολο των εκτελέσιμων πακέτων απαιτεί αρκετά CD, είναι απίθανο να χρειαστείτε πακέτα που να βρίσκονται από το τρίτο CD και μετά. Μπορείτε επίσης να εξετάσετε την εκδοχή της έκδοσης σε DVD, που σώζει αρκετό χώρο στο ράφι σας και σα γλιτώνει από τον μαραθώνιο της διαρκούς αλλαγής CD.
ko: 여러 가지 방법 중에서 &debian; 설치에 가장 쉬운 방법은 공식 데비안 CD-ROM 세트로 설치하는 것입니다. CD 세트는 판매하는 회사에서 (<ulink url="&url-debian-cd-vendors;">CD 판매 회사 페이지</ulink> 참고) 구입할 수 있습니다. 네트워크 연결이 빠르고, CD 라이터가 있으면, 데비안 미러 사이트에서 CD-ROM 이미지를 내려 받아서 직접 CD 세트를 만들 수도 있습니다. (CD 만드는 방법은 <ulink url="&url-debian-cd;">데비안 CD 페이지</ulink> 참고) 데비안 CD 세트가 있고 CD에서 부팅할 수 있으면, 바로 <xref linkend="boot-installer"/> 부분으로 넘어갈 수 있습니다. 이 부팅 CD에는 가능한 범위 내에서 대부분의 사람들에게 필요한 파일들이 들어 있습니다. 바이너리 꾸러미 모음은 전부 여러 장의 CD가 필요하지만, 아마도 3번째 이후의 CD에서 꾸러미가 필요한 일은 없을 겁니다. DVD 버전을 쓸 수도 있습니다. DVD 버전은 보관할 공간도 줄어들고, CD를 이것 저것 교환해야 하는 일도 없습니다.
pt: A forma mais simples para se instalar o &debian; é de longe a partir de um conjunto de CD-ROM oficiais. Pode também comprar um conjunto de CDs a um vendedor (visite a <ulink url="&url-debian-cd-vendors;">página de vendedores de CDs</ulink>). Também pode fazer o download das imagens a partir do mirror da Debian e fazer o seu próprio conjunto, se tiver uma ligação rápida à Internet e um gravador de CDs (para informações detalhadas visite a <ulink url="&url-debian-cd;">página de CDs Debian</ulink>). Se tem um conjunto de CDs Debian e estes iniciam na sua máquina, pode saltar directamente para o <xref linkend="boot-installer"/>; muito esforço tem sido dispendido para garantir que os ficheiros que a maioria das pessoas precisam estão presentes no CD. Embora o conjunto completo dos pacotes binários necessite de vários CDs, é pouco provável que você irá precisar dos pacotes que estão presentes no terceiro CD e seguintes. Deve também considerar em usar a versão em DVD, que poupa bastante espaço na sua prateleira e evita a maratona de de CDs misturados.
ru: Самым лёгким путём установки &debian; является установка с официального набора компакт-дисков Debian (смотрите <ulink url="&url-debian-cd-vendors;">страницу продавцов компакт-дисков Debian</ulink>). Также, вы можете загрузить образы компакт-дисков с сервера-зеркала Debian и сделать из них набор самостоятельно, если у вас есть высокоскоростное подключение к сети и устройство записи компакт-дисков (подробные инструкции смотрите на странице <ulink url="&url-debian-cd;">Debian GNU/Linux на компакт-дисках</ulink>). Если вас есть официальный набор компакт-дисков Debian и машина способна загружаться с привода CDROM, то вы можете сразу перейти к <xref linkend="boot-installer"/>; много усилий было потрачено, чтобы добиться того, чтобы файлы на этих дисках стали полезными большому числу людей. Хотя полный набор готовых пакетов умещается на нескольких дисках, вряд ли вам понадобятся пакеты, расположенные на третьем и последующих дисках. Также вы можете подумать над использованием DVD версии, так как это сохранит место на вашей полке и вы избежите частой смены компакт-дисков в приводе.
zh_cn: 目前安装 &debian; 最容易的方法是使用一个官方的 Debian CD 盘套件。您可以从一个销售商处购买 (参见 <ulink url="&url-debian-cd-vendors;">光盘销售商</ulink>)。如果您有快速的网络连接和光盘刻录机的话，也可以从 Debian 镜像站点下载光盘映像然后自行刻录光盘 (具体参见 <ulink url="&url-debian-cd;">Debian CD 页</ulink>)。如果您有一套 Debian 的 CD 盘套件并且能在您的机器上引导这些 CD 盘，您可以直接跳至 <xref linkend="boot-installer"/>。我们已经做了很多努力来确保 CD 中已经包含了大多数人所需要的文件。尽管一整套预编译的二进制软件包需要好几张 CD 盘，但是 您可能不会用到第三张 CD 盘以后的内容。您也可以可以考虑使用 DVD 版本，这将为您的书架节约很多光盘存放空间，并且您可以避免沉闷地 CD 盘切换。
zh_tw: 目前安裝 &debian; 最容易的方法是使用一個官方的 Debian光碟套件。您可以向零售商購買 (參閱 <ulink url="&url-debian-cd-vendors;">光碟零售商</ulink>)。如果您有快速的網路連接和光碟燒錄機的話，也可以從 Debian 鏡像站下載光碟映像檔然後自行燒錄光碟 (具體參閱 <ulink url="&url-debian-cd;">Debian 光碟網頁</ulink>)。如果您有一套 Debian 的光碟套件並且能在您的機器上開機這些光碟，您可以直接跳至 <xref linkend="boot-installer"/>。我們已經做了很多努力來確保光碟中已經包含了大多數人所需要的文件。儘管一整套預先編譯的二進位軟體套件需要好幾張光碟，但是您可能不會用到第三張光碟以後的內容。您也可以可以考慮使用 DVD 版本，這將為您的書架節省很多光碟存放空間，並且您可以避免馬拉松式的光碟換片動作。

source: If your machine doesn't support CD booting, but you do have a CD set, you can use an alternative strategy such as <phrase condition="supports-floppy-boot">floppy disk,</phrase> <phrase arch="s390">tape, emulated tape,</phrase> <phrase condition="bootable-disk">hard disk,</phrase> <phrase condition="bootable-usb">usb stick,</phrase> <phrase condition="supports-tftp">net boot,</phrase> or manually loading the kernel from the CD to initially boot the system installer. The files you need for booting by another means are also on the CD; the Debian network archive and CD folder organization are identical. So when archive file paths are given below for particular files you need for booting, look for those files in the same directories and subdirectories on your CD.
el: Αν το μηχάνημά σας δεν υποστηρίζει εκκίνηση από CD, αλλά διαθέτετε ένα σετ CD, μπορείτε να χρησιμοποιήσετε μια εναλλακτική στρατηγική όπως <phrase condition="supports-floppy-boot">δισκέττα,</phrase> <phrase arch="s390">κασέτα, προσομοίωση κασέτας,</phrase> <phrase condition="bootable-disk">σκληρός δίσκος,</phrase> <phrase condition="bootable-usb">usb stick,</phrase> <phrase condition="supports-tftp">δικτυακή εκκίνηση,</phrase> ή φορτώστε χειροκίνητα τον πυρήνα από το CD για να ξεκινήσετε αρχικά τον εγκαταστάτη του συστήματος. Τα αρχεία που χρειάζεστε για να ξεκινήσετε με ένα άλλο μέσο βρίσκονται επίσης στο CD; η οργάνωση της δικτυακής αρχειοθήκης του Debian και του καταλόγου στο CD είναι ταυτόσημα. Έτσι όταν στη συνέχεια δίνονται διαδρομές για αρχεία της αρχειοθήκης για συγκεκριμένα αρχεία που χρειάζεστε για την εκκίνηση, κοιτάξτε γι' αυτά τα αρχεία στους ίδιους καταλόγους και υποκαταλόγους στο CD σας.
ko: CD 세트가 있지만 CD 부팅을 지원하지 않는 경우에는, <phrase condition="supports-floppy-boot">플로피 디스크,</phrase> <phrase arch="s390">테이프, 테이프 에뮬레이션,</phrase> <phrase condition="bootable-disk">하드 디스크,</phrase> <phrase condition="bootable-usb">USB 스틱,</phrase> <phrase condition="supports-tftp">네트워크 부팅,</phrase> 아니면 수동으로 CD에서 커널을 읽어들여서 시스템 설치 프로그램을 맨 처음 부팅할 수 있습니다. 다른 방법으로 부팅할 때 필요한 파일은 CD 안에도 들어 있습니다. 데비안 네트워크 아카이브와 CD의 폴더 구조는 완전히 동일합니다. 그래서 아래에 부팅하는 데 필요한 어떤 파일의 경로가 있으면, CD의 같은 서브 디렉토리 안에서 그 파일을 찾아 보십시오.
pt: Se a sua máquina não suporta arranque a partir de CD, mas no entanto tem um conjunto de CDs, você pode utilizar uma estratégia alternativa tal como <phrase condition="supports-floppy-boot">disquete,</phrase> <phrase arch="s390">tape, tape emulada, </phrase> <phrase condition="bootable-disk">disco rígido,</phrase> <phrase condition="bootable-usb">stick usb,</phrase> <phrase condition="supports-tftp">net boot,</phrase> ou carregar manualmente o kernel a partir do CD para iniciar o instalador de sistema. Os ficheiros que precisa para inicializar através de outros métodos também estão no CD; A organização dos ficheiros do arquivo Debian na Internet é idêntica à organização de ficheiros do CD. Portanto quando abaixo forem dadas localizações para ficheiros específicos necessários para o arranque, procure por esses ficheiros nas mesmas directorias e subdirectorias do seu CD.
ru: Если машина не поддерживает загрузку с компакт-диска, а вы имеете набор CD, то для загрузки программы установки можно воспользоваться другим методом, например загрузить ядро <phrase condition="supports-floppy-boot">с дискеты,</phrase> <phrase arch="s390">с ленты, виртуальной ленты,</phrase> <phrase condition="bootable-disk">с жёсткого диска,</phrase> <phrase condition="bootable-usb">с карт памяти usb,</phrase> <phrase condition="supports-tftp">по сети,</phrase> или вручную с CD. Для этого на компакт-диске есть все файлы; структура архива Debian в сети и каталогов CD идентичны. Поэтому, когда ниже встречаются пути к файлам в архиве, которые требуются для определённого вида загрузки, поищите эти файлы в тех же каталогах и подкаталогах на ваших CD.
zh_cn: 如果您的机器不支持 CD 盘引导，但是您有一套 CD 光盘套件，您可以使用其他的方法比如： <phrase condition="supports-floppy-boot">软盘、</phrase> <phrase arch="s390">磁带、磁带仿真、</phrase> <phrase condition="bootable-disk">硬盘、</phrase> <phrase condition="bootable-usb">U 盘、</phrase> <phrase condition="supports-tftp">网络引导，</phrase> 或者从 CD 盘中手工装载内核来初始化系统安装程序。CD 盘已经包含了通过其他方法引导所需要的文件； Debain 的网络存档和 CD 盘的文件夹组织方式是一致的。因此如果后面有给出的用于引导的特定存档文件路径时，请在 CD 盘中同样的文件目录和子目录下查找它们。
zh_tw: 如果您的機器不支援光碟開機，但是您有一套光碟套件，您可以使用其他的方法例如： <phrase condition="supports-floppy-boot">軟碟、</phrase> <phrase arch="s390">磁帶、磁帶仿真、</phrase> <phrase condition="bootable-disk">硬碟、</phrase> <phrase condition="bootable-usb">USB 隨身碟、</phrase> <phrase condition="supports-tftp">網路開機，</phrase> 或者從光碟中手動載入核心來初始系統安裝程式。透過其他方法開機所需要的文件都包含在光碟之中；Debain 的網路存檔和光碟的目錄組織方式是一致的。因此如果後文中有出現用於開機的特定檔案路徑時，請在光碟中同樣的目錄和子目錄下查找它們。

source: Once the installer is booted, it will be able to obtain all the other files it needs from the CD.
el: Όταν ξεκινήσει ο εγκαταστάτης, θα είστε σε θέση να αποκτήσετε όλα τα υπόλοιπα απαραίτητα για τον εγκαταστάτη αρχεία από το CD.
ko: 설치 프로그램을 부팅하기만 하면, 필요한 다른 파일들은 모두 CD에서 이용할 수 있습니다.
pt: Uma vez o instalador iniciado, a partir do CD você poderá obter todos os outros ficheiros que precisa.
ru: После загрузки программы установки, можно будет загрузить все остальные файлы с компакт-дисков.
zh_cn: 一旦安装程序被引导，它将能够获得 CD 盘中其他所有必需的文件。
zh_tw: 安裝程式啟動一旦啟動，它將能夠取得光碟中其他所有必需的檔案。

source: If you don't have a CD set, then you will need to download the installer system files and place them on the <phrase arch="s390">installation tape</phrase> <phrase condition="supports-floppy-boot">floppy disk or</phrase> <phrase condition="bootable-disk">hard disk or</phrase> <phrase condition="bootable-usb">usb stick or</phrase> <phrase condition="supports-tftp">a connected computer</phrase> so they can be used to boot the installer.
el: Αν δεν έχετε ένα σετ από CD, τότε θα πρέπει να κατεβάσετε τα αρχεία συστήματος του εγκαταστάτη και να τα τοποθετήσετε σε<phrase arch="s390">μία κασέτα εγκατάστασης</phrase> <phrase condition="supports-floppy-boot">μία δισκέττα ή</phrase> <phrase condition="bootable-disk">ένα σκληρό δίσκο ή</phrase> <phrase condition="bootable-usb">ένα usb stick ή</phrase> <phrase condition="supports-tftp">έναν συνδεδεμένο υπολογιστή</phrase> ώστε να μπορέσουν να χρησιμοποιηθούν για την εκκίνηση του εγκαταστάτη.
ko: CD 세트가 없으면, 설치 프로그램의 시스템 파일들을 내려 받아서 <phrase arch="s390">설치 테이프</phrase> <phrase condition="supports-floppy-boot">플로피 디스크나</phrase> <phrase condition="bootable-disk">하드 디스크나</phrase> <phrase condition="bootable-usb">USB 스틱이나</phrase> <phrase codnition="supports-tftp">네트워크로 연결된 컴퓨터에</phrase> 저장해 놓으십시오. 그러면 이 파일을 이용해 설치 프로그램을 부팅할 수 있습니다.
pt: Se você não tem um conjunto de CDs, necessitará então de fazer o download dos ficheiros de instalação do sistema e coloca-los na <phrase arch="s390">tape de instalação ou na </phrase> <phrase condition="supports-floppy-boot">disquete ou</phrase> <phrase condition="bootable-disk"> no disco rígido ou </phrase> <phrase condition="bootable-usb">num usb stick ou</phrase> <phrase condition="supports-tftp">num computador que esteja ligado à rede</phrase> para que possam ser utilizados para arrancar com o instalador.
ru: Если у вас нет набора CD, то вам потребуется загрузить системные файлы программы установки и сохранить их на <phrase arch="s390">установочную ленту</phrase> <phrase condition="supports-floppy-boot">дискету или</phrase> <phrase condition="bootable-disk">жёсткий диск или</phrase> <phrase condition="bootable-usb">карте памяти usb или</phrase> <phrase condition="supports-tftp">подключённый компьютер</phrase> и использовать их для загрузки программы установки.
zh_cn: 如果您没有一套 CD 光盘套件，则您需要下载安装系统文件并且把他们放到： <phrase arch="s390">安装磁带</phrase> <phrase condition="supports-floppy-boot">软盘 或</phrase> <phrase condition="bootable-disk">硬盘 或</phrase> <phrase condition="bootable-usb">U 盘 或</phrase> <phrase condition="supports-tftp">一台连网的计算机上</phrase> 然后他们可以被用来引导安装程序。
zh_tw: 如果您沒有光碟套件，則需下載安裝系統檔案並且把他們放到：<phrase arch="s390">安裝磁帶</phrase> <phrase condition="supports-floppy-boot">軟碟、</phrase> <phrase condition="bootable-disk">硬碟、</phrase> <phrase condition="bootable-usb">USB 隨身碟或</phrase> <phrase condition="supports-tftp">一台有連接網路的電腦上</phrase>，他們可以用來啟動安裝程式。

source: Downloading Files from Debian Mirrors
el: Λήψη Αρχείων από τους Κατοπτριστές αρχείων του Debian
ko: 데비안 미러에서 파일 내려받기
pt: Download dos Ficheiros a partir dos Mirrors Debian
ru: Загрузка файлов с серверов-зеркал Debian
zh_cn: 从 Debian 镜像服务器下载文件
zh_tw: 從 Debian 鏡像伺服器下載檔案

source: To find the nearest (and thus probably the fastest) mirror, see the <ulink url="&url-debian-mirrors;">list of Debian mirrors</ulink>.
el: Για να βρείτε τον πλησιέστερο (και άρα πιθανόν τον γρηγορότερο) κατοπτριστή αρχείων δείτε το σύνδεσμο <ulink url="&url-debian-mirrors;">λίστα των κατοπτριστών αρχείων του Debian</ulink>.
ko: 가장 가까이 있는 (그래서 가장 빠를 것 같은) 미러 사이트를 찾으려면, <ulink url="&url-debian-mirrors;">데비안 미러 목록</ulink>을 참고하십시오.
pt: Para encontrar o mirror mais próximo (e provavelmente o mais rápido), visite a <ulink url="&url-debian-mirrors;">lista de mirrors Debian</ulink>.
ru: Ближайший (и поэтому, вероятно, самый быстрый) к вам сервер-зеркало можно найти в <ulink url="&url-debian-mirrors;">списке серверов-зеркал Debian</ulink>.
zh_cn: 选择离您较近的(因此很可能也是最快的)镜像服务器，请参见 <ulink url="&url-debian-mirrors;">Debian 镜像列表</ulink>。
zh_tw: 選擇離您較近的 (因此很可能也是最快的) 鏡像伺服器，請參閱 <ulink url="&url-debian-mirrors;">Debian 鏡像列表</ulink>。

source: When downloading files from a Debian mirror, be sure to download the files in <emphasis>binary</emphasis> mode, not text or automatic mode.
el: Όταν κατεβάζετε αρχεία από έναν κατοπτριστή αρχείων του Debian, σιγουρευτείτε ότι κατεβάζετε τα αρχεία σε <emphasis>δυαδική</emphasis> κατάσταση, όχι σε αυτόματη ή κατάσταση κειμένου.
ko: 데비안 미러에서 파일을 내려받을 때, 파일을 <emphasis>바이너리 (binary)</emphasis> 모드로 받도록 하십시오. 텍스트나 (text) 자동 (automatic) 모드로 받으면 안 됩니다.
pt: Quando fizer download de ficheiros do mirror Debian, certifique-se que faz download dos ficheiros no modo <emphasis>binário</emphasis>, e não em texto nem no modo automático.
ru: При загрузке файлов с сервера-зеркала Debian проверьте, что загружаете файлы в <emphasis>двоичном</emphasis>, а не текстовом или автоматическом режиме.
zh_cn: 当从 Debian 镜像服务器下载文件的时候，请确认下载的文件是处于<emphasis>二进制</emphasis>模式，而不是文本或者自动模式。
zh_tw: 當從 Debian 鏡像伺服器下載檔案的時候，請確認以<emphasis>二進位</emphasis>模式下載，而不是文字或者自動模式。

source: Where to Find Installation Images
el: Πού να βρείτε Είδωλα της Εγκατάστασης
ko: 설치 이미지를 찾을 위치
pt: Onde Encontrar Imagens de Instalação
ru: Где искать установочные образы
zh_cn: 在哪里能找到安装映像
zh_tw: 哪裡能找到安裝映像檔

source: The installation images are located on each Debian mirror in the directory <ulink url="&url-debian-installer;/images">debian/dists/&releasename;/main/installer-&architecture;/current/images/</ulink> &mdash; the <ulink url="&url-debian-installer;/images/MANIFEST">MANIFEST</ulink> lists each image and its purpose.
el: Τα είδωλα της εγκατάστασης βρίσκονται για κάθε κατοπτριστή αρχείων Debian στον κατάλογο <ulink url="&url-debian-installer;/images">debian/dists/&releasename;/main/installer-&architecture;/current/images/</ulink>&mdash; το αρχείο <ulink url="&url-debian-installer;/images/MANIFEST">MANIFEST</ulink> καταγράφει κάθε είδωλο και τον ρόλο της.
ko: 설치 이미지는 데비안 미러의 <ulink url="&url-debian-installer;/images">debian/dists/&releasename;/main/installer-&architecture;/current/images/</ulink> 디렉토리 안에 있습니다. <ulink url="&url-debian-installer;/images/MANIFEST">MANIFEST</ulink> 파일을 보면 각 이미지 이름과 그 용도가 쓰여 있습니다.
pt: As imagens de instalação estão localizadas em cada mirror Debian na directório <ulink url="&url-debian-installer;/images">debian/dists/&releasename;/main/installer-&architecture;/current/images/</ulink> &mdash; o <ulink url="&url-debian-installer;/images/MANIFEST">MANIFEST</ulink> lista cada imagem e o seu propósito.
ru: Установочные образы на сервере-зеркале Debian находятся в каталоге <ulink url="&url-debian-installer;/images">debian/dists/&releasename;/main/installer-&architecture;/current/images/</ulink> &mdash; в файле <ulink url="&url-debian-installer;/images/MANIFEST">MANIFEST</ulink> описано для чего предназначен каждый образ.
zh_cn: 安装映像位于每一个 Debian 镜像的 <ulink url="&url-debian-installer;/images">debian/dists/&releasename;/main/installer-&architecture;/current/images/</ulink> &mdash; <ulink url="&url-debian-installer;/images/MANIFEST">MANIFEST</ulink> 文件列出了每一个映像及其用途。
zh_tw: 安裝映像檔位於每一個 Debian 鏡像站的 <ulink url="&url-debian-installer;/images">debian/dists/&releasename;/main/installer-&architecture;/current/images/</ulink> &mdash; <ulink url="&url-debian-installer;/images/MANIFEST">MANIFEST</ulink> 文件列出每個映像檔及其用途。

source: Alpha Installation Files
el: Αρχεία Εγκατάστασης σε Alpha
ko: Alpha 설치 파일
pt: Ficheiros de Instalação de Alpha
ru: Файлы установки для Alpha
zh_cn: Alpha 的安装文件
zh_tw: Alpha 的安裝檔案

source: If you choose to boot from ARC console firmware using <command>MILO</command>, you will also need to prepare a disk containing <command>MILO</command> and <command>LINLOAD.EXE</command> from the provided disk images. See <xref linkend="alpha-firmware"/> for more information on Alpha firmware and boot loaders. The floppy images can be found in the <filename>MILO</filename> directory as <filename>milo_<replaceable>subarchitecture</replaceable>.bin</filename>.
el: Αν διαλέξετε να εκκινήσετε από κονσόλα ARC firmware χρησιμοποιώντας <command>MILO</command>, θα πρέπει επίσης να ετοιμάσετε μια δισκέττα που να περιέχει το <command>MILO</command> και το <command>LINLOAD.EXE</command>από τις αντίστοιχα διατιθέμενα είδωλα δισκεττών. Δείτε το <xref linkend="alpha-firmware"/> για περισσότερες πληροφορίες σχετικά με firmware και φορτωτές εκκίνησης για Alpha. Οι εικόνες των δισκεττών μπορούν να βρεθούν στον κατάλογο <filename>MILO</filename> με το όνομα <filename>milo_<replaceable>subarchitecture</replaceable>.bin</filename>.
ko: ARC 콘솔 펌웨어에서 <command>MILO</command>를 이용해 부팅하려고 한다면, 디스크 이미지에 있는 <command>MILO</command>와 <command>LINLOAD.EXE</command> 파일이 들어 있는 디스크도 준비해야 합니다. Alpha 펍웨어와 부트 로더에 관한 더 많은 정보는 <xref linkend="alpha-firmware"/> 부분을 참고하십시오. 플로피 이미지는 <filename>MILO</filename> 디렉토리에 <filename>milo_<replaceable>서브아키텍쳐</replaceable>.bin</filename>이라는 파일로 들어 있습니다.
pt: Se você escolheu arrancar a partir de uma consola de firmware ARC utilizando o <command>MILO</command>, necessitará também de preparar um disco contendo o <command>MILO</command> e <command>LINLOAD.EXE</command> a partir das imagens de disco fornecidas. Visite <xref linkend="alpha-firmware"/> para mais informações sobre firmware Alpha e gestores de arranque. As imagens de disquete podem ser encontradas na directoria <filename>MILO</filename> como <filename>milo_<replaceable>sub-arquitectura</replaceable>.bin</filename>.
ru: Если вы выбрали из консоли микропрограммы ARC загрузку с помощью <command>MILO</command>, то вам также потребуется подготовить диск, содержащий <command>MILO</command> и <command>LINLOAD.EXE</command>, которые можно найти на дисковых образах. Подробную информацию о микропрограмме на Alpha и системных загрузчиках смотрите в<xref linkend="alpha-firmware"/>. Образы дискет можно найти в каталоге <filename>MILO</filename> с именами <filename>milo_<replaceable>субархитектура</replaceable>.bin</filename>.
zh_cn: 如果您选择通过 <command>MILO</command> 来从 ARC 控制台固件引导，就需要从所提供的磁盘映像中准备一张载有 <command>MILO</command> 和 <command>LINLOAD.EXE</command> 的磁盘。有关 Alpha 固件和启动引导器的更多信息请参见 <xref linkend="alpha-firmware"/> 。软盘映像可以在 <filename>MILO</filename> 目录下找到。其形式为： <filename>milo_<replaceable>subarchitecture</replaceable>.bin</filename>。
zh_tw: 如果您選擇透過 <command>MILO</command> 來從 ARC 控制台韌體開機，就需要從所提供的磁碟映像中準備一張載有 <command>MILO</command> 和 <command>LINLOAD.EXE</command> 的磁碟。有關 Alpha 韌體和 boot-loader 的更多資訊請參閱 <xref linkend="alpha-firmware"/> 。軟碟映像檔可以在 <filename>MILO</filename> 目錄下找到。其形式為：<filename>milo_<replaceable>子架構</replaceable>.bin</filename>。
