Repository: xobs/debian-installer
Catalog: doc/manual/po/*/partitioning.po
Languages: el, ko, pt, ru, zh_cn, zh_tw

source: <filename>/usr</filename>: contains all user programs (<filename>/usr/bin</filename>), libraries (<filename>/usr/lib</filename>), documentation (<filename>/usr/share/doc</filename>), etc. This is the part of the file system that generally takes up most space. You should provide at least 500 MB of disk space. This amount should be increased depending on the number and type of packages you plan to install. A generous workstation or server installation should allow 4-6 GB.
el: <filename>/usr</filename>: περιέχει όλα τα προγράμματα χρήστη (<filename>/usr/bin</filename>), βιβλιοθήκες (<filename>/usr/lib</filename>),τεκμηρίωση (<filename>/usr/share/doc</filename>) κλπ. Αυτό είναι το μέρος του συστήματος αρχείων που γενικά καταλαμβάνει τον μεγαλύτερο χώρο. Θα πρέπει να δώσετε τουλάχιστον 500 ΜΒ στον δίσκο σας. Αυτός ο χώρος θα πρέπει να αυξηθεί ανάλογα με τον αριθμό και τον τύπο των πακέτων που σχεδιάζετε να εγκαταστήσετε. Μια γενναιόδωρη εγκατάσταση για ένα σύστημα γραφείου ή διακομιστή θα πρέπει να καταλαμβάνει 4-6 GB.
ko: <filename>/usr</filename>에는 유저 프로그램(<filename>/usr/bin</filename>)과 라이브러리(<filename>/usr/lib</filename>)와 시스템 문서(<filename>/usr/share/doc</filename>) 등이 저장됩니다. 많은 경우 이 부분이 가장 하드디스크 공간을 많이 차지할 것입니다. 최소한 500 MB를 할당하시고 시스템에 설치할 패키지의 구성과 수에 따라 적절히 조절하십시오. 워크스테이션이나 서버로 사용될 시스템은 넉넉잡아 4 - 6 GB 정도를 필요로 할 것입니다.
pt: <filename>/usr</filename>: contém todos os programas dos utilizadores (<filename>/usr/bin</filename>), bibliotecas (<filename>/usr/lib</filename>), documentação (<filename>/usr/share/doc</filename>), etc. Esta é a porção do sistema de ficheiros que geralmente requer mais espaço. Deverá fornecer pelo menos 500 MB de espaço em disco. Este tamanho deve aumentar dependendo do número e tipo de pacotes que planeia instalar. Uma generosa estação de trabalho deve permitir uns 4-6 GB.
ru: В <filename>/usr</filename> хранятся: все пользовательские программы (<filename>/usr/bin</filename>) , библиотеки (<filename>/usr/lib</filename>), документация (<filename>/usr/share/doc</filename>) и так далее. Этой части файловой системы требуется много места. Вы должны выделить как минимум 500 МБ дискового пространства. Этот объём должен быть увеличен в зависимости от числа и типа пакетов, планируемых к установке. Для рабочих станций общего назначения и серверов цифра может вырасти до 4-6 ГБ.
zh_cn: <filename>/usr</filename>：包含所有的用户程序(<filename>/usr/bin</filename>)，库文件(<filename>/usr/lib</filename>)，文档(<filename>/usr/share/doc</filename>)，等等。这是文件系统需要最多的空间的部分。您需要提供至少 500MB 磁盘空间。总容量的增长依据您要安装的软件包数量和类型。大的工作站或服务器安装应该需要 4-6 GB。
zh_tw: <filename>/usr</filename>：包含所有的使用者程式(<filename>/usr/bin</filename>)、函式庫(<filename>/usr/lib</filename>)、文件檔案(<filename>/usr/share/doc</filename>)，等等。這是檔案系統耗費最多的空間的部分。您至少需要 500MB 磁碟空間。總容量與您要安裝的軟體套件數量和類型成正比。大的工作站或伺服器安裝需要 4-6 GB。

source: <filename>/var</filename>: variable data like news articles, e-mails, web sites, databases, the packaging system cache, etc. will be placed under this directory. The size of this directory depends greatly on the usage of your system, but for most people will be dictated by the package management tool's overhead. If you are going to do a full installation of just about everything Debian has to offer, all in one session, setting aside 2 or 3 gigabyte of space for <filename>/var</filename> should be sufficient. If you are going to install in pieces (that is to say, install services and utilities, followed by text stuff, then X, ...), you can get away with 300&ndash;500 MB. If hard drive space is at a premium and you don't plan on doing major system updates, you can get by with as little as 30 or 40 MB.
el: <filename>/var</filename>: μεταβαλλόμενα δεδομένα όπως ειδήσεις, e-mails, διακτυακούς τόπους, την cache του συστήματος πακέτων κά θα μπουν στον κατάλογο αυτό. Το μέγεθος του εξαρτάται καθοριστικά από την χρήση του συστήματός αλλά για τους περισσότερους χρήστες αυτό θα υπαγορευθεί από το "βάρος" που προσθέτουν τα εργαλεία διαχείρισης των πακέτων. Αν πρόκειται να κάνετε μια πλήρη εγκατάσταση σχεδόν όλων όσων έχει να προσφέρει το Debian, όλα σε μια "φάση", τότε 2 με 3 GB χώρου θα είναι αρκετά για τον κατάλογο <filename>/var</filename>.Αν πρόκειται να εγκαταστήσετε σε περισσότερες από μια φάσεις (με άλλα λόγια εγκαταστήσετε πρώτα υπηρεσίες και βοηθήματα, ακολουθούμενα από υλικό κειμένου και μετά το σύστημα X...) μπορείτε πιθανόν να τα καταφέρετε και με 300&ndash;500 MB. Αν ο χώρος στον δίσκο δεν σας περισσεύει και δεν σκοπεύετε να κάνετε σημαντικές αναβαθμίσεις του συστήματος μπορείτε να περιοριστείτε και στα 30 με 40 ΜΒ.
ko: <filename>/var</filename>에는 뉴스그룹글이나 이메일, 웹페이지, 데이터베이스나 패키지 관리 프로그램의 캐시 등 자주 변하는 정보가 주로 저장됩니다. 이 디렉토리의 크기는 시스템에 따라 크게 차이가 나지만, 일반적인 사용자들의 시스템에서는 패키지 관리 프로그램이 이 공간이 대부분을 사용할 것입니다. 데비안에 포함된 프로그램을 한번에 거의 다 설치하실 경우 <filename>/var</filename>에 2 ~ 3 GB정도를 할당하시면 됩니다. 한번에 설치하지 않고 서비스와 유틸리티 따로, 문서 작업용 프로그램 따로, X 윈도우 따로하는 식으로 나눠서 설치하실 경우 300에서 500 MB로도 가능합니다. 하드디스크 크기가 부족하고 시스템의 대대적인 업데이트 예정이 없을 경우 이 파티션을 30이나 40 MB정도로 작게 하실 수도 있습니다.
pt: <filename>/var</filename>: dados variáveis tais como artigos de news , e-mails, web sites, bases de dados, cache do sistema de pacotes, etc. serão guardados sob este directório. O tamanho deste directório depende muito da utilização do seu sistema, mas para a maioria das pessoas irá ser ditado pelo espaço utilizado gestor de pacotes. Se vai fazer uma instalação completa com tudo aquilo que Debian tem para oferecer, numa só sessão, coloque de parte uns 2 ou 3 gigabytes de espaço para <filename>/var</filename> que deverão ser suficientes. Se vai instalar por partes (isto é, instalar serviços e utilitários, seguidos de materiais de texto, depois o X, ...), poderá safar-se com 300&ndash;500 MB. Se o espaço no disco rígido está a prémio e você não planeia fazer grandes actualizações ao sistema, poderá safar-se com uns 30 ou 40 MB.
ru: Каталог <filename>/var</filename> содержит все изменяющиеся данные типа новостных статей, электронной почты, веб сайтов, кэша системы управления пакетами и т.д. Размер каталога целиком зависит от степени использования компьютера, но для большинства людей он определяется работой с системой управления пакетами. Если вы собираетесь установить всё, что предлагает Debian, при чём сразу, то 2 или 3 гигабайта для <filename>/var</filename> должно хватить. Если вы собираетесь производить установку по частям (то есть, установить сервисы и утилиты, потом программы для работы с текстом, потом X, ...), то можно уложиться в 300&ndash;500 мегабайт. Если пространство жёсткого диска дорого и вы не планируете делать глобальных обновлений системы, то вам будет достаточно 30 или 40 мегабайт.
zh_cn: <filename>/var</filename>：所有的可变数据，如新的文章，电子邮件，网站，数据库，软件包系统的缓存等等，将被放置入这个目录。这个目录的大小取决于您对计算机的使用，但是对于大多数人来说将主要用在软件包系统的管理工具。如果您准备一次性地做一个完整的安装，包含 Debian 提供的所有程序，<filename>/var</filename> 下面 2 或 3GB 的空间应该满足需求。如果您准备逐次安装(也就是，安装服务程序和工具，然后是文本处理工具，然后是 X，...)，您可以在 <filename>/var</filename> 下准备 300&mdash;500 MB。如果硬盘空间很紧张，并且您不准备做主要的系统升级，您可以为 <filename>/var</filename> 配置 30-40MB 大小。
zh_tw: <filename>/var</filename>：所有的可變資料，如新的文章，電子郵件，網站，資料庫，套件系統快取等等，將被置入這個目錄下。這個目錄的大小取決於您對系統的使用，但是對大多數人來說主要取決於套件管理工具的額外負擔。如果您準備做完整的安裝，包含 Debian 提供的所有程式，為<filename>/var</filename> 保留 2 或 3GB 的空間應該滿足需求。如果您準備分開安裝(也就是說，安裝服務程式和工具，然後是文本處理工具，接著是 X，...)，您可以在 <filename>/var</filename> 下預留 300&mdash;500 MB。如果硬碟空間不足，而且您不打算做主要的系統升級，您甚至可以配置更少的空間，大概約 30-40MB

source: <filename>/tmp</filename>: temporary data created by programs will most likely go in this directory. 40&ndash;100 MB should usually be enough. Some applications &mdash; including archive manipulators, CD/DVD authoring tools, and multimedia software &mdash; may use <filename>/tmp</filename> to temporarily store image files. If you plan to use such applications, you should adjust the space available in <filename>/tmp</filename> accordingly.
el: <filename>/tmp</filename>: προσωρινά δεδομένα που δημιουργούνται από προγράμματα θα πάνε το πιθανότερο στον κατάλογο αυτό. 40&ndash;100 MB θα είναι συνήθως αρκετά. Μερικές εφαρμογές &mdash; όπως διαχειριστές αρχείων, εργαλεία επεξεργασίας CD/DVD και λογισμικό πολυμέσων &mdash; ίσως να χρησιμοποιούν τον κατάλογο <filename>/tmp</filename> για την προσωρινή αποθήκευση αρχείων εικόνων. Αν σκοπεύετε να χρησιμοποιήσετε τέτοιες εφαρμογές, θα πρέπει να ρυθμίσετε τον διαθέσιμο χώρο για τον κατάλογο <filename>/tmp</filename> ανάλογα.
ko: 프로그램들이 사용하는 임시 데이터는 <filename>/tmp</filename>에 주로 저장됩니다. 대부분 40&ndash;100 MB 정도면 충분하지만, 압축 유틸리티나 CD/DVD 굽는 유틸리티나 각종 멀티미디어 프로그램들은 이미지 파일을 <filename>/tmp</filename>에 임시로 저장하는 경우도 있으므로 이 경우에는 <filename>/tmp</filename>의 크기를 적절히 조절하십시오.
pt: <filename>/tmp</filename>: dados temporários criados por programas irão provavelmente para este directório. Normalmente 40&ndash;100 MB são suficientes. Algumas aplicações &mdash; incluindo manipuladores de arquivos, utilitários de criação de CD/DVD, e software multimédia &mdash; podem utilizar <filename>/tmp</filename> para guardar ficheiros de imagens. Se você planeia utilizar essas aplicações, você deve ajustar de acordo o espaço disponível em <filename>/tmp</filename>.
ru: Каталог <filename>/tmp</filename> содержит временные данные создаваемые запущенными программами. Обычно достаточно 40&ndash;100 МБ. Некоторые приложения &mdash; управление резервным копированием, утилиты работы с CD/DVD и мультимедийными данными &mdash; могут использовать <filename>/tmp</filename> для временного хранения файлов. Если вы планируете использовать данные приложения, то должны выделить пространство под <filename>/tmp</filename> согласно вашим потребностям.
zh_cn: <filename>/tmp</filename>: 程序创建的临时数据大都存到这个目录。通常 40&ndash;100 MB 应该足够。一些应用程序 &mdash; 包括档案处理器，CD/DVD 制作工具，和多媒体软件 &mdash; 可能会使用 <filename>/tmp</filename> 临时保存映像文件。如果您要使用这些程序，应该依据需要调整 <filename>/tmp</filename> 目录的大小。
zh_tw: <filename>/tmp</filename>: 程式製造出的暫存檔大都存到這個目錄，通常 40&ndash;100 MB 便足夠。一些應用程式 &mdash; 包括檔案處理器，CD/DVD 製作工具，和多媒體軟體 &mdash; 可能會使用 <filename>/tmp</filename> 臨時儲存映像檔。如果您要使用這些程式，應該依據需要調整 <filename>/tmp</filename> 目錄的大小。

source: <filename>/home</filename>: every user will put his personal data into a subdirectory of this directory. Its size depends on how many users will be using the system and what files are to be stored in their directories. Depending on your planned usage you should reserve about 100 MB for each user, but adapt this value to your needs. Reserve a lot more space if you plan to save a lot of multimedia files (MP3, movies) in your home directory.
el: <filename>/home</filename>: κάθε χρήστης θα τοπθετήσει τα προσωπικά του δεδομένα σε έναν υποκατάλογο του καταλόγου αυτού. Το μέγεθός του εξαρτάται από το πόσοι χρήστες θα χρησιμοποιούν το σύστημα και τι είδους αρχεία θα αποθηκεύουν στους καταλόγους τους. Ανάλογα με την σχεδιαζόμενη χρήση θα πρέπει να κρατήσετε 100 ΜΒ για κάθε χρήστη, αλλά προσαρμόστε την τιμή αυτή στις ανάγκες σας.Κρατήστε πολύ περισσότερο χώρο αν σκοπεύετε να σώζετε πολλά αρχεία πολυμέσων (MP3, ταινίες) στον προσωπικό σας κατάλογο.
ko: <filename>/home</filename>에는 사용자들의 홈디렉토리가 저장됩니다. 사용자들은 홈디렉토리에 개인 파일들을 저장할텐데, 이 시스템을 사용하는 사용자가 몇 명이며 각자가 자신의 홈디렉토리 어떤 종류의 파일을 저장할지에 따라 필요한 <filename>/home</filename>디렉토리의 크기가 달라지게 됩니다. 100 MB정도씩을 할당하면 되지만, 홈디렉토리 안에 MP3나 동영상 등 대용량 파일을 많이 저장할 예정이라면 공간을 충분히 늘려 잡으십시오.
pt: <filename>/home</filename>: todos os utilizadores irão colocar os seus dados pessoais num subdirectório desta directoria. O seu tamanho depende de quantos utilizadores estarão a utilizar o sistema e que ficheiros irão ser guardados nos seus directórios. Dependendo da utilização planeada deverá reservar cerca de 100MB para cada utilizador, mas adapte este valor ás suas necessidades. Reserve muito mais espaço se planeia guardar muitos ficheiros multimédia (MP3, filmes) no seu directório home.
ru: В каталоге <filename>/home</filename> каждый пользователь будет размещать данные в своём подкаталоге этого каталога. Его размер зависит от количества пользователей в системе и какие файлы они будут хранить в своих каталогах. В зависимости от планируемого использования вы должны зарезервировать около 100 МБ для каждого пользователя, но можете изменить это значение согласно своим требованиям. Выделите больше места, если планируете хранить мультимедийные файлы (MP3, фильмы) в своём домашнем каталоге.
zh_cn: <filename>/home</filename>：每个用户将放置他的个人数据到这个目录的子目录下。其大小取决于有多少用户将使用系统和有什么文件放在他们的目录下。取决于您计划的使用量，您应该为每个用户准备 100MB 空间，不过这个值应该迎合您的需求。假如您的 home 目录计划保存大量的多媒体文件(MP3，电影)，您该预备更多的空间。
zh_tw: <filename>/home</filename>：每個使用者將他的個人資料放置在這個目錄的子目錄下。其大小取決於有多少使用者將使用系統和有什麼文件放在他們的目錄下。根據您計畫的使用量，您應該為每個使用者預留 100MB 空間，不過這個值應該依照您的需求設定。假如您的家目錄計畫保存大量的多媒體檔案(MP3，電影)，您該預留更多的空間。

source: Recommended Partitioning Scheme
el: Προτεινόμενο Σχήμα Διαμέρισης
ko: 권장하는 파티션 구조
pt: Esquema Recomendado de Particionamento
ru: Рекомендуемые схемы разметки
zh_cn: 推荐的分区方案
zh_tw: 建議的分割方案

source: For new users, personal Debian boxes, home systems, and other single-user setups, a single <filename>/</filename> partition (plus swap) is probably the easiest, simplest way to go. However, if your partition is larger than around 6GB, choose ext3 as your partition type. Ext2 partitions need periodic file system integrity checking, and this can cause delays during booting when the partition is large.
el: Για νέους χρήστες, συστήματα Debian για προσωπική χρήση, οικιακά συστήματα, και άλλες διαμορφώσεις για έναν μοναδικό χρήστη, μια μοναδική κατάτμηση <filename>/</filename> (και μια swap) είναι πιθανόν ο ευκολότερος και απλούστερος τρόπος για να ξεκινήσετε. Αν όμως η κατάτμηση σας είναι μαγαλύτερη από περίπου 6GB διαλέξτε τον ext3 σαν τύπο της κατάτμησης αυτής. Κατατμήσεις τύπου ext2 χρειάζονται περιοδικό έλεγχο της ακεραιότητας τους κι αυτό μπορεί να προκαλεί καθυστέρηση κατά την εκκίνηση αν η κατάτμηση είναι αρκετά μεγάλη.
ko: 초보자이시거나 개인이나 가정에서 사용할 시스템일 경우에는 <filename>/</filename>에 스왑 파티션만을 사용하는 것이 가장 쉽고 편한 방식일 것입니다. 하드디스크의 크기가 6 GB이상 될 경우엔 파일시스템을 ext3방식으로 포맷하십시오. Ext2 방식을 사용할 경우 주기적으로 파일시스템을 검사해야 하는데, 하드디스크의 크기가 너무 클 경우 부팅시간이 너무 오래걸리는 단점이 있습니다.
pt: Para novos utilizadores, máquinas pessoais Debian, sistemas domésticos, e outras configurações de único utilizador, uma única partição <filename>/</filename> (mais a swap) é provavelmente o método mais simples e fácil de ser feito. Contudo, se a sua partição for maior que 6GB, seleccione ext3 como tipo da partição. As Partições ext2 requerem verificação periódica da integridade do sistema de ficheiros, e isto poderá causar demoras durante a inicialização caso a partição seja grande.
ru: Для новичков, устанавливающих Debian только для себя на домашние машины, создание единственного раздела для <filename>/</filename> (плюс раздел подкачки) вероятно, самый лёгкий и простой путь. Однако, если ваш раздел более 6 ГБ, в качестве типа раздела выберите ext3. Разделы Ext2 требуют периодической проверки целостности файловой системы, а это на больших разделах может вызвать паузу при загрузке.
zh_cn: 对于新用户，个人 Debian 系统，家庭系统以及其它单用户配置来说，一个单一 <filename>/</filename> 分区(加上交换分区)可能是最容易的方案。但是如果您的分区大于6GB，请选择 ext3 作为您的分区类型。ext2 分区需要周期性的系统完整性检查并且当分区很大的时候，这个特性将导致引导期间的延迟。
zh_tw: 對於新使用者，個人 Debian 系統，家庭系統以及其它單用戶設定來說，一個單一<filename>/</filename> 分割區(加上置換區)可能是最容易簡單的方式。但是如果您的分割區大於6GB，請選擇 ext3 作為您的分割區類型。ext2 分割區需要週期性的檔案系統完整性檢查，而且當分割區很大的時候，這個特性將導致開機的延遲。

source: For multi-user systems or systems with lots of disk space, it's best to put <filename>/usr</filename>, <filename>/var</filename>, <filename>/tmp</filename>, and <filename>/home</filename> each on their own partitions separate from the <filename>/</filename> partition.
el: Για συστήματα πολλών χρηστών ή συστήματα με άφθονο χώρο δίσκων είναι καλλίτερο να βάλετε κάθε ένα από τους καταλόγους <filename>/usr</filename>, <filename>/var</filename>, <filename>/tmp</filename>, και <filename>/home</filename> στην δική του κατάτμηση ξεχωριστά από την ριζική κατάτμηση <filename>/</filename>.
ko: 멀티유저 시스템이거나 하드디스크의 용량이 큰 시스템에서는 <filename>/usr</filename>, <filename>/var</filename>, <filename>/tmp</filename>, <filename>/home</filename> 각각을 별도의 파티션에 두어 <filename>/</filename>파티션과 별도로 두는 것이 좋습니다.
pt: Para sistemas multi-utilizador ou sistemas com discos de grande capacidade, é melhor optar por ter a <filename>/usr</filename>, <filename>/var</filename>, <filename>/tmp</filename>, e <filename>/home</filename> cada uma na sua própria partição, separadas da partição <filename>/</filename>.
ru: Для многопользовательских систем или систем с большим дисковым пространством будет лучше создать для <filename>/usr</filename>, <filename>/var</filename>, <filename>/tmp</filename> и <filename>/home</filename> собственные разделы, отдельные от <filename>/</filename>.
zh_cn: 对于多用户系统或者有很多磁盘空间的系统，最好放置 <filename>/usr</filename>, <filename>/var</filename>, <filename>/tmp</filename>, 以及 <filename>/home</filename> 到每个他们自己的分区空间以和 <filename>/</filename> 分区分离开来。
zh_tw: 對於多使用者系統或者有很多磁碟空間的系統，最好放置 <filename>/usr</filename>, <filename>/var</filename>, <filename>/tmp</filename>, 以及 <filename>/home</filename> 到他們自己的分割區空間以和 <filename>/</filename> 分割區區隔開來。

source: You might need a separate <filename>/usr/local</filename> partition if you plan to install many programs that are not part of the Debian distribution. If your machine will be a mail server, you might need to make <filename>/var/mail</filename> a separate partition. Often, putting <filename>/tmp</filename> on its own partition, for instance 20 to 50MB, is a good idea. If you are setting up a server with lots of user accounts, it's generally good to have a separate, large <filename>/home</filename> partition. In general, the partitioning situation varies from computer to computer depending on its uses.
el: Πιθανόν να χρειαστείτε και μια ξεχωριστή κατάτμηση για τον κατάλογο <filename>/usr/local</filename> αν σκοπεύετε να εγκαταστήσετε πολλά προγράμματα που δεν είναι μέρος της διανομής του Debian. Αν το μηχάνημά σας πρόκειται να είναι mail server ίσως χρειαστεί να βάλετε και τον κατάλογο <filename>/var/mail</filename> σε μια ξεχωριστή κατάτμηση. Συχνά και το να βάλετε τον κατάλογο <filename>/tmp</filename> σε ξεχωριστή κατάτμηση, για παράδειγμα 20 με 50 ΜΒ, είναι καλή ιδέα. Αν φτιάχνετε έναν server με πολλούς λογαρισμούς χρηστών είναι επίσης γενικά καλό να έχετε μια ξεχωριστή, μεγάλη κατάτμηση <filename>/home</filename>. Γενικά, η διαμόρφωση των κατατμήσεων ποικίλει από υπολογιστή σε υπολογιστή και ανάλογα με τις χρήσεις του.
ko: 데비안에서 제공하지 않는 프로그램을 많이 설치할 경우 <filename>/usr/local</filename>를 별도의 파티션에 두는 것이 좋을 수도 있습니다. 메일서버일 경우에는 <filename>/var/mail</filename>를 별도의 파티션에 두는 것이 좋으며, <filename>/tmp</filename> 역시 20 내지 50 MB 정도되는 별도의 파티션에 두는 것이 좋습니다. 사용자가 많은 멀티유저 서버일 경우 <filename>/home</filename>의 크기를 충분히 잡아서 별도의 파티션에서 관리하는 것이 좋습니다. 이처럼 파일시스템 파티션의 구성은 시스템마다 달라지므로 각자의 필요에 따라 적절히 결정하시면 됩니다.
pt: Precisará de ter <filename>/usr/local</filename> como partição separada se planear instalar muitos programas que não fazem parte da distribuição Debian. Se a sua máquina irá servir de servidor de mail, poderá necessitar de fazer da <filename>/var/mail</filename> uma partição separada de grande capacidade. Frequentemente é boa ideia colocar a <filename>/tmp</filename> na sua própria partição com 20 a 50MB, por exemplo. Se estiver a configurar um servidor com muitas contas de utilizadores, é geralmente bom ter a <filename>/home</filename> numa partição separada grande. Em geral o esquema de particionamento varia de computador para computador dependendo da sua utilização.
ru: Вам может потребоваться отдельный раздел <filename>/usr/local</filename>, если вы планируете установку многих программ, которые не являются частью дистрибутива Debian. Если ваша машина будет почтовым сервером, вам может потребоваться сделать отдельный <filename>/var/mail</filename> раздел. Часто, полезно выделить <filename>/tmp</filename> в отдельный раздел размером от 20 до 50 МБ. Если вы настраиваете сервер обслуживающий большое количество пользователей, обычно, хорошо иметь отдельный большой <filename>/home</filename> раздел. В общем, ситуация с разметкой зависит от цели, которой служит комьютер.
zh_cn: 当您计划安装许多不是 Debian 分发版本的程序的时候，您也许需要运行一个独立的 <filename>/usr/local</filename> 分区。如果您的机器是一个小的邮件服务器，您也许需要为 <filename>/var/mail</filename> 建立一个独立的分区。通常情况下放置 <filename>/tmp</filename> 至它独立的分区，比如20至50MB是一个好主意。如果您正在配置一个服务器带有放多用户帐户，通常需要一个独立的大 <filename>/home</filename> 分区。一般来说，分区状况对每台计算机都有所不同，这取决于他们的用途。
zh_tw: 若您打算安裝許多不是 Debian 分發版本的程式時，您或許需要另一個獨立的 <filename>/usr/local</filename> 分割區。如果您的機器是一個小的郵件伺服器，您也許需要為 <filename>/var/mail</filename> 建立一個獨立的分割區。通常我們會放置 <filename>/tmp</filename> 至獨立的分割區，大小大約20至 50MB 。如果您配置一個伺服器帶有許多使用者帳戶，通常需要一個獨立、大的 <filename>/home</filename> 分割區。一般來說，每台電腦的分割區狀況都有所不同，這取決於他們的用途。

source: For very complex systems, you should see the <ulink url="&url-multidisk-howto;"> Multi Disk HOWTO</ulink>. This contains in-depth information, mostly of interest to ISPs and people setting up servers.
el: Για πολύ πολύπλοκα συστήματα, θα πρέπει να δείτε την σελίδα <ulink url="&url-multidisk-howto;"> Multi Disk HOWTO</ulink>. Αυτή περιέχει πληροφορίες σε βάθος, που θα ενδιαφέρουν κυρίως τους ISP και ανθρώπους που στήνουν servers.
ko: 매우 복잡한 시스템을 구성하신다면 <ulink url="&url-multidisk-howto;"> 멀티디스크 HOWTO</ulink>를 참고하십시오. 하드디스크 파티션하기에 관한 심도있는 내용을 다루고 있으므로 ISP나 서버관리자들에게 주로 도움이 될 것입니다.
pt: Para sistemas muito complexos, deverá ver o <ulink url="&url-multidisk-howto;"> Multi Disk HOWTO</ulink>. Contém informação aprofundada, de grande interesse para ISPs e pessoas que configuram servidores.
ru: Для очень сложных систем вы должны прочитать <ulink url="&url-multidisk-howto;"> Multi Disk HOWTO</ulink>. В нём содержится подробная информация, которая будет наиболее интересна провайдерам Интернет и людям, настраивающим серверы.
zh_cn: 对于非常复杂的系统来说，您应该阅读 <ulink url="&url-multidisk-howto;"> Multi Disk HOWTO</ulink>。其中包含了很多对于 ISP 以及配置服务器的用户很有用的高级信息。
zh_tw: 對於非常複雜的系統來說，您應該閱讀 <ulink url="&url-multidisk-howto;"> Multi Disk HOWTO</ulink>。其中包含了很多對 ISP 以及設定伺服器的用戶來說非常用的深入資訊。
