Repository: xobs/debian-installer
Catalog: doc/manual/po/*/partitioning.po
Languages: el, ko, pt, ru, zh_cn, zh_tw

source: With respect to the issue of swap partition size, there are many views. One rule of thumb which works well is to use as much swap as you have system memory. It also shouldn't be smaller than 16MB, in most cases. Of course, there are exceptions to these rules. If you are trying to solve 10000 simultaneous equations on a machine with 256MB of memory, you may need a gigabyte (or more) of swap.
el: Όσον αφορά το ζήτημα του μεγέθους της κατάτμησης swap, υπάρχουν πολλές απόψεις. Ένας γενικός κανόνας που δουλεύει αρκετά καλά είναι να έχετε τόση swap όση είναι η φυσική μνήμη του συστήματός σας. Στις περισσότερες περιπτώσεις επίσης δεν θα πρέπει να είναι μικρότερη από 16 ΜΒ. Φυσικά υπάρχουν εξαιρέσεις στους κανόνες αυτούς. Αν προσπαθείτε να να λύσετε 10000 ταυτόχρονες εξισώσεις σε ένα μηχάνημα με 256 ΜΒ μνήμη, ίσως χρειαστείτε 1 GB (ή και παραπάνω) μνήμη swap.
ko: 스왑의 크기는 사람마다 생각이 다릅니다. 일단 시스템의 메모리만큼 스왑공간을 잡는 것이 좋습니다. 또한 16 MB보다는 큰 것이 좋습니다. 256 MB 메모리를 갖고 있는 컴퓨터에서 동시에 10000개의 공식을 풀 생각이시라면 1기가 이상 필요로 할 수도 있으므로 각자의 필요에 따라 스왑공간의 크기를 조절하시면 됩니다.
pt: No que respeita ao tamanho da partição swap, existem vários pontos de vista. Uma regra que funciona bem é usar a mesma quantidade correspondente a memória do seu sistema. Na maioria dos casos também não deverá ser nunca menor que 16MB. É claro que existem excepções a esta regra. Se estiver a tentar resolver 10000 equações simultaneamente numa máquina com 256MB de memória, poderá precisar um gigabyte (ou mais) de swap.
ru: По поводу размера раздела подкачки существует много точек зрения. Согласно проверенному опытом методу, размер подкачки должен совпадать с размером оперативной памяти. Также, в большинстве случаев он должен быть не менее 16 МБ. Естественно, есть исключения из правил. Если вы пытаетесь одновременно решить 10000 уравнений на машине с 256 МБ памяти, то вам может потребоваться гигабайтный (или более) раздел подкачки.
zh_cn: 在交换分区大小方面，这里有很多观点。我们的建议是使用和内存大小相同的交换分区。在大多数情况下它也应该不小于16MB。当然，这里有一些例外。如果您正在尝试在一个有 256MB 内存的机器上解决10000 个联立方程式，您也许需要 1G (或者更多)的交换分区。
zh_tw: 至於在置換分割區大小的問題，不同的人有不同的觀點。我們的建議是使用和系統記憶體大小相同的置換分割區。在大多數情況下它不應該小於 16MB ，當然也有一些例外。如果您正嘗試在 256MB 記憶體的機器上同時解決10000 個聯立方程式，您可能需要 1G (或者更多)的置換分割區。

source: On the other hand, Atari Falcons and Macs feel pain when swapping, so instead of making a large swap partition, get as much RAM as possible.
el: Από την άλλη, συστήματα Atari Falcons και οι Mac "υποφέρουν" όταν χρησιμοποιούν μνήμη swap οπότε στην περίπτωση αυτή αντί να φτιάξετε μεγαλύτερη κατάτμηση swap τοποθετήστε όσο το δυνατόν περισσότερη μνήμη RAM.
ko: 참고로 Atari Falcon과 매킨토시는 가상메모리를 사용할 때마다 성능이 크게 저하되므로 이들 컴퓨터에서는 스왑공간을 크게하기보다 램을 더 구하는 것이 더 효과적입니다.
pt: Por outro lados, Atari Falcons e Macs sentem dor ao fazerem swapping, portanto em vez de fazer uma grande partição de swap tenha o mais possível de RAM.
ru: С другой стороны, Atari Falcon и Mac не нравится свопиться, поэтому вместо создания большего раздела подкачки, добавьте оперативной памяти сколько сможете.
zh_cn: 在另外一个方面，Atari Falcons 以及 Macs 会对交换感到很痛苦，因此建立一个大的交换分区不如获得尽可能多的 RAM 。
zh_tw: 另外一個方面，Atari Falcons 以及 Macs 對置換感到很痛苦，因此建立一個大的置換分割區不如盡可能獲得更多的 RAM 。

source: On 32-bit architectures (i386, m68k, 32-bit SPARC, and PowerPC), the maximum size of a swap partition is 2GB. That should be enough for nearly any installation. However, if your swap requirements are this high, you should probably try to spread the swap across different disks (also called <quote>spindles</quote>) and, if possible, different SCSI or IDE channels. The kernel will balance swap usage between multiple swap partitions, giving better performance.
el: Σε 32-μπιτες αρχιτεκτονικές (i386, m68k, 32-bit SPARC, και PowerPC),το μέγιστο μέγεθος της κατάτμησης swap είναι 2GB. Αυτό είναι πιθανόν αρκετό για όλες σχεδόν τις εγκαταστάσεις. Αν όμως, οι ανάγκες σας σε swap είναι τόσο μεγάλες είναι καλλίτερο μάλλον να μοιράσετε την μνήμη swap μεταξύ διαφορετικών δίσκων (που λέγονται επίσης <quote>spindles</quote>) και αν είναι δυνατόν διαφορετικά κανάλια SCSI ή IDE. Ο πυρήνας θα εξισορροπήσει την χρήση της swap ανάμεσα στις πολλαπλές κατατμήσεις swap δίνοντας έτσι καλλίτερη απόδοση.
ko: i386, m68k, SPARC 32비트와 PowerPC등의 32비트 프로세서는 2GB가 스왑 파티션의 한계입니다. 대부분의 경우 이 정도로도 충분합니다. 하지만 스왑 공간이 정말 많이 필요하다면 스왑을 여러 하드디스크에 걸쳐서 잡으시고(이 방식을 <quote>spindles</quote>방식이라고 부릅니다), 가급적이면 서로 다른 SCSI, IDE 채널의 하드디스크에 잡으십시오. 커널이 알아서 여러 스왑 파티션에 적절히 작업을 분배하므로 시스템의 성능향상에 도움이 됩니다.
pt: Em arquitecturas de 32-bits (i386, m68k, 32-bit SPARC, e PowerPC), o tamanho máximo de uma partição swap é de 2GB. Que poderá ser suficiente para quase todas as instalações actuais. No entanto, se as suas necessidades de swap são elevadas, poderá tentar espalhar a swap por discos diferentes (também conhecidos por <quote>spindles</quote>) e, se possível, num canal IDE ou SCSI diferente. O kernel irá equilibrar a utilização de swap entre as múltiplas partições de swap, oferecendo uma melhor performance.
ru: На 32-битных архитектурах (i386, m68k, 32-bit SPARC и PowerPC) максимальный рамер раздела подкачки равен 2 ГБ. Этого должно хватить почти для любого варианта установки. Однако, если ваши требования к разделу подкачки превышают данную цифру, то вероятно, лучше попытаться разместить пространство подкачки на нескольких дисках (так называемых <quote>шпинделей</quote>) и, если возможно, на разные SCSI или IDE каналы. Ядро будет балансировать нагрузку между различными разделами подкачки, давая большую производительность.
zh_cn: 在 32 位体系结构(i386, m68k, 32位 SPARC 以及 PowerPC)下，最大尺寸的交换分区是 2GB。这应该基本满足任何安装情况。但是如果您的交换分区需求非常大，您应该尝试分离交换分区至不同磁盘中(这也叫做 <quote>spindles</quote> )，并且如果可能的话，不同的 SCSI 或者 IDE 通道。内核将在多个交换空间平衡用量来达到更好的性能。
zh_tw: 在 32 位元結構(i386, m68k, 32位 SPARC 以及 PowerPC)下，置換分割區的最大尺寸是 2GB。這應該滿足任何安裝情況。但是如果您的置換分割區需求非常大，您應該嘗試將置換分割區分至不同磁碟中(這也叫做 <quote>spindles</quote> )，如果可能的話，甚至是在不同的 SCSI 或者 IDE 通道。核心將在多個置換空間平衡用量來達到更好的性能。

source: For an idea of the space taken by tasks you might be interested in adding after your system installation is complete, check <xref linkend="tasksel-size-list"/>.
el: Για μια ιδέα σχετικά με τον χώρο που καταλαμβάνουν διάφορα καθήκοντα που πιθανόν να σας ενδιαφέρει να προσθέσετε μετά την ολοκλήρωση της εγκατάστασης του (βασικού) συστήματος, κοιτάξτε το <xref linkend="tasksel-size-list"/>.
ko: 필요할 하드디스크 용량이 얼마나 될지 감을 잡는데 도움이 되고자 <xref linkend="tasksel-size-list"/>에 작업별로 필요로 하는 하드디스크 공간이 정리되어 있습니다.
pt: Para ter uma ideia do espaço que será utilizado pelas tarefas que estiver interessado em adicionar após a instalação do seu sistema estar completa, veja a <xref linkend="tasksel-size-list"/>.
ru: Про то, как будет использовано дисковое пространство можно определить по задачам, которые вы захотите установить после установки системы; смотрите <xref linkend="tasksel-size-list"/>.
zh_cn: 对于不同任务所需要多大的空间的概念，您也许对于安装系统后加入的安装感兴趣，请检查 <xref linkend="tasksel-size-list"/>。
zh_tw: 對於不同工作所需要多大的空間的概念，您也許對於系統安裝完畢後加入的安裝感興趣，請參照 <xref linkend="tasksel-size-list"/>。

source: Device Names in Linux
el: Ονόματα συσκευών στο Linux
ko: 리눅스에서의 디바이스 이름
pt: Nomes de Dispositivos em Linux
ru: Имена устройств в Linux
zh_cn: Linux 里面的设备名称
zh_tw: Linux 裡的裝置名稱

source: Linux disks and partition names may be different from other operating systems. You need to know the names that Linux uses when you create and mount partitions. Here's the basic naming scheme:
el: Τα ονόματα των δίσκων και των κατατμήσεων ίσως διαφέρουν από άλλα λειτουργικά συστήματα. Θα πρέπει να ξέρετε τα ονόματα που χρησιμοποιεί το Linux όταν δημιουργείτε και προσαρτάτε κατατμήσεις. Αυτό είναι το βασικό σχήμα ονοματοδοσίας:
ko: 리눅스에서 디스크와 파티션을 다른 시스템과 다른 이름으로 부르기도 합니다. 리눅스에서 파티션을 생성하고 마운트할 때 이 이름들을 알고 있어야 합니다. 기본적으로는 다음 규칙에 따라 이름이 정해집니다.
pt: Nomes de discos e partições em Linux podem ser diferentes dos outros sistemas operativos. Você precisa conhecer os nomes que Linux utiliza quando criar e montar partições. Aqui está o esquema básico de nomes:
ru: Имена дисков и разделов в Linux могут отличаться от имён в других операционных системах. Для того чтобы создавать и монтировать разделы вам нужно знать какие имена используются в Linux. Вот основы схемы именования:
zh_cn: Linux 磁盘以及分区名称可能和其它的操作系统有所不同。您需要知道 Linux 用于创建以及挂接分区的设备名称。这里是基本的命名方案：
zh_tw: Linux 磁碟以及分割區名稱可能和其它的作業系統有所不同。當您建立以及掛載分割區時，必須先知道 Linux 所使用的設備名稱。以下是基本的命名規則：

source: The first floppy drive is named <filename>/dev/fd0</filename>.
el: Η πρώτη συσκευή δισκέττας ονομάζεται <filename>/dev/fd0</filename>.
ko: 첫번째 플로피 디스크 드라이브는 <filename>/dev/fd0</filename>라고 불립니다.
pt: O primeiro dispositivo de disquetes tem o nome de <filename>/dev/fd0</filename>.
ru: Первый дисковод гибких дисков называется <filename>/dev/fd0</filename>.
zh_cn: 第一个软盘驱动器被命名为 <filename>/dev/fd0</filename>。
zh_tw: 第一個軟碟機被命名為 <filename>/dev/fd0</filename>。

source: The second floppy drive is named <filename>/dev/fd1</filename>.
el: Η δεύτερη συσκευή δισκέττας ονομάζεται <filename>/dev/fd1</filename>.
ko: 두번째 플로피 디스크 드라이브는 <filename>/dev/fd1</filename>라고 불립니다.
pt: O segundo dispositivo de disquetes tem o nome de <filename>/dev/fd1</filename>.
ru: Второй дисковод гибких дисков называется <filename>/dev/fd1</filename>.
zh_cn: 第二个软盘驱动器被命名为 <filename>/dev/fd1</filename>。
zh_tw: 第二個軟碟機被命名為 <filename>/dev/fd1</filename>。

source: The first SCSI disk (SCSI ID address-wise) is named <filename>/dev/sda</filename>.
el: Ο πρώτος δίσκος SCSI (σχετικά με το SCSI ID) ονομάζεται <filename>/dev/sda</filename>.
ko: SCSI ID 주소에서 제일 먼저 오는 SCSI 디스크는 <filename>/dev/sda</filename>라고 불립니다.
pt: O primeiro disco SCSI (endereço SCSI ID) tem o nome de <filename>/dev/sda</filename>.
ru: Первый SCSI диск (отсчитывая по SCSI ID) называется <filename>/dev/sda</filename>.
zh_cn: 第一个 SCSI 驱动器 (SCSI ID 反向地址) 被命名为 <filename>/dev/sda</filename>。
zh_tw: 第一個 SCSI 磁碟 (SCSI ID 反向地址) 被命名為 <filename>/dev/sda</filename>。

source: The second SCSI disk (address-wise) is named <filename>/dev/sdb</filename>, and so on.
el: Ο δεύτερος δίσκος SCSI (σχετικά με το SCSI ID) ονομάζεται <filename>/dev/sdb</filename> κοκ.
ko: 두번째로 오는 디스크는 <filename>/dev/sdb</filename>라고 불리며, 각 디스크마다 이런 방식으로 이름이 붙습니다.
pt: O segundo disco com endereço SCSI tem o nome de <filename>/dev/sdb</filename>, e assim por diante.
ru: Второй SCSI диск (отсчитывая по SCSI ID) называется <filename>/dev/sdb</filename> и так далее.
zh_cn: 第二个 SCSI 驱动器 (反向地址) 被命名为 <filename>/dev/sdb</filename>，等等。
zh_tw: 第二個 SCSI 磁碟 (反向地址) 被命名為 <filename>/dev/sdb</filename>，等等。

source: The first SCSI CD-ROM is named <filename>/dev/scd0</filename>, also known as <filename>/dev/sr0</filename>.
el: Η πρώτη συσκευή SCSI CD-ROM ονομάζεται <filename>/dev/scd0</filename>, επίσης γνωστή και σαν <filename>/dev/sr0</filename>.
ko: 첫번째 SCSI CD-ROM은 <filename>/dev/scd0</filename>이라고 불리며, <filename>/dev/sr0</filename>라고도 불립니다.
pt: O primeiro CD-ROM SCSI tem o nome de <filename>/dev/scd0</filename>, também conhecido como <filename>/dev/sr0</filename>.
ru: Первый SCSI CD-ROM называется <filename>/dev/scd0</filename>, также можно использовать <filename>/dev/sr0</filename>.
zh_cn: 第一个 SCSI 光盘驱动器被命名为 <filename>/dev/scd0</filename>，也叫 <filename>/dev/sr0</filename>。
zh_tw: 第一個 SCSI 光碟機被命名為 <filename>/dev/scd0</filename>，也叫 <filename>/dev/sr0</filename>。

source: The master disk on IDE primary controller is named <filename>/dev/hda</filename>.
el: Ο κύριος δίσκος στον πρώτο ελεγκτή IDE ονομάζεται <filename>/dev/hda</filename>.
ko: IDE 주컨트롤러의 마스터는 <filename>/dev/hda</filename>라고 불립니다.
pt: O disco master no controlador IDE primário tem o nome de <filename>/dev/hda</filename>.
ru: Мастер диск первичного IDE контроллера называется <filename>/dev/hda</filename>.
zh_cn: 主 IDE 驱动器下的主磁盘被命名为 <filename>/dev/hda</filename>。
zh_tw: 主 IDE 控制器下的主磁碟被命名為 <filename>/dev/hda</filename>。

source: The slave disk on IDE primary controller is named <filename>/dev/hdb</filename>.
el: Ο δευτερεύων δίσκος στον πρώτο ελεγκτή IDE ονομάζεται <filename>/dev/hdb</filename>.
ko: IDE 주컨트롤러의 슬레이브는 <filename>/dev/hdb</filename>라고 불립니다.
pt: O disco slave no controlador IDE primário tem o nome de <filename>/dev/hdb</filename>.
ru: Подчинённый диск первичного IDE контроллера называется <filename>/dev/hdb</filename>.
zh_cn: 第二个控制器的主磁盘和从磁盘会分别被叫做 <filename>/dev/hdb</filename>。
zh_tw: 主 IDE 控制器下的從磁碟被命名為 <filename>/dev/hdb</filename>。

source: The master and slave disks of the secondary controller can be called <filename>/dev/hdc</filename> and <filename>/dev/hdd</filename>, respectively. Newer IDE controllers can actually have two channels, effectively acting like two controllers. <phrase arch="m68k"> The letters may differ from what shows in the mac program pdisk (i.e. what shows up as <filename>/dev/hdc</filename> on pdisk may show up as <filename>/dev/hda</filename> in Debian). </phrase>
el: Ο κύριος και ο δευτερεύων δίσκος στον δευτερεύοντα ελεγκτή IDE μπορεί να ονομάζεται <filename>/dev/hdc</filename> και <filename>/dev/hdd</filename>, αντίστοιχα. Νεώτεροι ελεγκτές IDE έχουν στην πραγματικότητα δυο κανάλια που λειτουργούν ουσιαστικά σαν δυο ελεγκτές. <phrase arch="m68k"> τα γράμματα πιθανόν να διαφέρουν από αυτά που εμφανίζονται στο πρόγραμμα pdisk για Mac (με άλλα λόγια αυτό που εμφανίζεται σαν <filename>/dev/hdc</filename> στο pdisk να φαίνεται σαν <filename>/dev/hda</filename> στο Debian). </phrase>.
ko: IDE 부컨트롤러의 마스터와 슬레이브는 각각 <filename>/dev/hdc</filename>, <filename>/dev/hdd</filename>라고 불릴 수 있습니다. 최근에 나온 IDE 컨트롤러는 2개의 통신채널을 갖고 있기 때문에 실질적으로는 2개의 컨트롤러 로 취급될 수 있습니다. <phrase arch="m68k"> Pdisk라는 매킨토시 프로그램과는 이름이 달라질 수 있습니다. 예를 들면 pdisk 상에서 <filename>/dev/hdc</filename>인 하드디스크가 데비안에서는 <filename>/dev/hda</filename>으로 표시될 수 있습니다. </phrase>
pt: Os discos master e slave do controlador IDE secundário poderão ser chamados <filename>/dev/hdc</filename> e <filename>/dev/hdd</filename>, respectivamente. Controladores IDE mais recentes poderão ter actualmente dois canais, agindo efectivamente como dois controladores. <phrase arch="m68k"> As letras poderão diferir do que é mostrado no programa pdisk do mac (ex. Em Debian, o que é mostrado como <filename>/dev/hdc</filename> no pdisk poderá ser mostrado como <filename>/dev/hda</filename>). </phrase>
ru: Мастер и подчинённый диски вторичного контроллера называются <filename>/dev/hdc</filename> и <filename>/dev/hdd</filename> соответственно. Новые IDE контроллеры могут на самом деле иметь два канала, эффективно действуя как два независимых контроллера. <phrase arch="m68k"> Буквы в mac программе pdisk могут быть другими (то есть, <filename>/dev/hdc</filename> в pdisk может быть как <filename>/dev/hda</filename> в Debian). </phrase>
zh_cn: 第二个控制器的主磁盘和从磁盘会分别被叫做 <filename>/dev/hdc</filename> 以及 <filename>/dev/hdd</filename>，较新的 IDE 控制器实际上有两个通道，扮演着两个控制器的角色。<phrase arch="m68k"> 字母可能和 mac 程序 pdisk 显示有所不同。(在 pdisk 上的 <filename>/dev/hdc</filename> 可能在 Debian 中显示为 <filename>/dev/hda</filename>)。</phrase>
zh_tw: 第二個控制器的主磁碟和從磁碟分別被叫做 <filename>/dev/hdc</filename> 以及 <filename>/dev/hdd</filename> ，較新的 IDE 控制器實際上有兩個通道，扮演著兩個控制器的角色。 <phrase arch="m68k"> 字母可能和 mac 程式 pdisk 顯示的不同。(在 pdisk 上的 <filename>/dev/hdc</filename> 可能在 Debian 中顯示為 <filename>/dev/hda</filename>)。 </phrase>

source: The first XT disk is named <filename>/dev/xda</filename>.
el: Ο πρώτος δίσκος ΧΤ ονομάζεται <filename>/dev/xda</filename>.
ko: 첫번째 XT 디스크는 <filename>/dev/xda</filename>입니다.
pt: O primeiro disco XT tem o nome de <filename>/dev/xda</filename>.
ru: Первый XT диск называется <filename>/dev/xda</filename>.
zh_cn: 第一个 XT 磁盘会被命名为 <filename>/dev/xda</filename>。
zh_tw: 第一個 XT 磁碟會被命名為 <filename>/dev/xda</filename>。

source: The second XT disk is named <filename>/dev/xdb</filename>.
el: Ο δεύτερος δίσκος ΧΤ ονομάζεται <filename>/dev/xdb</filename>.
ko: 두번째 XT 디스크는 <filename>/dev/xdb</filename>입니다.
pt: O segundo disco XT tem o nome de <filename>/dev/xdb</filename>.
ru: Второй XT диск называется <filename>/dev/xdb</filename>.
zh_cn: 第二个 XT 磁盘会被命名为 <filename>/dev/xdb</filename>。
zh_tw: 第二個 XT 磁碟會被命名為 <filename>/dev/xdb</filename>。

source: The first ACSI device is named <filename>/dev/ada</filename>, the second is named <filename>/dev/adb</filename>.
el: Η πρώτη συσκευή ACSI ονομάζεται <filename>/dev/ada</filename>, η δεύτερη <filename>/dev/adb</filename>.
ko: 첫번째 ACSI 디바이스의 이름은 <filename>/dev/ada</filename>이고, 두번째는 <filename>/dev/bdb</filename>입니다.
pt: O primeiro dispositivo ACSI tem o nome de <filename>/dev/ada</filename>, o segundo chama-se <filename>/dev/adb</filename>.
ru: Первое устройство ACSI называется <filename>/dev/ada</filename>, второе имеет название<filename>/dev/adb</filename>.
zh_cn: 第一个 ACSI 设备被命名为 <filename>/dev/ada</filename> ，第二个则是 <filename>/dev/adb</filename>。
zh_tw: 第一個 ACSI 裝置被命名為 <filename>/dev/ada</filename> ，第二個則是 <filename>/dev/adb</filename>。

source: The first DASD device is named <filename>/dev/dasda</filename>.
el: Η πρώτη συσκευή DASD ονομάζεται <filename>/dev/dasda</filename>.
ko: 첫번째 DASD 디바이스의 이름은 <filename>/dev/dasda</filename>입니다.
pt: O primeiro dispositivo DASD tem o nome de <filename>/dev/dasda</filename>.
ru: Первое устройство DASD называется <filename>/dev/dasda</filename>.
zh_cn: 第一个 DASD 设备被命名为 <filename>/dev/dasda</filename>。
zh_tw: 第一個 DASD 裝置被命名為 <filename>/dev/dasda</filename>。

source: The second DASD device is named <filename>/dev/dasdb</filename>, and so on.
el: Η δεύτερη συσκευή DASD ονομάζεται <filename>/dev/dasdb</filename>.κοκ.
ko: 두번째 DASD디바이스는 <filename>/dev/dasdb</filename>이고 추가로 연결되는 DASD디바이스 역시 이런 규칙을 따르게 됩니다.
pt: O segundo dispositivo DASD tem o nome de <filename>/dev/dasdb</filename>, e assim por diante.
ru: Второе устройство DASD называется <filename>/dev/dasdb</filename>и так далее.
zh_cn: 第二个 DASD 设备被命名为 <filename>/dev/dasdb</filename>，等等。
zh_tw: 第二個 DASD 裝置被命名為 <filename>/dev/dasdb</filename>，等等。

source: The partitions on each disk are represented by appending a decimal number to the disk name: <filename>sda1</filename> and <filename>sda2</filename> represent the first and second partitions of the first SCSI disk drive in your system.
el: Οι κατατμήσεις σε κάθε δίσκο αναπαρίστανται με την παράθεση ενός δεκαδικού ψηφίου στο όνομα του δίσκου: <filename>sda1</filename> και <filename>sda2</filename> αναπαριστούν την πρώτη και δεύτερη κατάτμηση στον πρώτο SCSI δίσκο στο σύστημά σας.
ko: 각 드라이브 상의 파티션은 디스크 이름 뒤에 숫자를 붙인 이름을 갖게 됩니다. <filename>sda1</filename>와 <filename>sda2</filename>는 각각 첫번째 SCSI 디스크의 첫번째와 두번째 파티션을 뜻합니다.
pt: As partições em cada disco são representadas acrescentando-se um número decimal ao nome do disco: <filename>sda1</filename> e <filename>sda2</filename> representam a primeira e a segunda partição do primeiro dispositivo SCSI no seu sistema.
ru: Имена разделов диска получаются добавлением к имени диска десятичного числа: <filename>sda1</filename> и <filename>sda2</filename> представляют первый и второй разделы на первом диске SCSI в системе.
zh_cn: 每个磁盘的分区名的显示，是通过在磁盘名称后面附加一个十进制数字： <filename>sda1</filename> 以及 <filename>sda2</filename> 表示您系统里第一个 SCSI 磁盘驱动器的第一个和第二个分区。
zh_tw: 每個磁碟分割區的名字在磁碟名稱後面附加一個十進制數字： <filename>sda1</filename> 以及 <filename>sda2</filename> 表示系統裡第一個 SCSI 磁碟的第一個及第二個分割區。

source: Here is a real-life example. Let's assume you have a system with 2 SCSI disks, one at SCSI address 2 and the other at SCSI address 4. The first disk (at address 2) is then named <filename>sda</filename>, and the second <filename>sdb</filename>. If the <filename>sda</filename> drive has 3 partitions on it, these will be named <filename>sda1</filename>, <filename>sda2</filename>, and <filename>sda3</filename>. The same applies to the <filename>sdb</filename> disk and its partitions.
el: Εδώ είναι ένα πραγματικό παράδειγμα. Ας υποθέσουμε ότι έχετε ένα σύστημα με 2 SCSI δίσκους, έναν στην διεύθυνση SCSI 2 και τον άλλον στη διεύθυνση SCSI 4. O πρώτος δίσκος (στη διεύθυνση 2) ονομάζεται τότε <filename>sda</filename>, και ο δεύτερος <filename>sdb</filename>. Αν ο δίσκος <filename>sda</filename> έχει 3 κατατμήσεις αυτές θα ονομάζονται <filename>sda1</filename>, <filename>sda2</filename>, και <filename>sda3</filename>. Το ίδιο ισχύει και για τον δίσκο <filename>sdb</filename> και τις κατατμήσεις του.
ko: 예를 하나 들어보도록 하겠습니다. 컴퓨터에 2개의 SCSI 디스크가 있고, 각각 SCSI 주소 2와 4에 연결되어 있다고 합시다. 2번 주소에 연결된 디스크가 첫번째 SCSI로, <filename>sda</filename>라고 불리게 됩니다. 두번째 4번 주소의 SCSI 디스크는 <filename>sdb</filename>와 연결되게 됩니다. <filename>sda</filename>에 파티션이 3개가 있다면 각각 <filename>sda1</filename>, <filename>sda2</filename>, <filename>sda3</filename>라고 불리게 됩니다. <filename>sdb</filename>와 파티션들 역시 같은 규칙을 적용받게 됩니다.
pt: Aqui está um exemplo real. Vamos assumir que tem um sistema com 2 discos SCSI, um no endereço 2 do SCSI e outro no endereço 4 do SCSI. O primeiro disco (no endereço 2) tem então o nome de <filename>sda</filename>, e o segundo <filename>sdb</filename>. Se o dispositivo <filename>sda</filename> tem 3 partições, estas poderão ter os seguintes nomes <filename>sda1</filename>, <filename>sda2</filename>, e <filename>sda3</filename>. O mesmo se aplica ao <filename>sdb</filename> e as suas partições.
ru: Вот реальный пример. Предположим, что вы имеете систему с 2-мя SCSI дисками, один имеет SCSI адрес 2, а другой SCSI адрес 4. Первый диск (с адресом 2) называется <filename>sda</filename>, а второй <filename>sdb</filename>. Если диск <filename>sda</filename> содержит 3 раздела, то их имена будут <filename>sda1</filename>, <filename>sda2</filename> и <filename>sda3</filename>. То же относится к диску <filename>sdb</filename> и его разделам.
zh_cn: 这里有一个具体的例子。假设您有一个系统带有两个 SCSI 磁盘，一个 SCSI 地址是 2 并且另外一个地址是 4。第一个磁盘(在 2 上)会被命名为 <filename>sda</filename>并且第二个是 <filename>sdb</filename>。如果 <filename>sda</filename> 驱动器有 3 个分区，它们将被命名为 <filename>sda1</filename>，<filename>sda2</filename>，以及 <filename>sda3</filename>。这同样适合 <filename>sdb</filename> 及其分区。
zh_tw: 這裡有個實際的例子。假設您有一個系統帶有兩個 SCSI 磁碟，一個 SCSI 位址是 2 而另外一個是 4。第一個磁碟(在 2 上)會被命名為 <filename>sda</filename>而第二個是 <filename>sdb</filename>。如果 <filename>sda</filename> 磁碟有 3 個分割區，它們將被命名為 <filename>sda1</filename>，<filename>sda2</filename>，以及 <filename>sda3</filename>。 <filename>sdb</filename> 及其分割區亦是如此。

source: Note that if you have two SCSI host bus adapters (i.e., controllers), the order of the drives can get confusing. The best solution in this case is to watch the boot messages, assuming you know the drive models and/or capacities.
el: Σημειώστε ότι αν έχετε δυο SCSI host bus adapters (δηλ. ελεγκτές) η σειρά των δίσκων μπορεί να γίνει αρκετά μπερδεμένη. Η καλλίτερη λύση σε αυτήν την περίπτωση είναι να παρακολουθήσετε προσεκτικά τα μηνύματα κατά την εκκίνηση, με την προϋπόθεση ότι γνωρίζετε τα μοντέλα και/ή τος χωρητικότητες των δίσκων.
ko: 참고로, SCSI 호스트 버스 어댑터(컨트롤러)가 있을 경우 어느 드라이브가 첫번째인지 확인하기 어려울 수 있습니다. 이 경우엔 부팅시 화면에 표시되는 드라이브 모델과 기능을 살펴보고 어느 드라이브가 <filename>sda</filename>에 연결되었는지 확인하는게 최선의 방법입니다.
pt: Note que se tem dois host bus adapters SCSI (ex., controladores), a ordem dos dispositivos pode ficar confusa. A melhor solução neste caso é vigiar as mensagens de arranque, supondo que você conhece os modelos e/ou capacidades dos dispositivos.
ru: Заметим, что если вы имеете два адаптера SCSI (то есть, контроллера), то порядок дисков может показаться непонятным. Лучшее решение в этом случае посмотреть загрузочные сообщения; предполагается, что вы знаете модели дисков и/или их объём.
zh_cn: 注意如果您有两个 SCSI 主机总线适配器(控制器)，设备的顺序可能会比较混乱。最好的解决方案是观察引导信息，假设您知道驱动器模式以及/或者容量。
zh_tw: 注意如果您有兩個 SCSI 主機匯流排適配器 (控制器)，設備的順序可能會比較混亂。假設您知道磁碟模式以及/或者容量，最好的解決方案是觀察開機訊息。
