Repository: xobs/debian-installer
Catalog: doc/manual/po/*/partitioning.po
Languages: el, ko, pt, ru, zh_cn, zh_tw

source: If you have a large disk, you might have to use cylinder translation techniques, which you can set from your BIOS setup program, such as LBA (Logical Block Addressing) or CHS translation mode (<quote>Large</quote>). More information about issues with large disks can be found in the <ulink url="&url-large-disk-howto;">Large Disk HOWTO</ulink>. If you are using a cylinder translation scheme, and the BIOS does not support the large disk access extensions, then your boot partition has to fit within the <emphasis>translated</emphasis> representation of the 1024th cylinder.
el: Αν έχετε έναν μεγάλο δίσκο ίσως να πρέπει να χρησιμοποιήσετε τεχνικές "μετάφρασης" κυλίνδρων, τις οποίες μπορείτε να ενεργοποιήσετε από το πρόγραμμα ρυθμίσεων του BIOS, τέτοιες όπως LBA (Logical Block Addressing) ή CHS translation mode (<quote>Large</quote>). Περισσότερες πληροφορίες για ζητήματα σχετικά με μεγάλους δίσκους μπορούν να βρεθούν στο <ulink url="&url-large-disk-howto;">Large Disk HOWTO</ulink>. Αν χρησιμοποιείτε ένα σχήμα μετάφρασης κυλίνδρων και το BIOS σας δεν υποστηρίζει τις επεκτάσεις πρόσβασης μεγάλων δίσκων, τότε η κατάτμηση εκκίνησης σας θα πρέπει να βρίσκεται μέσα στην <emphasis>μεταφρασμένη</emphasis> αναπαράσταση του 1024ου κυλίνδρου.
ko: 시스템에 대용량 디스크가 있을 경우 실린더 변환 기술이 필요한 경우가 있습니다. 이 때는 BIOS 설정으로 들어가셔서 LBA (Logical Block Addressing)나 CHS 변환 모드(<quote>대용량</quote>)을 선택하시면 됩니다. 대용량 디스크를 사용할 때의 문제점에 대해서 자세히 알고 싶으시면 <ulink url="&url-large-disk-howto;">Large Disk HOWTO</ulink>를 참조하십시오. 실린더 변환 기술을 사용하지만 BIOS에서 대용량 디스크 접근을 지원하지 않으면 부팅용 파티션이 <emphasis>변환 후</emphasis>의 앞 1024번째 실린더 내에 할당되어야 합니다.
pt: Se tem um disco de grande capacidade, poderá querer utilizar as técnicas de tradução de cilindros, que pode ajustar a partir do programa de configuração da BIOS, tal como LBA (Logical Block Addressing) ou o modo de tradução CHS (<quote>Large</quote>). Mais informação sobre questões com discos de grande capacidade, poderá ser encontrada no <ulink url="&url-large-disk-howto;">Large Disk HOWTO</ulink>. Se está a utilizar o esquema de tradução de cilindros, e a BIOS não suporta acesso a extensões de discos de grande capacidade, então a sua partição boot tem de encaixar na representação <emphasis>traduzida</emphasis> dos primeiros 1024 cilindros.
ru: Если вы имеете большой диск, то можете использовать технологию трансляции цилиндров, которую можно включить в BIOS; она называется LBA (логическая адресация блоков) или режим трансляции CHS (<quote>Large</quote>). Подробную информацию о проблемах с большими жёсткими дисками можно найти в <ulink url="&url-large-disk-howto;">HOWTO по большим дискам</ulink>. Если вы используете схему трансляции цилиндров, а BIOS не поддерживает расширения доступа к большим жёстким дискам, то ваш загрузочный раздел должен попадать в <emphasis>транслированное</emphasis> представление первых 1024-х цилиндров.
zh_cn: 如果您有一个大硬盘，您也许必须使用柱面转换(cylinder translation)技术。它可以在您的 BIOS 设置程序中打开，比如 LBA (Logical Block Addressing) 或者 CHS 转换模式(<quote>Large</quote>)。关于大硬盘的各种问题可以在 <ulink url="&url-large-disk-howto;">Large Disk HOWTO</ulink> 下找到。如果您正在使用一个柱面转换方案，并且 BIOS 并不支持大硬盘访问拓展，您的引导分区必须放置在 <emphasis>转换后</emphasis> 的 1024 柱面内。
zh_tw: 如果您有一個大硬碟，您也許必須使用磁柱轉換(cylinder translation)技術。它可以透過 BIOS 設定程式中設定，比如 LBA (Logical Block Addressing) 或者 CHS 轉換模式(<quote>Large</quote>)。關於大硬碟的各種議題討論可以在 <ulink url="&url-large-disk-howto;">Large Disk HOWTO</ulink> 下找到。如果您正在使用一個磁柱轉換方案，而 BIOS 不支援高容量硬碟的存取，您的開機分割區必須放置在 <emphasis>轉換後</emphasis> 的 1024 磁柱內。

source: The recommended way of accomplishing this is to create a small (5&ndash;10MB should suffice) partition at the beginning of the disk to be used as the boot partition, and then create whatever other partitions you wish to have, in the remaining area. This boot partition <emphasis>must</emphasis> be mounted on <filename>/boot</filename>, since that is the directory where the Linux kernel(s) will be stored. This configuration will work on any system, regardless of whether LBA or large disk CHS translation is used, and regardless of whether your BIOS supports the large disk access extensions.
el: Ο συνιστώμενος τρόπος για να το πετύχετε αυτό είναι να δημιουργήσετε μια μικρή (5&ndash;10ΜΒ θα είναι αρκετά) κατάτμηση στην αρχή του δίσκου που θα χρησιμοποιηθεί σαν κατάτμηση εκκίνησης και στη συνέχεια να δημιουργήσετε όποιες άλλες κατατμήσεις θέλετε στον χώρο του δίσκου που περισσεύει. Η κατάτμηση εκκίνησης <emphasis>πρέπει</emphasis> να είναι προσαρτημένη στο σημείο προσάρτησης <filename>/boot</filename>, μιας και αυτός είναι ο κατάλογος όπου θα πρέπει να αποθηκεύονται οι πυρήνες του Linux. Αυτή η διαμόρφωση θα δουλέψει σε οποιοδήποτε σύστημα άσχετα από την χρήση LBA ή CHS μετάφρασης μεγάλων δίσκων και ανεξάρτητα από το αν το BIOS σας υποστηρίζει ή όχι τις επεκτάσεις πρόσβασης μεγάλων δίσκων.
ko: 이 경우 디스크의 맨 앞에 5 &ndash; 10 MB의 작은 파티션을 둬서 부팅 파티션으로 사용하고 나머지 영역을 원하는 대로 파티션하시면 됩니다. 이 부팅 파티션은 리눅스 커널들이 저장될 <emphasis>반드시</emphasis> <filename>/boot</filename>에 마운트 되어야 합니다. 이 방법은 시스템이 LBA를 사용하든 대용량 디스크용 CHS 변환을 사용하든, BIOS에서 대용량 디스크 접근을 지원하든 안하든 상관없이 모든 경우에 적용될 수 있습니다.
pt: O modo recomendado de realizar isto é criar uma pequena partição (5&ndash;10MB devem ser suficientes) no início do disco para ser usado como partição de arranque, e então criar todas as outras partições que quer ter, na restante área. Esta partição de arranque <emphasis>tem</emphasis> de ser montada em <filename>/boot</filename>, dado que esta é a directoria onde o(s) kernel Linux serão guardados. Esta configuração funcionará em qualquer sistema, independentemente se é utilizada a tradução LBA ou large disc CHS, e independente da sua BIOS suportar extensões de acesso a discos de elevada capacidade.
ru: Рекомендуемый путь выполнения этого условия &mdash; создать маленький (5&ndash;10 МБ должно хватить) раздел в начале диска, для использования в качестве загрузочного раздела, а затем создавать любые нужные разделы в оставшейся области. Загрузочный раздел <emphasis>должен</emphasis> быть смонтирован в <filename>/boot</filename>, так как это каталог для хранения ядер Linux. Такая конфигурация будет работать на любой системе, независимо используются ли трансляции LBA больших дисков или CHS, и независимо от того поддерживает ли BIOS расширение для доступа к большим дискам.
zh_cn: 解决这个问题的推荐方法，是在磁盘开始处创建一个小的(5-10MB 足矣)分区来作为引导分区。并且在其它地方创建其它的分区。这个引导分区 <emphasis>必须</emphasis>挂接至 <filename>/boot</filename> 下，这是因为它是 Linux 内核放置的地方。这样的配置将可以在任意系统上工作，不管 LBA 或者大硬盘 CHS 转换是否起作用，甚至也不管您的 BIOS 是否支持大硬盘访问扩展。
zh_tw: 解決這個問題的推薦方法，是在磁碟開始處建立一個小的( 5&mdash;10MB 就夠了)分割區來作為開機分割區。並且在其它地方建立其它的分區。這個開機分割區 <emphasis>必須</emphasis> 掛載至<filename>/boot</filename> 下，這是因為這是 Linux 核心放置的地方。這樣的設定可以在任意系統上運作正常，不管是使用 LBA 或者大硬碟 CHS 轉換，甚至也不管您的 BIOS 是否支援高容量硬碟的存取。

source: The <command>partman</command> disk partitioner is the default partitioning tool for the installer. It manages the set of partitions and their mount points to ensure that the disks and filesystems is properly configured for a successful installation. It actually uses the <command>parted</command> to do the on-disk partitioning.
el: Το πρόγραμμα διαμέρισης <command>partman</command> είναι το προεπιλεγμένο εργαλείο για την διαμέριση δίσκων για τον εγκαταστάτη. Διαχειρίζεται το σύνολο των κατατμήσεων και τα σημεία προσάρτησής τους ώστε να διασφαλίσει ότι οι δίσκοι και τα συστήματα αρχείων είναι κατάλληλα διαμορφωμένα για μια πετυχημένη εγκατάσταση. Χρησιμοποιεί στην ουσία το πρόγραμμα <command>parted</command> για να κάνει την διαμέριση "επί-του-δίσκου".
ko: <command>Partman</command>이라는 디스크 파티션 프로그램은 설치 프로그램이 기본으로 사용하는 파티션 프로그램입니다. 파티션과 마운트 위치를 자동으로 관리해줘서 디스크와 파일시스템들이 정상적으로 설정되어 있도록 해주고 성공적인 시스템 설치를 도와줍니다. 이 프로그램은 실제 파티션을 할 경우엔 <command>parted</command> 명령어를 사용합니다.
pt: O particionador de disco <command>partman</command>é por omissão a ferramenta de particionamento para o instalador. Gere o ajuste das partições e os seus pontos de montagem para assegurar que os discos e os sistemas de ficheiros estão devidamente configurados para uma instalação com sucesso.
ru: Программа для дисковой разметки <command>partman</command> является инструментом разметки по умолчанию для программы установки. Она управляет имеющимися разделами и их точками монтирования, чтобы проверить, что диски и файловые системы настроены правильно для успешной установки. На самом деле для разметки используется программа <command>parted</command>.
zh_cn: <command>partman</command> 是安装程序的缺省分区工具。它管理一系列分区以及挂载点，来保证磁盘和文件系统对于成功的安装来说具有有合适的配置。实际上它使用的是 <command>parted</command> 来进行磁盘分区的。
zh_tw: <command>partman</command> 是安裝程式的預設分割工具。它管理一系列分割區以及掛載點，來保証磁碟和檔案系統的設定正確，才能安裝成功。實際上它式使用 <command>parted</command> 來進行磁碟分割的。

source: EFI Recognized Formats
el: EFI Αναγνωρίσιμα format.
ko: EFI에서 지원하는 포맷
pt: Formatos reconhecidos EFI
ru: Распознаваемые EFI форматы
zh_cn: EFI 能够识别的格式
zh_tw: EFI 能夠識別的格式

source: The IA64 EFI firmware supports two partition table (or disk label) formats, GPT and MS-DOS. MS-DOS, the format typically used on i386 PCs, is no longer recommended for IA64 systems. Although the installer also provides the <command>cfdisk</command>, you should only use the <ulink url="parted.txt"> <command>parted</command></ulink> because only it can manage both GPT and MS-DOS tables correctly.
el: Το IA64 EFI firmware υποστηρίζει δυο τύπους πινάκων κατάτμησης (ή επικεφαλίδες δίσκων), τους GPT και MS-DOS. Ο τύπος MS-DOS, που συνήθως χρησιμοποιείται σε i386 PC, δεν συνίσταται πλέον για συστήματα ΙΑ64. Αν και ο εγκαταστάτης προσφέρει επίσης και το πρόγραμμα <command>cfdisk</command> θα πρέπει να χρησιμοποιήσετε μόνον το <ulink url="parted.txt"> <command>parted</command></ulink> γιατί είναι το μόνο που μπορεί να χειριστεί σωστά τόσο πίνακες τύπου GPT όσο και MS-DOS.
ko: IA64의 EFI 펌웨어는 파티션 테이블 포맷, 또는 디스크 레이블 포맷으로 GPT와 MS-DOS를 모두 지원합니다. MS-DOS는 i386용 PC에서 사용하는 방식으로, IA64에서는 GPT를 권장합니다. 설치 프로그램은 하드디스크를 포맷할 때 <command>cfdisk</command> 명령도 지원하지만 IA64에서는 GPT와 MS-DOS를 모두 지원하는 <ulink url="parted.txt"> <command>parted</command></ulink>를 사용하십시오.
pt: O firmware IA64 EFI suporta dois formatos de tabelas de partições (ou disco label), GPT e MS-DOS. MS-DOS, o formato típico utilizado em PCs i386, já não é recomendado para sistemas IA64. Embora o instalador também forneça o <command>cfdisk</command>, deverá utilizar apenas o <ulink url="parted.txt"> <command>parted</command></ulink> porque somente este consegue gerir correctamente ambas as tabelas GPT e MS-DOS.
ru: Микропрограмма EIF на IA64 поддерживает два формата таблицы разделов (или метки диска), GPT и MS-DOS. MS-DOS обычно используется на i386 PC, не рекомендуется для систем IA64. Хотя в программу установки включён<command>cfdisk</command>, вы должны использовать только <ulink url="parted.txt"> <command>parted</command></ulink>, так как только она может работать корректно и с таблицами GPT и с MS-DOS.
zh_cn: IA64 EFI 固件支持 GPT 和 MS-DOS 两种分区表(或者磁盘标记)格式。MS-DOS 格式通常用在 i386 PC 上，并且对于 IA64 系统来说并不合适推荐使用。尽管安装程序同时提供了 <command>cfdisk</command>，您应该只采用 <ulink url="parted.txt"> <command>parted</command></ulink>，因为只有它能够同时正确地管理 GPT 和 MS-DOS 分区表。
zh_tw: IA64 EFI 軔體支援 GPT 和 MS-DOS 兩種分割區表(或者磁碟標籤)格式。MS-DOS 格式通常用在 i386 PC 上，並且不適用在 IA64 系統上。儘管安裝程式提供了 <command>cfdisk</command>，您只需用 <ulink url="parted.txt"> <command>parted</command></ulink>，因為只有它能夠同時正確地管理 GPT 和 MS-DOS 分區表。

source: The automatic partitioning recipes for <command>partman</command> allocate an EFI partition as the first partition on the disk. You can also set up the partition under the <guimenuitem>Guided partitioning</guimenuitem> from the main menu in a manner similar to setting up a <emphasis>swap</emphasis> partition.
el: Οι αυτοματοποιημένες συνταγές για διαμέριση με το <command>partman</command> προσδιορίζουν μια κατάτμηση EFI σαν την πρώτη κατάτμηση στο δίσκο. Μπορείτε ακόμα να διαμορφώσετε τις κατατμήσεις σας με την επιλογή της <guimenuitem>Καθοδηγούμενης διαμέρισης</guimenuitem> από το κύριο μενού με τρόπο ανάλογο αυτού της ρύθμισης της κατάτμησης <emphasis>swap</emphasis>.
ko: <command>Partman</command> 명령어가 자동으로 파티션 하도록 하면 EFI형 파티션이 디스크의 가장 앞쪽에 설치됩니다. GUI에서 파티션하기를 원하실 경우 <emphasis>스왑파티션</emphasis>을 설정할 때와 마찬가지로 <guimenuitem>Guided partitioning</guimenuitem> 메뉴를 선택해서 EFI형 파티션을 만드실 수 있습니다.
pt: As receitas de particionamento automático para o <command>partman</command> alocam uma partição EFI como primeira partição no disco. Também poderá configurar a partição sob o <guimenuitem>Guia de particionamento</guimenuitem> do menu principal numa maneira semelhante à configuração da partição de <emphasis>swap</emphasis>.
ru: При автоматическом способе разметки <command>partman</command> создаётEFI раздел первым на диске. Также вы можете создать раздел с помощью<guimenuitem>Направляющая разметка</guimenuitem> из главного меню тем же способом, каким вы создавали раздел <emphasis>swap</emphasis>.
zh_cn: <command>partman</command> 自动分区方案会分配一个 EFI 分区作为磁盘上的第一个分区。您也可以在主菜单下选择 <guimenuitem>Guided partitioning</guimenuitem> 配置分区。其方法类似设置一个 <emphasis>交换</emphasis> 分区。
zh_tw: <command>partman</command> 自動分割區方案會分配一個 EFI 分割區作為磁碟上的第一個分割區。您也可以在主選單下選擇 <guimenuitem>Guided partitioning</guimenuitem> 建立分割區。其方法類似建立一個 <emphasis>置換</emphasis> 分割區。

source: The <command>partman</command> partitioner will handle most disk layouts. For those rare cases where it is necessary to manually set up a disk, you can use the shell as described above and run the <command>parted</command> utility directly using its command line interface. Assuming that you want to erase your whole disk and create a GPT table and some partitions, then something similar to the following command sequence could be used: <informalexample><screen> mklabel gpt mkpartfs primary fat 0 50 mkpartfs primary linux-swap 51 1000 mkpartfs primary ext2 1001 3000 set 1 boot on print quit </screen></informalexample> This creates a new partition table, and three partitions to be used as an EFI boot partition, swap space, and a root file system. Finally it sets the boot flag on the EFI partition. Partitions are specified in Megabytes, with start and end offsets from the beginning of the disk. So, for example, above we created a 1999MB ext2 file system starting at offset 1001MB from the start of the disk. Note that formatting swap space with <command>parted</command> can take a few minutes to complete, as it scans the partition for bad blocks.
el: Το πρόγραμμα διαμέρισης <command>partman</command>μπορεί να χειριστεί τις περισσότερες από τις διατάξεις διαμόρφωσης δίσκων. Για τις σπάνιες εκείνες περιπτώσεις που θα χρειαστεί να κάνετε χειροκίνητα την διαμόρφωση του δίσκου μπορείτε να χρησιμοποιήσετε το κέλυφος, όπως περιγράφηκε παραπάνω, και να τρέξετε το εργαλείο <command>parted</command> κατευθείαν χρησιμοποιώντας τις λειτουργίες του από την γραμμή εντολών. Υποθέτοντας ότι θέλετε να διαγράψετε ολόκληρο τον δίσκο σας και να δημιουργήσετε έναν πίνακα διαμέρισης GPT και μερικές κατατμήσεις, τότε κάτι αντίστοιχο με την παρακάτω ακολουθία εντολών μπορεί να χρησιμοποιηθεί: <informalexample><screen> mklabel gpt mkpartfs primary fat 0 50 mkpartfs primary linux-swap 51 1000 mkpartfs primary ext2 1001 3000 set 1 boot on print quit </screen></informalexample>. Έτσι θα δημιουργηθεί ένας καινούριος πίνακας διαμέρισης και τρεις κατατμήσεις που θα χρησιμοποιηθούν σαν EFI κατάτμηση εκκίνησης, χώρος swap και ριζική κατάτμηση αντίστοιχα. Τέλος θέτει τη σημαία εκκίνησης στην κατάτμηση EFI. Τα μεγέθη των κατατμήσεων προσδιορίζονται σε Megabytes, με τα σημεία έναρξης και offsets από την αρχή του δίσκου. Έτσι για παράδειγμα, δημιουργήσαμε παραπάνω μια κατάτμηση ext2 1999ΜΒ αρχίζοντας με offset στα 1001ΜΒ από την αρχή του δίσκου. Σημειώστε ότι η δημιουργία μιας κατάτμησης swap με το <command>parted</command> μπορεί να πάρει έως και μερικά λεπτά να ολοκληρωθεί γιατί το πρόγραμμα ελέγχει την κατάτμηση για πρπβληματικά μπλοκ.
ko: <command>Partman</command> 파티션 프로그램에서 대부분의 디스크 구성을 지원합니다만, 간혹가다 직접 디스크 구성을 해야 하는 경우가 있습니다. 이런 경우에는 앞에서 설명한 바와 같이 쉘로 나간 후에 <command>parted</command>프로그램을 직접 실행시키시면 됩니다. 디스크를 전부 지운 후 GPT형 파티션 테이블과 파티션 몇 개를 만드시면 아래 순서를 따라가시면 됩니다. <informalexample><screen> mklabel gpt mkpartfs primary fat 0 50 mkpartfs primary linux-swap 51 1000 mkpartfs primary ext2 1001 3000 set 1 boot on print quit </screen></informalexample> 위의 과정을 밟으시면 새 파티션 테이블이 생성되고, EFI형 부팅 파티션 3개, 스왑 파티션과 루트 파일시스템이 생성됩니다. 그리고 EFI 파티션에 부트 플래그를 1로 설정한 후 끝냅니다. 파티션의 크기는 메가바이트(MB) 단위로 표시되며, 시작은 디스크의 맨 앞을 기준으로 합니다. 앞 예제를 살펴보면 1999MB 짜리 ext2 파일시스템을 디스크 앞에서 1001MB 위치에 설치됩니다. 참고로 <command>parted</command>으로 스왑파티션을 포맷하면 이 프로그램이 배드블럭을 검사하는데 몇분정도 걸릴 수 있습니다.
pt: O particionador <command>partman</command> lidará com a maioria dos layouts de discos. Para aqueles casos raros onde é necessário configurar os discos manualmente, pode utilizar a consola como é descrito abaixo e corra directamente o utilitário <command>parted</command> utilizando a sua interface na linha de comandos. Assumindo que quer apagar todo o disco e criar a tabela GPT e algumas partições, pode então utilizar algo similar à seguinte sequência de comandos: <informalexample><screen> mklabel gpt mkpartfs primary fat 0 50 mkpartfs primary linux-swap 51 1000 mkpartfs primary ext2 1001 3000 set 1 boot on print quit </screen></informalexample> Isto cria uma nova tabela de partições, e três partições para serem usadas como partição de arranque EFI, espaço swap, e um sistema de ficheiros root. Finalmente ajusta a flag de arranque na partição EFI. As partições são especificadas em Megabytes, com offsets de início e fim a partir do início do disco. Note que formatando o espaço swap com <command>parted</command> poderá demorar alguns minutos para terminar, devido ao scan feito ao disco para maus blocos.
ru: Программа разметки <command>partman</command> способна работать с большинством дисковых раскладок. В тех редких ситуациях, когда требуется настройка диска вручную, вы можете вызвать интерпретатор командной строки, как описано выше, запустить утилиту <command>parted</command> и напрямую использовать её интерфейс командной строки. Предположим, если вы хотите стереть весь диск, создать таблицу GPT и несколько разделов, то можно использовать такую последовательность команд: <informalexample><screen> mklabel gpt mkpartfs primary fat 0 50 mkpartfs primary linux-swap 51 1000 mkpartfs primary ext2 1001 3000 set 1 boot on print quit </screen></informalexample> Она создаст новую таблицу разделов, и три раздела, используемых в качестве загрузочного раздела EFI, пространства подкачки и корневой файловой системы. В конце на EFI разделе устанавливается загрузочный флаг. Размеры разделов заданы в мегабайтах в виде начальных и конечных смещений от начала диска.Например, в приведённом выше примере создана файловая система ext2 размером 1999МБ начинающаяся с 1001МБ от начала диска. Заметим, что форматирование пространства подкачки с помощью <command>parted</command> может занять несколько минут, так как оно сканируется на наличие плохих блоков.
zh_cn: <command>partman</command> 分区工具将掌握大部分的磁盘布局。对于那些需要手工设置磁盘的罕见例子，您可以按照上面方法采用 shell 并且直接运行 <command>parted</command> 工具下的明令行界面。比如您想擦除您的整个硬盘并且创立一个 GPT 分区表以及一些分区，则可以才采用类似下面命令的方法： <informalexample><screen> mklabel gpt mkpartfs primary fat 0 50 mkpartfs primary linux-swap 51 1000 mkpartfs primary ext2 1001 3000 set 1 boot on print quit </screen></informalexample> 这里创建了一个新的分区表，以及三个分区分别用做 EFI 引导分区，交换空间以及一个根文件系统。最后它设置了 EFI 分区的引导标记。分区将用兆字节，以及起始和结束位置到磁盘开始的偏移量来表示。因此，比如在上面我们在到磁盘开始处偏移量为 1001MB 的地方开始创建了一个 1999MB ext2 文件系统。注意采用 <command>parted</command> 格式化交换分区，可能要花一些时间来完成，因为它可能要扫描坏区。
zh_tw: <command>partman</command> 分割區工具將處理大部分的磁碟排列方式。對於那些需要手動設置磁碟的罕見例子，您可以按照上面方法採用 shell 並且直接執行 <command>parted</command> 工具下的命令列界面。若您想清除整個硬碟並且建立一個 GPT 分割區表以及一些分割區，可使用下面命令： <informalexample><screen> mklabel gpt mkpartfs primary fat 0 50 mkpartfs primary linux-swap 51 1000 mkpartfs primary ext2 1001 3000 set 1 boot on print quit </screen></informalexample> 一個新的分割區表及三個分割區建立後，分別用做 EFI 開機分割區，置換空間以及一個根檔案系統。最後它建立了 EFI 分割區的開機標記。分割區以百萬位元組為單位，表示從磁碟開始起始和結束位置的偏移量。舉個例子，我們在磁碟開始處偏移量為 1001MB 的地方開始建立了一個 1999MB ext2 檔案系統。注意用 <command>parted</command> 格式化置換分割區可能要花一些時間來完成，因為它要掃瞄壞磁區。

source: Boot Loader Partition Requirements
el: Απαιτήσεις κατατμήσεων από τον φορτωτή εκκίνησης.
ko: 부트로더 파티션의 제약
pt: Requisitos para a Partição do Gestor de Arranque
ru: Требования к разделу системного загрузчика
zh_cn: 启动引导器分区要求
zh_tw: boot loader 分割區需求

source: ELILO, the ia64 boot loader, requires a partition containing a FAT file system with the <userinput>boot</userinput> flag set. The partition must be big enough to hold the boot loader and any kernels or RAMdisks you may wish to boot. A minimum size would be about 20MB, but if you expect to run with multiple kernels, then 128MB might be a better size.
el: Ο ELILO, ο φορτωτής εκκίνησης για συστήματα ia64, απαιτεί μια κατάτμηση με σύστημα αρχείων FAT και με ενεργοποιημένη την "σημαία" <userinput>boot</userinput>. Η κατάτμηση πρέπει να είναι αρκετά μεγάλη ώστε να χωράει τον φορτωτή εκκίνησης και οποιουσδήποτε πυρήνες ή δισκους RAM θέλετε πιθανόν να εκκινήσετε. Το ελάχιστο μέγεθος θα πρέπει να είναι γύρω στα 20ΜΒ αλλά αν σκοπεύετε να χρησιμοποιήσετε περισσότερους πυρήνες τα 128ΜΒ είναι ένα καλλίτερο μέγεθος.
ko: IA64용 부트로더인 ELILO는 부트 플래그가 1인 FAT형 파티션을 필요로 합니다. 이 파티션에 부트로더와 커널, 램디스크가 저장되므로 충분히 커야 합니다. 최소 20 MB입니다만, 커널을 여러개 두고자 하실 경우엔 128 MB정도는 필요할 것입니다.
pt: O ELILO, o gestor de arranque do ia64, requer uma partição que tenha o sistema de ficheiros FAT com a flag <userinput>boot</userinput>. A partição tem de ser suficientemente grande para conter o gestor de arranque e quantos kernel ou RAMdisks desejar ter para inicializar. O mínimo de espaço são cerca de 20MB, mas se espera correr múltiplos Kernel, então 128MB será a melhor opção.
ru: ELILO, системному загрузчику на ia64, требуется раздел, содержащий файловую систему FAT с установленным флагом <userinput>загрузочный</userinput>. Раздел должен быть достаточно большим, чтобы вместить системный загрузчик и какое-нибудь ядро или RAMдиск, который вы хотели бы загрузить. Минимальный размер должен быть около 20МБ, но если вы хотите загружать разные ядра, то лучше чтобы было 128МБ.
zh_cn: ELILO 作为一种 ia64 启动引导器需要一个含有 FAT 文件系统的分区。且此分区标记为 <userinput>boot</userinput>。分区必须足够大以便能够放入启动引导器，您想引导的内核以及 RAMdisks 内存磁盘镜像。最小的尺寸大概有 20MB，但是如果您想使用多个内核的话，128MB 也许更好。
zh_tw: ELILO 是一種 ia64 boot loader 需要一個 FAT 檔案系統的分割區，且此分割區標記為 <userinput>boot</userinput>。分割區必須夠大以便能夠放入 boot loader，以及其他想啟動的核心以及 RAMdisks 。最小需要 20MB，但是如果您想執行多個核心的話，最好是 128MB 。
