Repository: xobs/debian-installer
Catalog: doc/manual/po/*/partitioning.po
Languages: el, ko, pt, ru, zh_cn, zh_tw

source: If you will be working with more than 20 partitions on your ide disk, you will need to create devices for partitions 21 and beyond. The next step of initializing the partition will fail unless a proper device is present. As an example, here are commands you can use in <userinput>tty2</userinput> or under Execute A Shell to add a device so the 21st partition can be initialized: <informalexample><screen> # cd /dev # mknod hda21 b 3 21 # chgrp disk hda21 # chmod 660 hda21 </screen></informalexample> Booting into the new system will fail unless proper devices are present on the target system. After installing the kernel and modules, execute: <informalexample><screen> # cd /target/dev # mknod hda21 b 3 21 # chgrp disk hda21 # chmod 660 hda21 </screen></informalexample> <phrase arch="i386">Remember to mark your boot partition as <quote>Bootable</quote>.</phrase>
el: Αν πρόκειται να δουλέψετε με περισσότερες από 20 κατατμήσεις στον IDE δίσκο σας θα χρειαστεί να δημιουργήσετε συσκευές για τις κατατμήσεις από την 21η και μετά. Το επόμενο βήμα της αρχικοποίησης της κατάτμησης θα αποτύχει αν δεν υπάρχει μια κανονική συσκευή παρούσα. Σαν παράδειγμα, εδώ είναι εντολές που μπορείτε να χρησιμοποιήσετε στην κονσόλα <userinput>tty2</userinput> ή κάτω από την επιλογή "Εκτέλεση ενός Κελύφους" για να προσθέσετε μια συσκευή ώστε να μπορεί να αρχικοποιηθεί η 21η κατάτμηση: <informalexample><screen> # cd /dev # mknod hda21 b 3 21 # chgrp disk hda21 # chmod 660 hda21 </screen></informalexample> Η εκκίνηση στο καινούριο σύστημα θα αποτύχει αν δεν είναι παρούσες οι κανονικές συσκευές στο σύστημα στόχο. Μετά την εγκατάσταση του πυρήνα και των αρθρωμάτων εκτελέστε:<informalexample><screen> # cd /target/dev # mknod hda21 b 3 21 # chgrp disk hda21 # chmod 660 hda21 </screen></informalexample> <phrase arch="i386"> Θυμηθείτε να μαρκάρετε την κατάτμηση εκκίνησης σαν <quote>Bootable</quote>.</phrase>.
pt: Se vai trabalhar com mais de 20 partições no seu disco ide, vai precisar de criar dispositivos para a partição 21 e superiores. O passo seguinte da inicialização da partição falhará a menos que um dispositivo apropriado esteja presente. Como exemplo, aqui estão os comandos que poderá utilizar no <userinput>tty2</userinput> ou sob Executar uma Shell para adicionar um dispositivo para que a 21ª partição possa ser inicializada: <informalexample><screen> # cd /dev # mknod hda21 b 3 21 # chgrp disk hda21 # chmod 660 hda21 </screen></informalexample> Arrancar para o novo sistema irá falhar a menos que dispositivos apropriados estejam presentes no sistema alvo. Após instalar o kernel e módulos, execute: <informalexample><screen> # cd /target/dev # mknod hda21 b 3 21 # chgrp disk hda21 # chmod 660 hda21 </screen></informalexample> <phrase arch="i386">Lembre-se de marcar a sua partição de arranque como <quote>Bootable</quote>.</phrase>
ru: Если вы будете работать с более чем 20 разделами на ide диске, то вам нужно создать устройства для разделов начиная с 21-го и далее. Следующий шаг инициализации раздела завершится неудачно, если устройства не будет. В качестве примера здесь показаны команды, которые вы можете выполнить на <userinput>tty2</userinput> или через Запуск оболочки для добавления устройства 21 раздела: <informalexample><screen> # cd /dev # mknod hda21 b 3 21 # chgrp disk hda21 # chmod 660 hda21 </screen></informalexample> Загрузка в новую систему завершится неудачно, если в системе не будет нужных устройств. После установки ядра и модулей, выполните: <informalexample><screen> # cd /target/dev # mknod hda21 b 3 21 # chgrp disk hda21 # chmod 660 hda21 </screen></informalexample> <phrase arch="i386">Не забудьте пометить раздел загрузки как <quote>Загрузочный</quote>.</phrase>
zh_cn: 如果您的 ide 磁盘上会超过多过 20 个分区，您将需要为 21 以上的分区创建设备。除非有正确的设备存在，否则下一步初始化分区将失败。作为一个例子，这里列举了相关的命令，让您可以在 <userinput>tty2</userinput> 中使用或者在运行一个 Shell 下加入一个设备文件，令第 21 个的分区能够被初始化。<informalexample><screen> # cd /dev # mknod hda21 b 3 21 # chgrp disk hda21 # chmod 660 hda21 </screen></informalexample> 除非在目标系统上有合适的设备名称，否则引导一个新的系统将会失败。在安装完内核和模块以后，执行： <informalexample><screen> # cd /target/dev # mknod hda21 b 3 21 # chgrp disk hda21 # chmod 660 hda21 </screen></informalexample> <phrase arch="i386">记住标记您的引导分区为 <quote>Bootable</quote>。</phrase>
zh_tw: 如果您的 ide 磁碟上會超過 20 個分割區，您需要為 21 以上的分割區建立裝置檔案。除非有適當的裝置，否則下一步初始化分割區將失敗。比如說，這裡列舉了相關的命令，讓您可以在 <userinput>tty2</userinput> 中使用或者在執行一個介殼之後加入一個裝置檔案，令第 21 個分割區能夠被初始化。 <informalexample><screen> # cd /dev # mknod hda21 b 3 21 # chgrp disk hda21 # chmod 660 hda21 </screen></informalexample> 除非在目標系統上有合適的裝置名稱，否則啟動一個新安裝的系統將會失敗。在安裝完核心及模塊後，執行： <informalexample><screen> # cd /target/dev # mknod hda21 b 3 21 # chgrp disk hda21 # chmod 660 hda21 </screen></informalexample> <phrase arch="i386">記住將您的開機分割區標籤為 <quote>Bootable</quote>。</phrase>

source: One key point when partitioning for Mac type disks is that the swap partition is identified by its name; it must be named <quote>swap</quote>. All Mac linux partitions are the same partition type, Apple_UNIX_SRV2. Please read the fine manual. We also suggest reading the <ulink url="&url-mac-fdisk-tutorial;">mac-fdisk Tutorial</ulink>, which includes steps you should take if you are sharing your disk with MacOS.
el: Ένα σημαντικό σημείο όταν κάνετε διαμέριση δίσκων σε σύστημα Mac είναι το ότι η κατάτμηση swap ταυτοποιείται από το όνομά της, πρέπει να λέγεται <quote>swap</quote>. Όλες οι κατατμήσεις για το Linux σε Mac έχουν τον ίδιο τύπο Apple_UNIX_SRV2. Παρακαλούμε διαβάστε το πολύ καλό εγχειρίδιο. Συνιστούμε επίσης για διάβασμα το <ulink url="&url-mac-fdisk-tutorial;">mac-fdisk Tutorial</ulink>, που περιγράφει βήματα που θα πρέπει να κάνετε αν πρόκειται να μοιραστείτε έναν δίσκο με το MacOS.
ko: 매킨토시용 디스크를 파티션할 때 주의할 점은 스왑파티션이 <quote>swap</quote>이라는 이름으로 구별된다는 점입니다. 매킨토시용 리눅스 파티션은 모두 같은 Apple_UNIX_SRV2입니다. 자세한 내용은 매뉴얼을 참조하시고, MacOS와 디스크를 공유할 때 수행해야할 절차를 설명한 <ulink url="&url-mac-fdisk-tutorial;">mac-fdisk Tutorial</ulink>도 읽을 것을 권해드립니다.
pt: Um ponto chave quando particionar discos do tipo Mac, é que a partição de swap seja identificada pelo seu nome; tem que ser chamada de <quote>swap</quote>. Todas as partições Linux no Mac são do mesmo tipo, Apple_UNIX_SRV2. Leia, por favor, o manual. Sugerimos também a leitura do <ulink url="&url-mac-fdisk-tutorial;">Tutorial mac-fdisk</ulink>, que inclui passos que deverá seguir se está a partilhar os seus discos com MacOS.
ru: Ключевым моментом при разметке дисков для Mac является то, что раздел подкачки в Mac распознаётся по имени; он должен называться <quote>swap</quote>. Все разделы Mac linux имеют один тип раздела, Apple_UNIX_SRV2. Пожалуйста, прочитайте документацию. Также, мы советуем прочитать <ulink url="&url-mac-fdisk-tutorial;">Введение в mac-fdisk</ulink>, который содержит шаги, которые нужно выполнить, если вы хотите использовать этот диск совместно с MacOS.
zh_cn: 为 Mac 类型磁盘分区的关键点是，交换分区是根据其名称确定的，它必须被命名为<quote>swap</quote>。所有的 Mac Linux 分区都是相同的 Apple_UNIX_SRV2 分区类型。请阅读合适的手册。我们还建议您阅读 <ulink url="&url-mac-fdisk-tutorial;">mac-fdisk Tutorial</ulink>，其中包括了如何同 MacOS 共享磁盘的步骤。
zh_tw: 重點是當分割 Mac 類型磁碟時，置換分割區根據它的名字做確認﹔它必須被命名為 <quote>swap</quote>。所有的 Mac Linux 分割區的類型都是 Apple_UNIX_SRV2 。請閱讀合適的手冊。我們通常建議閱讀 <ulink url="&url-mac-fdisk-tutorial;">mac-fdisk 使用指南</ulink>，其中包括了如何同 MacOS 共享磁碟的步驟。

source: Partitioning for &arch-title;
el: Διαμέριση για την αρχιτεκτονική &arch-title;
ko: &arch-title;에서 파티션하기
pt: Particionar para &arch-title;
ru: Разметка для &arch-title;
zh_cn: 为 &arch-title; 准备分区
zh_tw: 為 &arch-title; 分割

source: Booting Debian from the SRM console (the only disk boot method supported by &releasename;) requires you to have a BSD disk label, not a DOS partition table, on your boot disk. (Remember, the SRM boot block is incompatible with MS-DOS partition tables &mdash; see <xref linkend="alpha-firmware"/>.) As a result, <command>partman</command> creates BSD disk labels when running on &architecture;, but if your disk has an existing DOS partition table the existing partitions will need to be deleted before partman can convert it to use a disk label.
el: Το να εκκινήσετε το Debian από την κονσόλα SRM (η μόνη μέθοδος εκκίνησης από δίσκο που υποστηρίζεται από την έκδοση &releasename;) απαιτεί να έχετε μια επικεφαλίδα δίσκου BSD, και όχι έναν πίνακα κατατμήσεων DOS στον δίσκο εκκίνησης. (Θυμηθείτε ότι το μπλοκ εκκίνησης SRM είναι ασύμβατο με πίνακες κατάτμησης MS-DOS &mdash; δείτε το <xref linkend="alpha-firmware"/>.) Σαν αποτέλεσμα το πρόγραμμα <command>partman</command> δημιουργεί επικεφαλίδες δίσκων BSD όταν τρέχει στην αρχιτεκτονική &architecture;, αλλά αν ο δίσκος σας έχει ήδη έναν πίνακα κατατμήσεων DOS οι υπάρχουσες κατατμήσεις θα πρέπει να σβηστούν πριν το πρόγραμμα μπορέσει να μετατρέψει τον πίνακα αυτό ώστε να χρησιμοποιήσει μια επικεφαλίδα δίσκου.
ko: SRM 콘솔에서 데비안을 부팅할 경우 (&releasename;에서 유일하게 지원하는 방식이기도 합니다) 부팅 디스크에 DOS 파티션 테이블이 아닌 BSD 디스크 라벨이 필요합니다. (SRM 부트 블록은 MS-DOS 파티션 테이블과 호환되지 않습니다. 자세한 내용은 <xref linkend="alpha-firmware"/>를 참조하십시오) 따라서 <command>partman</command> 명령어는 &architecture;상에서는 BSD 디스크 라벨을 생성해줍니다만, 디스크에 DOS 파티션 테이블이 이미 존재하는 경우엔 partman 명령어가 디스크 라벨을 생성하기 전에 기존의 파티션들을 지워야 합니다.
pt: Iniciar o Debian a partir de uma consola SRM (o único método de inicialização a partir do disco suportado por &releasename;) requer que tenha um BSD disk label, e não uma tabela de partição DOS, no seu disco de arranque. (Lembre-se, que o bloco de arranque SRM é incompatível com as tabelas de partição MS-DOS - visite <xref linkend="alpha-firmware"/>.) Como resultado, <command>partman</command> cria BSD disk labels quando corre em &architecture;, mas se o seu disco tem uma tabela de partição DOS as partições existentes terão de ser apagadas antes que o partman as possa converter para utilizar uma disk label.
ru: Для загрузки Debian из SRM консоли (в &releasename; поддерживается только загрузка с диска) на загрузочном диске требуется BSD disk label, а не таблица разделов DOS. (Запомните, загрузочный блок SRM несовместим с таблицами разделов MS-DOS &mdash; смотрите <xref linkend="alpha-firmware"/>.) Отсюда, при запуске на &architecture; <command>partman</command> создаёт BSD disk label, но если на диске существует таблица разделов DOS, то её нужно удалить перед тем как partman сможет преобразовать её в disk label.
zh_cn: 从 SRM 控制台引导 Debian (唯一能被 &releasename; 支持的启动方法)要求您的启动盘上有 BSD 磁盘卷标，而不是 DOS 分区。(注意，SRM 引导块不和 MS-DOS 分区兼容 &mdash; 请参阅 <xref linkend="alpha-firmware"/>。)因此，<command>partman</command> 在 &architecture; 上运行时会创建 BSD 磁盘卷标，如果您的磁盘上已经存在一个 DOS 分区表，在 partman 转换到磁盘卷标前需要将它删除。
zh_tw: 從 SRM 控制台啟動 Debian (唯一 &releasename; 支援的啟動方法)要求您的開機磁碟上有 BSD 磁碟標籤，而不是 MS-DOS 分割區。(注意， SRM 開機區塊不與 MS-DOS 分割區相容 &mdash; 請參閱 <xref linkend="alpha-firmware"/>。)因此，<command>partman</command> 在 &architecture; 上使用時會建立 BSD 磁碟標籤，如果您的磁碟上已經存在一個 DOS 分割區表，在 partman 將之轉換到磁碟標籤前需要將此分割區刪除。

source: If you have chosen to use <command>fdisk</command> to partition your disk, and the disk that you have selected for partitioning does not already contain a BSD disk label, you must use the <quote>b</quote> command to enter disk label mode.
el: Αν έχετε διαλέξει να χρησιμοποιήσετε το πρόγραμμα <command>fdisk</command> για τη διαμέριση του δίσκου σας, και ο δίσκος που έχετε επιλέξει δεν περιέχει ήδη μια επικεφαλίδα δίσκου BSD, θα πρέπει να χρησιμοποιήσετε την εντολή <quote>b</quote> για να μπείτε στην κατάσταση του προγράμματος δημιουργίας επικεφαλίδων δίσκου.
ko: <command>fdisk</command> 명령어로 디스크를 파티션하고자 할 때, BSD 디스크 라벨이 아직 생성되지 않은 디스크를 파티션하고자 할 경우 <quote>b</quote> 명령어로 디스크 라벨 모드로 들어가서 라벨을 생성시켜야 합니다.
pt: Se escolheu utilizar o <command>fdisk</command> para particionar o disco, e o disco que seleccionou para particionar não possui já uma BSD disk label, tem de utilizar o comando <quote>b</quote> para entrar em modo de disk label.
ru: Если вы выбрали <command>fdisk</command> для разметки, и указанный диск ещё не содержит BSD disk label, то вы должны воспользоваться командой <quote>b</quote>, чтобы войти в режим disk label.
zh_cn: 如果您选择使用 <command>fdisk</command> 为您的磁盘分区，并且该磁盘上没有 BSD 磁盘卷标，您必须使用<quote>b</quote>命令进入磁盘卷标模式。
zh_tw: 如果您選擇使用 <command>fdisk</command> 來分割您的磁碟，並且該磁碟上沒有 BSD 磁碟標籤，您必須使用 <quote>b</quote> 命令進入磁碟標籤模式。

source: Unless you wish to use the disk you are partitioning from Tru64 Unix or one of the free 4.4BSD-Lite derived operating systems (FreeBSD, OpenBSD, or NetBSD), it is suggested that you do <emphasis>not</emphasis> make the third partition contain the whole disk. This is not required by <command>aboot</command>, and in fact, it may lead to confusion since the <command>swriteboot</command> utility used to install <command>aboot</command> in the boot sector will complain about a partition overlapping with the boot block.
el: Αν δεν επιθυμείτε να χρησιμοποιήσετε τον δίσκο που διαμερίζετε από το Tru64 Unix ή ένα από τα ελεύθερα παράγωγα λειτουργικά συστήματα του 4.4BSD-Lite (FreeBSD, OpenBSD, or NetBSD),συνιστούμε να <emphasis>μην</emphasis> κάνετε την τρίτη κατάτμηση να περιέχει ολόκληρο το δίσκο. Αυτό δεν απαιτείται από το <command>aboot</command>, και στην πραγματικότητα μπορεί να οδηγήσει σε σύγχιση αφού το βοηθητικό εργαλείο <command>swriteboot</command> που χρησιμοποιούνταν για την εγκατάσταση του <command>aboot</command> στον τομέα εκκίνησης θα γκρινιάζει ότι μια κατάτμηση αλληλεπικαλύπτεται με το μπλοκ εκκίνησης.
ko: Tru64 Unix나 FreeBSD, OpenBSD, NetBSD등 4.4BSD-Lite에 기반을 둔 운영체제와 디스크를 공유하고자 할 경우가 아니면 세번째 파티션에 디스크 전체를 넣지 않는 것을 권해드립니다. <command>aboot</command> 명령어는 이러한 설정을 필요도 하지 않을 뿐더러, <command>aboot</command>를 부트섹터에 설치하는 <command>swriteboot</command>에 혼란을 주어 파티션이 부트블록과 겹친다는 에러메시지를 출력시키게 합니다.
pt: A menos que deseje utilizar o disco que está a particionar a partir de Tru64 Unix ou dos sistemas operativos derivados do livre 4.4BSD-Lite (FreeBSD, OpenBSD, e NetBSD), é sugerido que <emphasis>NÃO</emphasis> faça a terceira partição conter todo o disco. Isto não é necessário pelo <command>aboot</command>, e de facto, pode levar a confusão já que o utilitário <command>swriteboot</command> costumava instalar <command>aboot</command> no sector de arranque vai-se queixar de uma partição sobreposta com o bloco de arranque.
ru: Если вы не хотите использовать диск с разметкой для Tru64 Unix или одного из свободных 4.4BSD-Lite клонов операционных систем (FreeBSD, OpenBSD, или NetBSD), советуем вам <emphasis>не</emphasis> делать третий раздел, содержащий весь диск. Это не нужно для <command>aboot</command>, и фактически, может привести в замешательство, когда утилита <command>swriteboot</command>, используемая для установки <command>aboot</command> в загрузочный сектор, пожалуется на раздел, который перекрывается с загрузочным сектором.
zh_cn: 除非您想在 Tru64 Unix 或者一个 free 4.4BSD-Lite 兼容的系统下(FreeBSD, OpenBSD 或 NetBSD)使用这个磁盘，请 <emphasis>不要</emphasis> 建立包含整个磁盘的第三方分区。<command>aboot</command> 并不需要这样，并且，它可能导致一些混乱，这是因为当用 <command>swriteboot</command> 工具在引导分区下安装时，<command>aboot</command> 将报怨引导扇区将被一个分区覆盖。
zh_tw: 除非您想在 Tru64 Unix 或者一個 free 4.4BSD-Lite 衍生的作業系統下(FreeBSD, OpenBSD 或 NetBSD)使用這個磁碟，請 <emphasis>不要</emphasis> 建立包含整個磁碟的第三分割區。<command>aboot</command> 並不需要做這個動作，而且它可能導致一些麻煩，這是因為當用 <command>swriteboot</command> 工具在開機區段下安裝 <command>aboot</command> 時，分割區會被一個開機區塊覆蓋。

source: Also, because <command>aboot</command> is written to the first few sectors of the disk (currently it occupies about 70 kilobytes, or 150 sectors), you <emphasis>must</emphasis> leave enough empty space at the beginning of the disk for it. In the past, it was suggested that you make a small partition at the beginning of the disk, to be left unformatted. For the same reason mentioned above, we now suggest that you do not do this on disks that will only be used by GNU/Linux. When using <command>partman</command>, a small partition will still be created for <command>aboot</command> for convenience reasons.
el: Επίσης επειδή το <command>aboot</command> γράφεται στους πρώτους λίγους τομείς του δίσκου (προς το παρόν καταλαμβάνει περίπου 70 kilobytes, ή 150 τομείς) θα <emphasis>πρέπει</emphasis> να αφήσετε αρκετό ελεύθερο χώρο στην αρχή του δίσκου για αυτόν το σκοπό. Παλιότερα συνιστούνταν να δημιουργείται μια μικρή κατάτμηση στην αρχή του δίσκου που έμενε αδιαμόρφωτη. Για τον ίδιο λόγο που αναφέραμε παραπάνω, συνιστούμε τώρα να μην κάνετε κάτι τέτοιο σε δίσκους που πρόκειται να χρησιμοποιηθούν μόνο από το GNU/Linux. Όταν χρησιμοποιείτε το <command>partman</command> μια μικρή κατάτμηση εξακολουθεί να δημιουργείται για το <command>aboot</command> για λόγους ευκολίας.
ko: 그리고 <command>aboot</command>는 디스크의 가장 앞쪽의 150 섹터(70 kB)를 차지하고 있기 때문에, 디스크 앞쪽에 이를 위한 여유공간을 충분히 두셔야만 합니다. 이전에는 디스크 시작 부분에 포맷 안된 빈 공간을 일부 둘 것을 권해드렸었지만, 이제는 GNU/Linux에서만 사용되는 디스크의 경우 권하지 않습니다. 하지만 사용자 편의를 위하여 <command>partman</command>명령어는 여전히 이 빈공간을 둡니다.
pt: Também, porque <command>aboot</command> é escrito para os primeiros poucos sectores do disco (actualmente ocupa cerca de 70 kilobytes, ou 150 sectores), você <emphasis>tem de</emphasis> deixar espaço vazio suficiente no início do disco para ele. No passado, era sugerido que cria-se uma pequena partição não formatada, no início do disco. Pela mesma razão mencionada abaixo, nós agora sugerimos que não faça isto nos discos que irão utilizar GNU/Linux. Quando se utiliza o <command>partman</command>, por convenientes razões uma pequena partição continuará a ser criada para <command>aboot</command>.
ru: Также, так как <command>aboot</command> записывается в несколько первых секторов диска (в данный момент, он занимает около 70 килобайт или 150 секторов), вы <emphasis>должны</emphasis> оставить для него достаточно пустого места в начале диска. Раньше предлагалось делать маленький раздел в начале диска, и оставлять его неотформатированным. По причине, упомянутой выше, теперь мы предлагаем не делать этого для дисков, если будет использоваться только GNU/Linux. При использовании <command>partman</command>, маленький раздел всё ещё нужно создать для <command>aboot</command> для удобства.
zh_cn: 同时，由于 <command>aboot</command> 将被写到磁盘的前面的几个扇区(目前它占用大约 70 KB 空间，或者 150 个扇区)。您 <emphasis>必须</emphasis> 在磁盘的开始处留下足够的空间。以前的方法建议您在磁盘的开始处分出一个较小并且不格式化的分区。基于上面的理由，我们现在建议您这块磁盘专门用于 GNU/Linux。当使用 <command>partman</command>，仍会建立一个小的分区给 <command>aboot</command>，这是习惯所致。
zh_tw: 同時因為 <command>aboot</command> 將被寫到磁碟前面的幾個區段(目前它佔用大約 70 KB 空間，或者 150 個區段)。您 <emphasis>必須</emphasis> 在磁碟一開始的地方留下足夠的空間。過去我們建議您在磁碟的開始處分出一個較小且未格式化的分割區。基於以上的理由，我們現在建議您這塊磁碟專門用於 GNU/Linux。當使用 <command>partman</command>，仍會建立一個小的分割區給 <command>aboot</command>，這樣一來較為方便。

source: For ARC installations, you should make a small FAT partition at the beginning of the disk to contain <command>MILO</command> and <command>linload.exe</command> &mdash; 5 megabytes should be sufficient, see <xref linkend="non-debian-partitioning"/>. Unfortunately, making FAT file systems from the menu is not yet supported, so you'll have to do it manually from the shell using <command>mkdosfs</command> before attempting to install the boot loader.
el: Για εγκαταστάσεις σε ARC θα πρέπει να δημιουργήσετε μια μικρή κατάτμηση FAT στην αρχή του δίσκου που θα περιέχει το <command>MILO</command> και το εκτελέσιμο <command>linload.exe</command> &mdash; 5ΜΒ θα είναι αρκετά, δείτε και το <xref linkend="non-debian-partitioning"/>. Δυστυχώς, η δημιουργία κατατμήσεων FAΤ δεν υποστηρίζεται ακόμα από το μενού κι επομένως θα πρέπει να το κάνετε αυτό χειροκίνητα από το κέλυφος χρησιμοποιώντας την εντολή <command>mkdosfs</command> πριν προσπαθήσετε να εγκαταστήσετε τον φορτωτή εκκίνησης.
ko: ARC에 설치하실 경우에는 디스크 맨 앞에 <command>MILO</command>와 <command>linload.exe</command> 명령어를 위한 5 MB 정도의 작은 FAT형 파티션을 만드는 것이 좋습니다. 자세한 내용은 xref linkend="non-debian-partitioning"/>을 참조하시면 됩니다. 아쉽게도 메뉴에서 FAT형 파티션을 만드는 기능은 지원되지 않기 때문에 쉘에서 직접 만드셔야 합니다. 쉘에서 <command>mkdosfs</command> 명령을 사용하여 직접 FAT형 파티션을 만드신 후에 부트로더를 설치하셔야 합니다.
pt: Para instalações ARC, deverá fazer uma pequena partição FAT no início do disco para conter <command>MILO</command> e <command>linload.exe</command> &mdash; 5 megabytes deverão ser suficientes, visite <xref linkend="non-debian-partitioning"/>. Infelizmente, fazer um sistema de ficheiros FAT a partir do menu ainda não é suportado, deverá ser feito manualmente recorrendo a uma consola para utilizar <command>mkdosfs</command> antes de tentar instalar o gestor de arranque.
ru: Для установки на ARC, вы должны сделать маленький раздел FAT в начале диска для хранения <command>MILO</command> и <command>linload.exe</command> &mdash; 5 мегабайт должно хватить, смотрите <xref linkend="non-debian-partitioning"/>. К сожалению, создание файловой системы FAT из меню пока не работает, поэтому вы должны сделать это вручную из командной строки с помощью <command>mkdosfs</command> перед попыткой установить системный загрузчик.
zh_cn: 对于 ARC 的安装来说，您应该在磁盘开始处建立一个小的 FAT 分区以便装入 <command>MILO</command> 以及 <command>linload.exe</command> &mdash; 至少需要 5 MB 空间，请参见 <xref linkend="non-debian-partitioning"/>。不幸地是，从菜单建立 FAT 文件系统的方法是不被支持的，因此您必须在 Shell 下面使用 <command>mkdosfs</command> 然后再尝试安装启动引导器。
zh_tw: 對於 ARC 的安裝來說，您應該在磁碟開始處建立一個小的 FAT 分區以放入 <command>MILO</command> 以及 <command>linload.exe</command> &mdash; 這至少需要 5 MB 空間，請參見 <xref linkend="non-debian-partitioning"/>。不幸地是，尚未支援從選單建立 FAT 檔案系統的方法，因此您必須在 Shell 下面手動使用 <command>mkdosfs</command> ，然後再嘗試安裝 boot loader 。
