Repository: xobs/debian-installer
Catalog: doc/manual/po/*/partitioning.po
Languages: el, ko, pt, ru, zh_cn, zh_tw

source: PALO, the HPPA boot loader, requires a partition of type <quote>F0</quote> somewhere in the first 2GB. This is where the boot loader and an optional kernel and RAMdisk will be stored, so make it big enough for that &mdash; at least 4Mb (I like 8&ndash;16MB). An additional requirement of the firmware is that the Linux kernel must reside within the first 2GB of the disk. This is typically achieved by making the root ext2 partition fit entirely within the first 2GB of the disk. Alternatively you can create a small ext2 partition near the start of the disk and mount that on <filename>/boot</filename>, since that is the directory where the Linux kernel(s) will be stored. <filename>/boot</filename> needs to be big enough to hold whatever kernels you might wish load; 8&ndash;16MB is generally sufficient.
el: O PALO, o φορτωτής εκκίνησης του HPPA, απαιτεί μια κατάτμηση τύπου <quote>F0</quote> κάπου στα πρώτα 2GB. Εκεί είναι που θα αποθηκευτούν ο φορτωτής εκκίνησης και προαιρετικά ο πυρήνας και η δίσκος μνήμης RAM, οπότε φροντίστε να είναι αρκετά μεγάλη &mdash; τουλάχιστον 4ΜΒ (κατά προτίμηση 8&ndash;16ΜΒ).Μια επιπλέον απαίτηση του firmware είναι ότι ο πυρήνας του Linux θα πρέπει να βρίσκεται στα πρώτα 2GB του δίσκου. Αυτό το πετυχαίνει κανείς συνήθως κάνοντας την ριζική ext2 κατάτμηση να χωράει ακριβώς στα πρώτα 2GB του δίσκου. Εναλλακτικά, μπορείτε να δημιουργήσετε μια μικρή κατάτμηση ext2 κοντά στην αρχή του δίσκου και να την προσαρτήσετε στο σημείο <filename>/boot</filename>, μιας και αυτός είναι ο κατάλογος στον οποίο θα πρέπει να αποθηκευτεί ο πυρήνας(-ες) του Linux. Ο κατάλογος <filename>/boot</filename> θα πρέπει να είναι αρκετά μεγάλος ώστε να χωρά όσους πυρήνες θέλετε πιθανόν να χρησιμοποιήσετε, γενικά 8-16ΜΒ είναι αρκετά.
ko: HPPA용 부트로더인 PALO에는 앞 2 GB 영역 내에 <quote>F0</quote>형 파티션을 둬야 합니다. 이 부분에 부트로더와 커널, 그리고 램디스크가 저장되므로, 최소 4 MB(약 8 &ndash; 16 MB )정도로 할당해야 합니다. 펌웨어의 추가 요구사항으로 리눅스 커널도 이 2 GB 영역 내에 있을 것을 요구합니다. 루트 파티션인 ext2형 파티션이 이 영역 내에 완전히 들어가도록 디스크를 파티션하면 됩니다. 또 디스크 앞부분에 작은 ext2형 파티션을 만든 후 이 파티션이 <filename>/boot</filename>에 마운트 되도록 하는 방법도 있습니다. 리눅스 커널은 이 디렉토리에 저장되기 때문입니다. 리눅스 커널과 기타 커널이 들어가야할 공간이므로 약 8 &ndash; 16 MB 정도 할당해두시면 됩니다.
pt: PALO, o gestor de arranque para HPPA, requer uma partição do tipo <quote>F0</quote> algures nos primeiros 2GB. É aqui onde o gestor de arranque, e um kernel opcional e o RAMdisk serão guardados, portanto deixe espaço suficiente para tal &mdash; pelo menos 4Mb no mínimo (Eu prefiro 8&ndash;16MB). Outros requisitos adicionais do firmware é que o Kernel Linux resida nos primeiros 2GB do disco. Isto é tipicamente alcançado fazendo a partição raiz do tipo ext2 caber inteiramente nos primeiros 2GB do disco. Alternativamente poderá criar uma pequena partição ext2 perto do início do disco e montá-la em <filename>/boot</filename>, dado que é nesta directoria onde o kernel(s) Linux será guardado. <filename>/boot</filename> necessita de ser suficientemente grande para conter todos os kernel que poderá querer ter; 8&ndash;16MB geralmente é suficiente.
ru: PALO, системный загрузчик на HPPA, требует тип раздела <quote>F0</quote> расположенный в пределах первых 2ГБ. На нём будут храниться системный загрузчик и необязательно ядро и RAMдиск, поэтому он должен быть достаточно большим &mdash; около 4МБ (мне нравится 8&ndash;16МБ). Дополнительные требования микропрограммы: ядро Linux должно располагаться на первых 2ГБ диска. Это, обычно, достигается созданием корневого раздела ext2, полностью размещаемого в пределах первых 2ГБ диска. Или же вы можете создать маленький раздел ext2 в начале диска и затем смонтировать его как <filename>/boot</filename>, так как в этом каталоге в Linux хранятся ядра. <filename>/boot</filename> должен быть достаточно большим, чтобы вместить все ядра, которые вы хотите загрузить; 8&ndash;16МБ обычно хватает.
zh_cn: PALO 是一个 HPPA 的启动引导器。它需要在磁盘前 2GB 内得到一个 <quote>F0</quote> 分区。这个分区里面装有启动引导器以及可选的内核和内存虚拟磁盘。因此最好这个分区的大小应该符合这个要求 -- 至少需要 4 MB (我个人倾向于 8-16 MB)。固件的一个附加的要求是 Linux 内核必须在磁盘的前 2 GB 内。达到这一点要求需要把根 ext2 分区整个放在磁盘的头 2GB 内。或者您可以在磁盘前部创建一个小分区，并且被挂载到 <filename>/boot</filename>，然后在这个目录下面放置 Linux 内核。<filename>/boot</filename> 需要足够大以便能够放置入内核；8&ndash;16 MB 一般来说应该足够了。
zh_tw: PALO 是一個 HPPA 的 boot loader ，需要在磁碟前 2GB 中建立一個 <quote>F0</quote> 的分割區。這個分割區裡面放有 boot loader 以及可選的核心和 RAMdisk ，因此這個分區的大小最好夠大 &mdash; 至少需要 4 MB (我個人傾向於 8&mdash;16MB)。軔體的附加需求是 Linux 核心必須放在磁碟的前 2 GB 內，我們可以把根 ext2 分割區整個放在磁碟的前 2GB 內。或者您可以在磁碟前面建立一個小分割區，並且掛載到 <filename>/boot</filename>，因為這個目錄下面放置了 Linux 核心。<filename>/boot</filename> 必須夠大以便能放置任何你想載入的核心﹔一般來說 8&mdash;16MB 應該足夠。

source: If you have an existing other operating system such as DOS or Windows and you want to preseve that operating system while installing Debian, you may need to resize its partition to free up space for the Debian installation. The installer supports resizing of both FAT and NTFS filesystems; when you get to the installer's partitioning step, select the option to partition manually and then simply select an existing partition and change its size.
el: Αν έχετε ένα άλλο λειτουργικό σύστημα ήδη όπως DOS ή Windows και θέλετε να το κρατήσετε κατά την εγκατάσταση του Debian, πιθανόν να χρειαστεί να αλλάξετε το μέγεθος της κατάτμησης όπου βρίσκεται αυτό το άλλο σύστημα ώστε να απελευθερώσετε χώρο για την εγκατάσταση του Debian. Ο εγκαταστάτης υποστηρίζει την αλλαγή του μεγέθους κατατμήσεων με σύστημα αρχείων τόσο FAT όσο και NTFS, Όταν φτάσετε κατά την εγκατάσταση στην φάση της διαμέρισης κάνετε την επιλογή της χειροκίνητης διαμέρισης και στη συνέχεια επιλέξτε απλά μια υπάρχουσα κατάτμηση και αλλάξτε το μέγεθός της.
ko: DOS나 윈도우 등 다른 운영체제와 데비안이 공존하기를 원하신다면 원 운영체제가 사용하는 파티션의 크기를 조정해야 할 수도 있습니다. 설치프로그램을 통하여 FAT와 NTFS형 파티션의 크기를 조정하실 수 있습니다. 설치 프로그램의 파티션하기 단계에서 수동 파티션을 선택한 다음 이미 존재하는 파티션의 크기를 조정하시면 됩니다.
pt: Se tem outro sistema operativo existente tal como o DOS ou Windows e quer preservá-lo durante a instalação do Debian, irá precisar de redimensionar as partições de modo a libertar espaço para para a instalação do Debian. O instalador suporta o redimensionamento de ambos os sistemas de ficheiros, FAT e NTFS; Quando chegar à fase de particionamento, seleccione a opção para particionar manualmente e depois simplesmente escolha a partição existente e altere o seu tamanho.
ru: Если у вас есть другие операционные системы, например DOS или Windows и вы хотите сохранить их, то может потребоваться изменить размеры их разделов, чтобы освободить больше пространства для Debian. Программа установки может изменять размеры файловых систем FAT и NTFS; на шаге разметки выберите разметку вручную и затем просто выберите нужный раздел и измените его размер.
zh_cn: 如果您已经有 DOS 或 Windows 这样的其他操作系统存在，并想在安装 Debian 时保留它们，您应该重新设置分区大小，释放更多的空间给 Debian 安装程序。安装程序支持 FAT 和 NTFS 文件系统的尺寸修改；当您走到安装程序的分区步骤，选择手动分区，只需选择该分区，并更改其尺寸。
zh_tw: 如果您已經有其他作業系統存在，像是 DOS 或 Windows，而且想在安裝 Debian 時保留它們，您需要重新設置分割區大小，以釋放更多的空間給 Debian 安裝。安裝程式支援重新修改 FAT 和 NTFS 檔案系統的大小﹔當您進行到安裝程式的分割區步驟，選擇手動分割後只需選擇該分割區，即可更改其大小。

source: The PC BIOS generally adds additional constraints for disk partitioning. There is a limit to how many <quote>primary</quote> and <quote>logical</quote> partitions a drive can contain. Additionally, with pre 1994&ndash;98 BIOSes, there are limits to where on the drive the BIOS can boot from. More information can be found in the <ulink url="&url-partition-howto;">Linux Partition HOWTO</ulink> and the <ulink url="&url-phoenix-bios-faq-large-disk;">Phoenix BIOS FAQ</ulink>, but this section will include a brief overview to help you plan most situations.
el: Το BIOS του PC προσθέτει γενικά επιπλέον περιορισμούς στην διαμέριση των δίσκων. Υπάρχει ένα όριο στο πόσες <quote>κύριες</quote> και <quote>λογικές</quote> κατατμήσεις μπορεί να περιέχει ένας δίσκος. Επιπλέον, για BIOS προγενέστερα από το 1994&ndash;98 υπάρχουν περιορισμοί σχετικά με το σημείο του δίσκου από όπου μπορεί να εκκινήσει το BIOS. Περισσότερες πληροφορίες μπορούν να βρεθούν στο <ulink url="&url-partition-howto;">Linux Partition HOWTO</ulink> και το <ulink url="&url-phoenix-bios-faq-large-disk;">Phoenix BIOS FAQ</ulink>, αλλά αυτή η ενότητα περιέχει μια σύντομη επισκόπηση που θα σας βοηθήσει για να ένα σχεδιασμό στις περισσότερες περιπτώσεις.
ko: PC의 BIOS도 디스크를 파티션하는데 각종 제약을 둡니다. 일단 하나의 드라이브에 둘 수 있는 <quote>주파티션</quote>과 <quote>논리파티션</quote>의 개수에 한계가 있습니다. 또한 1994&dash;98년 이전의 BIOS에는 부팅이 가능한 파티션의 위치에도 제약이 있습니다. 자세한 내용은 <ulink url="&url-partition-howto;">리눅스 파티션하기 HOWTO</ulink> 와 <ulink url="&url-phoenix-bios-faq-large-disk;">Phoenix BIOS FAQ</ulink>를 참조하시면 됩니다만, 이 단원에서 기초적인 내용은 배우실 수 있습니다.
pt: A BIOS do PC geralmente adiciona limitações adicionais ao particionamento do disco. Existe um limite de número de partições <quote>primárias</quote> e <quote>lógicas</quote> que um disco pode conter. Adicionalmente, com BIOS anteriores a 1994&ndash;98, existem limites sobre onde na drive a BIOS pode arrancar. Poderá encontrar mais informação no <ulink url="&url-partition-howto;">Linux Partition HOWTO</ulink> e em <ulink url="&url-phoenix-bios-faq-large-disk;">Phoenix BIOS FAQ</ulink>, mas esta secção irá incluir uma vista geral breve para ajudá-lo a planear a maioria das situações.
ru: PC BIOS обычно накладывает дополнительные ограничения на дисковую разметку. Есть ограничение на количество <quote>первичных</quote> и <quote>логических</quote> разделов, которые может содержать диск. Также, в BIOS 1994&ndash;98 годов, есть ограничения, откуда BIOS может производить загрузку. Подробную информацию можно найти в <ulink url="&url-partition-howto;">Разметка в Linux HOWTO</ulink> и <ulink url="&url-phoenix-bios-faq-large-disk;">Phoenix BIOS FAQ</ulink>, но в этом разделе будет дано краткое описание, которое поможет во многих ситуациях.
zh_cn: PC BIOS 一般会对磁盘分区加入一些约束。比如一个磁盘驱动可以含有多少个<quote>主</quote>分区和<quote>逻辑</quote>分区。在 1994$ndash;98 年的 BIOS 里，还有关于 BIOS 能够从什么地方引导的限制。详细的信息可以在 <ulink url="&url-partition-howto;">Linux Partition HOWTO</ulink> 以及 <ulink url="&url-phoenix-bios-faq-large-disk;">Phoenix BIOS FAQ</ulink> 中找到。但是这一节将包含一个简单的介绍，来帮助在大部分情况下进行规划。
zh_tw: PC BIOS 一般會對磁碟分割區加入一些限制。比如說一個磁碟可以包含多少個 <quote>主 (primry)</quote> 和 <quote>邏輯</quote>分割區。在 1994&mdash;1998 年的 BIOS 裡， BIOS 能夠從什麼地方開機還受到限制。詳細資訊可以在 <ulink url="&url-partition-howto;">Linux Partition HOWTO</ulink> 以及 <ulink url="&url-phoenix-bios-faq-large-disk;">Phoenix BIOS 常見問答集</ulink>中找到。但是這一節會有一個簡單的介紹，來幫助在大部分情況下進行規劃。

source: <quote>Primary</quote> partitions are the original partitioning scheme for PC disks. However, there can only be four of them. To get past this limitation, <quote>extended</quote> and <quote>logical</quote> partitions were invented. By setting one of your primary partitions as an extended partition, you can subdivide all the space allocated to that partition into logical partitions. You can create up to 60 logical partitions per extended partition; however, you can only have one extended partition per drive.
el: Οι <quote>κύριες</quote> κατατμήσεις είναι το αρχικό σχήμα διαμέρισης για δίσκους σε PC. Όμως μπορούν να υπάρχουν μόνο μέχρι τέσσερις από αυτές. Για να ξεπεραστεί αυτός ο περιορισμός εφευρέθηκαν οι <quote>εκτεταμένες</quote> και οι <quote>λογικές</quote> κατατμήσεις. Καθιστώντας μια από τις κύριες κατατμήσεις σας σαν εκτεταμένη, μπορείτε να υποδιαιρέσετε ολόκληρο το χώρο που αποδίδετε στην κατάτμηση αυτή σε λογικές κατατμήσεις. Μπορείτε να δημουργήσετε μέχρι 60 λογικές κατατμήσεις για κάθε εκτεταμένη κατάτμηση, μπορείτε όμως να έχετε μόνο μια εκτεταμένη κατάτμηση για κάθε δίσκο.
ko: <quote>주파티션</quote>은 PC용 디스크에서 전통적으로 사용하던 파티션 방식입니다만, 이 방식으로는 파티션을 4개만 둘 수 있습니다. 이 한계를 벗어나기 위해 <quote>확장파티션</quote>과 <quote>논리파티션</quote>이라는 개념이 만들어졌습니다. <quote>주파티션</quote> 하나를 <quote>확장파티션</quote>으로 두면 그 파티션의 공간을 최대 60개의 논리파티션으로 나눌 수 있습니다. 하지만 하나의 디스크에는 <quote>확장파티션</quote>을 하나만 둘 수 있습니다.
pt: Partições <quote>Primárias</quote> são o esquema de particionamento original para discos em PC. Contudo, apenas poderão existir 4. Para ultrapassar esta limitação, foram inventadas partições <quote>estendidas</quote> e <quote>lógicas</quote>. Ajustando uma das suas partições primárias como partição estendida, pode subdivir todo o espaço alocado a essa partição em partições lógicas. Pode criar até 60 partições lógicas por partição estendida; contudo, apenas pode ter uma única partição estendida por disco.
ru: <quote>Первичные</quote> разделы присутствовали в первоначальной схеме разметки дисков на PC. Однако, их может быть только четыре. Чтобы обойти это ограничение, были придуманы <quote>расширенные</quote> и <quote>логические</quote> разделы. Пометив один из первичных разделов как расширенный, вы можете поделить всё его пространство на логические разделы. Вы можете создать до 60 логических разделов на расширенном разделе; однако, вы можете иметь только один расширенный раздел на диске.
zh_cn: <quote>Primary</quote> 分区是 PC 磁盘上最原始的分区方案。但是，每个磁盘只能含有四个主分区。为了突破这个限制，发明了 <quote>拓展 (extended)</quote> 以及 <quote> 逻辑 </quote> 分区。通过设置一个主分区为拓展分区，您可以把它相关的分区划分成逻辑分区。您最多可以为每个拓展分区分配多至 60 逻辑驱动器；但是每个磁盘您只能含有一个扩展分区。
zh_tw: <quote>主</quote> 分割區是 PC 磁碟上最原始的分割區方式。但是，每個磁碟只能有四個主分區。為了突破這個限制，發明了 <quote>延伸 (extended)</quote> 以及 <quote> 邏輯 </quote> 分割區。將一個主分割區設定為延伸分割區，您可以將之分成許多邏輯分割區。每個延伸分割區最多可切割成 60 個邏輯分割區﹔但是每個磁碟只能有一個延伸分割區。

source: Linux limits the partitions per drive to 15 partitions for SCSI disks (3 usable primary partitions, 12 logical partitions), and 63 partitions on an IDE drive (3 usable primary partitions, 60 logical partitions). However the normal &debian; system provides only 20 devices for partitions, so you may not install on partitions higher than 20 unless you first manually create devices for those partitions.
el: Το Linux περιορίζει τις κατατμήσεις ανά δίσκο στις 15 κατατμήσεις για SCSI δίσκους (3 χρησιμοποιήσιμες κύριες και 12 λογικές κατατμήσεις) και 63 για ένα δίσκο IDE (3 χρησιμοποιήσιμες κύριες και 60 λογικές κατατμήσεις). Όμως ένα συνηθισμένο σύστημα &debian; παρέχει μόνο μέχρι 20 συσκευές για κατατμήσεις, οπότε δεν θα πρέπει να εγκαταστήσετε σε κατατμήσεις πάνω από την 20η αν δεν έχετε πριν δημιουργήσει χειροκίνητα συσκευές για αυτές τις κατατμήσεις.
ko: 리눅스는 파티션의 개수를 SCSI 디스크는 파티션 15개(주파티션 3개, 논리파티션 12개), IDE 디스크에는 63개(주파티션 3개, 논리파티션 60개)로 제한하고 있습니다. 하지만 일반적인 &debian; 시스템은 기본으로 파티션용 디바이스를 20개만 제공하므로 20개보다 많은 파티션을 두고자 할 경우에는 직접 파티션용 디바이스를 추가하셔야 합니다.
pt: Linux limita as partições por dispositivo a 15 partições para discos SCSI (3 usadas como partições primárias, 12 partições lógicas), e 63 partições num dispositivo IDE (3 usadas como partições primárias, 60 partições lógicas). Contudo o normal no sistema &debian; é fornecer apenas 20 dispositivos por partição, não poderá portanto instalar mais que 20 numa partição a menos que primeiro crie manualmente dispositivos para essas partições.
ru: Linux ограничивает количество разделов до 15 на SCSI дисках (3 первичных раздела, 12 логических разделов), и 63 раздела на IDE дисках (3 первичных раздела, 60 логических разделов). Однако, обычная система &debian; предоставляет только 20 устройств под разделы, поэтому вы не сможете произвести установку на раздел выше чем 20, если только сначала вручную не создадите устройства для этих разделов.
zh_cn: 对于 SCSI 来说，Linux 限制每个驱动器最多有 15 个分区(3 个可用的主分区，12 个逻辑分区)。对于 IDE 来说可以有 63 个分区(3 个可用的主分区，60 个逻辑分区)。但是对于正常的 &debian; 版本来说，系统只支持 20 个分区设备，因此您可能不能安装超过 20 个的分区，除非您为这些首先手工创建了设备文件。
zh_tw: 對於 SCSI 來說，Linux 限制每個磁碟最多有 15 個分割區( 3 個可用的主分割區，12 個邏輯分割區)。對於 IDE 來說可以有 63 個分割區( 3 個可用的主分割區， 60 個邏輯分割區)。但是通常 &debian; 系統只支持 20 個分割區裝置，因此您不能安裝超過 20 個的分割區，除非您先為這些分割區手動建立裝置檔案。

source: If you have a large IDE disk, and are using neither LBA addressing, nor overlay drivers (sometimes provided by hard disk manufacturers), then the boot partition (the partition containing your kernel image) must be placed within the first 1024 cylinders of your hard drive (usually around 524 megabytes, without BIOS translation).
el: Αν έχετε έναν μεγάλο δίσκο IDE και δεν χρησιμοποιείτε ούτε διευθυνσιοδότηση LBA ούτε υπερκάλυψη δίσκων (οδηγών) (που μερικές φορές παρέχεται από μερικούς κατασκευαστές σκληρών δίσκων) τότε η κατάτμηση εκκίνησης (η κατάτμηση που περιέχει την εικόνα του πυρήνα) θα πρέπει να τοποθετηθεί στους πρώτους 1024 κυλίνδρους του σκληρού σας δίσκου (συνήθως γύρω στα 524ΜΒ χωρίς την μετάφραση από το BIOS).
ko: 대용량 IDE 디스크를 사용하고, LBA 어드레싱이나 일부 하드디스크 제조사에서 제공하는 오버레이 드라이버를 사용하지 않을 경우 커널을 포함하고 있는 부트파티션의 위치에도 제약이 있습니다. 부트파티션은 맨앞 1024 실린더, BIOS의 주소변환 없이는 맨앞 524 MB에 둬야 합니다.
pt: Se tem um disco IDE de grande capacidade, e não está a utilizar nem endereçamento LBA nem drivers overlay (por vezes fornecidos pelos fabricantes de discos rígidos), então a partição de arranque (a partição que contém a sua imagem de kernel) tem de ser colocada dentro dos primeiros 1024 cilindros do seu disco rígido (por norma cerca de 524 megabytes, sem a tradução BIOS).
ru: Если вы имеете большой IDE диск и не используете ни LBA адресацию, ни драйвера поддержки (иногда предоставляемого производителем жёсткого диска), то загрузочный раздел (раздел, содержащий образ ядра) должен располагаться в пределах первых 1024 цилиндров жёсткого диска (обычно, это 524 мегабайта без BIOS трансляции).
zh_cn: 如果您有一个巨大的 IDE 磁盘，并且既没有使用 LBA 寻址，也没有扩展驱动器(硬盘制造商有时候提供此功能)，那么引导分区(含有您内核映像的分区)必须放置在硬盘第一个 1024 柱面内。(在没有 BIOS 转换的情况下，大约有 524MB)。
zh_tw: 如果您有一個很大的 IDE 磁碟，既沒有使用 LBA 定址，也沒有 overlay 驅動程式 (硬碟製造商有時候提供此功能)，那麼開機分割區 (含有您核心映像的分割區) 必須放置在硬碟第一個 1024 磁柱內。(在沒有 BIOS 轉換的情況下，大約有 524MB)。

source: This restriction doesn't apply if you have a BIOS newer than around 1995&ndash;98 (depending on the manufacturer) that supports the <quote>Enhanced Disk Drive Support Specification</quote>. Both Lilo, the Linux loader, and Debian's alternative <command>mbr</command> must use the BIOS to read the kernel from the disk into RAM. If the BIOS int 0x13 large disk access extensions are found to be present, they will be utilized. Otherwise, the legacy disk access interface is used as a fall-back, and it cannot be used to address any location on the disk higher than the 1023rd cylinder. Once Linux is booted, no matter what BIOS your computer has, these restrictions no longer apply, since Linux does not use the BIOS for disk access.
el: Αυτός ο περιορισμός δεν υφίσταται αν έχετε ένα BIOS μεταγενέστερπ από το 1995&ndash;98 (ανάλογα με τον κατασκευαστή) που υποστηρίζει τον προσδιορισμό <quote>Enhanced Disk Drive Support Specification</quote>. Τόσο το LILO, o φορτωτής εκκίνησης του Linux, όσο και το εναλλακτικό <command>mbr</command> του Debian θα πρέπει να χρησιμοποιήσουν το BIOS για να διαβάσουν τον πυρήνα από τον δίσκο στην μνήμη RAM. Αν οι επεκτάσεις int 0x13 του BIOS για την πρόσβαση μεγάλων δίσκων είναι παρούσες θα χρησιμοποιηθούν. Διαφορετικά, το παλιότερο interface πρόσβασης δίσκου θα χρησιμοποιηθεί σαν λύση ασφαλείας, που δεν μπορεί να χρησιμοποιηθεί για την διευθυνσιοδότηση οποιουδήποτε μέρους του δίσκου πέρα από τον 1023ο κύλινδρο. Από την στιγμή της εκκίνησης του Linux όμως όλοι αυτοί οι περιορισμοί δεν ισχύουν πια αφού το Linux δεν χρησιμοποιεί το BIOS για την πρόσβαση των δίσκων.
ko: 이 제약은 제조사에 따라 1995&ndash;98년도 이후에 만들어진 BIOS에는 적용되지 않습니다. 이들 BIOS는 <quote>향상된 디스크 드라이브 지원을 위한 스펙</quote>에 맞추어서 제조되었습니다. 리눅스 로더인 LILO와 데비안 고유의 <command>mbr</command> 모두 디스크에서 램으로 커널을 읽어들일 때 BIOS의 지원을 필요로 합니다. BIOS가 대용량 디스크 접근용 확장 명령어인 int 0x13을 지원하지 않으면 구형의 디스크 접근 인터페이스가 사용될 것입니다. 이 접근 인터페이스는 1023번째 실린더 이후의 실린더에 접근하지 못합니다. 일단 리눅스가 부팅된다면 디스크 접근에 BIOS가 사용되지 않으므로 이런 제약이 없어집니다.
pt: Esta restrição não se aplica se tiver uma BIOS mais recente que 1995&ndash;98 (dependendo do fabricante) que suporte a <quote>Enhanced Disk Drive Support Specification</quote>. Quer o Lilo, o gestor de arranque do Linux, e a alternativa do Debian <command>mbr</command> têm de utilizar a BIOS para ler o kernel do disco para a RAM. Se as extensões para o acesso a discos de grandes dimensões da int 0x13 da BIOS estiverem presentes, serão utilizadas. Caso contrário, o interface antigo de acesso ao disco é utilizado como recurso, e não pode ser utilizado para endereçar qualquer localização acima do 1023º cilindro. Uma vez o Linux iniciado, não interessa que BIOS o seu computador tem, estas restrições já não se aplicam mais, já que o Linux não utiliza a BIOS para acesso ao disco.
ru: Этого ограничения нет в BIOS новее 1995&ndash;98 годов (зависит от производителя), которые поддерживают <quote>Enhanced Disk Drive Support Specification</quote>. И Lilo, Linux загрузчик, и Debian альтернатива <command>mbr</command>, должны использовать BIOS для чтения ядра с диска в оперативную память. Если будет найдено расширение прерывания BIOS int 0x13 доступа к диску, то оно будет использовано. Иначе, будет использован обычный старый интерфейс доступа к диску, и не будут использованы адреса, расположенные на диске за 1023-им цилиндром. После загрузки Linux, неважно какой BIOS имеется в компьютере, эти ограничения больше не действуют, так как Linux не использует BIOS для доступа к диску.
zh_cn: 如果您的 BIOS 在 1995&ndash;98 年之后出现(取决于制造商)并且支持 <quote>Enhanced Disk Drive Support Specification</quote>，这个限制并不有效。Lilo 引导器和 Debian 的 <command>mbr</command> 都必须使用 BIOS 来从磁盘读取内核至内存。如果 BIOS int 0x13 大硬盘访问拓展被打开，则将被使用。否则会使用旧的传统磁盘访问界面，并且它不能找到任何大于 1023 的柱面。一旦 Linux 被引导后，不管您的计算机 BIOS 是什么，这些限制将不再起任何作用，因为 Linux 并不使用 BIOS 来进行磁盘寻址。
zh_tw: 如果您的 BIOS 在 1995&mdash;1998 年之後出產(取決於製造商)且支援 <quote>Enhanced Disk Drive Support Specification</quote> 則不受限。 Lilo ， Linux Loader 以及 Debian 的替代方案 <command>mbr</command> 必須使用 BIOS 從磁碟讀取核心至記憶體。如果開啟 BIOS int 0x13 高容量硬碟的存取功能，則將被使用，否則合法的磁碟存取界面會拿來當備用方式，而且它不能定址任何大於 1023rd 磁柱的位置。一旦 Linux 啟動後，不管電腦的 BIOS 哪一種，這些限制將不再起任何作用，因為 Linux 不使用 BIOS 來存取硬碟。
