Repository: xobs/debian-installer
Catalog: doc/manual/po/*/partitioning.po
Languages: el, ko, pt, ru, zh_cn, zh_tw

source: Linux represents the primary partitions as the drive name, plus the numbers 1 through 4. For example, the first primary partition on the first IDE drive is <filename>/dev/hda1</filename>. The logical partitions are numbered starting at 5, so the first logical partition on that same drive is <filename>/dev/hda5</filename>. Remember that the extended partition, that is, the primary partition holding the logical partitions, is not usable by itself. This applies to SCSI disks as well as IDE disks.
el: Το Linux αναπαριστά τις κύριες κατατμήσεις με τα ονόματα των δίσκων μαζί με τους αριθμούς 1 έως 4. Για παράδειγμα, η πρώτη κύρια κατάτμηση στον πρώτο IDE δίσκο είναι <filename>/dev/hda1</filename>. Οι λογικές κατατμήσεις αριθμούνται ξεκινώντας από το 5, επομένως η πρώτη λογική κατάτμηση στον ίδιο δίσκο είναι <filename>/dev/hda5</filename>. Θυμηθείτε ότι η επεκταμμένη κατατμήση, δηλ. η κύρια κατάτμηση που κρατά τις λογικές κατατμήσεις δεν χρησιμοποιείται η ίδια. Αυτό ισχύει και για τους SCSI δίσκους όπως και για τους IDE.
ko: 리눅스 파티션은 드라이브 이름 뒤에 숫자 1에서 4를 붙여서 주파티션을 구분합니다. 예를 들어, 첫번째 IDE드라이브의 첫번째 파티션은 <filename>/dev/hda1</filename>입니다. 논리파티션은 5번부터 시작하므로, 이 드라이브의 첫번째 논리파티션은 <filename>/dev/hda5</filename>입니다. 논리파티션이 들어있는 확장파티션은 독자적으로 쓸 수 없습니다. 이는 SCSI 디스크, IDE디스크 모두에 적용되는 사실입니다.
pt: Linux representa a partição primária com o nome do dispositivo, mais os números de 1 a 4. Por exemplo, a primeira partição primária no primeiro dispositivo IDE é <filename>/dev/hda1</filename>. As partições lógicas são numeradas a partir do 5, portanto a primeira partição lógica na mesma drive tem o nome de <filename>/dev/hda5</filename>. Lembre-se que a partição extendida, isto é, a partição primária que tem partições lógicas, não é utilizada por ela própria. Isto aplica-se tanto aos discos SCSI como aos discos IDE.
ru: В Linux первичные разделы представляются как имя диска плюс число от 1 до 4. Например, первый первичный раздел первого IDE диска называется <filename>/dev/hda1</filename>. Логические разделы нумеруются начиная с 5, поэтому первый логический раздел на том же диске называется<filename>/dev/hda5</filename>. Помните, что это расширенный раздел, то есть первичный раздел содержащий логические разделы, сам по себе не использующийся. Это применимо и к дискам SCSI и к дискам IDE.
zh_cn: Linux 表示主分区为您的驱动器名称加上数字 1 到 4。例如，在第一个 IDE 驱动器上的第一个主分区是 <filename>/dev/hda1</filename>。逻辑驱动器将会从数字 5 开始，因此在相同驱动器上的第一个逻辑驱动器是 <filename>/dev/hda5</filename>。记住扩展分区，也就是含有逻辑驱动器的主分区本身将不可用。这个规则对 SCSI 也同样适用。
zh_tw: Linux 以主分割區為您的磁碟名稱再加上數字 1 到 4。例如，在第一個 IDE 磁碟上的第一個主分區是 <filename>/dev/hda1</filename>。邏輯分割區將會從數字 5 開始，因此在此磁碟的第一個邏輯分割區是 <filename>/dev/hda5</filename>。記住延伸分割區，意即含有邏輯分割區的主分割區本身將不可用。這個規則同樣適用於 SCSI 。

source: VMEbus systems using the TEAC FC-1 SCSI floppy drive will see it as normal SCSI disk. To make identification of the drive simpler the installation software will create a symbolic link to the appropriate device and name it <filename>/dev/sfd0</filename>.
el: Τα συστήματα VMEbus που χρησιμοποιούν τις SCSI συσκευές δισκέττας TEAC FC-1 θα τις δουν σαν έναν κανονικό SCSI δίσκο. Για να κάνει απλούστερη την ταυτοποίηση της συσκευής το λογισμικό της εγκατάστασης θα δημιουργήσει έναν συμβολικό σύνδεσμο στην κατάλληλη συσκευή με το όνομα <filename>/dev/sfd0</filename>.
ko: VMEbus 시스템에서 TEAC FC-1 SCSI 플로피 드라이브는 일반적인 SCSI 디스크로 인식될 것입니다. 설치 프로그램은 이 디스크 드라이브를 알아보기 쉽게 하기 위하여 적절한 디바이스와 연결되는 심볼릭 링크<filename>/dev/sfd0</filename>를 만들 것입니다.
pt: Os sistemas VMEbus utilizando o dispositivo de disquetes TEAC FC-1 SCSI irá reconhece-lo como um disco SCSI normal. Para tornar mais simples a identificação dos dispositivos, o instalador irá criar um symbolic link para o dispositivo apropriado e dar-lhe-á o nome de <filename>/dev/sfd0</filename>.
ru: Системы VMEbus использующие TEAC FC-1 SCSI дисковод гибких дисков видится как обычный SCSI. Чтобы упростить идентификацию этого дисковода, программа установки создаст символическую ссылку на соотвествующее устройство с именем<filename>/dev/sfd0</filename>.
zh_cn: VMEbus 系统使用的 TEAC FC-1 SCSI 软盘驱动器将被看成正常的 SCSI 磁盘。为了让驱动器辨认更强容易安装软件将创建一个符号链接至合适的设备并且称为 <filename>/dev/sfd0</filename>。
zh_tw: VMEbus 系統使用的 TEAC FC-1 SCSI 軟碟將被看成正常的 SCSI 磁碟。為了讓磁碟辨認更容易，安裝軟體將建立一個符號連結至合適的裝置並且稱為 <filename>/dev/sfd0</filename>。

source: Sun disk partitions allow for 8 separate partitions (or slices). The third partition is usually (and is preferred to have) the <quote>Whole Disk</quote> partition. This partition references all of the sectors of the disk, and is used by the boot loader (either SILO, or Sun's).
el: Οι κατατμήσεις δίσκων Sun επιτρέπουν μέχρι 8 ξεχωριστές κατατμήσεις (ή τεμάχια, slices). H τρίτη κατάτμηση είναι συνήθως (και αυτό είναι το προτιμητέο) η κατάτμηση <quote>Ολόκληρος ο Δίσκος</quote>. Η κατάτμηση αυτή έχει τις αναφορές όλων των τομέων του δίσκου και χρησιμοποιείται από τον φορτωτή εκκίνησης (είτε το SILO είτε αυτόν της Sun).
ko: Sun 디스크 파티션은 8개의 분리된 파티션(또는 슬라이스)를 지원합니다만 대부분 세번째 파티션에 <quote>디스크 전부</quote>를 할당합니다. 이 파티션은 디스크의 모든 섹터를 포괄하며, SILO나 Sun의 부트로더에서 사용됩니다.
pt: Partições de disco Sun permitem 8 partições separadas (ou slices). A terceira partição é normalmente (e é preferível que tenha) a partição <quote>Whole Disk</quote>. Esta partição referencia todos os sectores do disco e é usada pelo gestor de arranque (seja o SILO ou o da Sun).
ru: На дисках Sun можно создать 8 отдельных разделов (или слайсов). Третий раздел обычно (и желательно так делать) является разделом типа <quote>весь диск</quote>. Этот раздел указывает на все сектора диска, и используется системным загрузчиком (или SILO или от Sun).
zh_cn: Sun 磁盘分区允许8个独立的分区(或者片)。第三个分区通常是(一般也被建议设置为)<quote>Whole Disk</quote>分区。这个分区代表磁盘上所有的扇区，并且将被启动引导器(SILO 或者 SUN 的)使用。
zh_tw: Sun 磁碟分割區允許 8 個獨立的分割區(或者片)。第三個分割區通常(一般也是)<quote>整個磁碟</quote>分割區。這個分割區代表磁碟上所有的磁區，並且將被 boot loader (SILO 或者 SUN 的)使用。

source: The partitions on each disk are represented by appending a decimal number to the disk name: <filename>dasda1</filename> and <filename>dasda2</filename> represent the first and second partitions of the first DASD device in your system.
el: Οι κατατμήσεις σε κάθε δίσκο αναπαρίστανται παραθέτοντας ένα δεκαδικό ψηφίο στο όνομα του δίσκου: <filename>dasda1</filename> και <filename>dasda2</filename> αναπαριστούν την πρώτη και την δεύτερη κατάτμηση του πρώτου δίσκου DASD στο σύστημά σας.
ko: 각 디스크의 파티션은 디스크 이름에 십진수 숫자를 붙여서 나타냅니다. 예를 들어 <filename>dasda1</filename> 와 <filename>dasda2</filename>는 각각 시스템에 설치된 첫번째와 두번째 DASD 디바이스를 가리킵니다.
pt: As partições em cada disco são representadas acrescentando-se um número decimal ao nome do disco: <filename>dasda1</filename> e <filename>dasda2</filename> representam a primeira e a segunda partição do primeiro dispositivo DASD no seu sistema.
ru: Имена разделов диска получаются добавлением к имени диска десятичного числа: <filename>dasda1</filename> и <filename>dasda2</filename> представляют первый и второй раздел первого устройства DASD в системе.
zh_cn: 每个磁盘的分区名的显示，是通过在磁盘名称后面附加一个十进制数字： <filename>dasda1</filename> 以及 <filename>dasda2</filename> 表示您系统上第一个 DASD 设备的第一个以及第二个分区。
zh_tw: 每個磁碟的分割區名字，是在磁碟名稱後面加一個十進制數字： <filename>dasda1</filename> 以及 <filename>dasda2</filename> 表示您系統上第一個 DASD 裝置的第一個以及第二個分區。

source: Debian Partitioning Programs
el: Προγράμματα Διαμέρισης στο Debian
ko: 데비안의 파티션용 프로그램
pt: Programas de Particionamento Debian
ru: Программы разметки в Debian
zh_cn: Debian 分区程序
zh_tw: Debian 分割程式

source: Several varieties of partitioning programs have been adapted by Debian developers to work on various types of hard disks and computer architectures. Following is a list of the program(s) applicable for your architecture.
el: Μια ποικιλία προγραμμάτων διαμέρισης έχουν προσαρμοστεί από τους προγραμματιστές του Debian ώστε να δουλεύουν σε διάφορους τύπους δίσκων και αρχιτεκτονικών υπολογιστών.
ko: 여러가지 하드디스크와 시스템 종류에 맞게 데비안의 개발자들이 여러 종류의 파티션 프로그램을 개발했습니다. 아래에 시스템에 따른 파티션 프로그램의 목록을 열거하였습니다.
pt: Diversas variedades de programas de particionamento foram adaptados pelos Debian developers para funcionar com vários tipos de discos rígidos e arquitecturas de computadores. De seguida está uma lista de programa(s) para a sua arquitectura.
ru: Несколько разновидностей программ разметки были адаптированы разработчиками Debian для работы с различными типами жёстких дисков и компьютерных архитектур. Программы из списка ниже могут работать на вашей машине.
zh_cn: Debian 开发人员配置了几种在不同硬盘和不同体系结构上的分区程序。下面是一个适合您的结构的程序列表。
zh_tw: Debian 開發人員配置了幾種在不同硬碟及電腦架構上的分割區程式。下面是一個適合您的架構的程式列表。

source: Recommended partitioning tool in Debian. This swiss army knife can also resize partitions, create filesystems <phrase arch="i386"> (<quote>format</quote> in Windows speak)</phrase> and assign them to the mountpoints.
el: Συνιστώμενο εργαλείο διαμέρισης στο Debian. Αυτό το εργαλείο για κάθε χρήση (swiss army knife) μπορεί επίσης να αλλάξει το μέγεθος των κατατμήσεων, να δημιουργήσει συστήματα αρχείων <phrase arch="i386"> (<quote>format</quote> στην γλώσσα των Windows)</phrase> και να τις αντιστοιχεί στα διάφορα σημεία προσάρτησης.
ko: 데비안에서 권장하는 파티션용 프로그램. 이 만능 프로그램으로 파티션의 크기를 조정하며, 파일시스템을 생성하고 <phrase arch="i386"> (윈도우에서 말하는 <quote>포맷</quote>)</phrase>, 마운트 위치도 설정할 수 있습니다.
pt: Ferramenta de particionamento recomendada em Debian. Este canivete suíço também pode redimensionar partições, criar sistemas de ficheiros <phrase arch="i386"> (<quote>format</quote> na linguagem Windows)</phrase> e atribuir-lhes pontos de montagem.
ru: Рекомендуемая утилита разметки в Debian. Этот швейцарский армейский нож может также изменять размеры разделов, создавать файловые системы <phrase arch="i386"> (<quote>format</quote> в Windows) </phrase> и назначать им точки монтирования.
zh_cn: 推荐的 Debian 分区工具。这个小而全的工具可以修改分区大小，创建文件系统 <phrase arch="i386">(在 Windows 下的说法是 <quote>format</quote>)</phrase> 以及联系分区至挂接点。
zh_tw: 這是我們建議的 Debian 分割區工具。這個小而全的工具可以修改分區大小，建立檔案系統 <phrase arch="i386">(在 Windows 下的說法是 <quote>format</quote>)</phrase> 並將分區連結至掛載點。

source: The original Linux disk partitioner, good for gurus.
el: Το πρώτο πρόγραμμα διαμέρισης δίσκων στο Linux, καλό για τους πολύ έμπειρους χρήστες.
ko: 전통적인 리눅스 파티션 프로그램으로, 전문가용.
pt: O particionador original do Linux, bom para gurus.
ru: Самая первая программа разметки дисков в Linux, хороша для гуру.
zh_cn: 原始版本的 Linux 磁盘分区工具，对于高手很好用。
zh_tw: 最早的 Linux 磁碟分割區工具，對高手來說很好用。

source: Be careful if you have existing FreeBSD partitions on your machine. The installation kernels include support for these partitions, but the way that <command>fdisk</command> represents them (or not) can make the device names differ. See the <ulink url="&url-linux-freebsd;">Linux+FreeBSD HOWTO</ulink>
el: Προσοχή χρειάζεται αν έχετε υπάρχουσες κατατμήσεις FreeBSD στο μηχάνημά σας. Οι πυρήνες της εγκατάστασης περιλαμβάνουν υποστήριξη για αυτές τις κατατμήσεις, αλλά ο τρόπος που το <command>fdisk</command> τις αναπαριστά (ή όχι) μπορεί να κάνει τα ονόματα των συσκευών.να διαφέρουν. Κοιτάξτε το <ulink url="&url-linux-freebsd;">Linux+FreeBSD HOWTO</ulink>.
ko: FreeBSD용 파티션이 디스크에 있을 경우엔 신중하셔야 합니다. 설치용 커널은 이 형식의 파티션들을 지원합니다만, <command>fdisk</command> 프로그램이 이들 파티션을 화면에 나타내는 방식이 달라질 수 있습니다. <ulink url="&url-linux-freebsd;">리눅스+FreeBSD HOWTO</ulink>를 참조하시면 보다 자세한 내용을 얻어실 수 있습니다.
pt: Cuidado se tem partições FreeBSD na sua máquina. O kernel de instalação inclui suporte para estas partições, mas a forma como o <command>fdisk</command> as representa (ou não) pode fazer com que os nomes dos dispositivos sejam diferentes. Veja <ulink url="&url-linux-freebsd;">Linux+FreeBSD HOWTO</ulink>
ru: Будьте осторожны, если у вас на машине есть разделы FreeBSD. В устанавливаемые ядра включена поддержка этих разделов, но метод, которым <command>fdisk</command> их отображает (или нет) может отличаться. Смотрите <ulink url="&url-linux-freebsd;">Linux+FreeBSD HOWTO</ulink>
zh_cn: 这里注意，如果您的机器上有一个 FreeBSD 分区。安装内核将包括这些分区的支持，但是 <command>fdisk</command> 表示他们的设备名称方式可能有所不同(也可能不是)。请参照 <ulink url="&url-linux-freebsd;">Linux+FreeBSD HOWTO</ulink>
zh_tw: 請注意如果您的機器上有一個既存 FreeBSD 分區。安裝核心將包括對這些分割區的支援，但是 <command>fdisk</command> 裝置名稱的表示方式可能有所不同(也可能不是)。請參照 <ulink url="&url-linux-freebsd;">Linux+FreeBSD HOWTO</ulink>

source: A simple-to-use, full-screen disk partitioner for the rest of us.
el: Ένα απλό στην χρήση, πλήρους-οθόνης πρόγραμμα διαμέρισης για τους υπόλοιπους από μας.
ko: 대부분의 사람들을 위한 풀스크린 파티션 프로그램.
pt: Um particionador de disco de ecrã inteiro de simples utilização para o resto de nós.
ru: Простая в использовании, полноэкранная программа разметки дисков для повседневного использования.
zh_cn: 一个简单易用，给其它人使用的是全屏幕磁盘分区程序。
zh_tw: 一個簡單易用，給其它人使用的是全螢幕磁碟分割區程式。

source: Note that <command>cfdisk</command> doesn't understand FreeBSD partitions at all, and, again, device names may differ as a result.
el: Σημειώστε ότι το <command>cfdisk</command> δεν αναγνωρίζει κατατμήσεις FreeBSD καθόλου, και σαν αποτέλεσμα τα ονόματα μπορεί επίσης να διαφέρουν.
ko: 참고로 <command>cfdisk</command>는 FreeBSD파티션을 전혀 인식하지 못하기 때문에 디바이스의 이름이 예상과 달라질 수 있습니다.
pt: Note que <command>cfdisk</command> não compreende de todo partições FreeBSD, e, novamente, como resultado os nomes dos dispositivos podem ser diferentes.
ru: Заметим, что <command>cfdisk</command> не понимает разделов FreeBSD, и ещё раз, поэтому имена устройств могут различаться.
zh_cn: 请注意 <command>cfdisk</command> 完全不了解 FreeBSD 的分区，因此，再一次设备名称可能最后有所不同。
zh_tw: 請注意 <command>cfdisk</command> 完全不瞭解 FreeBSD 的分割區，而且裝置名稱也可能有所不同。

source: Atari-aware version of <command>fdisk</command>.
el: Έκδοση του <command>fdisk</command>για Atari.
ko: Atari용 <command>fdisk</command>입니다.
pt: Versão do <command>fdisk</command> que reconhece Atari.
ru: Версия <command>fdisk</command> для Atari.
zh_cn: Atari 版本的 <command>fdisk</command>。
zh_tw: Atari-aware 版本的 <command>fdisk</command>。

source: Amiga-aware version of <command>fdisk</command>.
el: Έκδοση του <command>fdisk</command>για Amiga.
ko: Amiga용 <command>fdisk</command>입니다.
pt: Versão do <command>fdisk</command> que reconhece o Amiga
ru: Версия <command>fdisk</command> для Amiga.
zh_cn: Amiga-aware 版本的 <command>fdisk</command>。
zh_tw: Amiga-aware 版本的 <command>fdisk</command>。

source: Mac-aware version of <command>fdisk</command>.
el: Έκδοση του <command>fdisk</command>για Mac.
ko: 매킨토시용 <command>fdisk</command>입니다.
pt: Versão do <command>fdisk</command> que reconhece Mac.
ru: Версия <command>fdisk</command> для Mac.
zh_cn: Mac-aware 版本的 <command>fdisk</command>。
zh_tw: Mac-aware 版本的 <command>fdisk</command>。

source: PowerMac-aware version of <command>fdisk</command>, also used by BVM and Motorola VMEbus systems.
el: Έκδοση του <command>fdisk</command>για PowerMac, που χρησιμοποιείται επίσης σε συστήματα BVM και Motorola VMEbus.
ko: PowerMac용 <command>fdisk</command>로, BVM과 모토롤라 VMEbus 시스템에서도 사용하실 수 있습니다.
pt: Versão de <command>fdisk</command> para lidar com PowerMac, também utilizada por BVM e sistemas Motorola VMEbus.
ru: Версия <command>fdisk</command> для PowerMac также используется в системах BVM иMotorola VMEbus.
zh_cn: PowerMac 的 <command>fdisk</command>版本，同时也用于 BVM 以及 Motorola VMEbus 系统。
zh_tw: PowerMac版本的 <command>fdisk</command>，同時也用於 BVM 以及 Motorola VMEbus 系統。

source: &arch-title; version of <command>fdisk</command>; Please read the fdasd manual page or chapter 13 in <ulink url="http://oss.software.ibm.com/developerworks/opensource/linux390/docu/l390dd08.pdf"> Device Drivers and Installation Commands</ulink> for details.
el: Έκδοση του <command>fdisk</command> για την αρχιτεκτονική &arch-title; Παρακαλούμε διαβάστε την σελίδα χρήσης του fdasd ή το κεφάλαιο 13 στο <ulink url="http://oss.software.ibm.com/developerworks/opensource/linux390/docu/l390dd08.pdf"> Device Drivers and Installation Commands</ulink> για λεπτομέρειες.
ko: <command>Fdisk</command>명령어의 &arch-title; 버전; 자세한 내용을 위해서는 fdasd 매뉴얼 페이지나 <ulink url="http://oss.software.ibm.com/developerworks/opensource/linux390/docu/l390dd08.pdf">디바이스 드라이버와 설치 명령어</ulink>를 참조하십시오.
pt: Versão de <command>fdisk</command> para &arch-title; por favor leia a página do manual fdasd ou o capítulo 13 em <ulink url="http://oss.software.ibm.com/developerworks/opensource/linux390/docu/l390dd08.pdf">Controladores de Dispositivos e Comandos de Instalação</ulink> para mais detalhes.
ru: Версия <command>fdisk</command> для &arch-title; ; Подробней читайте страницу руководства или главу 13 в <ulink url="http://oss.software.ibm.com/developerworks/opensource/linux390/docu/l390dd08.pdf">Драйвера устройств и команды установки</ulink>.
zh_cn: &arch-title; <command>fdisk</command> 的版本; 请阅读 <ulink url="fdasd.txt">fdasd 手册页</ulink>或者 <ulink url="http://oss.software.ibm.com/developerworks/opensource/linux390/docu/l390dd08.pdf"> Device Drivers and " "Installation Commands</ulink> 的第 13 章获得详细信息。
zh_tw: &arch-title; <command>fdisk</command> 的版本; 請閱讀 <ulink url="fdasd.txt">fdasd 手冊</ulink>或者 <ulink url="http://oss.software.ibm.com/developerworks/opensource/linux390/docu/l390dd08.pdf"> Device Drivers and " "Installation Commands</ulink> 的第 13 章獲得詳細資訊。

source: One of these programs will be run by default when you select <guimenuitem>Partition a Hard Disk</guimenuitem>. If the one which is run by default isn't the one you want, quit the partitioner, go to the shell (<userinput>tty2</userinput>) by pressing <keycap>Alt</keycap> and <keycap>F2</keycap> keys together, and manually type in the name of the program you want to use (and arguments, if any). Then skip the <guimenuitem>Partition a Hard Disk</guimenuitem> step in <command>debian-installer</command> and continue to the next step.
el: Ένα από τα προγράμματα αυτά θα χρησιμοποιηθεί αυτόματα ότα επιλέξετε την <guimenuitem>Διαμέριση σκληρού δίσκου</guimenuitem>. Αν το πρόγραμμα που τρέχει προεπιλεγμένα δεν είναι αυτό που θέλετε παραιτηθείτε από το πρόγραμμα διαμέρισης πηγαίνετε στο κέλυφος (στην κονσόλα <userinput>tty2</userinput>) πατώντας ταυτόχρονα τα πλήκτρα <keycap>Alt</keycap> και <keycap>F2</keycap> και πληκτρολογώντας το όνομα του προγράμματος που θέλετε να χρησιμοποιήσετε (και όποια άλλα ορίσματα πιθανόν). Στη συνέχεια παρακάμψετε το βήμα <guimenuitem>Διαμέριση σκληρού δίσκου</guimenuitem> στον <command>debian-installer</command> και συνεχίστε στο επόμενο βήμα.
ko: <guimenuitem>Partition a Hard Disk</guimenuitem>를 선택할 때 이 프로그램들 중 하나가 실행되게 됩니다. 디폴트로 실행되는 프로그램을 바꾸고자 할 경우 파티션 프로그램을 끝낸 후 <keycap>Alt</keycap>와 <keycap>F2</keycap>를 동시에 눌러서 쉘 프롬프트(<userinput>tty2</userinput>)로 가십시오. 그 다음 원하시는 프로그램을 인자와 함께 수동으로 실행시키십시오. 파티션이 끝났으면 다시 <command>debian-installer</command>로 돌아가서 <guimenuitem>Partition a Hard Disk</guimenuitem> 부분을 생략하시면 됩니다.
pt: Um destes programas será executado por omissão quando seleccionar <guimenuitem>Particionar Um Disco Rígido</guimenuitem>. Se o que é executado por omissão não é aquele que você pretende, saia do particionador, vá até uma consola (<userinput>tty2</userinput>) premindo a seguinte combinação de teclas <keycap>Alt</keycap> e <keycap>F2</keycap>, e manualmente digite o nome do programa que quer utilizar (e argumentos, se necessário). Saia então do passo de <guimenuitem>Particionar um Disco Rígido</guimenuitem> no <command>instalador Debian</command> e continue para o próximo passo.
ru: Одна из этих программ будет запущена по умолчанию при выборе <guimenuitem>Разметить жёсткий диск</guimenuitem>. Если запустилось не то что вы хотите, выйдите из программы разметки, перейдите в интерпретатор командной строки (<userinput>tty2</userinput>), нажав клавиши <keycap>Alt</keycap> и<keycap>F2</keycap> вместе, и вручную введите название программы, которой хотите воспользоваться (и аргументы, если надо). Затем пропустите шаг <guimenuitem>Разметить жёсткий диск</guimenuitem> в <command>debian-installer</command> и перейдите к следующему шагу.
zh_cn: 当您选择 <guimenuitem>对硬盘进行分区</guimenuitem> 时，程序之一将会运行。如果缺省运行的那个非您所希望，退出分区程序，在 shell (<userinput>tty2</userinput>) 下按下 <keycap>Alt</keycap> 以及 <keycap>F2</keycap>，并且手工输入您想使用的程序名称(以及可能的参数)。然后跳过 <guimenuitem>对硬盘进行分区</guimenuitem> 步骤至 <command>debian-installer</command> 并继续进行下一步。
zh_tw: 當您選擇 <guimenuitem>對硬碟進行分割</guimenuitem> 時，有一程式預設會啟動。如果預設啟動的那個不是您所想要的，退出分割區程式，在 shell (<userinput>tty2</userinput>) 下按下 <keycap>Alt</keycap> 以及 <keycap>F2</keycap>，並且手動輸入您想使用的程式名稱(以及可能的參數)。然後跳過 <guimenuitem>對硬碟進行分割</guimenuitem> 步驟至 <command>debian-installer</command> ，並繼續進行下一步。
