Repository: xobs/debian-installer
Catalog: doc/manual/po/*/partitioning.po
Languages: el, ko, pt, ru, zh_cn, zh_tw

source: The EFI Boot Manager and the EFI Shell fully support the GPT table so the boot partition does not necessarily have to be the first partition or even on the same disk. This is convenient if you should forget to allocate the partition and only find out after you have formatted the other partitions on your disk(s). The <command>partman</command> partitioner checks for an EFI partition at the same time it checks for a properly set up <emphasis>root</emphasis> partition. This gives you an opportunity to correct the disk layout before the package install begins. The easiest way to correct this omission is to shrink the last partition of the disk to make enough free space for adding an EFI partition.
el: O διαχειριστής Εκκίνησης EFI και το κέλυφος EFI υποστηρίζουν πλήρως τον πίνακα διαμέρισης GPT οπότε η κατάτμηση εκκίνησης δεν πρέπει απαραίτητα να είναι και η πρώτη κατάτμηση ούτε καν να βρίσκεται στον ίδιο δίσκο. Αυτό είναι βολικό αν ξεχάσετε να προσδιορίσετε τη θέση της κατάτμησης και το διαπιστώσετε μόνο αφού έχετε διαμορφώσει τις υπόλοιπες κατατμήσεις στον δίσκο σας. Το πρόγραμμα διαμέρισης <command>partman</command> ελέγχει για μια κατάτμηση EFI την ίδια στιγμή που ελέγχει για μια κανονικά διαμορφωμένη <emphasis>ριζική</emphasis> κατάτμηση. Αυτό σας δίνει την ευκαιρία να διορθώσετε την διάταξη των κατατμήσεων στο δίσκο πριν αρχίσει η εγκατάσταση των πακέτων. Ο ευκολότερος τρόπος για να διορθώσετε αυτή την παράλειψη είναι είναι να συρρικνώσετε την τελευταία κατάτμηση του δίσκου ώστε να δημιουργήσετε επαρκή ελεύθερο χώρο για την προσθήκη μιας κατάτμησης EFI.
ko: EFI 부트매니져와 EFI 쉘 모두 GPT 파티션 테이블을 지원하므로 부트파티션을 굳이 디스크의 맨 앞에 두거나 같은 디스크에 둬야 하지 않습니다. 이 말은 부트파티션을 깜빡하고 안한 상태에서 다른 파티션을 포맷했을 경우에도 문제가 없다는 뜻입니다. <command>Partman</command> 프로그램은 EFI 파티션이 있는지 확인하는 동시에 <emphasis>루트파티션</emphasis>이 제대로 설정되어 있는지를 확인해주어 패키지를 설치하기 전에 디스크의 구성을 고칠 수 있도록 해줍니다. 이 실수를 고치려면 디스크의 마지막 파티션의 크기를 조정하여 EFI형 파티션을 이 위치에 설정하면 됩니다.
pt: O gestor de arranque e a consola EFI suportam completamente a tabela GPT e por isso não é necessário que a partição de arranque seja a primeira partição nem que esteja no mesmo disco. Isto é conveniente se você se esquecer de alocar a partição e só descobrir depois de ter formatado as outras partições no(s) seu(s) disco(s). O particionador <command>partman</command> procura uma partição EFI ao mesmo tempo que procura uma partição devidamente configurada como <emphasis>root</emphasis>. Isto dá-lhe a oportunidade de corrigir a disposição do disco antes que a instalação de pacotes comece. A maneira mais simples de corrigir esta omissão é encolher a última partição do disco para perfazer espaço suficiente para adicionar uma partição EFI.
ru: Системный загрузчик EFI и оболочка EFI полностью поддерживают GPT таблицу, поэтому загрузочный раздел необязательно должен быть первым разделом или даже на первом диске. Это удобно, если вы забыли создать раздел, и выяснили это только после того как уже отформатировали другие разделы на жёстком диске(ах). Программа разметки <command>partman</command> проверяет EFI раздел одновременно с проверкой правильности <emphasis>корневого</emphasis> раздела. Это даёт вам возможность исправить разметку диска перед началом установки пакетов. Самый лёгкий способ исправить это упущение &mdash; уменьшить последный раздел диска, освободив достаточно свободного места для добавления раздела EFI.
zh_cn: 因为 EFI Boot Manager 以及 EFI Shell 完全支持 GPT 表格所以引导分区不需要一定是第一个分区，甚至可以不在本地磁盘上。这样方便您在格式化磁盘上的其它分区后再决定。<command>partman</command> 分区程序将在设置 <emphasis>root</emphasis> 分区时会同时检查一个 EFI 分区。这样您就有机会在开始安装软件包之前检查磁盘的布局。纠正这个问题的最简单的方法，是在最后一个分区末尾留下足够的磁盘空间，来加入一个 EFI 分区。
zh_tw: 因為 EFI Boot Manager 以及 EFI Shell 完全支援 GPT 表格所以開機分割區不一定需要是第一個分割區，甚至可以不在同個磁碟上。若你之前忘了分配分割區，這樣方便您在格式化磁碟上的其它分割區後再決定。<command>partman</command> 分割區程式將在設置 <emphasis>root</emphasis> 分割區時會同時檢查一個 EFI 分割區。這樣您就有機會在開始安裝套件之前檢查磁碟的排列方式。糾正這個問題的最簡單的方法，是在最後一個分割區末尾留下足夠的磁盤空間，來加入一個 EFI 分區。

source: It is strongly recommended that you allocate the EFI boot partition on the same disk as the <emphasis>root</emphasis> filesystem.
el: Συνίσταται έντονα να τοποθετήσετε την κατάτμηση εκκίνησης EFI στον ίδιο δίσκο που περιέχει και το <emphasis>ριζικό</emphasis> σύστημα αρχείων.
ko: EFI 부트 파티션과 <emphasis>루트파티션</emphasis>을 꼭 같은 디스크에 할당할 것을 권장합니다.
pt: É bastante recomendado que a partição de arranque EFI esteja no mesmo disco que o sistema de ficheiros <emphasis>root</emphasis>.
ru: Настоятельно рекомендуется создавать загрузочный раздел EFI на одном диске с <emphasis>корневой</emphasis> файловой системой.
zh_cn: 强烈建议您把 EFI 引导分区和 <emphasis>root</emphasis> 文件系统分配在同一个磁盘上。
zh_tw: 強烈建議您把 EFI 開機分割區和 <emphasis>root</emphasis> 檔案系統裝在同一個磁碟上。

source: EFI Diagnostic Partitions
el: Διαγνωστικές κατατμήσεις EFI
ko: EFI 검사용 파티션
pt: Partições de Diagnóstico EFI
ru: Разделы диагностики EFI
zh_cn: EFI 诊断分区
zh_tw: EFI 診斷分割區

source: The EFI firmware is significantly more sophisticated than the usual BIOS seen on most x86 PCs. Some system vendors take advantage of the ability of the EFI to access files and run programs from a hard disk filesystem to store diagnostics and EFI based system management utilities on the hard disk. This is a separate FAT format filesystem on the system disk. Consult the system documentation and accessories that come with the system for details. The easiest time to set up a diagnostics partition is at the same time you set up the EFI boot partition.
el: To firmware EFI είναι σημαντικά πιο εξεζητημένο από το συνηθισμένο BIOS που βρίσκουμε στα περισσότερα PC x86. Μερικοί κατασκευαστές αξιοποιούν την δυνατότητα του EFI να προσβαίνει άμεσα αρχεία και να τρέχει προγράμματα από ένα σύστημα αρχείων στον δίσκο για την αποθήκευση διαγνωστικών και βοηθητικών προγραμμάτων διαχείρισης συστήματος βασισμένα στο EFI στον σκληρό δίσκο. Αυτό είναι ένα ξεχωριστό σύστημα αρχείων FAT στον δίσκο του συστήματος. Συμβουλευτείτε την τεκμηρίωση του συστήματος και τα βοηθήματα που έρχονται με αυτό για λεπτομέρειες. Ο πιο κατάλληλος χρόνος για να διαμορφώσετε μια τέτοια κατάτμηση διαγνωστικών είναι την ίδια στιγμή που κάνετε τη ρύθμιση της κατάτμησης εκκίνησης EFI.
ko: EFI의 펌웨어는 대부분의 x86 BIOS보다 훨씬 복잡합니다. 어떤 시스템 제조사는 EFI가 파일에 접근하고 하드디스크의 프로그램을 실행시킬 수 있는 기능을 이용하여 디스크에 각종 검사기록과 EFI기반의 시스템 관리 프로그램들을 저장하기도 합니다. 이들은 시스템 디스크와 다른 별도의 FAT형 파티션에 저장됩니다. 자세한 내용은 시스템과 같이 제공되는 문서와 기타 부속품을 확인하십시오. 시스템 검사용 파티션은 EFI 부트 파티션을 설정할 때 같이 설정하시면 편합니다.
pt: O firmware EFI é substancialmente mais sofisticado que as usuais BIOS vistas na maioria dos PCs x86. Alguns vendedores de sistemas tiram vantagem da habilidade de EFI aceder a ficheiros e executar programas a partir dos sistemas de ficheiros para guardar diagnósticos e utilidades do sistema de gestão baseado em EFI. É um sistema de ficheiros separado do formato FAT no sistema do disco. Consulte a documentação do sistema e acessórios que vêm como o sistema para mais detalhes. A altura mais simples de fazer um diagnóstico à partição é ao mesmo tempo que prepara a sua partição de arranque EFI.
ru: Микропрограмма EFI значительно более сложна чем обычный BIOS на большинствекомпьютеров x86. Некоторые поставщики систем пользуются способностями EFI доступа к файлам и запуском программы с файловой системы жёсткого диска для хранения утилит диагностики иуправления основанных на EFI на жёстком диске. Это отдельный раздел с файловой системой FAT на системном диске. Подробней мотрите документацию на систему и принадлежности, которые идут вместе с системой. Правильней будет создать раздел диагностики в тоже время что и загрузочный раздел EFI.
zh_cn: 对于在大多数 x86 PCs 上常见的 BIOS 来说，EFI 固件明显要复杂的多。一些系统制造商利用 EFI 的 优点从硬盘文件系统来访问文件以及运行程序以保存一些诊断信息和 EFI 的系统管理工具。这将在系统磁盘上存在一个分开的 FAT 文件系统。请查阅随机相关的系统文档和附件以获得细节。最轻松设置一个诊断分区的时候是在设置 EFI 引导分区的时候。
zh_tw: 大多數 x86 PCs 上常見的 BIOS 來說，EFI 軔體明顯地複雜得多。一些系統製造商利用 EFI 的優點從硬碟檔案系統來存取檔案以及執行程式以儲存一些診斷訊息和 EFI 的系統管理工具。 在系統磁碟上存在一個另外 FAT 格式的檔案系統，請查閱相關的系統文檔和附件以獲得細節。建立一個診斷分割區的最容易的時刻是在設置 EFI 開機分割區的時候。

source: SGI Indys require an SGI disk label in order to make the system bootable from hard disk. It can be created in the fdisk expert menu. The thereby created volume header(partition number 9) should be at least 3MB large. If the volume header created is too small, you can simply delete partition number 9 and re-add it with a different size. Note that the volume header must start at sector 0.
el: Συστήματα SGI Indy απαιτούν μια επικεφαλίδα δίσκου SGI για να γίνει το σύστημα εκκινήσιμο από τον σκληρό δίσκο.Αυτή μπορεί να δημιουργηθεί από το μενού expert του προγράμματος fdisk. Η επικεφαλίδα του τόμου (κατάτμηση με αριθμό 9) που δημιουργείται με αυτόν τον τρόπο πρέπει να έχει μέγεθος τουλάχιστον 3ΜΒ. Αν είναι πιο μικρή, μπορείτε απλά να διαγράψετε την κατάτμηση με τον αριθμό 9 και να την επαναπροσθέσετε με διαφορετικό μέγεθος. Σημειώστε ότι η επικεφαλίδα δίσκου πρέπει να ξεκινάει από τον τομέα 0.
ko: SGI의 Indys에서 하드디스크로 부팅을 하고자 할 경우 SGI 디스크 레이블을 필요로 합니다. 이는 fdisk의 전문가용 메뉴에서 만들 수 있습니다. 이 때 만들어지는 9번 파티션인 볼륨 헤더는 최소한 3MB어이야 합니다. 볼륨헤더를 너무 작게 만들었다면 9번 파티션을 삭제하고 더 크게 새로 만드시면 됩니다. 이 때 볼륨헤더는 0번 섹터에 만들어야 합니다.
pt: SGI Indys requer uma label de disco com a finalidade de fazer o sistema iniciar a partir do disco rígido. Poderá ser criado no menu expert do fdisk. O volume header criado deste modo (partição número 9) deverá ter pelo menos 3MB de capacidade. Se o volume header criado for demasiado pequeno, poderá simplesmente apagar a partição número 9 e voltar a adicioná-la com um tamanho diferente. Note que o volume header tem de começar no sector 0.
ru: SGI Indys требуется метка диска SGI чтобы сделать систему загружаемой с жёсткого диска. Это можно сделать из экспетрного меню в fdisk. Таким образом создаваемыйзаголовок тома(раздел номер 9) должен быть как минимум 3МБ. Если заголовок тома создан слишком маленьким, вы можете просто удалить раздел номер 9 и добавить его с другим размером. Заметим, что заголовок тома должен начинаться с нулевого сектора.
zh_cn: SGI Indys 需要一个 SGI 磁盘标记来确保系统能够从硬盘上引导。它能够在 fdisk expert menu 下创建。因此创建的 volume header (分区号 9)应该有至少 3MB 大。但是为了能够保存各种不同的内核，我们推荐 10 MB 大小。如果 volume header 创建的太小，您可以简单的删除分区号 9 并且重新加入另外不同的尺寸。注意 volume header 必须从 0 号扇区开始。
zh_tw: SGI Indys 需要一個 SGI 磁碟標籤來確保系統能夠從硬碟上開機。它能夠在 fdisk expert menu 下建立。因此建立的 volume header (分割區號 9)至少要有 3MB 大。如果 volume header 建立的太小，您可以簡單的刪除分割區號 9 並且重新加入另外不同的尺寸。注意 volume header 必須從 0 號磁區開始。

source: Partitioning Newer PowerMacs
el: Διαμέριση για νεώτερους PowerMac.
ko: 현대 PowerMac에서 파티션하기
pt: Particionar PowerMacs Recentes
ru: Разметка новых PowerMac
zh_cn: 为较新的 PowerMacs 分区
zh_tw: 較新的 PowerMacs 分割區

source: If you are installing onto a NewWorld PowerMac you must create a special bootstrap partition to hold the boot loader. The size of this partition must be 800KB and its partition type must be <emphasis>Apple_Bootstrap</emphasis>. If the bootstrap partition is not created with the <emphasis>Apple_Bootstrap</emphasis> type your machine cannot be made bootable from the hard disk. This partition can easily be created by creating a new partition in <command>partman</command> and telling it to use it as a <quote>NewWorld boot partition</quote>, or in <command>mac-fdisk</command> using the <userinput>b</userinput> command.
el: Αν εγκαθιστάτε σε ένα σύστημα NewWorld PowerMac θα πρέπει να δημιουργήσετε μια ειδική κατάτμηση bootstrap που θα περιέχει τον φορτωτή εκκίνησης. Το μέγεθος της πρέπει να είναι γύρω στα 800ΚΒ και ο τύπος της <emphasis>Apple_Bootstrap</emphasis>. Αν η κατάτμηση bootstrap δεν δημιουργηθεί με τον τύπο <emphasis>Apple_Bootstrap</emphasis> το μηχάνημά σας δεν θα μπορεί να είναι εκκινήσιμο από τον σκληρό δίσκο. Η κατάτμηση αυτή μπορεί να δημιουργηθεί εύκολα δημιουργώντας μια καινούρια κατάτμηση με το πρόγραμμα <command>partman</command> και λέγοντας του να την χρησιμοποιήσει σαν <quote>NewWorld boot partition</quote> ή με το πρόγραμμα <command>mac-fdisk</command> χρησιμοποιώντας την εντολή <userinput>b</userinput>.
ko: NewWorld PowerMac에 데비안을 설치하실 경우 부트로더를 저장할 특별한 부트스트랩 파티션을 만드셔야 합니다. 이 파티션은 최소한 800 KB이어야 하며 <emphasis>Apple_Bootstrap</emphasis>형 파티션이어야 합니다. <emphasis>Apple_Bootstrap</emphasis>형 파티션이 아닐 경우 하드디스크로 부팅이 안 됩니다. 이 형식의 파티션은 <command>partman</command>프로그램으로 새 파티션을 만드신 후 <quote>NewWorld boot partition</quote>으로 설정하거나, <command>mac-fdisk</command>프로그램에서 <userinput>b</userinput> 명령을 사용해서 만드시면 됩니다.
pt: Se está a instalar num PowerMac NewWorld deve criar uma partição bootstrap especial para conter o gestor de arranque. O tamanho desta partição deve ser de 800KB e o tipo da partição tem de ser <emphasis>Apple_Bootstrap</emphasis>. Se a partição bootstrap não é criada com o tipo <emphasis>Apple_Bootstrap</emphasis> a sua máquina poderá não iniciar a partir do disco rígido. Esta partição pode facilmente ser criada criando uma nova partição no <command>partman</command> e informando-o que está a usar <quote>NewWorld boot partition</quote>, ou em <command>mac-fdisk</command> usando o comando <userinput>b</userinput>.
ru: Если вы производите установку на NewWorld PowerMac, то вы должны создать специальный загрузочный раздел для системного загрузчика. Размер этого раздела должен быть800КБ, а его тип <emphasis>Apple_Bootstrap</emphasis>. Если этот раздел создан без типа<emphasis>Apple_Bootstrap</emphasis>, то вашу машину нельзя будет загрузить с жёсткого диска. Этот раздел можно легко создать, создав новый раздел в программе <command>partman</command> и указав, что его нужно использовать в качестве<quote>загрузочного раздела NewWorld</quote>, или с помощью <command>mac-fdisk</command> используя команду <userinput>b</userinput>.
zh_cn: 如果您正在一台 NewWorld PowerMac 上面安装，您必须创建一个特殊的启动分区来驻留启动引导器。这个分区的尺寸必须是 800KB 并且它的分区类型必须是 <emphasis>Apple_Bootstrap</emphasis>。如果启动分区并非 <emphasis>Apple_Bootstrap</emphasis> 类型则您的机器不能从硬盘上引导。可以采用 <command>partman</command> 并告诉它用它作为 <quote>NewWorld boot partition</quote>，或在 <command>mac-fdisk</command> 使用 <userinput>b</userinput> 命令。
zh_tw: 如果您在 NewWorld PowerMac 上安裝，您必須建立一個特殊的啟動分割區來存放 boot loader 。這個分割區大小必須是 800KB ，而且它的分割區類型必須是<emphasis>Apple_Bootstrap</emphasis>。如果啟動分割區的類型並非<emphasis>Apple_Bootstrap</emphasis>，則您的機器無法從硬碟開機。可以採用 <command>partman</command> 並將它用作 <quote>NewWorld boot partition</quote>，或在 <command>mac-fdisk</command> 使用 <userinput>b</userinput> 命令。

source: The special partition type Apple_Bootstrap is required to prevent MacOS from mounting and damaging the bootstrap partition, as there are special modifications made to it in order for OpenFirmware to boot it automatically.
el: Ο ειδικός τύπος κατάτμησης Apple_Bootstrap είναι απαραίτητος για να αποτρέψει το MacOS από το να προσαρτήσει και να προκαλέσει ζημιά στην κατάτμηση bootstrap, μιας και υπάρχουν ειδικές τροποποιήσεις που έχουν γίνει ώστε το OpenFirmware να την ξεκινά από αυτήν αυτόματα.
ko: Apple_Bootstrap이라는 파티션 형식은 MacOS가 부트스트랩 파티션을 마운트해서 그 내용을 손상시키는 것을 방지하기 위해 필요합니다. OpenFirmware에서 자동으로 부팅하도록 특별히 수정된 파티션이기 때문입니다.
pt: A partição especial do tipo Apple_Bootstrap é necessária para prevenir que o MacOS monte e danifique a partição bootstrap, porque há modificações especiais feitas a ela com a finalidade do OpenFirmware iniciar automaticamente.
ru: Специальный тип раздела Apple_Bootstrap требуется для предотвращения монтирования и повреждения загрузочного раздела MacOS, так как это изменение в OpenFirmware для автоматической загрузки.
zh_cn: 这里要求特殊的分区类型 Apple_Bootstrap 来阻止 MacOS 挂接以及处理启动分区。因为里面 含有一些特殊修改的模式来让 OpenFirmware 能够自动启动它。
zh_tw: 特殊的分割區類型 Apple_Bootstrap 用來避免 MacOS 掛載並且毀壞此開機磁區，這是因為要使 OpenFirmware 能夠自動啟動 MacOS 需要對分割區做一些特殊修改。

source: Note that the bootstrap partition is only meant to hold 3 very small files: the <command>yaboot</command> binary, its configuration <filename>yaboot.conf</filename>, and a first stage OpenFirmware loader <command>ofboot.b</command>. It need not and must not be mounted on your file system nor have kernels or anything else copied to it. The <command>ybin</command> and <command>mkofboot</command> utilities are used to manipulate this partition.
el: Σημειώστε ότι η κατάτμηση bootstrap έχει σκοπό να κρατά μόνο 3 πολύ μικρά αρχεία: το εκτελέσιμο <command>yaboot</command>, το αρχείο ρυθμίσεών του <filename>yaboot.conf</filename>, και το πρώτο στάδιο ενός φορτωτή εκκίνησης για το OpenFirmware, το <command>ofboot.b</command>. Δεν χρειάζεται όυτε πρέπει να προσαρτάται στο σύστημα αρχείων σας ούτε να έχει αντίγραφα οποιωνδήποτε πυρήνων ή άλλων αρχείων. Τα βοηθητικά προγράμματα <command>ybin</command> και <command>mkofboot</command> χρησιμοποιούνται για την διαχείριση αυτής της κατάτμησης.
ko: 부트스트랩 파티션에는 <command>yaboot</command>바이너리, 설정파일인 <filename>yaboot.conf</filename>, OpenFirmware의 일단계 로더인 <command>ofboot.b</command> 3개만 저장됩니다. 파일시스템에 마운트될 필요도 없으며 마운트 되서도 안 되고, 커널이나 기타 다른 내용이 이 파티션에 저장되어서도 안 됩니다. 이 파티션은 <command>ybin</command>프로그램과 <command>mkofboot</command> 프로그램을 통해서 관리하실 수 있습니다.
pt: Note que a partição bootstrap serve apenas para conter 3 pequenos ficheiros: O binário <command>yaboot</command>, a configuração <filename>yaboot.conf</filename>, e a primeira fase do arranque de OpenFirmware <command>ofboot.b</command>. Não precisa nem deve ser montada no sistema de ficheiros nem tenha kernel ou qualquer outra coisa sendo copiada para lá. Os utilitários <command>ybin</command> e <command>mkofboot</command> são usados para manipular esta partição.
ru: Заметим, что этот загрузочный раздел нужен только для хранения 3 очень маленьких файлов: двоичный <command>yaboot</command>, его конфигурация <filename>yaboot.conf</filename> и первая часть загрузчика OpenFirmware <command>ofboot.b</command>. Его не нужно и он не должен быть смонтирован в файловую систему, на него не нужно копировать ядра и что-то другое. Для работы с этим разелом используются утилиты <command>ybin</command> и <command>mkofboot</command>.
zh_cn: 注意启动分区只含有三个非常小的文件：<command>yaboot</command> 可执行文件，它的配置文件 <filename>yaboot.conf</filename>，以及一个第一级 OpenFirmware 装载器 <command>ofboot.b</command>。它不需要，也一定不要被您的文件系统挂接，或者把内核以及其它文件放入在其中。<command>ybin</command> 和 <command>mkofboot</command> 工具可以用来维护这个分区。
zh_tw: 注意開機磁區只能存放三個非常小的檔案：<command>yaboot</command> 可執行檔，它的設定檔 <filename>yaboot.conf</filename>，以及第一級 OpenFirmware loader <command>ofboot.b</command>。它不需要且不能被您的檔案系統掛載，或者把核心或其它檔案複製到其中。<command>ybin</command> 和 <command>mkofboot</command> 工具可以用來管理這個分割區。

source: In order for OpenFirmware to automatically boot &debian; the bootstrap partition should appear before other boot partitions on the disk, especially MacOS boot partitions. The bootstrap partition should be the first one you create. However, if you add a bootstrap partition later, you can use <command>mac-fdisk</command>'s <userinput>r</userinput> command to reorder the partition map so the bootstrap partition comes right after the map (which is always partition 1). It's the logical map order, not the physical address order, that counts.
el: Για να ξεκινά το OpenFirmware αυτόματα το &debian; η κατάτμηση bootstrap θα πρέπει να εμφανίζεται πριν από οποιεσδήποτε άλλες κατατμήσεις εκκίνησης και ειδικότερα πριν από κατατμήσεις εκκίνησης του MacOS. Η κατάτμηση bootstrap θα πρέπει να είναι η πρώτη που δημιουργείτε. Αν όμως προσθέσετε μια τέτοια κατάτμηση αργότερα μπορείτε να χρησιμοποιήσετε την εντολή <userinput>r</userinput> του προγράμματος <command>mac-fdisk</command> για να αναδιατάξετε τον χάρτη διαμέρισης ώστε η κατάτμηση bootstrap να τοποθετηθεί αμέσως μετά τον χάρτη (που είναι πάντα η διαμέριση με τον αριθμό 1). Είναι η διάταξη του λογικού χάρτη που μετρά και όχι η σειρά των φυσικών διευθύνσεων των κατατμήσεων.
ko: OpenFirmware에서 &debian;이 성공적으로 부팅되기 위해서는 부트스트랩 파티션이 다른 부팅 파티션보다, 특히 MacOS용 부팅 파티션 앞에 와야 합니다. 부트스트랩 파티션을 가장 먼저 만드는 것이 좋습니다. 나중에 부트스트랩 파티션을 생성하는 경우에는 <command>mac-fdisk</command>의 <userinput>r</userinput> 명령을 사용하여 파티션의 배열을 재정렬하실 수 있습니다. 파티션 배열은 항상 1번 파티션이므로, 부트스트랩 파티션은 바로 다음에 와야 합니다. 물리적인 주소의 순서가 중요한 것이 아니라 논리적인 배열 순서가 중요합니다.
pt: Com a finalidade do OpenFirmware iniciar automaticamente &debian; a partição bootstrap deverá aparecer antes das outras partições de arranque no disco, especialmente partições de arranque MacOS. A partição bootstrap deve ser a primeira que criou. Contudo se só mais tarde adicionou a partição bootstrap, poderá usar os comandos <command>mac-fdisk</command>'s <userinput>r</userinput> para reordenar o mapa de particionamento para que a partição bootstrap venha logo após o mapa (que é sempre na partição 1). O que conta é a lógica da ordem do mapa, não a ordem do endereço físico.
ru: Чтобы OpenFirmware автоматически загружал &debian; этот специальный загрузочный раздел должен располагаться перед любыми другими загрузочными разделами на диске, особенно перед загрузочным разделом MacOS. Специальный загрузочный раздел должен быть создан первым. Однако, если вы добавите специальный загрузочный раздел позднее, то можете воспользоваться в программе <command>mac-fdisk</command> командной <userinput>r</userinput>, что преобразовать карту разделов для того чтобы специальный загрузочный раздел располагался сразу после карты (которая всегда является разделом 1). Это всего лишь логическое изменение, а не изменение физических адресов, что важно.
zh_cn: 为了确保 OpenFirmware 能够自动引导 &debian; 启动分区应该先于其它磁盘上的引导分区，特别是 MacOS 引导分区。启动分区应该是您第一个创建的分区。但是，如果您在其它情况下后加入启动分区，您可以使用 <command>mac-fdisk</command> 的 <userinput>r</userinput> 命令来重新调整分区布局。这样启动分区就可以在随后时间内顺利使用 (它总是位于 1 号分区)。注意的是，这只是逻辑布局顺序而不是物理地址顺序。
zh_tw: 為了確保 OpenFirmware 能夠自動啟動 &debian;，開機磁區必須位於硬碟上其他開機磁區之前，特別是 MacOS 開機磁區。開機分割區應該是您第一個建立的分割區。但是，如果您在之後新加入開機磁區，您可以使用 <command>mac-fdisk</command> 的 <userinput>r</userinput> 命令來重新調整分割區順序，如此一來開機磁區就可以在此之後順利使用(位於 1 號分割區)。請注意，這是邏輯順序而不是實際位址順序。

source: Apple disks normally have several small driver partitions. If you intend to dual boot your machine with MacOSX, you should retain these partitions and a small HFS partition (800k is the minimum size). That is because MacOSX, on every boot, offers to initialize any disks which do not have active MacOS partitions and driver partitions.
el: Οι δίσκοι σε συστήματα Apple έχουν συνήθως αρκετές μικρές κατατμήσεις συσκευών. Αν σκοπεύετε να έχετε διπλή εκκίνηση με το MacOSX θα πρέπει να διατηρήσετε αυτές τις κατατμήσεις και μια μικρή κατάτμηση HFS (800K είναι το ελάχιστο μέγεθος). Αυτό γιατί το MacOSX, σε κάθε εκκίνηση προσφέρεται να αρχικοποιεί οποιουσδήποτε δίσκους δεν έχουν ενεργές κατατμήσεις MacOS και κατατμήσεις συσκευών.
ko: 애플컴퓨터용 디스크는 많은 경우 파티션이 작게 잡혀있습니다. MacOSX와 듀얼부팅하기를 원하신다면, 이 파티션들과 작은 HFS 파티션(800k가 최소입니다) 하나 정도를 그대로 두시기 바랍니다. 이는 MacOSX가 부팅될 때마다 활성화된 MacOS용 파티션과 드라이버 파티션이 없는 디스크를 초기화하고자 하기 때문입니다.
pt: Os discos Apple têm, por norma, várias pequenas partições de dispositivos. Se tenciona ter dual boot na sua máquina com MacOSX deve ficar com estas partições e as pequenas partições HFS (800k é o tamanho mínimo). Isto é porque MacOSX, em todos os arranques, oferece-se para inicializar qualquer disco que não tenha partições MacOS activas e partições de dispositivos.
ru: Диски Apple обычно содержат несколько маленьких разделов драйверов. Если вы хотите иметь двойную загрузку машины MacOSX, то нужно оставить эти разделы и маленьких раздел HFS (800к его минимальный размер). Это нужно для того чтобы MacOSX при каждой загрузке не предлагал инициализировать диски, которые не содержат активных разделов MacOS и разделов драйверов.
zh_cn: Apple 磁盘通常有一些小的驱动分区。如果您想和 MacOSX 一起使用而采用双引导，您应该保持这些分区以及一个小的 HFS 分区 (最少要求 800k)。这是因为 MacOSX 在每次启动的时候，会初始化没有任何激活的 MacOS 分区以及驱动分区的磁盘。
zh_tw: Apple 磁碟通常有一些小的驅動分割區。如果您想同時使用 MacOSX 而採用雙開機方式，您應該保持這些分割區以及一個小的 HFS 分割區 (大小至少 800k)。這是因為 MacOSX 在每次啟動時，會初始化沒有任何啟用中的 MacOS 分割區及驅動分割區的磁盤。
