Repository: xobs/debian-installer
Catalog: doc/manual/po/*/partitioning.po
Languages: el, ko, pt, ru, zh_cn, zh_tw

source: Partitioning for Debian
el: Δημιουργία κατατμήσεων για το Debian
ko: 데비안의 하드디스크 파티션
pt: Particionar para Debian
ru: Разметка дисков в Debian
zh_cn: 为 Debian 准备分区
zh_tw: 為 Debian 分割磁區

source: Deciding on Debian Partitions and Sizes
el: Αποφασίζοντας για τις κατατμήσεις στο Debian και τα μεγέθη τους
ko: 파티션을 나눌 때 파티션의 크기 등 고려할 점
pt: Decidir o Tamanho e Partições do Debian
ru: Дисковые разделы Debian и их размеры
zh_cn: 决定 Debian 分区以及大小
zh_tw: 決定 Debian 磁區及大小

source: At a bare minimum, GNU/Linux needs one partition for itself. You can have a single partition containing the entire operating system, applications, and your personal files. Most people feel that a separate swap partition is also a necessity, although it's not strictly true. <quote>Swap</quote> is scratch space for an operating system, which allows the system to use disk storage as <quote>virtual memory</quote>. By putting swap on a separate partition, Linux can make much more efficient use of it. It is possible to force Linux to use a regular file as swap, but it is not recommended.
el: Σαν ελάχιστη απαίτηση το Linux χρειάζεται μια κατάτμηση για τον εαυτό του. Μπορείτε να έχετε μια και μόνη κατάτμηση που να περιέχει ολόκληρο το λειτουργικό σύστημα, τις εφαρμογές και τα προσωπικά σας αρχεία. Οι περισσότεροι χρήστες αισθάνονται ότι είναι αναγκαίο να έχουν και μια ξεχωριστή κατάτμηση swap αν και κάτι τέτοιο δεν είναι απόλυτα αληθές. <quote>Swap</quote> είναι ένας άδειος χώρος για το λειτουργικό σύστημα που του δίνει την δυνατότητα να χρησιμοποιήσει μέρος του δίσκου σαν <quote>εικονική μνήμη</quote>. Με τη δημιουργία μιας ξεχωριστής κατάτμησης swap το Linux μπορεί να κάνει πολύ πιο αποτελεσματική χρήση της. Είναι ακόμα δυνατόν να αναγκάσετε το Linux να χρησιμοποιήσει σαν swap ακόμα και ένα συνηθισμένο αρχείο αλλά κάτι τέτοιο δεν συνιστάται.
ko: GNU/Linux는 전용으로 쓸 수 있는 파티션을 최소한 하나 필요로 합니다. 각종 응용프로그램과 사용자 파일, 데비안 전체를 하나의 파티션에 둘 수 있습니다. 스왑 파티션도 반드시 필요하다고 하는 사람이 많지만, 꼭 그런 것만은 아닙니다. <quote>스왑</quote>이란 운영체제가 사용할 수 있는 일종의 낙서공간으로, 디스크를 <quote>가상메모리</quote>처럼 사용할 수 있게 해줍니다. 스왑을 별도의 파티션에 두면, 리눅스가 스왑을 더 효율적으로 사용할 수 있게 됩니다. 일반적인 파일을 스왑으로 사용하도록 강제할 수 있지만 별로 추천하는 방식은 아닙니다.
pt: No mínimo, o GNU/Linux precisa de uma partição para si mesmo. Poderá ter uma partição simples contendo todo o sistema operativo, aplicações e os seus ficheiros pessoais. A maioria das pessoas sente que uma partição swap separada também é necessária, sendo que isto não é realmente verdade. A <quote>Swap</quote> é um espaço scratch para um sistema operativo, que permite ao sistema usar espaço de disco como <quote>memória virtual</quote>. Colocando a swap numa partição separada, o Linux poderá fazer um uso mais eficiente dela. É possível forçar o Linux a utilizar um ficheiro normal como swap, mas isto não é recomendado.
ru: Как минимум, для GNU/Linux требуется один раздел. Вы можете иметь единственный раздел, содержащий всю операционную систему, приложения и ваши личные файлы. Большинство людей считают, что также необходим раздел подкачки, хотя это не совсем верно. <quote>Раздел подкачки (swap)</quote> &mdash; это рабочее пространство для операционной системы, которое позволяет использовать дисковое пространство в качестве <quote>виртуальной памяти</quote>. Linux работает с виртуальной памятью более эффективно, если она расположена в отдельном разделе. Linux может использовать для подкачки обычный файл, но это не рекомендуется.
zh_cn: 最小化情况下，GNU/Linux 需要一个分区。您可以有一个包含整个操作系统，应用程序以及您私人数据的分区。大多数人感到一个分离的交换分区也是很有必要的，尽管它并非严格要求。<quote>Swap</quote> 是一个操作系统用的空白空间，允许系统使用磁盘来提供 <quote>虚拟内存</quote>。通过放置交换空间至一个分离的分区，Linux 可以非常有效地使用它。强迫 Linux 使用一个普通文件作为交换空间也是可行的，但是并不推荐这种做法。
zh_tw: 最小化情況下，GNU/Linux 需要一個分割區。您可以有一個包含整個作業系統，應用程式以及您個人檔案的分割區。大多數人認為另建一個的置換分割區是有必要的，雖然嚴格來說它並不正確。 <quote>Swap</quote> 是一個作業系統用的空白空間，允許系統使用磁碟來提供 <quote>虛擬記憶體</quote>。通過置換空間至一個分離的分割區，Linux 可以有效地使用它。強迫 Linux 使用一個一般檔案作為置換空間也是可行的，但是並不建議這種做法。

source: Most people choose to give GNU/Linux more than the minimum number of partitions, however. There are two reasons you might want to break up the file system into a number of smaller partitions. The first is for safety. If something happens to corrupt the file system, generally only one partition is affected. Thus, you only have to replace (from the backups you've been carefully keeping) a portion of your system. At a bare minimum, you should consider creating what is commonly called a <quote>root partition</quote>. This contains the most essential components of the system. If any other partitions get corrupted, you can still boot into GNU/Linux to fix the system. This can save you the trouble of having to reinstall the system from scratch.
el: Οι περισσότεροι χρήστες όμως προτιμούν να δίνουν στο GNU/Linux μεγαλύτερο αριθμό κατατμήσεων από τον ελάχιστο δυνατό. Υπάρχουν δυο λόγοι για τους οποίους θα θέλατε να χωρίσετε ένα σύστημα αρχείων σε έναν αριθμό μικρότερων τμημάτων. Ο πρώτος είναι για ασφάλεια. Αν κάτι συμβεί και προκαλέσει την αλλοίωση του συστήματος αρχείων γενικά μόνο μια κατάτμηση θα επηρρεαστεί. Έτσι θα χρειαστεί να αποκαταστήσετε (από τα αντίγραφα ασφαλείας που που κρατάτε προσεκτικά, έτσι;) μόνο ένα κομμάτι του συστήματός σας. Στην ελάχιστη περίπτωση θα πρέπει να δημιουργήσετε αυτό που συνήθως ονομάζεται <quote>ριζική κατάτμηση</quote>. Αυτή περιέχει τα πιο ουσιώδη μέρη του συστήματος.Αν οποιεσδήποτε άλλες κατατμήσεις αλλοιωθούν θα μπορείτε ακόμα να εκκινήσετε το σύστημά σας GNU/Linux ώστε να διορθώσετε την όποια ζημιά. Αυτό μπορεί να σας γλιτώσει από τον κόπο του να ξαναγκαταστήσετε το σύστημα από το μηδέν.
ko: 하지만 대부분의 사람들은 GNU/Linux에게 여러 개의 파티션을 할당합니다. 파일시스템을 몇 개의 작은 파티션으로 나누는게 좋은 이유로 두가지를 들 수 있습니다. 첫번째는 안전문제입니다. 파일시스템이 망가지게 될 경우, 대부분 파티션 하나에만 문제가 생깁니다. 즉 그 동안 잘 백업해 둔 정보를 토대로 시스템의 일부만을 복구하면 됩니다. 이런 이유로 <quote>root</quote>파티션을 따로 두는 것이 좋습니다. 여기에 시스템의 가장 핵심적인 파일들이 있기 때문입니다. 그러면 다른 파티션들에 문제가 생기더라도 이 파티션에 오류가 없다면 부팅을 해서 문제점을 고칠 수 있습니다. 시스템을 처음부터 완전히 설치하는 것에 비해 수고를 덜 수 있습니다.
pt: A maioria das pessoas escolhem dar ao GNU/Linux mais que o número mínimo de partições. No entanto, existem duas razões para querer dividir o sistema de arquivos em partições mais pequenas. O primeiro é a segurança. Se algo acontecer e corromper seu sistema de arquivos, geralmente somente uma partição é afectada. Assim, terá somente que substituir (utilizando backups do sistema) uma parte do sistema. No mínimo poderá considerar a criação do que é normalmente chamado <quote>partição raiz</quote>. Ela contém os componentes mais essenciais do sistema. Se qualquer outra partição for corrompida, poderá ainda inicializar no GNU/Linux e corrigir o sistema. Isto podo evitar-lhe que tenha de reinstalar o sistema a partir do nada.
ru: Однако большинство людей выделяют под GNU/Linux больше одного раздела. Есть две причины, по которым возможно вы захотите разделить файловую систему на несколько маленьких разделов. Первая &mdash; это безопасность. Если что-то повредится в файловой системе, пострадает только один раздел. То есть, вам нужно будет восстановить (из резервной копии, которую вы заботливо храните) только часть системы. Как минимум, вам нужно создать так называемый <quote>корневой раздел</quote>. Он содержит наиболее важные компоненты системы. Если любой другой раздел будет повреждён, вы всё равно сможете загрузиться в GNU/Linux чтобы починить систему. Это может спасти вас от неприятной полной переустановки системы.
zh_cn: 但是大多数人选择给 GNU/Linu 更多的分区。这里有两个原因使您愿意把系统放置到一些较小的分区上。第一个问题是安全性。如果文件系统出现了问题，一般来说只是一个分区会受到影响。因此，您只需要更换(来自于您小心维护的备份)一个分区。在原始最小化阶段，您应该考虑创建所谓的 <quote>根分区</quote>。它含有最基础的系统组件。如果其它分区出现了问题，您仍然可以引导至 GNU/Linux 来修复系统。这个可以让您不用从头重新安装系统。
zh_tw: 大多數人選擇給 GNU/Linu 比最小化更多的分區。有兩個原因可能使您願意把檔案系統打散放置到一些較小的分區上。第一個問題是安全性，如果檔案系統出現了問題，一般來說只有一個磁區會受到影響。因此，您只需要更換(來自於您小心維護的備份)一個磁區。在最小化階段，您應該考慮建立所謂的 <quote>根分割區</quote>。它含有最主要的系統組件。如果其它分割區出現了問題，您仍可以進入至 GNU/Linux 來修復系統。這樣您可以不必從頭重新安裝系統。

source: The second reason is generally more important in a business setting, but it really depends on your use of the machine. For example, a mail server getting spammed with e-mail can easily fill a partition. If you made <filename>/var/mail</filename> a separate partition on the mail server, most of the system will remain working even if you get spammed.
el: Ο δεύτερος λόγος έχει μεγαλύτερη αξία συνήθως σε ένα εταιρικό περιβάλλον αλλά στην ουσία εξαρτάται από την χρήση που κάνετε του μηχανήματος.Για παράδειγμα, ένας mail server που δέχεται επίθεση spam από e-mail μπορεί έυκολα να γεμίσει μια ολόκληρη κατάτμηση. Αν έχετε κάνει τον κατάλογο <filename>/var/mail</filename> μια ξεχωριστή κατάτμηση στον server αυτό, το σύστημα στο μεγαλύτερο μέρος του θα εξακολουθεί να δουλεύει ακόμα και μετά από μια τέτοια επίθεση.
ko: 두번째 이유는 기업환경에서 더 중요하다고 할 수 있습니다만, 각자의 상황에 따라 다르다고 보는 것이 맞을 듯 합니다. 예를 들어, 대량의 스팸메일을 받고 있는 메일서버는 금방 파티션 하나를 채울 수 있습니다. <filename>/var/mail</filename>을 별도의 파티션에 두었다면, 스팸메일로 하드디스크가 가득차서 시스템이 동작을 멈추는 현상을 어느 정도 예방할 수 있을 것입니다.
pt: A segunda razão é por norma mais importante num meio empresarial, mas realmente depende da sua utilização da máquina. Por exemplo, um servidor de mail que recebe spam de emails pode facilmente encher a partição. Se no servidor de email fez da <filename>/var/mail</filename> uma partição separada, a maioria do sistema irá continuar a funcionar mesmo esteja a receber spam.
ru: Вторая причина обычно более важна для бизнеса, но на самом деле это зависит от того, в каком качестве используется машина. Например, почтовый сервер, получая спам, может легко переполнить раздел письмами. Если вы сделаете для <filename>/var/mail</filename> отдельный раздел на почтовом сервере, большинство систем будут продолжать работать даже если вас заспамят.
zh_cn: 第二个理由对商业设置来说更重要，但它实际上取决于您机器的使用。比如，一个邮件服务器接受到很多垃圾邮件会很快填满一个分区，如果您创建 <filename>/var/mail</filename>在一个分离的分区上面，大多数系统在您得到太多垃圾邮件的情况下会继续工作。
zh_tw: 第二個理由對商業設置來說更重要，但它實際上取決於您機器的使用。比如，一個郵件伺服器接受到很多垃圾郵件會很快填滿一個分割區，如果您建立 <filename>/var/mail</filename> 在一個分離的分割區上面，大多數系統在您得到太多垃圾郵件的情況下會繼續工作。

source: The only real drawback to using more partitions is that it is often difficult to know in advance what your needs will be. If you make a partition too small then you will either have to reinstall the system or you will be constantly moving things around to make room in the undersized partition. On the other hand, if you make the partition too big, you will be wasting space that could be used elsewhere. Disk space is cheap nowadays, but why throw your money away?
el: Το μόνο πραγματικά μειονέκτημα στη δημιουργία περισσότερων κατατμήσεων είναι ότι είναι συχνά δύσκολο να ξέρετε από πριν ποιες θα είναι οι ανάγκες σας. Αν κάνετε μια κατάτμηση μικρότερη τότε θα πρέπει έιτε να επανεγκαταστήσετε το σύστημα ή διαφορετικά να μετακινείτε διαρκώς αρχεία από δω κι εκεί για να δημιουργείτε ελεύθερο χώρο στην υπομεγέθη αυτή κατάτμηση. Αν από την άλλη έχετε δώσει πολύ μεγαλύτερο μέγεθος σε μια κατάτμηση θα έχετε πιθανόν σπαταλήσει χώρο που θα μπορούσε να χρησιμοποιηθεί αλλού. Ο χώρος στους σκληρούς δίσκους είναι σίγουρα αρκετά φθηνός σήμερα αλλά γιατί να πετάτε έτσι τα χρήματά σας;!
ko: 여러개의 파티션을 사용할 때의 유일한 단점은 각 파티션의 적절한 크기를 사전에 알기 힘들다는 점에 있습니다. 파티션을 너무 작게 만들면 시스템을 새로 설치하거나 그 파티션에 있는 파일들을 자주 다른 파티션으로 옮겨줘야 하는 불편함이 있습니다. 반면에 파티션을 너무 크게 만들면 다른 곳에서 쓸 수 있는 공간을 낭비하는 셈이 됩니다. 디스크 공간이 많이 저렴해졌다 하지만 낭비할 수는 없지 않습니까?
pt: O único inconveniente real em optar por mais do que uma partição é que torna-se, por vezes, difícil saber em adiantado quais serão as suas necessidades. Se fizer uma partição muito pequena então poderá ter que reinstalar o sistema ou mover constantemente coisas para outros directorias para arranjar espaço numa tão pequena partição. Por outro lado, se fizer uma partição muito grande, estará desperdiçando espaço em disco que poderia ser utilizado noutro lugar. Hoje em dia um disco é barato, mas porquê desperdiçar dinheiro?
ru: Единственным настоящим препятствием по использованию нескольких разделов является то, что часто трудно предсказать размер, который для них нужно выбрать. Если вы сделаете раздел слишком маленьким, то вам придётся или переустанавливать всю систему или постоянно перемещать файлы из-за нехватки места на разделе. С другой стороны, если сделать раздел слишком большим, то это трата места впустую, а оно могло пригодиться где-нибудь ещё. В наши дни дисковое пространство дёшево, но зачем выбрасывать деньги на ветер?
zh_cn: 使用更多分区的唯一缺点很难知道您将来的需求。如果您建立了一个分区容量太小，则您将或者重装系统或者不停地移动数据来给分区分配空间。在另外一个方面，如果您建立的分区过大，您将浪费一些可以用在别的地方的空间。磁盘容量目前很便宜，但是为什么您要把金钱随意抛洒呢？
zh_tw: 使用更多分割區的唯一缺點是很難預先知道您將來的需求。如果您建立了一個太小的分割區，則您可能需要重新安裝系統或者不停地移動資料以增加分割區空間。除此之外，如果您建立的分割區過大，您將浪費一些可以用在別的地方的空間。硬碟容量目前很便宜，但是為什麼要浪費呢？

source: The Directory Tree
el: Το Δέντρο των Καταλόγων
ko: 디렉토리 구조
pt: A Árvore de Directórios
ru: Структура каталогов
zh_cn: 目录树
zh_tw: 目錄樹

source: &debian; adheres to the <ulink url="&url-fhs-home;">Filesystem Hierarchy Standard</ulink> for directory and file naming. This standard allows users and software programs to predict the location of files and directories. The root level directory is represented simply by the slash <filename>/</filename>. At the root level, all Debian systems include these directories:
el: Το &debian; ακολουθεί πιστά το πρότυπο <ulink url="&url-fhs-home;">Filesystem Hierarchy Standard</ulink> για την ονομασία των καταλόγων και των αρχείων. Το πρότυπο αυτό επιτρέπει στους χρήστες και στις εφαρμογές να προβλέπουν την θέση των καταλόγων και των αρχείων. Ο ριζικός κατάλογος αντιπροσωπεύεται απλά από το σύμβολο <filename>/</filename> (slash). Στο επίπεδο αυτό όλα τα συστήματα Debian περιλαμβάνουν τους ακόλουθους καταλόγους:
ko: &debian; 은 디렉토리와 파일명을 정할 때 <ulink url="&url-fhs-home;">표준 파일 시스템 구조Filesystem Hierarchy Stan</ulink>를 따르고 있습니다. 이 표준을 준수함으로써 사용자들과 유저 프로그램들은 처음 접하는 시스템이라도 원하는 파일과 디렉토리의 위치를 예측할 수 있게 됩니다. 루트 디렉토리는 슬래쉬<filename>/</filename>로 표시됩니다. 데비안은 루트 디렉토리 아래에 다음의 디렉토리들을 포함하고 있습니다:
pt: &debian; adere ao <ulink url="&url-fhs-home;">Filesystem Hierarchy Standard</ulink> para as directorias e nomes de ficheiros. Este padrão permite aos utilizadores e a programas de software predizer o local dos ficheiros e directorias. O nível do directório raiz é representada simplesmente por uma barra <filename>/</filename>. No nível raiz, todos os sistemas Debian incluem estas directorias:
ru: &debian; придерживается стандарта <ulink url="&url-fhs-home;">Filesystem Hierarchy Standard</ulink> для каталогов и имён файлов. Этот стандарт позволяет пользователям и программному обеспечению быть уверенным в расположении файлов и каталогов. Уровень корневого каталога представляется просто косой чертой <filename>/</filename>. На корневом уровне, все системы Debian содержат следующие каталоги:
zh_cn: &debian; 依照 <ulink url="&url-fhs-home;">文件系统层次标准 (Filesystem Hierarchy Standard)</ulink> 安排文件以及文件命名。这个标准允许用户以及软件程序预测文件以及目录的位置。根层次目录只是简单表现为 <filename>/</filename>。在根层次，所有的 Debian 系统包括这些目录：
zh_tw: &debian; 依照 <ulink url="&url-fhs-home;">檔案系統層次標準 (Filesystem Hierarchy Standard)</ulink> 為目錄以及檔案命名。這個標準允許使用者以及軟體程式預測檔案及目錄的位置。根層次目錄只是簡單表現為 <filename>/</filename>。在根層次，所有的 Debian 系統包括這些目錄：

source: Directory
el: Κατάλογος
ko: 디렉토리
pt: Directoria
ru: Каталог
zh_cn: 目录
zh_tw: 目錄

source: Content
el: Περιεχόμενο
ko: 내용
pt: Conteúdo
ru: Содержит
zh_cn: 内容
zh_tw: 內容

source: Essential command binaries
el: Βασικά εκτελέσιμα αρχεία
ko: 필수적인 명령 바이너리들
pt: Comandos binários essenciais
ru: необходимые исполняемые файлы
zh_cn: 基础命令执行文件
zh_tw: 基礎命令執行檔案

source: Static files of the boot loader
el: Στατικά αρχεία για τον φορτωτή εκκίνησης
ko: 부트 로더가 필요로 하는 정적 파일들
pt: Ficheiros estáticos do gestor de arranque
ru: статичные файлы системного загрузчика
zh_cn: 启动引导器的静态链结文件
zh_tw: boot loader的靜態鏈結檔案

source: Device files
ko: 하드웨어의 다바이스 파일들
pt: Ficheiros de dispositivos
ru: файлы устройств
zh_cn: 设备文件
zh_tw: 裝置檔案

source: Host-specific system configuration
el: Ρυθμίσεις συστήματος που αφορούν το συγκεκριμένο μηχάνημα
ko: 이 호스트 고유의 설정파일 등
pt: Configurações específicas do sistema da máquina
ru: настройки системы данной машины
zh_cn: 主机特定的系统配置
zh_tw: 主機特定的系統設定

source: User home directories
el: Προσωπικοί κατάλογοι χρηστών
ko: 사용자의 홈디렉토리
pt: Directoria home do(s) utilizador(es)
ru: домашние каталоги пользователей
zh_cn: 用户活动目录
zh_tw: 使用者家目錄

source: Essential shared libraries and kernel modules
el: Βασικές μοιραζόμενες βιβλιοθήκες και αρθρώματα του πυρήνα
ko: 시스템 운영에 필수적인 공유 라이브러리와 커널 모듈들
pt: Bibliotecas essenciais partilhadas e módulos do kernel
ru: необходимые библиотеки общего пользования и модули ядра
zh_cn: 基本共享库以及内核模块
zh_tw: 基本共享程式庫以及核心單元

source: Contains mount points for replaceable media
el: Σημεία προσάρτησης για τα αφαιρούμενα μέσα
ko: 플로피 디스켓 등의 탈부착 가능한 매체를 마운트 시키는 디렉토리
pt: Contém pontos de montagem para media amovível
ru: содержит точки монтирования для съёмных носителей
zh_cn: 包含移动介质的挂载点
zh_tw: 包含移動媒介的掛載點

source: Mount point for mounting a file system temporarily
el: Σημείο προσάρτησης για την προσωρινή προσάρτηση ενός συστήματος αρχείων
ko: 파일 시스템을 임시로 마운트 시키는 디렉토리
pt: Local de montagem temporária de um sistema de ficheiros
ru: точка монтирования для временно монтируемой файловой системы
zh_cn: 用于临时挂接一个文件系统
zh_tw: 暫時掛載檔案系統的掛載點

source: Virtual directory for system information (2.4 and 2.6 kernels)
el: Εικονικός κατάλογος για πληροφορίες σχετικά με το σύστημα (πυρήνες 2.4 και 2.6)
ko: 커널 2.4와 2.6에서 시스템 정보를 저장하는 가상 디렉토리
pt: Directoria virtual para informações do sistema (kernels 2.4 e 2.6)
ru: виртуальный каталог для системной информации (для ядер 2.4 и 2.6)
zh_cn: 系统信息的虚拟目录(2.4 和 2.6 内核)
zh_tw: 系統資訊的虛擬目錄(2.4 和 2.6 內核)

source: Home directory for the root user
el: Προσωπικός κατάλογος για τον χρήστη root
ko: root 사용자의 홈디렉토리
pt: Directoria home do utilizador root
ru: домашний каталог суперпользователя
zh_cn: 根用户的活动目录
zh_tw: 根使用者的家目錄

source: Essential system binaries
el: Βασικά εκτελέσιμα του συστήματος
ko: 필수적인 시스템 관리 바이너리
pt: Binários essenciais do sistema
ru: необходимые системные исполняемые файлы
zh_cn: 基本的系统级程序
zh_tw: 基本的系統執行檔案

source: Virtual directory for system information (2.6 kernels)
el: Εικονικός κατάλογος για πληροφορίες σχετικά με το σύστημα (πυρήνες 2.6)
ko: 2.6 커널이 시스템 정보를 저장하는 가상 디렉토리
pt: Directoria virtual para informações do sistema (kernels 2.6)
ru: виртуальный каталог для системной информации (для ядер 2.6)
zh_cn: 系统信息的虚拟目录(2.6 内核)
zh_tw: 系統資訊的虛擬目錄(2.6 內核)

source: Temporary files
el: Προσωρινά αρχεία
ko: 임시 파일들
pt: Ficheiros temporários
ru: временные файлы
zh_cn: 临时文件
zh_tw: 暫存檔

source: Secondary hierarchy
el: Δευτερεύουσα ιεραρχία
ko: 2차적인 디렉토리 구조
pt: Hierarquia secundária
ru: вторичная иерархия
zh_cn: 第二层次
zh_tw: 第二層次

source: Variable data
el: Μεταβαλλόμενα δεδομένα
ko: 내용이 자주 변하는 파일들
pt: Dados variáveis
ru: изменяемые данные
zh_cn: 活动数据
zh_tw: 變動資料

source: Add-on application software packages
el: Πρόσθετα πακέτα λογισμικού εφαρμογών
ko: 별도로 추가하는 응용 소프트웨어
pt: Pacotes de software e aplicações adicionais
ru: дополнительное программное обеспечение
zh_cn: 附加的应用程序软件包
zh_tw: 附加的應用程式軟體套件

source: The following is a list of important considerations regarding directories and partitions. Note that disk usage varies widely given system configuration and specific usage patterns. The recommendations here are general guidelines and provide a starting point for partitioning.
el: Η ακόλουθη είναι μια λίστα με σημαντικά σημεία που πρέπει να προσέξει κανείς σχετικά με τους καταλόγους και τις κατατμήσεις. Σημειώστε ότι η χρήση του δίσκου ποικίλλει πολύ ανάλογα με την διαμόρφωση του συστήματος και τις συγκεκριμένες ανάγκες χρήσης. Οι συστάσεις εδώ είναι μόνο γενικές κατευθύνσεις που δίνουν ένα σημείο αφετηρίας για την πιθανή διαμέριση.
ko: 디렉토리와 하드디스크 파티션을 구성할 때 고려해야 할 점들을 아래에 정리했습니다. 실제 디스크 사용량은 각 시스템의 설정과 주 사용용도에 따라 달라질 수 있습니다. 아래의 내용은 참고만 하시고 실제 설정에는 각 시스템에 맞게 하실 것을 권합니다.
pt: O seguinte é uma lista de considerações importantes relacionadas com directórios e partições. Note que a utilização do disco varia muito com a configuração do sistema e padrões de utilização específicos. As recomendações aqui são linhas de orientação gerais e disponibilizam um ponto de partida para particionar.
ru: Далее следует список важных предположений относительно каталогов и разделов. Заметьте, что дисковое пространство может использоваться совершенно по-разному, в зависимости от настроек системы и специфики решаемых задач. Приводимые здесь рекомендации являются лишь отправной точкой в решении задачи разметки.
zh_cn: 下面列出关于目录和分区的重要考虑。要注意磁盘的使用随系统配置和特定用途有很大变化。这里所推荐的是通用指引，提供一个分区的起点。
zh_tw: 下面列出關於目錄和分割區的重要考量。要注意硬碟的使用隨系統設定和特定用途有很大變化。這裡的建議是一般導引，提供分割區的基本分割方式。

source: The root partition <filename>/</filename> must always physically contain <filename>/etc</filename>, <filename>/bin</filename>, <filename>/sbin</filename>, <filename>/lib</filename> and <filename>/dev</filename>, otherwise you won't be able to boot. Typically 150&ndash;250 MB is needed for the root partition.
el: Η ριζική κατάτμηση <filename>/</filename> πρέπει πάντα να περιέχει σαν πραγματικούς καταλόγους τους <filename>/etc</filename>, <filename>/bin</filename>, <filename>/sbin</filename>, <filename>/lib</filename> και <filename>/dev</filename>, διαφορετικά δεν θα μπορείτε να εκκινήσετε το σύστημα.Τυπικά 150&ndash;250 ΜΒ είναι απαραίτητα για την ριζική κατάτμηση.
ko: <filename>/etc</filename>, <filename>/bin</filename>, <filename>/sbin</filename>, <filename>/lib</filename>, <filename>/dev</filename>는 반드시 루트 파티션(<filename>/</filename>)에 존재해야 합니다. 그렇지 않을 경우 부팅에 문제가 발생합니다. 일반적으로 150&ndash;250 MB정도가 필요합니다.
pt: A partição raiz <filename>/</filename> deve conter sempre fisicamente <filename>/etc</filename>, <filename>/bin</filename>, <filename>/sbin</filename>, <filename>/lib</filename> e <filename>/dev</filename>, caso contrário não lhe será possível iniciar. Tipicamente são necessários 150%ndash;250 MB para a partição root.
ru: Корневой раздел <filename>/</filename> всегда должен физически содержать <filename>/etc</filename>, <filename>/bin</filename>, <filename>/sbin</filename>, <filename>/lib</filename> и <filename>/dev</filename>, иначе невозможна загрузка системы. Обычно, для корневого раздела требуется 150&ndash;250 МБ, но этот размер может быть и другим.
zh_cn: 根分区 <filename>/</filename> 必须总是物理地包含 <filename>/etc</filename>，<filename>/bin</filename>，<filename>/sbin</filename>，<filename>/lib</filename> 以及 <filename>/dev</filename>，否则您将不能引导。典型的 root 分区需要 150&ndash;250MB 大小空间。
zh_tw: 根分割區 <filename>/</filename> 必須包含 <filename>/etc</filename>、<filename>/bin</filename>、<filename>/sbin</filename>、<filename>/lib</filename> 以及 <filename>/dev</filename>，否則您將不能開機。 root 分區通常需要 150&ndash;250MB 大小空間。
