Repository: xobs/debian-installer
Catalog: doc/manual/po/*/partitioning.po
Languages: el, ko, pt, ru, zh_cn, zh_tw

source: Make sure you create a <quote>Sun disk label</quote> on your boot disk. This is the only kind of partition scheme that the OpenBoot PROM understands, and so it's the only scheme from which you can boot. The <keycap>s</keycap> key is used in <command>fdisk</command> to create Sun disk labels.
el: Σιγουρευτείτε ότι δημιουργείτε μια <quote>εποικεφαλίδα δίσκου Sun</quote> στον δίσκο εκκίνησης. Αυτό είναι το μόνο είδος σχήματος διαμέρισης που καταλαβαίνει το OpenBoot PROM και επομένως είναι το μόνο σχήμα από το οποίο μπορείτε να εκκινήσετε. Το πλήκτρο <keycap>s</keycap> χρησιμοποιείται στο πρόγραμμα <command>fdisk</command> για την δημιουργία επικεφαλίδων δίσκων Sun.
ko: 부팅디스크에 <quote>Sun disk label</quote>를 꼭 만들어두시기 바랍니다. OpenBoot PROM이 유일하게 이해하는 파티션 방식이기 때문이고, 부팅 디스크가 이 방식으로 파티션이 되어있지 않을 경우에는 부팅을 할 수 없기 때문입니다. <quote>Sun disk label</quote>는 <command>fdisk</command> 실행시 <keycap>s</keycap>키를 이용하여 만드실 수 있습니다.
pt: Certifique-se que criou uma <quote>Sun disk label</quote> no seu disco de arranque. Este é o único esquema de partição que o PROM OpenBoot entende, e é portanto o único esquema do qual pode iniciar. A tecla <keycap>s</keycap> é usada no <command>fdisk</command> para criar Sun disk labels.
ru: Проверьте, что создали <quote>Sun disk label</quote> на загрузочном диске. OpenBoot PROM понимает только один тип схемы разметки, и поэтому это единственная схема, с которой возможна загрузка. Для создания Sun disk label в <command>fdisk</command> используется клавиша <keycap>s</keycap>.
zh_cn: 首先确保在您的引导磁盘上面创建有一个 <quote>Sun 磁盘标记</quote> 。这是 OpenBoot PROM 唯一懂得的分区方式，因此它是唯一能够被引导的分区类型。可以在 <keycap>s</keycap> 中用 <command>fdisk</command> 键来创建 Sun 磁盘标记。
zh_tw: 確保在您的開機磁碟上建立了 <quote>Sun 磁碟標籤</quote> 。這是 OpenBoot PROM 唯一懂得的分割區方式，而且它是唯一能夠被開機分割區類型。可以在 <command>fdisk</command> 中使用<keycap>s</keycap> 鍵來建立 Sun 磁碟標籤。

source: Furthermore, on &arch-title; disks, make sure your first partition on your boot disk starts at cylinder 0. While this is required, it also means that the first partition will contain the partition table and the boot block, which are the first two sectors of the disk. You must <emphasis>not</emphasis> put swap on the first partition of the boot drive, since swap partitions do not preserve the first few sectors of the partition. You can put Ext2 or UFS partitions there; these will leave the partition table and the boot block alone.
el: Επιπλέον, σε δίσκους στην αρχιτεκτονική &arch-title; βεβαιωθείτε ότι η πρώτη κατάτμηση στον δίσκο εκκίνησης ξεκινά στον κύλινδρο 0. Αυτό όχι μόνο απαιτείται, αλλά σημαίνει και ότι η πρώτη κατάτμηση θα περιέχει τον πίνακα διαμέρισης και το μπλοκ εκκίνησης που είναι οι δυο πρώτοι τομείς του δίσκου. <emphasis>Δεν</emphasis> πρέπει να δημιουργείτε τον χώρο swap στην πρώτη κατάτμηση γιατί του δίσκου εκκίνησης καθώς οι κατατμήσεις swap δεν διατηρούν τους λίγους πρώτους τομείς της κατάτμησης. Μπορείτε να βάλετε εκεί κατατμήσεις Ext2 ή UFS. Αυτές θα αφήσουν ανεπηρρέαστα τον πίνακα διαμέρισης και το μπλοκ εκκίνησης.
ko: &arch-title;용 디스크에서 파티션이 반드시 0번 실린더에서 시작하도록 하십시오. 첫번째 파티션에는 파티션 테이블과 부팅 블록 처음 2 섹터에 저장되므로 첫번째 파티션을 스왑으로 지정하시면 안됩니다. 스왑 형식의 파티션은 처음 몇 섹터도 보존하지 않기 때문입니다. 스왑 형식의 파티션 대신에 Ext2나 UFS 형식의 파티션으로 지정하면 이 섹터들을 보존할 수 있을 것입니다.
pt: Além disso, nos discos &arch-title;, certifique-se que a sua primeira partição no seu disco de arranque inicia no cilindro 0. Enquanto isto for requerido, significa também que a primeira partição irá conter a tabela de partições e o bloco de arranque, que são os primeiros dois sectores do disco. Não deve colocar a swap na primeira partição do dispositivo de arranque, dado que as partições de swap não preservam os primeiros sectores da partição. Poderá ali colocar as partições Ext2 e UFS; estas deixarão a tabela de partições e o bloco de arranque de parte.
ru: Кроме того, на дисках &arch-title;, убедитесь, что первый раздел загрузочного диска начинается с цилиндра 0. Так это обязательно, отсюда следует, что первый раздел будет содержать таблицу разделов и загрузочный блок, который занимает первые два сектора диска. Вы <emphasis>не</emphasis> должны делать раздел подкачки первым разделом загрузочного диска, так как разделы подкачки не сохраняют неизменными первые несколько секторов раздела. Вы можете здесь сделать разделы Ext2 или UFS; они не трогают таблицу разделов и загрузочный блок.
zh_cn: 进一步来说，在 &arch-title; 磁盘里，请确定您的引导磁盘的第一分区是从 cylinder 0 开始的。在这里是必须的，这意味着第一个分区将含有分区表以及引导块。它们通常在磁盘的前两个扇区内。您必须 <emphasis>not</emphasis> 能设置引导磁盘的第一分区为交换分区，因为交换分区并不能保留分区前两个扇区。您可以放置 Ext2 或者 UFS 分区在那里；它们将隔离分区表和引导块。
zh_tw: 進一步來說，在 &arch-title; 磁碟裡，請確認您的開機磁碟的第一分割區是從 cylinder 0 開始。這是必須的，這意味著第一個分割區將含有分割區表以及開機區，它們通常在磁碟的前兩個磁區內。您一定 <emphasis>不能</emphasis> 設置開機磁碟的第一分割區為置換分割區，因為置換分割區並不能保留分割區前幾個磁區。您可以在那裡放置 Ext2 或者 UFS 分割區，它們將分割區表和開機磁區隔離開來。

source: It is also advised that the third partition should be of type <quote>Whole disk</quote> (type 5), and contain the entire disk (from the first cylinder to the last). This is simply a convention of Sun disk labels, and helps the <command>SILO</command> boot loader keep its bearings.
el: Σας συμβουλεύουμε επίσης να κάνετε την τρίτη κατάτμηση να έχει τύπο <quote>Whole disk</quote> (τύπος 5) και να περιέχει ολόκληρο τον δίσκο (από τον πρώτο κύλινδρο μέχρι τον τελευταίο). Αυτή είναι απλά μια σύμβαση των επικεφαλίδων δίσκου Sun και βοηθά τον φορτωτή εκκίνησης <command>SILO</command> να διατηρεί τα περιεχόμενά τους.
ko: 세번째 파티션은 <quote>Whole disk</quote> (5번 형식)으로 둬서 디스크 전체를 포괄하도록 하는 것이 좋습니다. 이것은 <quote>Sun disk label</quote>에서 사용되는 규약으로, SILO가 정상적인 동작을 하는데 도움이 됩니다.
pt: É também aconselhado que a terceira partição seja do tipo <quote>Whole disk</quote> (tipo 5), e contenha o disco inteiro (desde o primeiro cilindro até ao último). Isto é simplesmente uma convenção do Sun disk labels, e ajuda o gestor de arranque <command>SILO</command> a manter-se.
ru: Также посоветуем, чтобы у третьего раздела был тип <quote>Весь диск</quote> (тип 5), и содержал весь диск целиком (от первого цилиндра до последнего). Это является простым соглашением в Sun disk label и помогает системному загрузчику<command>SILO</command> загружаться.
zh_cn: 这里建议第三个分区应该是 <quote>Whole disk</quote>(type 5)，并且包含整个磁盘 (从第一个柱面至最后一个)，这是 Sun 磁盘格式的惯例，并且确保 <command>SILO</command> 启动引导器工作良好。
zh_tw: 我們建議第三個分割區的類型應該是 <quote>Whole disk</quote>(type 5)，並且包含整個磁碟(從第一個磁柱至最後一個)，這是 Sun 磁碟標籤的慣例， 並且確保 <command>SILO</command> boot loader 工作良好。
