Repository: xobs/debian-installer
Catalog: doc/manual/po/*/post-install.po
Languages: el, pt, ru, zh_cn, zh_tw

source: To compile a kernel the Debian way, you need some packages: <classname>kernel-package</classname>, <classname>kernel-source-&kernelversion;</classname> (the most recent version at the time of this writing), <classname>fakeroot</classname> and a few others which are probably already installed (see <filename>/usr/share/doc/kernel-package/README.gz</filename> for the complete list).
el: Για να χτίσετε έναν πυρήνα με τον "τρόπο του Debian", χρειάζεστε μερικά πακέτα όπως τα <classname>kernel-package</classname>, <classname>kernel-source-&kernelversion;</classname> (η πιο πρόσφατη έκδοση του πυρήνα τη στιγμή που γράφονται οι γραμμές αυτές) <classname>fakeroot</classname> και μερικά ακόμα που ίσως είναι ήδη εγκατεστημένα.(δείτε το <filename>/usr/share/doc/kernel-package/README.gz</filename> για μια πλήρη λίστα).
pt: Para compilar um kernel novo à maneira Debian, necessitará de alguns pacotes: <classname>kernel-package</classname>, <classname>kernel-source-&kernelversion;</classname> (a versão mais recente na altura em que este manual foi escrito), <classname>fakeroot</classname> e mais alguns que provavelmente já estarão instalados (veja <filename>/usr/share/doc/kernel-package/README.gz</filename> para a lista completa).
ru: Чтобы собрать ядро по технологии Debian, вам потребуются некоторые пакеты: <classname>kernel-package</classname>, <classname>kernel-source-&kernelversion;</classname> (последняя версия на время написания), <classname>fakeroot</classname> и некоторые другие, которые, вероятно, уже установлены (в <filename>/usr/share/doc/kernel-package/README.gz</filename> есть полный список).
zh_cn: 为了以 Debian 的方式编译内核，您需要一些软件包： <classname>kernel-package</classname>，<classname>kernel-source-&kernelversion;</classname>(与此文档写作时间最接近的版本)，<classname>fakeroot</classname> 以及其它一些您可能已经安装过的软件包 (请参阅 <filename>/usr/share/doc/kernel-package/README.gz</filename> 以获得完整的列表)。
zh_tw: 為了以 Debian 的方式編譯核心，您需要一些軟體套件：<classname>kernel-package</classname>，<classname>kernel-source-&kernelversion;</classname> (與此文件寫作時間最接近的版本)，<classname>fakeroot</classname> 以及其它一些您可能已經安裝過的軟體套件 (請參閱 <filename>/usr/share/doc/kernel-package/README.gz</filename> 以取得完整的列表)。

source: This method will make a .deb of your kernel source, and, if you have non-standard modules, make a synchronized dependent .deb of those too. It's a better way to manage kernel images; <filename>/boot</filename> will hold the kernel, the System.map, and a log of the active config file for the build.
el: Αυτή η μέθοδος θα φτιάξει ένα αρχείο .deb από τον κώδικα του πυρήνα και , αν έχετε μη-συνηθισμένα modules, θα φτιάξει ένα συγχρονισμένο .deb αρχείο και γι΄αυτά. Είναι ένας καλλίτερος τρόπος για να διαχειρίζεστε εικόνες του πυρήνα. Στον κατάλογο <filename>/boot</filename> θα τοποθετηθούν ο πυρήνας. το αρχείο System.map και ένα αρχείο καταγραφής του αρχείου config της δημιουργίας τους.
pt: Este método irá fazer um .deb da fonte do seu kernel, e, se tiver módulos não-standard, fazer igualmente um .deb dependente sincronizado. É a melhor maneira de gerir as imagens dos kernel; <filename>/boot</filename> irá guardar o kernel, o System.map e um log do ficheiro de configuração activo para a build.
ru: С помощью этого метода создаётся .deb файл из исходных текстов ядра, а также, если у вас имеются нестандартные модули, делается .deb файл с синхронизированными зависимостями. Это наилучший способ управления образами ядра; в <filename>/boot</filename> лежит ядро, System.map и журнальный конфигурационный файл от сборки.
zh_cn: 此方法将从您的内核源码创建一个 .deb 文件，并且，如果您有非标准模块，将同时创建它们的同步依赖 .deb 文件。这是一个管理内核的较好的方法； <filename>/boot</filename> 目录将保存内核，System.map，以及当前编译的活动配置文件的日志。
zh_tw: 此方法將從您的核心原始碼建立一個 .deb 檔案，並且，如果您有非標準模組，將同時建立它們的同步相依 .deb 檔案。這是一個管理核心的較好的方法﹔<filename>/boot</filename> 目錄將保存核心，System.map，以及目前編譯的活動設定檔紀錄。

source: Note that you don't <emphasis>have</emphasis> to compile your kernel the <quote>Debian way</quote>; but we find that using the packaging system to manage your kernel is actually safer and easier. In fact, you can get your kernel sources right from Linus instead of <classname>kernel-source-&kernelversion;</classname>, yet still use the <classname>kernel-package</classname> compilation method.
el: Σημειώστε ότι δεν είσαστε <emphasis>υποχρεωμένοι</emphasis> να χτίσετε τον πυρήνα σύμφωνα με την <quote>μέθοδο του Debian</quote>, αλλά πιστεύουμε ότι η χρήση του συστήματος πακέτων για τη διαχείριση του πυρήνα σας είναι στην ουσία ασφαλέστερη και ευκολότερη. Στην πραγματικότητα μπορείτε να πάρετε τον κώδικα του πυρήνα από τον ίδιο τον Linus αντί από το πακέτο <classname>kernel-source-&kernelversion;</classname> αλλά να χρησιμοποιήσετε και πάλι την μέθοδο του <classname>kernel-package</classname>.
pt: Note que você não <emphasis>tem</emphasis> que compilar o seu kernel <quote>à maneira Debian</quote>; mas achamos que usando o sistema de pacotes para gerir o seu kernel é mais fácil e seguro. De facto, pode obter a fonte do kernel directamente de Linus, em vez de <classname>kernel-source-&kernelversion;</classname>, ainda assim use o método de compilação <classname>kernel-package</classname>.
ru: Заметим, что вам <emphasis>не обязательно</emphasis> собирать ядро <quote>по технологии Debian</quote>; но мы пришли к выводу, что управлять ядрами с помощью системы управления пакетами на самом деле безопаснее и легче. Фактически, вы можете получить исходные тексты ядра прямо у Линуса, а не в виде <classname>kernel-source-&kernelversion;</classname>, а после собрать ядро с помощью <classname>kernel-package</classname>.
zh_cn: 注意您不 <emphasis>需要</emphasis>编译内核以 <quote>Debian 方式</quote>；但我们发现使用软件包系统来管理您的内核确实可以更加安全和简单。事实上，您可以直接从 Linus 那里而不是 <classname>kernel-source-&kernelversion;</classname> 得到内核源码，并仍然使用 <classname>kernel-package</classname> 的编译方法。
zh_tw: 注意您不<emphasis>需要</emphasis>以 <quote>Debian 方式</quote>編譯核心﹔但我們發現使用軟體套件系統來管理您的核心確實可以更加安全和簡單。事實上，您可以直接從 Linus 那裡而不是 <classname>kernel-source-&kernelversion;</classname> 取得核心原始碼，並仍然使用 <classname>kernel-package</classname> 的編譯方法。

source: Note that you'll find complete documentation on using <classname>kernel-package</classname> under <filename>/usr/share/doc/kernel-package</filename>. This section just contains a brief tutorial.
el: Σημειώστε ότι θα βρείτε πλήρη τεκμηρίωση για την χρήση του <classname>kernel-package</classname> στον κατάλογο <filename>/usr/share/doc/kernel-package</filename>. Αυτή η ενότητα είναι απλά μια σύντομη παρουσίαση.
pt: Note que irá encontrar documentação completa utilizando <classname>kernel-package</classname> sob <filename>/usr/share/doc/kernel-package</filename>. Esta secção apenas contém um breve tutorial.
ru: Заметим, что полную документацию по использованию <classname>kernel-package</classname> можно найти в <filename>/usr/share/doc/kernel-package</filename>. Этот раздел содержит лишь краткое руководство.
zh_cn: 注意您可以找到完整的文档，通过使用 <classname>kernel-package</classname> 它在 <filename>/usr/share/doc/kernel-package</filename>里。本节只包含一个简单的入门指南。
zh_tw: 注意您可以找到完整的文件，透過使用 <classname>kernel-package</classname> 它在 <filename>/usr/share/doc/kernel-package</filename>裡。本節只包含一個簡單的入門指南。

source: Hereafter, we'll assume you have free rein over your machine and will extract your kernel source to somewhere in your home directory<footnote> <para> There are other locations where you can extract kernel sources and build your custom kernel, but this is easiest as it does not require special permissions. </para> </footnote>. We'll also assume that your kernel version is &kernelversion;. Make sure you are in the directory to where you want to unpack the kernel sources, extract them using <userinput>tar xjf /usr/src/kernel-source-&kernelversion;.tar.bz2</userinput> and change to the directory <filename>kernel-source-&kernelversion;</filename> that will have been created.
el: Στο εξής θεωρούμε ότι έχετε ελεύθερη πρόσβαση στο μηχάνημά σας και θα αποσυμπιέσετε τον κώδικα του πυρήνα κάπου στον προσωπικό σας κατάλογο<footnote> <para> Υπάρχουν και άλλες τοποθεσίες όπου μπορείτε να αποσυμπιέσετε τον κώδικα του πυρήνα και να χτίσετε τον δικό σας πυρήνα, αλλά αυτή είναι η ευκολότερη καθώς δεν απαιτεί οποιαδήποτε ειδική άδεια πρόσβασης. </para> </footnote>. Θα υποθέσουμε ακόμα ότι η έκδοση του πυρήνα σας είναι &kernelversion;. Βεβαιωθείτε ότι είσαστε στον κατάλογο όπου θέλετε να ξεπακετάρετε τον κώδικα του πυρήνα, και κάντε το με την εντολή <userinput>tar xjf /usr/src/kernel-source-&kernelversion;.tar.bz2</userinput> και πηγαίνετε στον κατάλογο <filename>kernel-source-&kernelversion;</filename> που θα έχετε δημιουργήσει.
pt: A partir de aqui, iremos assumir que tem as rédeas da sua máquina, e irá extrair a sua fonte do kernel para algum local dentro da sua directoria home<footnote> <para> Há outras localizações para onde pode extrair as fontes dos kernels e construir o seu kernel personalizado, mas esta é a mais simples, uma vez que não requer permissões especiais. </para> </footnote>. Iremos também assumir que a sua versão do kernel é &kernelversion;. Assegure-se que está na directoria para onde deseja descompactar as fontes do kernel, extraia-as usando <userinput>tar xjf /usr/src/kernel-source-&kernelversion;.tar.bz2</userinput> e mude-se para a directoria <filename>kernel-source-&kernelversion;</filename> que terá sido criada.
ru: Далее мы предполагаем, что можете делать на своей машине что угодно и хотите распаковать исходные тексты ядра в домашний каталог<footnote> <para> Есть несколько мест куда можно распаковывать исходные тексты и собрать своё ядро, но это самый лёгкий способ, без необходимости раздачи специальных прав. </para> </footnote>. Также мы предполагаем, что у вас ядро версии &kernelversion;. Проверьте, что вы находитесь в каталоге куда хотите распаковать исходные тексты ядра, распакуйте их с помощью команды <userinput>tar xjf /usr/src/kernel-source-&kernelversion;.tar.bz2</userinput> и перейдите в только что появившийся каталог <filename>kernel-source-&kernelversion;</filename>.
zh_cn: 此后，我们假设您具有操作您机器的权力，可以将内核源码解到您的 home 目录<footnote> <para> 可以在其他目录解开内核源码并 build 自定义内核，但是不需要额外的权限是最简单的方式。</para> </footnote>。我们还假设您的内核版本是 "&kernelversion;。确定您处于打算解开内核源码的目录，然后使用 <userinput>tar xjf /usr/src/kernel-source-&kernelversion;.tar.bz2</userinput> 解开并进入 <filename>kernel-source-&kernelversion;</filename> 刚才创建的目录。
zh_tw: 此後，我們假設您具有操作您機器的權力，可以將核心原始碼解壓縮到您的 home 目錄<footnote> <para> 也可以在其他目錄解開核心原始碼並建立自定義核心，但是不需要額外的權限是最簡單的方式。 </para> </footnote>。我們還假設您的核心版本是 "&kernelversion;。確定您處於打算解開核心原始碼的目錄，然後使用 <userinput>tar xjf /usr/src/kernel-source-&kernelversion;.tar.bz2</userinput> 解壓縮並進入 <filename>kernel-source-&kernelversion;</filename> 剛才建立的目錄。

source: Now, you can configure your kernel. Run <userinput>make xconfig</userinput> if X11 is installed, configured and being run; run <userinput>make menuconfig</userinput> otherwise (you'll need <classname>libncurses5-dev</classname> installed). Take the time to read the online help and choose carefully. When in doubt, it is typically better to include the device driver (the software which manages hardware peripherals, such as Ethernet cards, SCSI controllers, and so on) you are unsure about. Be careful: other options, not related to a specific hardware, should be left at the default value if you do not understand them. Do not forget to select <quote>Kernel module loader</quote> in <quote>Loadable module support</quote> (it is not selected by default). If not included, your Debian installation will experience problems.
el: Τώρα μπορείτε να διαμορφώσετε τον πυρήνα σας. Εκτελέστε την εντολή <userinput>make xconfig</userinput> αν έχετε ήδη εγκαταστήσει, ρυθμίσει και τρέξει το περιβάλλον Χ11 ή διαφορετικά την <userinput>make menuconfig</userinput> (θα πρέπει να έχετε εγκαταστήσει το πακέτο <classname>libncurses5-dev</classname>). Αφιερώστε χρόνο στο να διαβάσετε την επιτόπου βοήθεια και διαλέξτε με προσοχή. Αν έχετε αμφιβολίες είναι συνήθως καλλίτερο να περιλαμβάνετε τους οδηγούς των συσκευών για τους οποίους (το λογισμικό που χειρίζεται τις περιφερειακές συσκευές όπως κάρτες Ethernet, ελεγκτές SCSI κτλ). για τους οποίους δεν είστε βέβαιοι. Προσέξτε: άλλες επιλογές που δεν σχετίζονται με ένα συγκεκριμένο υλικό θα πρέπει να αφήνονται στις προεπιλεγμένες τιμές τους αν δεν τις καταλαβαίνετε επαρκώς. Μην ξεχάσετε να επιλέξετε <quote>Kernel module loader</quote> στο <quote>Loadable module support</quote> (δεν είναι προεπιλεγμένο). Αν δεν το κάνετε η εγκατάσταση του Debian θα αντιμετωπίσει προβλήματα.
pt: Agora, pode configurar o seu kernel. Corra <userinput>make xconfig</userinput> se o seu X11 está instalado, configurado e a correr; corra <userinput>make menuconfig</userinput> caso contrário (irá necessitar da <classname>libncurses5-dev</classname> instalada). Dispense tempo para ler a ajuda online e escolher cuidadosamente as opções. Quando em dúvida, a melhor opção será incluir o gestor de periféricos (o software responsável por gerir os periféricos de hardware, tais como placas de rede - Ethernet -, controladores SCSI e mais) sobre o que está em dúvida. Tenha cuidado: outras opções, não relacionadas com hardware específico, devem ser deixadas com os valores pré-definidos se não compreender o que significam. Não se esqueça de seleccionar o <quote>Kernel module loader</quote> em <quote>Loadable module support</quote> (não está seleccionado de origem). Se não for incluído, a sua instalação Debian poderá vir a ter problemas.
ru: Теперь вы можете выполнить конфигурацию ядра. Если установлены, настроены и запущены X11, то запустите <userinput>make xconfig</userinput>, иначе <userinput>make menuconfig</userinput> (вам потребуется установить пакет <classname>libncurses5-dev</classname>). Внимательно прочитайте интерактивную документацию и внимательно выберите нужные параметры. Если что-то вам непонятно, обычно лучше включить драйвер устройства (программное обеспечение, которое управляет установленным оборудованием, например картами Ethernet, SCSI контроллерами и так далее). Будьте осторожны: для других параметров, не относящихся к определённому аппаратному обеспечению, нужно оставить значения по умолчанию, если вы не понимаете, что они делают. Не забудьте выбрать <quote>Kernel module loader</quote> в <quote>Loadable module support</quote> (не включён по умолчанию). Если его не включить, возникнут проблемы с установкой Debian.
zh_cn: 现在，您可以开始配置您的内核了。如果您已经安装配置好，并正在运行 X11，请执行 <userinput>make xconfig</userinput>；否则请执行 <userinput>make menuconfig</userinput>(必须已经安装好 <classname>libncurses5-dev</classname>)。请花点时间阅读在线帮助并仔细地作选择。如果有疑问，通常来说包含您所不确定的 设备驱动程序 (用来管理硬件外设的软件，例如以太网卡，SCSI 控制器等) 会比较好一点。注意：对于与特殊硬件无关的其它选项，如果您不了解它们，最好保持默认值。不要忘记选择 <quote>Kernel module loader</quote> 中的 <quote>Loadable module support</quote> (它们默认并没有被选择)。否则，您的 Debian 安装将会遇到问题。
zh_tw: 現在，您可以開始設定您的核心了。如果您已經安裝並正在執行 X11， 請執行 <userinput>make xconfig</userinput>﹔否則請執行 <userinput>make menuconfig</userinput> (必須已經安裝好 <classname>libncurses5-dev</classname>)。請花點時間閱讀線上說明並仔細地選擇。如果有任何疑慮，通常把您所不確定的設備驅動程式 (用來管理周邊硬體的軟體，例如以太網路卡、SCSI 控制器等) 一起編譯會比較好一點。注意：對於與特殊硬體無關的其它選項，如果您不瞭解它們，最好保持預設值。不要忘記選擇 <quote>Kernel module loader</quote> 中的 <quote>Loadable module support</quote> (它們預設並沒有被選擇)。否則，您的 Debian 安裝將會遇到問題。

source: Clean the source tree and reset the <classname>kernel-package</classname> parameters. To do that, do <userinput>make-kpkg clean</userinput>.
el: Καθαρίστε το δέντρο με τον πηγαίο κώδικα και επανρυθμίστε τις παραμέτρους του <classname>kernel-package</classname>. Για να το κάνετε αυτό εκτελέστε <userinput>make-kpkg clean</userinput>.
pt: Limpe a árvore da origem (source tree) e faça reset aos parâmetros do <classname>kernel-package</classname> . Para fazer isso, faça <userinput>make-kpkg clean</userinput>.
ru: Очистите дерево исходных текстов и сбросьте параметры <classname>kernel-package</classname>. Для этого выполните <userinput>make-kpkg clean</userinput>.
zh_cn: 清除源码树并复原 <classname>kernel-package</classname> 参数。也就是使用 <userinput>make-kpkg clean</userinput>。
zh_tw: 清除原始碼樹並復原 <classname>kernel-package</classname> 參數。也就是使用 <userinput>make-kpkg clean</userinput>。

source: Now, compile the kernel: <userinput>fakeroot make-kpkg --revision=custom.1.0 kernel_image</userinput>. The version number of <quote>1.0</quote> can be changed at will; this is just a version number that you will use to track your kernel builds. Likewise, you can put any word you like in place of <quote>custom</quote> (e.g., a host name). Kernel compilation may take quite a while, depending on the power of your machine.
el: Τώρα χτίστε τον πυρήνα: <userinput>fakeroot make-kpkg --revision=custom.1.0 kernel_image</userinput>. Ο αριθμός έκδοσης <quote>1.0</quote>μπορεί να αλλάξει όπως θέλετε. Είναι απλά ένας αριθμός έκδοσης που μπορείτε να χρησιμοποιείτε για να καταγράφετε τους πυρήνες που φτιάχνετε. Αντίστοιχα, μπορείτε να βάλετε οποιαδήποτε λέξη στη θέση του <quote>custom</quote> (πχ. το όνομα του μηχανήματός σας). Η μεταγλώττιση του πυρήνα μπορεί να πάρει αρκετή ώρα ανάλογα με την ισχύ του μηχανήματός σας.
pt: Agora, compile o kernel: <userinput>fakeroot make-kpkg --revision=custom.1.0 kernel_image</userinput>. O número da versão de <quote>1.0</quote> pode ser mudada à vontade; isto é apenas um número de versão que irá usar para manter registo das suas compilações. Da mesma forma, pode colocar qualquer palavra que deseje no lugar de <quote>custom</quote> (e.g., um host name). A compilação do kernel poderá demorar um pouco, dependendo da capacidade da sua máquina.
ru: Теперь соберите ядро: <userinput>fakeroot make-kpkg --revision=custom.1.0 kernel_image</userinput>. Номер версии <quote>1.0</quote> можно изменить; этот номер версии нужен только для отслеживания ваших сборок. Более того, вы можете добавить любое слово вместо <quote>custom</quote> (например имя машины). Сборка ядра может занять некоторое время в зависимости от мощности машины.
zh_cn: 现在，开始编译内核： <userinput>fakeroot make-kpkg --revision=custom.1.0 kernel_image</userinput>。其中版本号 <quote>1.0</quote> 可以随便您修改；它仅是一个用来跟踪您的内核编译的版本号。同样地，您也可以用任何您喜欢的单词替换 <quote>custom</quote> (例如，您的主机名称)。编译内核可能要花费较长的时间，这取决于您的机器的性能。
zh_tw: 現在，開始編譯核心：<userinput>fakeroot make-kpkg --revision=custom.1.0 kernel_image</userinput>。其中版本號 <quote>1.0</quote> 可以隨便您修改﹔它僅用來追蹤您的核心編譯的版本號。同樣地，您也可以用任何您喜歡的單詞替換 <quote>custom</quote> (例如，您的主機名稱)。編譯核心可能要花費較長的時間，這取決於您的機器的性能。

source: If you require PCMCIA support, you'll also need to install the <classname>pcmcia-source</classname> package. Unpack the gzipped tar file as root in the directory <filename>/usr/src</filename> (it's important that modules are found where they are expected to be found, namely, <filename>/usr/src/modules</filename>). Then, as root, do <userinput>make-kpkg modules_image</userinput>.
el: Αν θέλετε υποστήριξη PCMCIA θα πρέπει επίσης να εγκαταστήσετε το πακέτο <classname>pcmcia-source</classname>. Αποσυμπιέστε το συμπιεσμένο αρχείο σαν χρήστης root στον κατάλογο <filename>/usr/src</filename> (είναι σημαντικό τα modules να βρίσκονται εκεί που αναμένεται να βρίσκονται, δηλαδή στον κατάλογο <filename>/usr/src/modules</filename>). Μετά, σαν root, εκτελέστε την εντολή <userinput>make-kpkg modules_image</userinput>.
pt: Se necessitar de suporte PCMCIA, irá necessitar de instalar o pacote <classname>pcmcia-source</classname> . Extraia o ficheiro tar gzipped como root para a directoria <filename>/usr/src</filename> (é importante que os módulos sejam encontrados quando é suposto, nomeadamente, <filename>/usr/src/modules</filename>). Então, como root, faça <userinput>make-kpkg modules_image</userinput>.
ru: Если требуется поддержка PCMCIA, вам нужно установить пакет <classname>pcmcia-source</classname>. Распакуйте сжатый tar файл с правами суперпользователя в каталог <filename>/usr/src</filename> (это важно, так как модули должны находиться там где их будут искать, то есть в <filename>/usr/src/modules</filename>). Затем, с правами суперпользователя, выполните <userinput>make-kpkg modules_image</userinput>.
zh_cn: 如果您需要支持 PCMCIA，您必须安装 <classname>pcmcia-source</classname> 软件包。以 root 身份将用 gzip 压缩的 tar 文件解压到 <filename>/usr/src</filename> 目录内(注意模块必须位于它们所应处的位置，即 <filename>/usr/src/modules</filename>)。然后，以 root 身份执行 <userinput>make-kpkg modules_image</userinput>。
zh_tw: 如果您需要支援 PCMCIA，您必須安裝 <classname>pcmcia-source</classname> 軟體套件。以 root 身份將用 gzip 壓縮的 tar 檔案解壓到 <filename>/usr/src</filename> 目錄內 (注意模組必須位於它們所應處的位置，即 <filename>/usr/src/modules</filename>)。然後，以 root 身份執行 <userinput>make-kpkg modules_image</userinput>。
