Repository: xobs/debian-installer
Catalog: doc/manual/po/*/post-install.po
Languages: el, pt, ru, zh_cn, zh_tw

source: Once the compilation is complete, you can install your custom kernel like any package. As root, do <userinput>dpkg -i ../kernel-image-&kernelversion;-<replaceable>subarchitecture</replaceable>_custom.1.0_&architecture;.deb</userinput>. The <replaceable>subarchitecture</replaceable> part is an optional sub-architecture, <phrase arch="i386"> such as <quote>i586</quote>, </phrase> depending on what kernel options you set. <userinput>dpkg -i kernel-image...</userinput> will install the kernel, along with some other nice supporting files. For instance, the <filename>System.map</filename> will be properly installed (helpful for debugging kernel problems), and <filename>/boot/config-&kernelversion;</filename> will be installed, containing your current configuration set. Your new <classname>kernel-image-&kernelversion;</classname> package is also clever enough to automatically use your platform's boot-loader to run an update on the booting, allowing you to boot without re-running the boot loader. If you have created a modules package, e.g., if you have PCMCIA, you'll need to install that package as well.
el: Όταν η μεταγλώττιση έχει ολοκληρωθεί, μπορείτε να εγκαταστήσετε τον προσωπικό σας πυρήνα όπως ένα οποιοδήποτε πακέτο.Σαν root τρέξτε <userinput>dpkg -i ../kernel-image-&kernelversion;-<replaceable>subarchitecture</replaceable>_custom.1.0_&architecture;.deb</userinput>. Το κομμάτι <replaceable>subarchitecture</replaceable> είναι προαιρετικά μια υπο-αρχιτεκτονική <phrase arch="i386"> όπως <quote>i586</quote>, </phrase> που εξαρτάται από τις επιλογές του πυρήνα που κάνετε. Η εντολή <userinput>dpkg -i kernel-image...</userinput> θα εγκαταστήσει τον πυρήνα μαζί με κάποια επιπλέον χρήσιμα αρχεία. Για παράδειγμα, το <filename>System.map</filename> θα εγκατασταθεί κανονικά (χρήσιμο για την εκσφαλμάτωση προβλημάτων του πυρήνα) 'οπως και το <filename>/boot/config-&kernelversion;</filename> που περιέχει τις τρέχουσες ρυθμίσεις σας, Το καινούριο πακέτο σας <classname>kernel-image-&kernelversion;</classname> είναι ακόμα αρκετά έξυπνο ώστε να χρησιμοποιήσει αυτόματα τον φορτωτή εκκίνησης της πλατφόρμας σας για να ενημερώσει τον μηχανισμό εκκίνησης επιτρέποντας σας έτσι να εκκινήσετε χωρίς να ξανατρέξετε τον φορτωτή εκκίνησης. Αν έχετε δημιουργήσει ένα πακέτο των modules, πχ. αν έχετε PCMCIA, θα πρέπει επίσης να εγκαταστήσετε το πακέτο αυτό.
pt: Quando a compilação estiver completa, poderá instalar o seu kernel personalizado como qualquer pacote. Como root, faça <userinput>dpkg -i ../kernel-image-&kernelversion;-<replaceable>subarchitecture</replaceable>_custom.1.0_&architecture;.deb</userinput>. A parte <replaceable>subarchitecture</replaceable> é uma sub-arquitectura opcional, <phrase arch="i386"> tal como <quote>i586</quote>, </phrase> dependendo das opções de kernel que colocou. <userinput>dpkg -i kernel-image...</userinput> irá instalar o kernel, juntamente com alguns outros ficheiros de suporte. Por exemplo, o <filename>System.map</filename> irá ser instalado correctamente (ajuda a fazer debug de problemas no kernel), e <filename>/boot/config-&kernelversion;</filename> irá ser instalado, contendo a sua configuração actual. O seu novo pacote <classname>kernel-image-&kernelversion;</classname> é também suficiente esperto para automaticamente usar o gestor de arranque correcto para a sua plataforma, para realizar uma actualização no arranque, permitindo-o arrancar sem voltar a executar o gestor de arranque. Se criou um pacote de módulos, e.g., se tem PCMCIA, irá igualmente necessitar de instalar esse pacote.
ru: После завершения сборки вы можете установить собранное ядро как обычный пакет. От суперпользователя выполните <userinput>dpkg -i ../kernel-image-&kernelversion;-<replaceable>subarchitecture</replaceable>_custom.1.0_&architecture;.deb</userinput>. Часть <replaceable>subarchitecture</replaceable> &mdash; это необязательная субархитектура, <phrase arch="i386"> например <quote>i586</quote>, </phrase> зависящая от установленных параметров ядра. <userinput>dpkg -i kernel-image...</userinput> установит ядро вместе с некоторыми полезными файлами поддержки. Например, будет правильно установлен <filename>System.map</filename> (полезен при отладке проблем с ядром), а также <filename>/boot/config-&kernelversion;</filename>, содержащий параметры сборки ядра. Ваш новый пакет <classname>kernel-image-&kernelversion;</classname> достаточно умён, чтобы автоматически использовать системный загрузчик платформы для обновления загрузки, что позволяет не делать перезапуск обновления системного загрузчика вручную. Если вы создали пакет с модулями, например, если у вас есть PCMCIA, то вам нужно установить и этот пакет.
zh_cn: 一旦编译完成，您就可以像安装其它软件包一样安装您的内核。以 root 身份，执行 <userinput>dpkg -i ../kernel-image-&kernelversion;-<replaceable>subarchitecture</replaceable>_custom.1.0_&architecture;.deb</userinput>。其中 <replaceable>subarchitecture</replaceable> 部分是一个可选的子结构，<phrase arch="i386"> 例如 <quote>i586</quote>, </phrase> 这取决于您所设置的内核选项。<userinput>dpkg -i kernel-image...</userinput> 将安装内核以及其它的一些支持文件。例如 <filename>System.map</filename> 可能会被安装 (用来辅助调试内核问题)，<filename>/boot/config-&kernelversion;</filename> 也将被安装，它包含了您当前的配置。新的 <classname>kernel-image-&kernelversion;</classname> 软件包将会自动地使用您的系统上的启动引导器来更新引导区，因此您不必重新运行启动引导器即可引导系统。如果您创建了一个模块软件包，例如 PCMCIA，您也必须同时安装该软件包。
zh_tw: 一旦編譯完成，您就可以像安裝其它軟體套件一樣安裝您的核心。以 root 身份，執行 <userinput>dpkg -i ../kernel-image-&kernelversion;-<replaceable>subarchitecture</replaceable>_custom.1.0_&architecture;.deb</userinput>。其中 <replaceable>subarchitecture</replaceable> 部分是一個可選的子結構，<phrase arch="i386"> 例如 <quote>i586</quote>, </phrase> 這取決於您所設置的核心選項。<userinput>dpkg -i kernel-image...</userinput> 將安裝核心以及其它的一些支援檔案。例如 <filename>System.map</filename> 可能會被安裝 (用來輔助除錯核心問題)，<filename>/boot/config-&kernelversion;</filename> 也將被安裝，它包含了您目前的設定。新的 <classname>kernel-image-&kernelversion;</classname> 軟體套件將會自動使用您系統上的 boot-loader 來更新開機區，因此您不必重新執行 boot-loader 即可開機系統。如果您建立了一個模組軟體套件，例如 PCMCIA，您也必須同時安裝該軟體套件。

source: It is time to reboot the system: read carefully any warning that the above step may have produced, then <userinput>shutdown -r now</userinput>.
el: Είναι στιγμή να επανεκκινήσετε το σύστημα: διαβάστε προσεκτικά οποιοδήποτε προειδοποιητικό μήνυμα πιθανόν παρουσιάστηκε στο προηγούμενο βήμα και μετά εκτελέστε <userinput>shutdown -r now</userinput>.
pt: É altura de re-iniciar o sistema; leia cuidadosamente qualquer aviso que o passo acima possa ter produzido, e de seguida faça <userinput>shutdown -r now</userinput>.
ru: Настало время перезагрузить систему: внимательно прочитайте все предупреждения, которые могут появиться, затем наберите <userinput>shutdown -r now</userinput>.
zh_cn: 下面到了重启系统的时刻了；请仔细阅读前述步骤所产生的所有警告信息，然后执行 <userinput>shutdown -r now</userinput>。
zh_tw: 下面到了重新啟動系統的時刻了﹔請仔細閱讀前述步驟所產生的所有警告資訊，然後執行 <userinput>shutdown -r now</userinput>。

source: For more information on <classname>kernel-package</classname>, read the fine documentation in <filename>/usr/share/doc/kernel-package</filename>.
el: Για περισσότερες πληροφορίες για το <classname>kernel-package</classname>,διαβάστε την εξαιρετική τεκμηρίωση στο <filename>/usr/share/doc/kernel-package</filename>.
pt: Para mais informação sobre <classname>kernel-package</classname>, leia a documentação em <filename>/usr/share/doc/kernel-package</filename>.
ru: Полная информация по <classname>kernel-package</classname> лежит в каталоге <filename>/usr/share/doc/kernel-package</filename>.
zh_cn: 欲获得关于 <classname>kernel-package</classname> 的更多信息，请参阅 <filename>/usr/share/doc/kernel-package</filename>。
zh_tw: 欲取得關於 <classname>kernel-package</classname> 的更多資訊，請參閱 <filename>/usr/share/doc/kernel-package</filename>。

source: Recovering a Broken System
el: Ανακτώντας ένα Σπασμένο σύστημα
pt: Recuperar um Sistema Estragado
ru: Восстановление неработающей системы
zh_cn: 修复损坏的系统

source: Sometimes, things go wrong, and the system you've carefully installed is no longer bootable. Perhaps the boot loader configuration broke while trying out a change, or perhaps a new kernel you installed won't boot, or perhaps cosmic rays hit your disk and flipped a bit in <filename>/sbin/init</filename>. Regardless of the cause, you'll need to have a system to work from while you fix it, and rescue mode can be useful for this.
el: Μερικές φορές τα πράγματα μπορεί να πάνε στραβά και το σύστημα που με τόση προσοχή εγκαταστήσατε δεν είναι πια εκκινήσιμο. Πιθανόν να καταστράφηκε η ρύθμιση του φορτωτή εκκίνησης ενώ δοκιμάζατε κάποια αλλαγή ή ένας καινούριος πυρήνας που εγκαταστήσατε δεν εκκινεί ή ίσως κοσμικές ακτίνες χτύπησαν τον δίσκο σας και άλλαξαν ένα μπιτ στο <filename>/sbin/init</filename>. Ανεξάρτητα από την αιτία, θα πρέπει να έχετε κάποιο σύστημα από το οποίο να μπορείτε να δουλέψετε μέχρι να διορθώσετε το σύστημά σας και η κατάσταση "διάσωσης" μπορεί να φανεί χρήσιμη σε αυτό.
pt: Por vezes, as coisas correm mal, e o sistema que você instalou cuidadosamente já não arranca. Talvez a configuração do carregador de arranque se tenha estragado enquanto experimentava uma alteração, ou talvez o novo kernel que você instalou não arranque, ou talvez raios cósmicos tenham atingido o seu disco rígido e tenham trocado um bit em <filename>/sbin/init</filename>. Seja qual for a causa, você precisa de um sistema que funcione enquanto você o compõe, e o modo de recuperação pode ser útil para isso.
ru: Иногда что-то идёт неправильно, и система, которую вы аккуратно установили больше не загружается. Возможно, испортились настройки системного загрузчика во время изменения, или не хочет загружаться новое ядро, или космические лучи попали в жёсткий диск и исправили единичку на нолик в файле <filename>/sbin/init</filename>. В любом случае, вам нужна система с которой можно всё исправить, и режим восстановления может помочь в этом.
zh_cn: 有时候，会遇到一些麻烦，您小心翼翼安装的系统无法启动。可能是由于调整启动加载程序时损坏了配置文件， 或者新准备的内核无法启动，或者宇宙射线撞击了您的硬盘造成 <filename>/sbin/init</filename> 中的一位反转。无论什么原因，修复时您都需要一个可以工作的系统，rescue 模式正好用于此目的。

source: To access rescue mode, type <userinput>rescue</userinput> at the <prompt>boot:</prompt> prompt, or boot with the <userinput>rescue/enable=true</userinput> boot parameter. You'll be shown the first few screens of the installer, with a note in the corner of the display to indicate that this is rescue mode, not a full installation. Don't worry, your system is not about to be overwritten! Rescue mode simply takes advantage of the hardware detection facilities available in the installer to ensure that your disks, network devices, and so on are available to you while repairing your system.
el: Για να μπείτε στην κατάσταση "διάσωσης" πληκτρολογήστε <userinput>rescue</userinput> στο προτρεπτικό <prompt>boot:</prompt> ή εκκινήστε με την παράμετρο εκκίνησης <userinput>rescue/enable=true</userinput>. Θα δείτε τις λίγες πρώτες οθόνες του εγκαταστάτη με μια σημείωση στην άκρη της οθόνης που υποδεικνύει ότι βρίσκεστε σε κατάσταση "διάσωσης" και όχι πλήρους εγκατάστασης. Μην ανησυχείτε, το σύστημά σας δεν πρόκειται να γραφεί από πάνω! Η κατάσταση διάσωσης εκμεταλλεύεται απλά τις δυνατότητες ανίχνευσης υλικού που διαθέτει ο εγκαταστάτης για να βεβαιώσει ότι οι δίσκοι, οι συσκευές δικτύου κοκ. είναι διαθέσιμα σε σας κατά την επιδιόρθωση του συστήματος.
pt: Para aceder ao modo de recuperação, escreva <userinput>rescue</userinput> na prompt <prompt>boot:</prompt>, ou arranque com o parâmetro de arranque <userinput>rescue/enable=true</userinput>. Ser-lhe-ão mostrados os primeiros ecrãs do instalador, com uma nota no canto do seu monitor a indicar que este é o modo de recuperação, e não uma instalação completa. Não se preocupe, o seu sistema não está prestes a ser reescrito! O modo de recuperação apenas tira partido das capacidades de detecção de hardware disponíveis no instalador para se certificar que os seus discos, dispositivos de rede, e por aí fora estão disponíveis para si enquanro você repara o seu sistema.
ru: Чтобы войтив режим восстановления, введите <userinput>rescue</userinput> после приглашения <prompt>boot:</prompt>, или загрузитесь с параметром загрузки <userinput>rescue/enable=true</userinput> . В начале вы пройдёте по нескольким диалогам программы установки, на которых есть пометка в углу экрана, что это режим восстановления, а не полная установка. Не волнуйтесь, ваши данные не исчезнут! Режим восстановления использует программу установки только для определения имеющихся устройств, таких как диски и сетевые устройства, и они будут доступны во время восстановления системы.
zh_cn: 要进入 rescue 模式，请再 <prompt>boot:</prompt> 提示符后键入 <userinput>rescue</userinput>， 或者启动时给给引导参数加上 <userinput>rescue/enable=true</userinput>。 您会看到安装程序的前几个画面，并再显示器的角落里面提示处于 rescue 模式，而不是完整安装。 别担心，您的系统不会被覆盖! rescue 模式只是借助安装程序强大的硬件探测能力，确保修复系统的时候 硬盘，网络设备等等可以使用。

source: Instead of the partitioning tool, you should now be presented with a list of the partitions on your system, and asked to select one of them. Normally, you should select the partition containing the root file system that you need to repair. You may select partitions on RAID and LVM devices as well as those created directly on disks.
el: Αντί για το εργαλείο διαμέρισης, θα δείτε τώρα μια λίστα με τις κατατμήσεις στο σύστημά σας και θα σας ζητηθεί να διαλέξετε μια από αυτές. Συνήθως θα πρέπει να διαλέξετε την κατάτμηση που περιέχει το ριζικό σύστημα αρχείων που θέλετε να επιδιορθώσετε. Μπορείτε να επιλέξετε κατατμήσεις σε συσκευές RAID και LVM καθώς κι αυτές που έχουν δημιουργηθεί κατευθείαν στους δίσκους.
pt: Em vez da ferramenta de particionamento, deve ser-lhe apresentada uma lista das partições no seu sistema, e ser-lhe-à pedido que seleccione uma delas. Normalmente, você deverá escolher a partição que contém o sistema de ficheiros raiz que você necessita reparar. Você pode escolher partições em dispositivos RAID e LVM assim como as criadas directamente nos discos.
ru: Вместо программы разметки, вам покажут список разделов, имеющихся в системе, попросят выбрать один из них. Обычно, нужно выбрать раздел, содержащий корневую систему, которую нужно восстановить. Кроме созданных непосредственно на дисках, вы можете выбирать разделы на устройствах RAID и LVM.
zh_cn: 取代分区工具的，是显示您系统上的分区列表，并请您选择。通常，您应该选择修复包含 root 文件系统的分区。 您也可以选择 RAID 和 LVM 设备上的分区，与直接在磁盘上创建一样。

source: If possible, the installer will now present you with a shell prompt in the file system you selected, which you can use to perform any necessary repairs. <phrase arch="i386"> For example, if you need to reinstall the GRUB boot loader into the master boot record of the first hard disk, you could enter the command <userinput>grub-install '(hd0)'</userinput> to do so. </phrase>
el: Αν είναι εφικτό, ο εγκαταστάτης θα σας παρουσιάσει τώρα με το προτρεπτικό ενός κελύφους στο σύστημα αρχείων που επιλέξατε, το οποίο μπορείτε να χρησιμοποιήσετε για να πραγματοποιήσετε όποιες απαραίτητες επισκευές. <phrase arch="i386"> Για παράδειγμα. αν χρειαστεί να επανεγκαταστήσετε τον φορτωτή εκκίνησης GRUB στο κύριο αρχείο εκκίνησης (MBR) του πρώτου δίσκου, μπορείτε να δώσετε την εντολή <userinput>grub-install '(hd0)'</userinput> για να το κάνετε.</phrase>
pt: Se possível, o instalador irá agora apresentar-lhe uma prompt da shell no sistema de ficheiros que você seleccionou, o qual você pode utilizar para executar quaisquer reparações necessárias. <phrase arch="i386"> Por exemplo, se você necessitar reinstalar o carregador de arranque GRUB no master boot record do primeiro disco, você pode introduzir o comando <userinput>grub-install '(hd0)'</userinput> para o fazer. </phrase>
ru: Если возможно, программа установки запустит оболочку командной строки в выбранной файловой системе, где вы сможете сделать любые дополнительныепроцедуры восстановления. <phrase arch="i386"> Например, для переустановки системного загрузчика GRUB в главную загрузочную запись первого жёсткого диска, введите команду <userinput>grub-install '(hd0)'</userinput> . </phrase>
zh_cn: 如可能，安装程序将在您选择的文件系统上给您一个 shell 提示符，通过它可以执行一些必要的修复操作。 <phrase arch="i386">例如，如果您需要在第一个硬盘的主引导区重装 GRUB 引导程序， 您可以通过输入这个命令 <userinput>grub-install '(hd0)'</userinput>。</phrase>

source: If the installer cannot run a usable shell in the root file system you selected, perhaps because the file system is corrupt, then it will issue a warning and offer to give you a shell in the installer environment instead. You may not have as many tools available in this environment, but they will often be enough to repair your system anyway. The root file system you selected will be mounted on the <filename>/target</filename> directory.
el: Αν ο εγκαταστάτης δεν μπορεί να τρέξει ένα χρηστικό κέλυφος στο ριζικό σύστημα αρχείων που διαλέξατε, πιθανόν επειδή αυτό είναι σοβαρά αλλοιωμένο, τότε θα εμφανίσει μια προειδοποίηση και θα σας προσφέρει ένα κέλυφος στο στο περιβάλλον του εγκαταστάτη. Ίσως να μην έχετε εξίσου αρκετά εργαλεία διαθέσιμα στο περιβάλλον αυτό, αλλά συχνά θα είναι αρκετά για να επιδιορθώσετε το σύστημά σας με κάποιο τρόπο. Το σύστημα αρχείων που επιλέξατε θα προσαρτηθεί στον κατάλογο <filename>/target</filename>.
pt: Se o instalador não conseguir correr uma shell utilizável no sistema de ficheiros raiz que você escolheu, talvez porque o sistema de ficheiros está corrompido, então irá lançar um aviso e oferecer-se para em vez disso dar-lhe uma shell no ambiente do instalador. Você poderá não ter tantos utilitários disponíveis neste ambiente, mas muitas vezes serão suficientes para reparar o seu sistema. O sistema de ficheiros raiz que você seleccionou será montado no directório <filename>/target</filename>.
ru: Иногда программе установки не удаётся запустить оболочку командной строки в выбранной корневой файловой системе. Возможной причиной может быть повреждение файловой системы, и в этом случае выдаётся предупреждение и предлагается запустить оболочку командной строки в среде программы установки. Здесь не так много полезных программ, но и их часто достаточно для восстановления системы. Выбранная корневая файловая система будет смонтирована в каталог <filename>/target</filename>.
zh_cn: 假如安装程序在您选择的 root 文件系统上不能运行一个可用的 shell，这可能是因为文件系统已经损坏， 那么将发出警告，并通过安装程序的环境提供一个 shell。您在这个环境下可能没有丰富的工具可用， 但足以应付系统修复工作。您选择的 root 文件系统将挂载到 <filename>/target</filename> 目录。

source: In either case, after you exit the shell, the system will reboot.
el: Σε κάθε περίπτωση, αφού εγκαταλείψετε το κέλυφος, το σύστημα θα επανεκκινήσει.
pt: Em qualquer dos casos, após você sair da shell, o sistema irá reiniciar.
ru: В обоих случаях, после выхода из оболочки командной строки система будет перезагружена.
zh_cn: 无论哪种情况，退出 shell 之后，系统将重启。

source: Finally, note that repairing broken systems can be difficult, and this manual does not attempt to go into all the things that might have gone wrong or how to fix them. If you have problems, consult an expert.
el: Τέλος. σημειώστε ότι η επιδιόρθωση "σπασμένων" συστημάτων μπορεί να είναι δύσκολη και αυτό το εγχειρίδιο δεν προσπαθεί να μπει σε όλες τις λεπτομέρειες που μπορεί να έχουν πάει λάθος ή στο πώς να τις διορθώσετε. Αν έχετε προβλήματα, συμβουλευτείτε έναν ειδικό.
pt: Finalmente, note que reparar sistemas estragados pode ser dificil, e este manual não tenta desenvolver todas as coisas que podem ter corrido mal e como as corrigir. Se você tiver problemas, consulte um especialista.
ru: И напоследок заметим, что восстановление нерабочей системы может оказаться очень трудным делом, и это руководство не пытается описать все возможные случаи, которые могут произойти и способы их решения. Если у вас есть проблемы &mdash; обратитесь к профессионалам.
zh_cn: 最后，要注意修复一个损坏的系统可能非常困难，在这份手册里面不会列举所有的情况和修复方法。 如果您遇到困难，请咨询专家。
