Repository: xobs/debian-installer
Catalog: doc/manual/po/*/post-install.po
Languages: el, pt, ru, zh_cn, zh_tw

source: Next Steps and Where to Go From Here
el: Επόμενα βήματα και πού να πάτε από δω κι ύστερα
pt: Próximos Passos e Onde Ir a Partir Daqui
ru: Следующие шаги и что делать дальше
zh_cn: 下一步该干什么
zh_tw: 下一步該做什麼

source: If You Are New to Unix
el: Αν είσαστε καινούριος στο Unix
pt: Se Você é Novo em Unix
ru: Если вы новичок в Unix
zh_cn: 如果您不熟悉 Unix
zh_tw: 如果您不熟悉 Unix

source: If you are new to Unix, you probably should go out and buy some books and do some reading. A lot of valuable information can also be found in the <ulink url="&url-debian-reference;">Debian Reference</ulink>. This <ulink url="&url-unix-faq;">list of Unix FAQs</ulink> contains a number of UseNet documents which provide a nice historical reference.
el: Αν είσαστε καινούριος στο Unix, ίσως να θέλατε να βγείτε έξω και να αγοράσετε μερικά βιβλία! Πολλές πολύτιμες πληροφορίες μπορούν να βρεθούν επίσης στο <ulink url="&url-debian-reference;">Debian Reference</ulink>. Ακόμα εδώ <ulink url="&url-unix-faq;">list of Unix FAQs</ulink> περιέχονται ένας αριθμός από κείμενα στο UseNet που δίνουν μια καλή ιστορική αναφορά.
pt: Se você é novo em Unix, você provavelmente deve saír e comprar alguns livros e fazer algumas leituras. Muita informação valiosa pode também ser encontrada em <ulink url="&url-debian-reference;">Debian Reference</ulink>. Esta <ulink url="&url-unix-faq;">lista de FAQs de Unix</ulink> contém um número de documentos da UseNet que disponibilizam boas referências históricas.
ru: Если вы новичок в Unix, то, вероятно, вам стоит купить несколько книг и что-нибудь почитать. Много полезной информации можно найти в <ulink url="&url-debian-reference;">справочнике по Debian</ulink>. В <ulink url="&url-unix-faq;">списке Unix FAQs</ulink> содержатся ссылки на некоторые интересные документы UseNet.
zh_cn: 如果您不熟悉 Unix，您也许应该出去买些书来读。还可以从 <ulink url="&url-debian-reference;">Debian Reference</ulink> 找到到大量有用的信息。<ulink url="&url-unix-faq;">Unix 常见问题解答</ulink> 中包含了大量的 Usenet 文档，它提供过去很有用的参考。
zh_tw: 如果您不熟悉 Unix，您也許應該出去買些書來讀。還可以從 <ulink url="&url-debian-reference;">Debian Reference</ulink> 找到到大量有用的資訊。<ulink url="&url-unix-faq;">Unix 常見問答集</ulink>中包含了大量的 Usenet 文件，它提供很有用的參考。

source: Linux is an implementation of Unix. The <ulink url="&url-ldp;">Linux Documentation Project (LDP)</ulink> collects a number of HOWTOs and online books relating to Linux. Most of these documents can be installed locally; just install the <classname>doc-linux-html</classname> package (HTML versions) or the <classname>doc-linux-text</classname> package (ASCII versions), then look in <filename>/usr/share/doc/HOWTO</filename>. International versions of the LDP HOWTOs are also available as Debian packages.
el: To Linux είναι μια υλοποίηση του Unix. Το project <ulink url="&url-ldp;">Linux Documentation Project (LDP)</ulink> συλλέγει έναν αριθμό από HOWTOs και δικτυκά βιβλία που σχετίζονται με το Linux. Τα περισσότερα από τα κείμενα αυτά μπορούν να εγκατασταθούν τοπικά. Απλά εγκαταστήστε το πακέτο <classname>doc-linux-html</classname> (σε μορφή HTML) ή το πακέτο <classname>doc-linux-text</classname> package (σε μορφή ASCII), και μετά κοιτάξτε στον κατάλογο <filename>/usr/share/doc/HOWTO</filename>. Διεθνείς εκδόσεις των HOWTOs του LDP είναι επίσης διαθέσιμες σαν πακέτα του Debian.
pt: O Linux é uma implementação de Unix. O <ulink url="&url-ldp;"> Projecto de Documentação de Linux (LDP)</ulink> junta inúmeros HOWTOs e livros online relacionados com Linux. A maioria destes documentos pode ser instalada localmente; basta que instale o pacote <classname>doc-linux-html</classname> (versão HTML) ou o pacote <classname>doc-linux-text</classname> (versão ASCII), e depois procure em <filename>/usr/share/doc/HOWTO</filename>. Versões internacionais dos HOWTOs LDP também estão disponíveis como pacotes Debian.
ru: Linux &mdash; это одна из реализаций Unix. <ulink url="&url-ldp;">Linux Documentation Project (LDP)</ulink> собирает различные HOWTO и электронные книги, посвящённые Linux. Большинство из этих документов можно получить просто установив пакет <classname>doc-linux-html</classname> (HTML версия) или пакет <classname>doc-linux-text</classname> (ASCII версия), а затем перейти в каталог <filename>/usr/share/doc/HOWTO</filename>. Переводы LDP HOWTO также доступны в виде пакетов Debian.
zh_cn: Linux 是 Unix 的一种实现。<ulink url="&url-ldp;">Linux 文档计划 (LDP)</ulink> 收集了大量的 HOWTO 和 Linux 的在线书籍。这些文档绝大部分可以在本地安装；只要安装 <classname>doc-linux-html</classname> 包(HTML 版本)或者 <classname>doc-linux-text</classname>包(ASCII 版本)，然后在 <filename>/usr/share/doc/HOWTO</filename> 里面就能找到。在 Debian 软件包里面也提供 LDP HOWTO 的国际化版本。
zh_tw: Linux 是 Unix 的實作。<ulink url="&url-ldp;">Linux 文件計劃 (LDP)</ulink> 收集了大量的 HOWTO 和 Linux 的線上書籍。這些文件絕大部分可以在本地安裝；只要安裝 <classname>doc-linux-html</classname> 套件 (HTML 版本) 或者 <classname>doc-linux-text</classname> 套件 (ASCII 版本)，然後在 <filename>/usr/share/doc/HOWTO</filename> 裡面就能找到。在 Debian 軟體套件裡面也提供 LDP HOWTO 的國際化版本。

source: Orienting Yourself to Debian
el: Προσανατολιστείτε στο Debian
pt: Oriente-se Para Debian
ru: Самостоятельное ориентирование в Debian
zh_cn: 让您自己转向 Debian
zh_tw: 讓您自己轉向 Debian

source: Debian is a little different from other distributions. Even if you're familiar with Linux in other distributions, there are things you should know about Debian to help you to keep your system in a good, clean state. This chapter contains material to help you get oriented; it is not intended to be a tutorial for how to use Debian, but just a very brief glimpse of the system for the very rushed.
el: To Debian διαφέρει λίγο από άλλες διανομές. Ακόμα κι αν είσαστε εξοικειωμένοι με το Linux από άλλες διανομές, υπάρχουν πράγματα που θα πρέπει να ξέρετε ώστε να μπορέσετε να κρατάτε το σύστημά σας σε μια καλή, τακτική κατάσταση. Το κεφάλαιο αυτό περιέχει απλά υλικό που θα σας βοηθήσει να προσανατολιστείτε. Δεν έχει σκοπό να δώσει ένα tutorial στο πώς να χρησιμοποιείτε το Debian αλλά μόνο μια γρήγορη ματιά για τους πολύ βιαστικούς!
pt: O Debian é ligeiramente diferente das outras distribuições. Mesmo se está familiarizado com outras distribuições de Linux, há algumas coisas que deverá saber sobre Debian para o ajudar a manter o seu sistema limpo e eficiente. Este capítulo contém material para o orientar; não é intenção ser um tutorial sobre como usar Debian, mas apenas um breve piscar de olhos do sistema, para os muito apressados.
ru: Debian слегка отличается от других дистрибутивов. Даже если вы знакомы с другими дистрибутивами Linux, есть вещи, которые вы должны знать о Debian, чтобы поддерживать систему в рабочем состоянии. Эта глава содержит материалы, которые помогут вам ориентироваться; она не является руководством по использованию Debian, она всего лишь кратко описывает систему для занятых людей.
zh_cn: Debian 和其它的发行版有些不同。即使您熟悉其它发行版的 Linux，您也应该了解 Debian 的一些东西，以便保持您的系统处在整洁良好的状态。本章包的材料可以帮助您转向；但这并不是一个如何使用 Debian 的入门指南，而仅仅是对整个系统的一个粗略的介绍。
zh_tw: Debian 和其它的發行版有些不同。即使您熟悉其它發行版的 Linux，您也應該瞭解 Debian 的一些東西，以便保持您的系統處在整潔良好的狀態。本章包含的內容可以幫助您瞭解 Debian﹔但這並不是一個如何使用 Debian 的入門指南，而僅僅是對整個系統的一個粗略的介紹。

source: Debian Packaging System
el: Το σύστημα πακέτων του Debian
pt: Sistema de Pacotes Debian
ru: Система управления пакетами Debian
zh_cn: Debian 软件包系统
zh_tw: Debian 軟體套件系統

source: The most important concept to grasp is the Debian packaging system. In essence, large parts of your system should be considered under the control of the packaging system. These include: <itemizedlist> <listitem><para> <filename>/usr</filename> (excluding <filename>/usr/local</filename>) </para></listitem> <listitem><para> <filename>/var</filename> (you could make <filename>/var/local</filename> and be safe in there) </para></listitem> <listitem><para> <filename>/bin</filename> </para></listitem> <listitem><para> <filename>/sbin</filename> </para></listitem> <listitem><para> <filename>/lib</filename> </para></listitem> </itemizedlist> For instance, if you replace <filename>/usr/bin/perl</filename>, that will work, but then if you upgrade your <classname>perl</classname> package, the file you put there will be replaced. Experts can get around this by putting packages on <quote>hold</quote> in <command>aptitude</command>.
el: Η πιο σημαντική έννοια που θα πρέπει να κατανοήσετε είναι το σύστημα πακέτων του Debian. Στην ουσία, μεγάλα μέρη του συστήματός σας θα πρέπει να θεωρηθούν ότι είναι κάτω από τον έλεγχο του συστήματος πακέτων, Αυτά περιλαμβάνουν τα:<itemizedlist> <listitem><para> <filename>/usr</filename> (με την εξαίρεση του <filename>/usr/local</filename>) </para></listitem> <listitem><para> <filename>/var</filename> (μπορείτε να φτιάξετε το <filename>/var/local</filename> και να είστε ασφαλείς εκεί) </para></listitem> <listitem><para> <filename>/bin</filename> </para></listitem> <listitem><para> <filename>/sbin</filename> </para></listitem> <listitem><para> <filename>/lib</filename> </para></listitem> </itemizedlist>. Για παράδειγμα, αν αντικαταστήσετε το <filename>/usr/bin/perl</filename> αυτό θα δουλέψει, αλλά τότε αν αναβαθμίσετε το πακέτο σας της <classname>perl</classname>, το αρχείο που βάλατε εκεί θα αντικατασταθεί. Οι πιο έμπειροι χρήστες μπορούν να παρακάμψουν κάτι τέτοιο βάζοντας πακέτα στην κατάσταση αναμονής (<quote>hold</quote>) στο <command>aptitude</command>.
pt: O conceito mais importante para realçar é o sistema de pacotes Debian. Na sua essência, grande parte do seu sistema deve ser consdiderado sob o controlo do sistema de pacotes. Incluem-se: <itemizedlist> <listitem><para> <filename>/usr</filename> (excluindo <filename>/usr/local</filename>) </para></listitem> <listitem><para> <filename>/var</filename> (poderá fazer <filename>/var/local</filename> e ficar lá seguro) </para></listitem> <listitem><para> <filename>/bin</filename> </para></listitem> <listitem><para> <filename>/sbin</filename> </para></listitem> <listitem><para> <filename>/lib</filename> </para></listitem> </itemizedlist> Por exemplo, se substituir <filename>/usr/bin/perl</filename>, isso irá funcionar, mas se fizer um upgrade ao seu pacote <classname>perl</classname> , o ficheiro que lá puser irá ser substituído. Utilizadores mais avançados poderão contornar isto, ao colocar pacotes como hold no <command>aptitude</command>.
ru: Наиболее важно разобраться в системе управления пакетами Debian. В сущности, большая часть системы находится под контролем системы управления пакетами. Сюда входят: <itemizedlist> <listitem><para> <filename>/usr</filename> (кроме <filename>/usr/local</filename>) </para></listitem> <listitem><para> <filename>/var</filename> (вы можете спокойно сделать <filename>/var/local</filename>) </para></listitem> <listitem><para> <filename>/bin</filename> </para></listitem> <listitem><para> <filename>/sbin</filename> </para></listitem> <listitem><para> <filename>/lib</filename> </para></listitem> </itemizedlist> Например, если вы заместите <filename>/usr/bin/perl</filename>, он будет работать, но позже, если вы обновите пакет <classname>perl</classname>, файл, который вы положили будет заменён. Эксперты могут обойти это установив на пакеты флаг <quote>hold</quote> в <command>aptitude</command>.
zh_cn: 要掌握的最重要概念是 Debian 的软件包系统。事实上，您系统的绝大部分都应该由软件包系统来控制。包括：<itemizedlist> <listitem><para> <filename>/usr</filename> (除了 <filename>/usr/local</filename>) </para></listitem> <listitem><para> <filename>/var</filename> (您可以创建 <filename>/var/local</filename>，在那里面进行安全的操作) </para></listitem> <listitem><para> <filename>/bin</filename> </para></listitem> <listitem><para> <filename>/sbin</filename> </para></listitem> <listitem><para> <filename>/lib</filename> </para></listitem> </itemizedlist> 例如，如果您替换了 <filename>/usr/bin/perl</filename>，它可以正常工作，但以后升级了您的 <classname>perl</classname> 软件包，那个文件仍将被替换回来。有经验的用户可以将软件包设置为 <quote>hold</quote>状态，以避免这种情况，这需要使用 <command>aptitude</command>。
zh_tw: 要掌握的最重要概念是 Debian 的軟體套件系統。事實上，您系統的絕大部分都該由軟體套件系統來控制。包括：<itemizedlist> <listitem><para> <filename>/usr</filename> (除了 <filename>/usr/local</filename> 之外)</para></listitem> <listitem><para> <filename>/var</filename> (您可以建立 <filename>/var/local</filename>，在那裡面進行安全的操作) </para></listitem> <listitem><para> <filename>/bin</filename> </para></listitem> <listitem><para> <filename>/sbin</filename> </para></listitem> <listitem><para> <filename>/lib</filename> </para></listitem> </itemizedlist> 例如，如果您替換了 <filename>/usr/bin/perl</filename>，它可以正常工作，但以後您升級了 <classname>perl</classname> 軟體套件，那個檔案仍將被替換回來。有經驗的使用者可以將軟體套件設置為 <quote>hold</quote> 狀態，以避免這種情況，這需要使用 <command>aptitude</command>。

source: One of the best installation methods is apt. You can use the command line version <command>apt-get</command> or full-screen text version <application>aptitude</application>. Note apt will also let you merge main, contrib, and non-free so you can have export-restricted packages as well as standard versions.
el: Μια από τις καλλίτερες μεθόδους εγκατάστασης είναι το apt. Μπορείτε να χρησιμοποιήσετε την εκδοχή του στην γραμμή εντολών <command>apt-get</command> ή σε μορφή κειμένου πλήρους-οθόνης με το <application>aptitude</application>. Σημειώστε επιπλέον ότι το apt σας επιτρέπει να ενσωματώσετε τις αρχειοθήκες main, contrib και non-free ώστε να μπορείτε να έχετε διαθέσιμες πέρα από τις κανονικές εκδόσεις πακέτων και εκείνες που υπόκεινται σε περιορισμούς στην εξαγωγή τους σε ορισμένες χώρες.
pt: Um dos melhores métodos de instalação é o apt. Pode usar a versão de linha de comandos <command>apt-get</command> ou a versão de texto em ecrã inteiro <application>aptitude</application>. Note que o apt deixa-lo-á fazer a junção de main, contrib e non-free, de forma a que possa ter pacotes com restrições de exports assim como versões standard.
ru: Один из лучших методов установки пакетов &mdash; apt. Вы можете использовать версию для командной строки <command>apt-get</command> или полноэкранную текстовую версию <application>aptitude</application>. Заметим, что apt также позволяет объединить main, contrib и non-free, так что вы можете устанавливать имеющие экспортные ограничения пакеты вместе с обычными.
zh_cn: apt 是最好的安装方法之一。您可以使用命令行模式的 <command>apt-get</command> 或者全屏幕文本模式的 <application>aptitude</application>。注意 apt 也可以让您合并 main，contrib 以及 non-free 版本的软件包，从而使您可以在使用标准版本的同时使用限制出口的软件包。
zh_tw: apt 是最好的安裝方法之一。您可以使用命令列模式的 <command>apt-get</command> 或者全螢幕文字模式的 <application>aptitude</application>。注意 apt 也可以讓您合併 main，contrib 以及 non-free 版本的軟體套件，從而使您可以在使用標準版本的同時使用限製出口的軟體套件。

source: Application Version Management
el: Διαχείριση των εκδόσεων των Εφαρμογών
pt: Aplicação de Gestão de Versões
ru: Управление версиями приложений
zh_cn: 应用程序版本管理
zh_tw: 應用程式版本管理

source: Alternative versions of applications are managed by update-alternatives. If you are maintaining multiple versions of your applications, read the update-alternatives man page.
el: Εναλλακτικές εκδόσεις των εφαρμογών διαχειρίζονται από το update-alternatives. Αν έχετε διαφορετικές εκδόσεις κάποιων εφαρμογών συμβουλευτείτε τη σελίδα χρήσης του update-alternatives.
pt: Versões alternativas das aplicações são geridas por alternativas de actualização. Se está a manter múltiplas versões das suas aplicações, leia a página do manual update-alternatives.
ru: Альтернативность версий приложений управляется с помощью программы update-alternatives. Если вы работаете с несколькими версиями одного приложения, прочитайте страницу руководства к update-alternatives.
zh_cn: 可选版本的应用程序可以通过 update-alternatives 来管理。如果您维护着多个版本的应用程序，请参阅 update-alternatives 的 man 手册。
zh_tw: 可選版本的應用程式可以透過 update-alternatives 來管理。 如果您維護著多個版本的應用程式，請參閱 update-alternatives 的 man 手冊。

source: Cron Job Management
el: Διαχείριση Περιοδικών εργασιών
pt: Gestão dos Cron Jobs
ru: Управление заданиями cron
zh_cn: 定时任务管理
zh_tw: 任務排程管理

source: On the other hand, if you have a cron job that (a) needs to run as a special user, or (b) needs to run at a special time or frequency, you can use either <filename>/etc/crontab</filename>, or, better yet, <filename>/etc/cron.d/whatever</filename>. These particular files also have an extra field that allows you to stipulate the user under which the cron job runs.
el: Από την άλλη αν έχετε μια περιοδική εργασία που (α) χρειάζεται να τρέχει από έναν ειδικό χρήστη ή (β) χρειάζεται να τρέχει σε συγκεκριμένες χρονικές στιγμές και συχνότητα, μπορείτε να χρησιμοποιήσετε είτε το <filename>/etc/crontab</filename>,είτε ακόμα καλλίτερα τον κατάλογο <filename>/etc/cron.d/"ο,τιδήποτε"</filename>. Τα αρχεία στον κατάλογο αυτό έχουν ένα επιπλέον πεδίο που σας επιτρέπει να ορίζετε τον χρήστη υπό τον οποίον τρέχει αυτή η περιοδική εργασία.
pt: Por outro lado, se tem um cron job que (a) necessita de ser corrido como um utilizador especial ou, (b) necessita de escolher em determinada altura ou com determinada frequência, pode usar tanto <filename>/etc/crontab</filename>, ou, melhor ainda, <filename>/etc/cron.d/whatever</filename>. Estes ficheiros particulares também têm um campo extra que lhe permite estipular o utilizador que sob o qual o cron job corre.
ru: С другой стороны, если задания: (а) нужно запускать от определённого пользователя или (b) нужно запустить в определённое время или с определённой частотой, вы можете использовать или <filename>/etc/crontab</filename>, или, что лучше, <filename>/etc/cron.d/имя_задания</filename>. Это особые файлы, они содержат дополнительное поле, позволящее вам указать пользователя от которого будет выполняться задание cron.
zh_cn: 另一方面，如果您有某个定时任务需要以某个特定的用户身份运行，或者需要在某个特定时刻或以特定周期运行，您或者可以使用 <filename>/etc/crontab</filename> 或 <filename>/etc/cron.d/whatever</filename>，而后者会更好一些。这些特殊的文件可以包含一个额外的域，允许您指定运行该定时任务的用户帐户。
zh_tw: 另一方面，如果您有某個定期任務需要以某個特定的使用者身份執行，或者需要在某個特定時刻或以特定週期執行，您也許可以使用 <filename>/etc/crontab</filename> 或 <filename>/etc/cron.d/whatever</filename>，後者會更好一些。這些特殊的檔案可以包含額外的設定項目，允許您指定運行該定期任務的使用者帳戶。

source: In either case, you just edit the files and cron will notice them automatically. There is no need to run a special command. For more information see cron(8), crontab(5), and <filename>/usr/share/doc/cron/README.Debian</filename>.
el: Σε κάθε περίπτωση, εσείς απλά εκδίδετε τα αρχεία και το cron θα τα ενημερώσει αυτόματα. Δεν υπάρχει ανάγκη να τρέξετε κάποια ειδική εντολή. Για περισσότερες πληροφορίες δείτε τις σελίδες χρήσης cron(8), crontab(5),και το <filename>/usr/share/doc/cron/README.Debian</filename>.
pt: Em qualquer um dos casos, basta editar os ficheiros e o cron irá notá-lo automaticamente. Não há necessidade de correr um comando especial. Para mais informação veja cron(8), crontab(5), e <filename>/usr/share/doc/cron/README.Debian</filename>.
ru: В любом случае, просто отредактируйте файлы, и cron обнаружит эти изменения автоматически. Не нужно запускать специальную команду. Подробная информация доступна в cron(8), crontab(5) и <filename>/usr/share/doc/cron/README.Debian</filename>.
zh_cn: 在任何情况下，您只需编辑这些文件，cron 将会自动处理它们。没有必要再运行某个特殊的命令。欲了解更多的信息，请参阅 cron(8)，crontab(5)，以及 <filename>/usr/share/doc/cron/README.Debian</filename>。
zh_tw: 在任何情況下，您只需編輯這些檔案，cron 將會自動處理它們。沒有必要再執行某個特殊的指令。欲瞭解更多的資訊，請參閱 cron(8)，crontab(5)，以及 <filename>/usr/share/doc/cron/README.Debian</filename>。

source: Reactivating DOS and Windows
el: Επανενεργοποίηση του DOS και των Widnows.
pt: Reactivar o DOS e o Windows
ru: Реактивация DOS и Windows
zh_cn: 重新激活 DOS 和 Windows
zh_tw: 重新啟動 DOS 和 Windows

source: After installing the base system and writing to the <emphasis>Master Boot Record</emphasis>, you will be able to boot Linux, but probably nothing else. This depends what you have chosen during the installation. This chapter will describe how you can reactivate your old systems so that you can also boot your DOS or Windows again.
el: Μετά την εγκατάσταση του βασικού συστήματος και την εγγραφή του <emphasis>Master Boot Record</emphasis> θα είσαστε σε θέση να εκκινήσετε το Linux αλλά πιθανότατα τίποτα άλλο! Αυτό εξαρτάται από το τι επιλέξατε κατά την εγκατάσταση. Το κεφάλαιο αυτό περιγράφει πώς μπορείτε να επανεργοποιήσετε τα παλιά σας λειτουργικά συστήματα ώστε να μπορείτε να εκκινήσετε πάλι το DOS ή τα Windows.
pt: Após instalar o sistema base e escrever para o <emphasis>Master Boot Record</emphasis>, será capaz de arrancar para Linux, mas provavelmente nada mais. Isto depende do que escolheu durante a instalação. Este capítulo irá descrever como pode reactivar os seus antigos sistemas para que também possam arrancar do seu DOS ou Windows novamente.
ru: После установки базовой системы и изменения <emphasis>главной загрузочной записи (MBR)</emphasis>, вы сможете загружать Linux, но вероятно ничего более. Это зависит от вашего выбора во время установки. Эта глава опишет, как вы можете реактивировать вашу старую систему, например, чтобы снова стала возможной загрузка DOS или Windows.
zh_cn: 安装好基本系统并写入 <emphasis>主引导记录</emphasis> 后，您就可以启动 Linux，但也可能什么都没有。这将由您在安装中所作的选择决定。本章告诉您，如何重新激活旧系统，以便可以再次启动 DOS 或 Windows。
zh_tw: 安裝好基本系統並寫入 <emphasis>主開機記錄</emphasis> 後，您就可以啟動 Linux，但也可能什麼都沒有。這將由您在安裝中所作的選擇決定。本章告訴您，如何重新啟動舊系統，以便可以再次啟動 DOS 或 Windows。

source: <command>LILO</command> is a boot manager with which you can also boot other operating systems than Linux, which complies to PC conventions. The boot manager is configured via <filename>/etc/lilo.conf</filename> file. Whenever you edited this file you have to run <command>lilo</command> afterwards. The reason for this is that the changes will take place only when you call the program.
el: To <command>LILO</command> είναι ένας διαχειριστής εκκίνησης που σας επιτρέπει να εκκινήσετε και άλλα λειτουργικά συστήματα εκτός του Linux και που ακολουθεί τις συμβάσεις των PC. O διαχειριστής ρυθμίζεται μέσω του αρχείου <filename>/etc/lilo.conf</filename>. Όποτε αλλάξετε το αρχείο αυτό θα πρέπει να τρέξετε στη συνέχεια την εντολή <command>lilo</command>. Ο λόγος είναι ότι οι αλλαγές θα πραγματοποιηθούν μόνο αφού εκτελέσετε το πρόγραμμα αυτό.
pt: <command>LILO</command> é um gestor de arranque com o qual pode arrancar outros sistemas operativos para além do Linux, o que respeita a convenção dos PC. O gestor de boot é configurado através do ficheiro <filename>/etc/lilo.conf</filename> . Sempre que editar este ficheiro, terá de correr o comando <command>lilo</command> de seguida. A razão para tal é que a alteração apenas terá efeito quando reiniciar o programa.
ru: <command>LILO</command> &mdash; это менеджер загрузки, с помощью которого вы можете также загружать другие операционные системы кроме Linux, которые подчиняются PC соглашениям. Менеджер загрузки настраивается через файл <filename>/etc/lilo.conf</filename>. После редактирования этого файла, вы должны выполнить программу <command>lilo</command>. Это нужно для того, чтобы ваши изменения вступили в силу.
zh_cn: <command>LILO</command> 是一个启动引导器，通过它您可以启动 Linux 之外的其他操作系统，它遵循 PC 的习惯。该启动引导器通过 <filename>/etc/lilo.conf</filename> 文件进行配置。当您编辑过该文件之后，您必须运行 <command>lilo</command>程序。这是因为只有您运行过该程序后，所做的更改才能生效。
zh_tw: <command>LILO</command> 是一個 boot-loader，它遵循 PC 的習慣，透過它您可以啟動 Linux 之外的其他作業系統。該 boot-loader 透過 <filename>/etc/lilo.conf</filename> 檔案進行設定。當您編輯過該檔案之後，您必須執行 <command>lilo</command> 程式。這是因為只有您執行過該程式後，所做的更改才能生效。
