Repository: xobs/debian-installer
Catalog: doc/manual/po/*/post-install.po
Languages: el, pt, ru, zh_cn, zh_tw

source: Important parts of the <filename>lilo.conf</filename> file are the lines containing the <userinput>image</userinput> and <userinput>other</userinput> keywords, as well as the lines following those. They can be used to describe a system which can be booted by <command>LILO</command>. Such a system can include a kernel (<userinput>image</userinput>), a root partition, additional kernel parameters, etc. as well as a configuration to boot another, non-Linux (<userinput>other</userinput>) operating system. These keywords can also be used more than once. The ordering of these systems within the configuration file is important because it determines which system will be booted automatically after, for instance, a timeout (<userinput>delay</userinput>) presuming <command>LILO</command> wasn't stopped by pressing the <keycap>shift</keycap> key.
el: Σημαντικά μέρη του αρχείου <filename>lilo.conf</filename> είναι οι γραμμές που περιέχουν λέξεις κλειδιά όπως <userinput>image</userinput> και μερικές ακόμα, καθώς και οι γραμμές που τις ακολουθούν. Μπορούν να χρησιμοποιηθούν για να περιγράψουν ένα λειτουργικό σύστημα που θέλετε να εκκινήσετε με το <command>LILO</command>. Ένα τέτοιο σύστημα μπορεί να περιλαμβάνει έναν πυρήνα (<userinput>image</userinput>), μια ριζική κατάτμηση, επιπλέον παραμέτρους για τον πυρήνα κλπ. καθώς και ρυθμίσεις για την εκκίνηση ενός non-Linux (<userinput>other</userinput>) λειτουργικού συστήματος. Οι λέξεις αυτές κλειδιά μπορούν να χρησιμοποιηθούν περισσότερες από μια φορά. Η σειρά των συστημάτων στο αρχείο ρύθμισης είναι σημαντική γιατί καθορίζει ποιο σύστημα θα εκκινηθεί αυτόματα μετά από, παραδείγματος χάριν, ένα συγκεκριμένο χρονικό διάστημα (<userinput>delay</userinput>) εφόσον το <command>LILO</command> δεν διακοπεί με το πάτημα του πλήκτρου <keycap>shift</keycap>.
pt: Partes importantes do ficheiro <filename>lilo.conf</filename> são as linhas que contém as palavras-chave <userinput>image</userinput> e <userinput>other</userinput> , assim como as linhas que se seguem. Podem ser usadas para descrever o sistema que pode ser arrancado através do comando <command>LILO</command>. Tal sistema pode incluir um kernel (<userinput>image</userinput>), uma partição de root, parâmetros de kernel adicionais, etc. assim como uma configuração para arrancar outro, não Linux, (<userinput>other</userinput>) sistema operativo. Estas palavras-chave também poderão ser usadas mais do que uma vez. A ordenação destes sistemas dentro do ficheiro de configuração é importante, porque determina qual o sistema que arrancará automaticamente após, por exemplo, um timeout (<userinput>delay</userinput>) presumindo que o comando <command>LILO</command> não foi parado por pressionar a tecla <keycap>shift</keycap>.
ru: Важными частями файла <filename>lilo.conf</filename> являются строки, содержащие ключевые слова <userinput>image</userinput> и <userinput>other</userinput>, а также строки, стоящие после них. Они используются для описания системы, которая может быть загружена с помощью <command>LILO</command>. Такая система может иметь ядро (<userinput>image</userinput>), корневой раздел, дополнительные параметры ядра и так далее, а также конфигурацию для загрузки другой, не Linux, (<userinput>other</userinput>) операционной системы. Эти ключевые слова могут быть использованы несколько раз. Порядок этих систем в файле конфигурации важен, так как им определяется, какая система будет грузиться автоматически после, например, таймаута (<userinput>delay</userinput>), если <command>LILO</command> не остановлен нажатием клавиши <keycap>shift</keycap>.
zh_cn: 在 <filename>lilo.conf</filename> 文件中的关键部分是包含关键字 <userinput>image</userinput> 和 <userinput>other</userinput> 的行，以及在其之后的行。它们用来描述可被 <command>LILO</command>引导的系统。这样的系统可以包含一个内核 (<userinput>image</userinput>)，一个根分区，额外的内核参数等，以及可引导另一个非 Linux 操作系统 (<userinput>other</userinput>)的配置。这些关键字可使用多次。这些系统在配置文件中的顺序很重要，因为它将决定哪个操作系统会自动引导，比如，在超时(<userinput>delay</userinput>) 而且 <command>LILO</command> 没有被按下 <keycap>shift</keycap> 键中止的情况下。
zh_tw: 在 <filename>lilo.conf</filename> 檔案中的關鍵部分是包含關鍵字 <userinput>image</userinput> 和 <userinput>other</userinput> 的那一行，以及在其之後的設定。它們用來描述可被 <command>LILO</command> 開機的系統。這樣的系統可以包含一個核心 (<userinput>image</userinput>)，一個根分割區，額外的核心參數等，以及可開機另一個非 Linux 作業系統 (<userinput>other</userinput>) 的設定。這些關鍵字可使用多次。這些系統在設定檔中的順序很重要，因為它將決定哪個作業系統會自動開機，例如，時間到但(<userinput>delay</userinput>) <command>LILO</command> 沒有被按下 <keycap>shift</keycap> 鍵中止的情況下。

source: After a fresh install of Debian, just the current system is configured for booting with <command>LILO</command>. If you want to boot another Linux kernel, you have to edit the configuration file <filename>/etc/lilo.conf</filename> to add the following lines: <informalexample><screen> &additional-lilo-image; </screen></informalexample> For a basic setup just the first two lines are necessary. If you want to know more about the other two options please have a look at the <command>LILO</command> documentation. This can be found in <filename>/usr/share/doc/lilo/</filename>. The file which should be read is <filename>Manual.txt</filename>. To have a quicker start into the world of booting a system you can also look at the <command>LILO</command> man pages <filename>lilo.conf</filename> for an overview of configuration keywords and <filename>lilo</filename> for description of the installation of the new configuration into the boot sector.
el: Μετά από μια καινούρια εγκατάσταση του Debian μόνο το τρέχον λειτουργικό σύστημα ρυθμίζεται για εκκίνηση με το <command>LILO</command>. Αν θέλετε να ξεκινήσετε έναν άλλο πυρήνα Linux θα πρέπει να αλλάξετε το αρχείο ρύθμισης <filename>/etc/lilo.conf</filename> και να προσθέσετε τις ακόλουθες γραμμές: <informalexample><screen> &additional-lilo-image; </screen></informalexample>. Για μια βασική ρύθμιση οι δυο πρώτες γραμμές είναι αρκετές. Αν θέλετε να ξέρετε περισσότερα για τις δυο άλλες επιλογές παρακαλώ κοιτάξτε την τεκμηρίωση του <command>LILO</command>, που μπορεί να βρεθεί στο <filename>/usr/share/doc/lilo/</filename>. Το αρχείο που πρέπει να διαβάσετε είναι το <filename>Manual.txt</filename>, Για να έχετε ένα πιο γρήγορο ξεκίνημα στον κόσμο της εκκίνησης ενός συστήματος μπορείτε ακόμα να κοιτάξετε τις σελίδες χρήσης του <command>LILO</command>, του <filename>lilo.conf</filename> για μια επισκόπηση των λέξεων-κλειδιών των ρυθμίσεων, και του <filename>lilo</filename> για μια περιγραφή της εγκατάστασης της καινούριας ρύθμισης στον τομέα εκκίνησης (boot sector).
pt: Após uma instalação nova de Debian, apenas o sistema corrente está configurado para arrancar com o <command>LILO</command>. Se deseja correr outro kernel Linux, tem de editar o ficheiro de configuração <filename>/etc/lilo.conf</filename> para adicionar as seguintes linhas: <informalexample><screen> &additional-lilo-image; </screen></informalexample> Para uma instalação básica apenas as duas primeiras linhas são necessárias. Se deseja saber mais acerca das outras duas opções, por favor, veja a documentação relativa ao <command>LILO</command> . Esta pode ser encontrada em <filename>/usr/share/doc/lilo/</filename>. O ficheiro que deverá ser lido é o <filename>Manual.txt</filename>. Para ter um começo rápido no mundo do arranque de sistemas, poderá também dar uma vista de olhos ás páginas do manual do <command>LILO</command> ou ao <filename>lilo.conf</filename> para uma ideia geral das palavras-chave de configurações e ao <filename>lilo</filename> para uma descrição da instalação da nova configuração no sector de arranque.
ru: После установки Debian, только текущая система прописана в загрузку с помощью <command>LILO</command>. Если нужно загрузить другое ядро Linux, вы можете отредактировать файл конфигурации <filename>/etc/lilo.conf</filename>, добавив следующие строки: <informalexample><screen> &additional-lilo-image; </screen></informalexample> Для простой настройки достаточно только две первые строки. Если вы хотите больше узнать об этих двух параметрах, обратитесь к документации на <command>LILO</command>. Её можно найти в каталоге <filename>/usr/share/doc/lilo/</filename>. Файл называется <filename>Manual.txt</filename>. Чтобы быстро войти в мир загрузки системы также посмотрите страницы руководства по <command>LILO</command> <filename>lilo.conf</filename>, где описаны ключевые слова файла конфигурации, а на странице <filename>lilo</filename> описана установка новой конфигурации в загрузочный сектор.
zh_cn: 刚刚安装好一个全新的 Debian 后，只有当前系统被配置好用 <command>LILO</command>引导。如果您想引导另一个 Linux 内核，您必须编辑 <filename>/etc/lilo.conf</filename> 配置文件，在其中加入如下行： <informalexample><screen> &additional-lilo-image; </screen></informalexample> 对一个基本安装而言，只有第一行是必需的。如果您想了解关于其它两个选项的更多信息，请查阅 <command>LILO</command> 的文档。该文档位于 <filename>/usr/share/doc/lilo/</filename>目录中，您所需阅读的文件是 <filename>Manual.txt</filename>。如果您想快速了解如何引导系统，您也可以查阅 <command>LILO</command> 的 man 手册，<filename>lilo.conf</filename>可得到关于配置文件的关键字的说明，<filename>lilo</filename> 可得到将一个新配置安装到引导扇区的说明。
zh_tw: 剛剛安裝好一個全新的 Debian 後，只有目前系統被設定成用 <command>LILO</command>開機。如果您想啟動另一個 Linux 核心，您必須編輯 <filename>/etc/lilo.conf</filename> 設定檔，在其中加入如下行：<informalexample><screen> &additional-lilo-image; </screen></informalexample> 對一個基本安裝而言，只有第一行是必需的。如果您想瞭解關於其它兩個選項的更多資訊，請參閱 <command>LILO</command> 的文件。該文件位於 <filename>/usr/share/doc/lilo/</filename> 目錄中，您所需閱讀的文件是 <filename>Manual.txt</filename>。如果您想快速瞭解如何啟動系統，您也可以參閱 <command>LILO</command> 的 man 手冊，<filename>lilo.conf</filename> 是關於設定檔關鍵字的說明，<filename>lilo</filename> 則是將新設定安裝到到開機磁區的說明。

source: Notice that there are other boot loaders available in &debian;, such as GRUB (in <classname>grub</classname> package), CHOS (in <classname>chos</classname> package), Extended-IPL (in <classname>extipl</classname> package), loadlin (in <classname>loadlin</classname> package) etc.
el: Σημειώστε ότι υπάρχουν και άλλοι φορτωτές εκκίνησης διαθέσιμοι στο &debian;, όπως το GRUB (στο πακέτο <classname>grub</classname>), CHOS (στο πακέτο <classname>chos</classname>), Extended-IPL (στο πακέτο <classname>extipl</classname>), loadlin (στο πακέτο <classname>loadlin</classname>) κλπ.
pt: Note que há outros gestores de arranque disponíveis no &debian;, tais como GRUB (no pacote <classname>grub</classname>), CHOS (no pacote <classname>chos</classname>), Extended-IPL (no pacote <classname>extipl</classname> ), loadlin (no pacote <classname>loadlin</classname>) etc.
ru: Обратите внимание, что в &debian; есть и другие системные загрузчики, такие как GRUB (в пакете <classname>grub</classname>), CHOS (в пакете <classname>chos</classname>), Extended-IPL (в пакете <classname>extipl</classname>), loadlin (в пакете <classname>loadlin</classname>) и другие.
zh_cn: 注意，在 &debian; 中还有其它可用的启动引导器，例如 GRUB (在 <classname>grub</classname> 包中)，CHOS (在 <classname>chos</classname> 包中)，Extended-IPL (在 <classname>extipl</classname> 包中)，loadlin (在 <classname>loadlin</classname> 包中) 等。
zh_tw: 注意，在 &debian; 中還有其它可用的 boot-loader，例如 GRUB (在 <classname>grub</classname> 套件中)，CHOS (在 <classname>chos</classname> 套件中)，Extended-IPL (在 <classname>extipl</classname> 套件中)，loadlin (在 <classname>loadlin</classname> 套件中) 等。

source: Further Reading and Information
el: Παραπέρα Διάβασμα και Πληροφορίες
pt: Leitura e Informação Adicional
ru: Что почитать
zh_cn: 更多信息
zh_tw: 更多閱讀資訊

source: If you need information about a particular program, you should first try <userinput>man <replaceable>program</replaceable></userinput>, or <userinput>info <replaceable>program</replaceable></userinput>.
el: Αν χρειάζεστε πληροφορίες για ένα συγκεκριμένο πρόγραμμα, θα πρέπει πρώτα να δοκιμάσετε τις σελίδες χρήσης του με την εντολή <userinput>man<replaceable>program</replaceable></userinput>,ή την εντολή <userinput>info <replaceable>program</replaceable></userinput>.
pt: Se necessita de informação sobre um programa em particular, deverá tentar primeiro o programa <userinput>man <replaceable>program</replaceable></userinput>, ou <userinput>info <replaceable>program</replaceable></userinput>.
ru: Если вам требуется информация по определённой программе, сначала, попробуйте выполнить <userinput>man <replaceable>название программы</replaceable></userinput> или <userinput>info <replaceable>название программы</replaceable></userinput>.
zh_cn: 如果您想查阅某个程序的更详细资料，应该先试试 <userinput>man <replaceable>程序名称</replaceable></userinput>，或者 <userinput>info <replaceable>程序名称</replaceable></userinput>。
zh_tw: 如果您想查閱某個程式的更詳細資料，應該先試試 <userinput>man<replaceable> 程式名稱</replaceable></userinput>，或者 <userinput>info<replaceable> 程式名稱</replaceable></userinput>。

source: There is lots of useful documentation in <filename>/usr/share/doc</filename> as well. In particular, <filename>/usr/share/doc/HOWTO</filename> and <filename>/usr/share/doc/FAQ</filename> contain lots of interesting information. To submit bugs, look at <filename>/usr/share/doc/debian/bug*</filename>. To read about Debian-specific issues for particular programs, look at <filename>/usr/share/doc/(package name)/README.Debian</filename>.
el: Υπάρχει επίσης πληθώρα τεμκηρίωσης στον κατάλογο <filename>/usr/share/doc</filename> . Ιδιαίτερα τα <filename>/usr/share/doc/HOWTO</filename> και <filename>/usr/share/doc/FAQ</filename> περιέχουν πλήθος από ενδιαφέρουσες πληροφορίες. Για να υποβάλλετε αναφορές σφαλμάτων κοιτάξτε στο <filename>/usr/share/doc/debian/bug*</filename>. Για να διαβάσετε σχετικά με πιθανά προβλήματα εφαρμογών που αφορούν ειδικά το Debian δείτε το αντίστοιχο <filename>/usr/share/doc/("όνομα πακέτου")/README.Debian</filename>.
pt: Há uma grande quantidade de informação útil em <filename>/usr/share/doc</filename>. Em particular, <filename>/usr/share/doc/HOWTO</filename> e <filename>/usr/share/doc/FAQ</filename> contêm grande quantidade de informação interessante. Para enviar bugs, veja o ficheiro <filename>/usr/share/doc/debian/bug*</filename>. Para ler sobre assuntos específicos de Debian relativos a determinados programas, veja o ficheiro <filename>/usr/share/doc/(package name)/README.Debian</filename>.
ru: Также, есть много полезной документации в каталоге <filename>/usr/share/doc</filename>. В частности, в каталогах <filename>/usr/share/doc/HOWTO</filename> и <filename>/usr/share/doc/FAQ</filename> содержится море интересной документации. Информацию об ошибках смотрите в <filename>/usr/share/doc/debian/bug*</filename>. Информацию по работе определённой программы в Debian смотрите в файле <filename>/usr/share/doc/(имя пакета )/README.Debian</filename>.
zh_cn: 在 <filename>/usr/share/doc</filename> 目录里有很多有用的文档，特别是 <filename>/usr/share/doc/HOWTO</filename>和 <filename>/usr/share/doc/FAQ</filename> 里有很多值得一读的文章。如果您想提交错误报告，请先查阅这些文件： <filename>/usr/share/doc/debian/bug*</filename>。针对某个程序，其有关于 Debian 的内容可以查阅文件： <filename>/usr/share/doc/(package name)/README.Debian</filename>。
zh_tw: 在 <filename>/usr/share/doc</filename> 目錄裡有很多有用的文件，特別是 <filename>/usr/share/doc/HOWTO</filename> 和 <filename>/usr/share/doc/FAQ</filename> 裡有很多值得一讀的文章。如果您想回報臭蟲報告，請先查閱這些文件： <filename>/usr/share/doc/debian/bug*</filename>。針對某個程式，其有關於 Debian 的內容可以查閱文件： <filename>/usr/share/doc/(package name)/README.Debian</filename>。

source: The <ulink url="http://www.debian.org/">Debian web site</ulink> contains a large quantity of documentation about Debian. In particular, see the <ulink url="http://www.debian.org/doc/FAQ/">Debian GNU/Linux FAQ</ulink> and the <ulink url="http://www.debian.org/doc/user-manuals#quick-reference">Debian Reference</ulink>. An index of more Debian documentation is available from the <ulink url="http://www.debian.org/doc/ddp">Debian Documentation Project</ulink>. The Debian community is self-supporting; to subscribe to one or more of the Debian mailing lists, see the <ulink url="http://www.debian.org/MailingLists/subscribe"> Mail List Subscription</ulink> page. Last, but not least, the <ulink url="http://lists.debian.org/">Debian Mailing List Archives</ulink> contain a wealth of information on Debian.
zh_cn: 在 <ulink url="http://www.debian.org/">Debian 网站</ulink> 上有大量的 Debian 相关文档。尤其要看看 <ulink url="http://www.debian.org/doc/FAQ/">Debian GNU/Linux FAQ</ulink> 和 <ulink url="http://www.debian.org/doc/user-manuals#quick-reference">Debian Reference</ulink>。更多的 Debian 文档位于 <ulink url="http://www.debian.org/doc/ddp">Debian Documentation Project</ulink>。Debian 社区是靠用户们自己的力量支撑起来的; 如果您想要订阅 Debian 的邮件列表，请访问 <ulink url="http://www.debian.org/MailingLists/subscribe"> Mail List Subscription</ulink> 页面。最后，相当重要的，<ulink url="http://lists.debian.org/">Debian Mailing List Archives</ulink> 包含了 Debian 丰富的信息。

source: A general source of information on GNU/Linux is the <ulink url="http://www.tldp.org/">Linux Documentation Project</ulink>. There you will find the HOWTOs and pointers to other very valuable information on parts of a GNU/Linux system.
el: Μια γενική πηγή πληροφόρησης για το GNU/Linux είναι το <ulink url="http://www.tldp.org/">Linux Documentation Project</ulink>. Εκεί θα βρείτε τα HOWTO και δείκτες σε άλλες πολύτιμες πληροφορίες για ένα σύστημα GNU/Linux.
pt: Uma fonte genérica de informação sobre GNU/Linux é o <ulink url="http://www.tldp.org/">Projecto de Documentação Linux</ulink>. Aí, irá encontrar HOWTOs e caminhos para outras informações valiosas sobre partes de um sistema GNU/Linux.
ru: Общая информация о GNU/Linux есть в <ulink url="http://www.tldp.org/">проекте документации Linux</ulink>. Здесь вы найдёте разные HOWTO и ссылки на другие превосходные источники информации на компоненты системы GNU/Linux.
zh_cn: 在 GNU/Linux 世界里，最常用的文档资料来源是： <ulink url="http://www.tldp.org/">Linux 文档计划项目</ulink>。在这里您可以找到有关于 GNU/Linux 系统各个部分的 非常有价值的 HOWTO 文档以及其他指导。
zh_tw: 在 GNU/Linux 世界裡，最常用的文件資料來源是：<ulink url="http://www.tldp.org/">Linux 文件計劃</ulink>。在這裡您可以找到有關於 GNU/Linux 系統關於各個部分非常有價值的 HOWTO 文件以及其他指引。

source: Compiling a New Kernel
el: Χτίσιμο ενός καινούριου πυρήνα
pt: Compilando um Novo Kernel
ru: Сборка нового ядра
zh_cn: 编译新内核
zh_tw: 編譯新核心

source: Why would someone want to compile a new kernel? It is often not necessary since the default kernel shipped with Debian handles most configurations. However, it is useful to compile a new kernel in order to:
el: Γιατί θα ήθελε κάποιος να φτιάξει έναν καινούριο πυρήνα; Συνήθως δεν είναι απαραίτητο καθώς ο προκαθορισμένος πυρήνας που έρχεται με το Debian μπορεί να χειριστεί τις περισσότερες διαμορφώσεις. Παρόλα αυτά είναι χρήσιμο να φτιάξετε έναν καινούριο πυρήνα για να:
pt: Porque é que alguém quererá compilar um novo kernel? Na grande maioria das vezes não é necessário uma vez que o kernel que vem por defeito com o Debian trata da maioria das configurações. No entanto, é útil compilar um novo kernel, para:
ru: Для чего некоторые люди пересобирают ядро? Обычно этого делать не нужно, так как ядро, устанавливаемое по умолчанию в Debian, подходит для многих конфигураций. Однако, полезно пересобрать ядро в следующих случаях:
zh_cn: 为什么有些人想要编译新内核？Debian 自带的默认内核已经包含了绝大部分配置，所以编译新内核并不是必需的。然而，基于以下这些理由，编译新内核还是很有用的：
zh_tw: 為什麼有些人想要編譯新核心？Debian 的預設核心已經包含了絕大部分設定，所以編譯新核心並不是必需的。然而，基於以下理由，編譯新核心還是很有用的：

source: handle special hardware needs, or hardware conflicts with the pre-supplied kernels
el: αντιμετωπίσετε συγκεκριμένες ανάγκες του υλικού σας ή ασυμβατότητες του υλικού με τους προσφερόμενους πυρήνες
pt: tratar de necessidades específicas em termos de hardware, ou conflitos do mesmo com os kernel pré-compilados
ru: если установлено специфичное оборудование или возникает конфликт аппаратного обеспечения со стандартным ядром
zh_cn: 支持某些特殊的硬件，或者默认的内核配置和某些硬件冲突。
zh_tw: 支援某些特殊的硬體，或者預設的核心設定和某些硬體衝突。

source: handle hardware or options not included in the stock kernel, such as APM or SMP
el: χειριστείτε υλικό ή επιλογές που δεν περιλαμβάνονται στο πυρήνα του Debian όπως οι APM (Advanced Power Management) ή η SMP (Symmetric Multi Processing)
pt: lidar com hardware ou opções não incluídas no kernel por defeito, tais como APM ou SMP
ru: если нужна поддержка оборудования или параметры, которых нет в готовом ядре, например APM или SMP
zh_cn: 支持某些没有包含在预装内核中的硬件或选项，例如 APM 或 SMP。
zh_tw: 支援某些沒有包含在預裝核心中的硬體或選項，例如 APM 或 SMP。

source: optimize the kernel by removing useless drivers to speed up boot time
el: βελτιστοποιήσετε τον πυρήνα με την αφαίρεση αχρείαστων οδηγών ώστε να επιταχύνετε και τον χρόνο εκκίνησης
pt: optimizar o kernel removendo drivers inúteis para diminuir o tempo de arranque
ru: для оптимизации ядра, удаляя ненужные драйверы для уменьшения времени загрузки
zh_cn: 通过删除无用的驱动程序来优化内核，以减少启动时间。
zh_tw: 透過刪除無用的驅動程式來優化核心，以減少開機時間。

source: use options of the kernel which are not supported by the default kernel (such as high memory support)
el: χρησιμοποιήσετε επιλογές του πυρήνα που δεν υποστηρίζονται από τον προκαθορισμένο πυρήνα (όπως η υποστήριξη μεγάλης μνήμης)
pt: usar opções do kernel que não são suportadas pelo kernel de origem (tais como suporte para muita memória)
ru: чтобы задействовать свойства, которых нет в ядре по умолчанию (например, поддержка high memory)
zh_cn: 使用某些不被默认内核所支持的选项 (例如 high memory 支持)。
zh_tw: 使用某些不被預設核心所支援的選項 (例如 high memory 支援)。

source: run an updated or development kernel
el: τρέξετε μια νεώτερη ή μια πειραματική έκδοση του πυρήνα
pt: correr um kernel actualizado ou de desenvolvimento
ru: для установки обновлённого или разрабатываемого ядра
zh_cn: 运行最新的内核或开发中的内核。
zh_tw: 使用最新的核心或開發中的核心。

source: impress your friends, try new things
el: εντυπωσιάσετε τους φίλους σας ή να δοκιμάσετε καινούρια πράγματα!
pt: impressionar os seus amigos, tentar novas coisas
ru: удивить друзей, попробовать новые фишки
zh_cn: 尝试新东西，向您的朋友炫耀。
zh_tw: 嘗試新東西，向您的朋友炫耀。

source: Kernel Image Management
el: Διαχείρισης της Εικόνας του Πυρήνα
pt: Gestão das Imagens dos Kernel
ru: Управление образами ядра
zh_cn: 内核映象管理
zh_tw: 核心映像管理

source: Don't be afraid to try compiling the kernel. It's fun and profitable.
el: Μην φοβηθείτε να προσπαθήσετε να χτίσετε τον πυρήνα. Είναι διασκεδαστικό και προσοδοφόρο!
pt: Não tenha medo de tentar compilar o kernel. É divertido e lucrativo.
ru: Не бойтесь пересобирать ядро. Это забавно и полезно.
zh_cn: 不要害怕尝试编译内核。它很有趣而且很合算。
zh_tw: 不要害怕嘗試編譯核心。它很有趣而且很有好處。
