Repository: xobs/debian-installer
Catalog: doc/manual/po/*/preparing.po
Languages: el, ko, pt, ru, zh_cn, zh_tw

source: To get to the boot prompt you need to hold down the <keycap>Stop</keycap> key (on older type 4 keyboards, use the <keycap>L1</keycap> key, if you have a PC keyboard adapter, use the <keycap>Break</keycap> key) and press the <keycap>A</keycap> key. The boot PROM will give you a prompt, either <userinput>ok</userinput> or <userinput>&gt;</userinput>. It is preferred to have the <userinput>ok</userinput> prompt. So if you get the old style prompt, hit the <keycap>n</keycap> key to get the new style prompt.
el: Για να μπείτε στο προτρεπτικό εκκίνησης πρέπει να κρατήσετε κάτω το πλήκτρο <keycap>Stop</keycap> (σε πληκτρολόγια παλιότερου τύπου 4 χρησιμοποιήστε το πλήκτρο <keycap>L1</keycap>, αν έχετε έναν προσαρμοστή πληκτρολογίου PC χρησιμοποιήστε το πλήκτρο <keycap>Break</keycap>) και πιέστε το πλήκτρο <keycap>A</keycap>. Η PROM εκκίνησης θα σας δώσει ένα προτρεπτικό <userinput>ok</userinput> ή <userinput>&gt;</userinput>. Είναι προτιμότερο να έχετε ένα προτρεπτικό <userinput>ok</userinput>. Αν λοιπόν δείτε το παλιότερο προτρεπτικό πατήστε <keycap>n</keycap>για να δείτε αυτό του νεώτερου τύπου.
ko: 부팅 프롬프트로 들어가려면 <keycap>Stop</keycap> 키를 누르고 있다가 (옛날 type 4 키보드에서는 <keycap>L1</keycap> 키를 사용하고, PC 키보드 어댑터를 쓰면 <keycap>Break</keycap> 키 사용), <keycap>A</keycap> 키를 누릅니다. boot PROM에서 <userinput>ok</userinput> 혹은 <userinput>&gt;</userinput>라는 프롬프트가 나옵니다. <userinput>ok</userinput> 프롬프트가 좋습니다. 옛날 방식의 프롬프트가 나타난다면, <keycap>n</keycap>키를 누르면 새로운 방식의 프롬프트가 나옵니다.
pt: Para obter a linha de comandos de arranque você necessita pressionar a tecla <keycap>Stop</keycap> (em teclados antigos type 4, utilize a tecla <keycap>L1</keycap>, se você tiver um adaptador de teclado de PC, utilize a tecla <keycap>Break</keycap>) e pressione a tecla <keycap>A</keycap>. A PROM de arranque ir-lhe-à dar uma linha de comandos, quer seja <userinput>ok</userinput> ou <userinput>&gt;</userinput>. É preferível ter uma linha de comandos <userinput>ok</userinput>. Se você obter uma prompt antiga, carregue na tecla <keycap>n</keycap> para obter a nova linha de comandos.
ru: Чтобы попасть в boot prompt вам нужно удерживая клавишу <keycap>Stop</keycap> (на старых клавиатурах 4-го типа, используйте клавишу <keycap>L1</keycap>, если у вас адаптер PC клавиатуры, используйте клавишу <keycap>Break</keycap>) нажать клавишу <keycap>A</keycap>. Boot PROM выдаст приглашение: или <userinput>ok</userinput> или <userinput>&gt;</userinput>. Желательно иметь приглашение <userinput>ok</userinput>. Поэтому, если у вас появилось приглашение старого типа, нажмите клавишу <keycap>n</keycap>, чтобы получить приглашение нового типа.
zh_cn: 为了得到启动提示符，您需要按住 <keycap>Stop</keycap> 键(在老式的 type 4 键盘上，使用 <keycap>L1</keycap> 键，如果您有一个 PC 键盘适配器，使用 <keycap>Break</keycap> 健)并按下 <keycap>A</keycap> 键。启动 PROM 将给出提示符，可能是 <userinput>ok</userinput> 或者 <userinput>&gt;</userinput>。优先使用 <userinput>ok</userinput> 提示符。如果您得到的是旧风格的提示符，按下 <keycap>n</keycap> 键得到新风格的提示符。
zh_tw: 為了得到開機提示符號，您需要按住 <keycap>Stop</keycap> 鍵 (在老式的 type 4 鍵盤上，使用 <keycap>L1</keycap> 鍵，如果您有一個 PC 鍵盤適配器，使用 <keycap>Break</keycap> 鍵) 並按下 <keycap>A</keycap> 鍵。啟動 PROM 將出現提示符號，可能是 <userinput>ok</userinput> 或者 <userinput>&gt;</userinput>。優先使用 <userinput>ok</userinput> 提示符號。如果您得到的是舊風格的提示符號，按下 <keycap>n</keycap> 鍵得到新風格的提示符號。

source: If you are using a serial console, send a break to the machine. With Minicom, use <keycap>Ctrl-A F</keycap>, with cu, hit <keycap>Enter</keycap>, then type <userinput>%~break</userinput>. Consult the documentation of your terminal emulator if you are using a different program.
el: Αν χρησιμοποιείτε μια σειριακή κονσόλα, στείλτε ένα break στο μηχάνημα. Με το Minicom, χρησιμοποιήστε τα πλήκτρα <keycap>Ctrl-A F</keycap>, με το cu, πατήστε <keycap>Enter</keycap>,και μετά <userinput>%~break</userinput>.Συμβουλευτείτε την τεκμηρίωση του προσομοιωτή τερματικού που έχετε αν χρησιμοποιείτε κάποιο διαφορετικό πρόγραμμα.
ko: 시리얼 콘솔을 사용한다면, break 신호를 보내십시오. minicom에서는 <keycap>Ctrl-A F</keycap>을 누르고, cu에서는 <keycap>Enter</keycap> 다음에 <userinput>%~break</userinput>을 입력합니다. 다른 프로그램을 사용한다면 그 터미널 에뮬레이터의 문서를 참고하십시오.
pt: Se você está a utilizar uma consola série, envie um break para a máquina. Como o Minicom, utilize <keycap>Ctrl-A F</keycap>, com cu, carregue em <keycap>Enter</keycap>, e depois escreva <userinput>%~break</userinput>. Consulte a documentação do seu emulador de terminal se está a utilizar um programa diferente.
ru: Если вы подключились через последовательный порт, пошлите машине сигнал break. Для этого в Minicom нажмите <keycap>Ctrl-A F</keycap>, в cu, нажмите <keycap>Enter</keycap>, затем введите <userinput>%~break</userinput>. Если вы используете другую программу посмотрите к её документации по эмуляции терминала.
zh_cn: 如果您使用的是串口控制台，发送 break 到机器。在 Minicom 下，使用 <keycap>Ctrl-A F</keycap>，在 cu 下，按下 <keycap>Enter</keycap>，然后键入 <userinput>%~break</userinput>。如果您使用其他的程序，查看终端模拟器相关的文档。
zh_tw: 如果您使用的是序列控制台，發送 break 到機器。在 Minicom 下，使用 <keycap>Ctrl-A F</keycap>，在 cu 下，按下 <keycap>Enter</keycap>，然後鍵入 <userinput>%~break</userinput>。如果您使用其他的程式，查看終端模擬器相關的文件。

source: You can use OpenBoot to boot from specific devices, and also to change your default boot device. However, you need to know some details about how OpenBoot names devices; it's much different from Linux device naming, described in <xref linkend="device-names"/>. Also, the command will vary a bit, depending on what version of OpenBoot you have. More information about OpenBoot can be found in the <ulink url="&url-openboot;">Sun OpenBoot Reference</ulink>.
el: Μπορείτε να χρησιμοποιήσετε το OpenBoot για να εκκινήσετε από συγκεκριμένες συσκευές και να αλλάξετε την προκαθορισμένη συσκευή εκκίνησης. Πρέπει όμως να ξέρετε μερικές λεπτομέρειες για τα ονόματα των συσκευών στο OpenBoot. Είναι πολύ διαφορετικά από ό,τι στο Linux όπως περιγράφεται στην ενότητα <xref linkend="device-names"/>. Επίσης η εντολη που χρησιμοποιείται αλλάζει λίγο ανάλογα με την έκδοση του OpenBoot που έχετε. Περισσότερες πληροφορίες για το OpenBoot μπορείτε να βρείτε στο <ulink url="&url-openboot;">Sun OpenBoot Reference</ulink>.
ko: OpenBoot를 사용해 특정 장치에서 부팅할 수 있고, 기본 부팅 장치를 바꿀 수도 있습니다. 하지만 OpenBoot의 장치 명명법에 대해 좀 자세히 알아야 합니다. 리눅스 장치 명명법과는 많이 다른데 <xref linkend="device-names"/>에 보면 설명되어 있습니다. 또, 명령어도 어떤 OpenBoot 버전을 쓰느냐에 따라 많이 다릅니다. OpenBoot에 대한 더 많은 정보는 <ulink url="&url-openboot;">Sun OpenBoot Reference</ulink>에서 볼 수 있습니다.
pt: Você pode utilizar o OpenBoot para arrancar a partir de dispositivos específicos, e também mudar o dispositivo de arranque. No entanto, você necessita saber alguns detalhes acerca dos nomes de dispositivos OpenBoot; é muito diferente do esquema de nomes de dispositivos em Linux, descrito em <xref linkend="device-names"/>. Além disso, o comando pode variar um pouco, dependendo de que versão do OpenBoot que você tem. Mais informação acerca do OpenBoot pode ser encontrada na <ulink url="&url-openboot;">Sun OpenBoot Reference</ulink>.
ru: С помощью OpenBoot можно загрузиться с разных устройств, а также изменить устройство загрузки по умолчанию. Однако, вам нужно знать некоторые подробности о том, какв OpenBoot называются устройства; их сильно отличающиеся от Linux названия, описаны в <xref linkend="device-names"/>. Также, могут слегка различаться команды, в зависимости от версии OpenBoot. Более подробную информацию по OpenBoot можно найти вe <ulink url="&url-openboot;">Sun OpenBoot Reference</ulink>.
zh_cn: 您可以使用 OpenBoot 从指定设备启动，也可以能改变默认启动设备。但您需要了解 OpenBoot 如何命名设备的细节，它与 Linux 命名方法有很大差别，说明在 <xref linkend="device-names"/>。另外，该命令会依 OpenBoot 的版本不同而略有区别。更多关于 OpenBoot 的信息请参考 <ulink url="&url-openboot;">Sun OpenBoot Reference</ulink>。
zh_tw: 您可以使用 OpenBoot 指定開機設備，也可以能改變預設開機設備。但您需要瞭解 OpenBoot 如何命名設備的細節，它與 Linux 命名方法有很大差別，說明在 <xref linkend="device-names"/>。另外，該指令會依 OpenBoot 的版本不同而略有區別。更多關於 OpenBoot 的資料請參閱 <ulink url="&url-openboot;">Sun OpenBoot Reference</ulink>。

source: Typically, with newer revisions, you can use OpenBoot device such as <quote>floppy</quote>, <quote>cdrom</quote>, <quote>net</quote>, <quote>disk</quote>, or <quote>disk2</quote>. These have the obvious meanings; the <quote>net</quote> device is for booting from the network. Additionally, the device name can specify a particular partition of a disk, such as <quote>disk2:a</quote> to boot disk2, first partition. Full OpenBoot device names have the form <informalexample> <screen> <replaceable>driver-name</replaceable>@ <replaceable>unit-address</replaceable>: <replaceable>device-arguments</replaceable> </screen></informalexample>. In older revisions of OpenBoot, device naming is a bit different: the floppy device is called <quote>/fd</quote>, and SCSI disk devices are of the form <quote>sd(<replaceable>controller</replaceable>, <replaceable>disk-target-id</replaceable>, <replaceable>disk-lun</replaceable>)</quote>. The command <userinput>show-devs</userinput> in newer OpenBoot revisions is useful for viewing the currently configured devices. For full information, whatever your revision, see the <ulink url="&url-openboot;">Sun OpenBoot Reference</ulink>.
el: Τυπικά, με τις νεώτερες εκδόσεις του OpenBoot μπορείτε να χρησιμοποιήσετε συσκευές όπως <quote>floppy</quote>, <quote>cdrom</quote>, <quote>net</quote>, <quote>disk</quote>, ή <quote>disk2</quote>. με την προφανή ερμηνεία. Η συσκευή <quote>net</quote> είναι για εκκίνηση από το δίκτυο. Επιπρόσθετα, η ονομασία της συσκευής ,μπορεί να προσδιορίσει μια συγκεκριμένη κατάτμηση ενός δίσκου για εκκίνηση, όπως <quote>disk2:a</quote> για να ξεκινήσετε από τον δεύτερο δίσκο disk2, πρώτη κατάτμηση.Τα πλήρη ονόματα συσκευών στο OpenBoot έχουν την μορφή <informalexample> <screen> <replaceable>driver-name</replaceable>@ <replaceable>unit-address</replaceable>: <replaceable>device-arguments</replaceable> </screen></informalexample>. Σε παλιότερες εκδόσεις του OpenBoot, η ονομασία είναι λίγο διαφορετική: η δισκέττα λέγεται <quote>/fd</quote> και οι συσκευές SCSI δίσκων είναι της μορφής <quote>sd(<replaceable>controller</replaceable>, <replaceable>disk-target-id</replaceable>, <replaceable>disk-lun</replaceable>)</quote>. Η εντολή <userinput>show-devs</userinput> σε νεώτερες εκδόσεις του OpenBoot είναι χρήσιμη για να βλέπετε τις συσκευές που είναι ήδη ρυθμισμένες. Για πλήρεις πληροφορίες, άσχετα από την έκδοση, δείτε το <ulink url="&url-openboot;">Sun OpenBoot Reference</ulink>.
ko: 최근 버전에서는, OpenBoot 장치를 <quote>floppy</quote>, <quote>cdrom</quote>, <quote>net</quote>, <quote>disk</quote> 혹은 <quote>disk2</quote>와 같이 쓸 수 있습니다. 각각은 분명한 의미가 있습니다. <quote>net</quote>은 네트워크에서 부팅합니다. 또 장치 이름에서 디스크의 특정 파티션을 지정할 수도 있습니다. <quote>disk2:a</quote>와 같이 하면 disk2의 첫번째 파티션에서 부팅하는 것입니다. 완전한 OpenBoot 장치 이름의 형식은 다음과 같습니다: <informalexample> <screen> <replaceable>드라이버-이름</replaceable>@ <replaceable>유닛-주소</replaceable>: <replaceable>드라이버-인수</replaceable> </screen></informalexample> 과거 버전의 OpenBoot에서는 장치 명명법이 약간 다릅니다: 플로피 장치는 <quote>/fd</quote>라고 하고, SCSI 디스크는 <quote>sd(<replaceable>컨트롤러</replaceable>, <replaceable>디스크-타겟-ID</replaceable>, <replaceable>디스크-LUN</replaceable>)</quote> 형식입니다. 최근 OpenBoot 버전에서는 <userinput>show-devs</userinput> 명령으로 현재 설정되어 있는 장치의 목록을 볼 수 있습니다. 버전에 대한 더 자세한 정보는 <ulink url="&url-openboot;">Sun OpenBoot Reference</ulink>를 참고하십시오.
pt: Tipicamente, com revisões mais recentes, você pode utilizar um dispositivo OpenBoot tal como <quote>floppy</quote>, <quote>cdrom</quote>, <quote>net</quote>, <quote>disk</quote>, ou <quote>disk2</quote>. Estes têm significados óbvios; o dispositivo <quote>net</quote> é utilizado para arrancar a partir da rede. Adicionalmente, o nome de dispositivo pode especificar uma partição específica do disco, tal como <quote>disk2:a</quote> para arrancar a partir de disk2, primeira partição. Nomes completos de dispositivos OpenBoot têm a forma <informalexample> <screen> <replaceable>driver-name</replaceable>@ <replaceable>unit-address</replaceable> <replaceable>device-arguments</replaceable> </screen></informalexample>. Em versões mais antigas do OpenBoot, o esquema de nomes é um pouco diferente: a disquete é chamada de <quote>/fd</quote>, e dispositivos de discos SCSI têm a forma <quote>sd(<replaceable>controller</replaceable>, <replaceable>disk-target-id</replaceable>, <replaceable>disk-lun</replaceable>)</quote>. Em revisões mais recentes de OpenBoot o comando <userinput>show-devs</userinput> é útil para ver os dispositivos actualmente configurados. Para mais informação, qualquer que seja a sua revisão, veja a <ulink url="&url-openboot;">Sun OpenBoot Reference</ulink>.
ru: Естественно, в новых версиях OpenBoot вы можете использовать простые имена устройств: <quote>floppy</quote>, <quote>cdrom</quote>, <quote>net</quote>, <quote>disk</quote>, или <quote>disk2</quote>. Названия говорят сами за себя; устройство <quote>net</quote> предназначено для загрузки по сети. Также, именем устройства можно задать определённый раздел на диске, например <quote>disk2:a</quote> указывает на загрузку с диска disk2, из первого раздела. Полные имена устройств в OpenBoot имеют вид <informalexample> <screen> <replaceable>драйвер</replaceable>@ <replaceable>адрес устройства</replaceable>: <replaceable>аргументы устройства</replaceable> </screen></informalexample>. В старых версиях OpenBoot, названия устройств слегка отличаются: дисковод гибких дисков называется <quote>/fd</quote>, а название SCSI диска имеет вид: <quote>sd(<replaceable>контроллер</replaceable>, <replaceable>id диска</replaceable>, <replaceable>lun диска</replaceable>)</quote>. Команда <userinput>show-devs</userinput> в новых версияхOpenBoot показывает имеющиеся настроенные устройства. Полную информацию по любой версии смотрите в <ulink url="&url-openboot;">Sun OpenBoot Reference</ulink>.
zh_cn: 一般来说，在较新的修订版中，您可以使用 OpenBoot 设备，如<quote>floppy</quote>、<quote>cdrom</quote>、<quote>net</quote>、<quote>disk</quote>或<quote>disk2</quote>。这些是显而易见的含义，<quote>net</quote>即指设备是从网络启动。另外，设备名可以明确指定磁盘分区，如<quote>disk2:a</quote>将启动磁盘 disk2 的第一个分区。完整的 OpenBoot 设备命名形式为 <informalexample> <screen> <replaceable>driver-name</replaceable>@ <replaceable>unit-address</replaceable>: <replaceable>device-arguments</replaceable> </screen></informalexample>。在旧版的 OpenBoot 中，设备命名有些不同：软盘设备称为<quote>/fd</quote>，SCSI 磁盘形式是<quote>sd(<replaceable>controller</replaceable>, <replaceable>disk-target-id</replaceable>, <replaceable>disk-lun</replaceable>)</quote>。<userinput>show-devs</userinput> 命令在新版的 OpenBoot 中用于查看当前的配置设备。对于完整的信息，和您使用的版本，请参考 <ulink url="&url-openboot;">Sun OpenBoot Reference</ulink>。
zh_tw: 一般來說，在較新的修訂版中，您可以使用 OpenBoot 設備，如 <quote>floppy</quote>、<quote>cdrom</quote>、<quote>net</quote>、<quote>disk</quote> 或 <quote>disk2</quote>。這些是顯而易見的，<quote>net</quote> 即指從網路開機。另外，設備名可以明確指定磁碟分割區，如 <quote>disk2:a</quote> 將開機磁碟 disk2 的第一個分割區。完整的 OpenBoot 設備命名形式為 <informalexample> <screen> <replaceable>driver-name</replaceable>@ <replaceable>unit-address</replaceable>: <replaceable>device-arguments</replaceable> </screen></informalexample>。 在舊版的 OpenBoot 中，設備命名方式有些不同：軟碟設備稱為 <quote>/fd</quote>，SCSI 磁碟形式是 <quote>sd (<replaceable>controller</replaceable>, <replaceable>disk-target-id</replaceable>, <replaceable>disk-lun</replaceable>)</quote>。指令 <userinput>show-devs</userinput> 在新版的 OpenBoot 中用於查看目前設定好的設備。對於完整的資料，和您使用的版本，請參閱 <ulink url="&url-openboot;">Sun OpenBoot Reference</ulink>。

source: To boot from a specific device, use the command <userinput>boot <replaceable>device</replaceable></userinput>. You can set this behavior as the default using the <userinput>setenv</userinput> command. However, the name of the variable to set changed between OpenBoot revisions. In OpenBoot 1.x, use the command <userinput>setenv boot-from <replaceable>device</replaceable></userinput>. In later revisions of OpenBoot, use the command <userinput>setenv boot-device <replaceable>device</replaceable></userinput>. Note, this is also configurable using the <command>eeprom</command> command on Solaris, or modifying the appropriate files in <filename>/proc/openprom/options/</filename>, for example under Linux: <informalexample><screen> # echo disk1:1 &gt; /proc/openprom/options/boot-device </screen></informalexample> and under Solaris:
el: Για να εκκινήσετε από μια συγκεκριμένη συσκευή χρησιμοποιήστε την εντολή <userinput>boot <replaceable>device</replaceable></userinput>. Μπορείτε να κάνετε την συμπεριφορά αυτή την προκαθορισμένη χρησιμοποιώντας την εντολή <userinput>setenv</userinput>. Όμως το όνομα της μεταβλητής που πρέπει να ρυθμίσετε έχει αλλάξει μεταξύ των διαφορετικών εκδόσεις του OpenBoot. Στο OpenBoot 1.x χρησιμοποιήστε την εντολή <userinput>setenv boot-device <replaceable>device</replaceable></userinput>. Σημειώστε ότι μπορείτε να κάνετε τη ρύθμιση αυτή και με την εντολή <command>eeprom</command> στο Solaris ή με την τροποποίηση των κατάλληλων αρχείων στο <filename>/proc/openprom/options/</filename>, για παράδειγμα στο Linux <informalexample><screen> # echo disk1:1 &gt; /proc/openprom/options/boot-device </screen></informalexample> και στο Solaris:
ko: 특정 장치에서 부팅하려면, <userinput>boot <replaceable>장치</replaceable></userinput> 명령을 사용합니다. <userinput>setenv</userinput> 명령을 사용하면 이걸 기본값으로 만들 수 있습니다. 하지만 변수의 이름은 OpenBoot 버전마다 다릅니다. OpenBoot 1.x에서는 <userinput>setenv boot-from <replaceable>장치</replaceable></userinput> 명령을 사용하십시오. 그 후의 OpenBoot 버전에서는, <userinput>setenv boot-device <replaceable>장치</replaceable></userinput> 명령을 사용하십시오. Solaris에서 <command>eeprom</command> 명령을 이용하거나, <filename>/proc/openprom/options/</filename>의 파일을 고쳐서 설정할 수 있습니다. 예를 들어 리눅스에서는: <informalexample><screen> # echo disk1:1 &gt; /proc/openprom/options/boot-device </screen></informalexample> 그리고 Solaris에서는:
pt: Para arrancar a partir de um dispositivo específico, utilize o comando <userinput>boot <replaceable>device</replaceable></userinput>. Você pode definir este comportamento como padrão utilizando o comando <userinput>setenv</userinput>. No entanto, o nome da variável a definir mudou entre as revisões do OpenBoot. No OpenBoot 1.x, utilize o comando <userinput>setenv boot-from <replaceable>device</replaceable></userinput>. Em versões posteriores do OpenBoot, utilize o comando <userinput>setenv boot-device<replaceable>device</replaceable></userinput>. Note, isto também pode ser configurado utilizando o comando <command>eeprom</command> em Solaris, ou modificar os ficheiros apropriados em <filename>/proc/openprom/options/</filename>, por exemplo em Linux: <informalexample><screen> # echo disk1:1 &gt; /proc/openprom/options/boot-device </screen></informalexample> e em Solaris:
ru: Чтобы загрузиться с определённого устройства, воспользуйтесь командой <userinput>boot <replaceable>устройство</replaceable></userinput>. Вы можете настроить это как действие по умолчанию с помощью команды <userinput>setenv</userinput>. Однако, имя переменной для установки различается в разных версиях OpenBoot. В OpenBoot 1.x, используйте команду <userinput>setenv boot-from <replaceable>устройство</replaceable></userinput>. В последних версиях OpenBoot используйте команду <userinput>setenv boot-device <replaceable>устройство</replaceable></userinput>. Заметим, что это также можно настроить с помощью команды <command>eeprom</command> в Solaris, или изменить соответствующие файлы в <filename>/proc/openprom/options/</filename>, например в Linux: <informalexample><screen> # echo disk1:1 &gt;/proc/openprom/options/boot-device </screen></informalexample> и в Solaris:
zh_cn: 要从指定的设备启动，请使用 <userinput>boot <replaceable>device</replaceable></userinput> 命令。您可以通过 <userinput>setenv</userinput> 命令将它设为默认方式。但变量的名称对不同版本有所改变。在 OpenBoot 1.x 中，请使用 <userinput>setenv boot-from <replaceable>device</replaceable></userinput> 命令。在稍后的 OpenBoot 修订版本中，请使用 <userinput>setenv boot-device <replaceable>device</replaceable></userinput> 命令。注意，它也可以通过使用 Solaris 上的 <command>eeprom</command> 命令或者修改 <filename>/proc/openprom/options/</filename> 中相应的文件来进行配置，例如，Linux 下使用： <informalexample><screen> # echo disk1:1 &gt; /proc/openprom/options/boot-device </screen></informalexample> 或在 Solaris下执行：
zh_tw: 要從指定的設備開機，請使用 <userinput>boot <replaceable>device</replaceable></userinput> 指令。您可以透過 <userinput>setenv</userinput> 指令將它設為預設方式。但變數的名稱在不同版本會有所改變。在 OpenBoot 1.x 中，請使用 <userinput>setenv boot-from <replaceable>device</replaceable></userinput> 指令。在稍後的 OpenBoot 修訂版本中，請使用 <userinput>setenv boot-device <replaceable>device</replaceable></userinput> 指令。注意，它也可以透過使用 Solaris 上的 <command>eeprom</command> 指令或者修改 <filename>/proc/openprom/options/</filename> 中相應的檔案來進行設定，例如，Linux 下使用： <informalexample><screen> # echo disk1:1 &gt; /proc/openprom/options/boot-device </screen></informalexample> 或在 Solaris下執行：

source: BIOS Setup
el: Ρύθμιση του BIOS
ko: BIOS 설정
pt: Configuração da BIOS
ru: Настройка BIOS
zh_cn: BIOS 设置
zh_tw: BIOS 設置

source: In order to install &debian; on a &arch-title; or zSeries machine you have first boot a kernel into the system. The boot mechanism of this platform is inherently different to other ones, especially from PC-like systems: there are no floppy devices available at all. You will notice another big difference while you work with this platform: most (if not all) of the time you will work remote, with the help of some client session software like telnet, or a browser. This is due to that special system architecture where the 3215/3270 console is line-based instead of character-based.
el: Για να εγκαταστήσετε το &debian; στην αρχιτεκτονική &arch-title; ή σε ένα μηχάνημα zSeries πρέπει πρώτα να ξεκινήσετε έναν πυρήνα στο σύστημα. Ο μηχανισμός εκκίνησης στην πλατφόρμα αυτή είναι εγγενώς διαφορετικός από όλους τους άλλους, ειδικότερα από συστήματα τύπου-PC. Δεν υπάρχουν καθόλου διαθέσιμες συσκευές δισκέττας. Θα προσέξετε επίσης και μια άλλη μεγάλη διαφορά δουλεύοντας στην πλατφόρμα αυτή: τον περισσότερο (αν όχι όλο το χρόνο) θα δουλεύετε απομακρυσμένα, με τη βοήθεια λογισμικού για client session όπως το telnet, ή έναν browser. Αυτό οφείλεται στην ιδιαιτερότητα της αρχιτεκτονικής αυτών των συστημάτων όπου η κονσόλα 3215/3270 είναι line-based και όχι character-based.
ko: &debian;을 &arch-title; 혹은 zSeries 기계에 설치하려면 먼저 커널을 부팅합니다. 이 플랫폼의 부팅 방법은 다른 플랫폼과는 (특히 PC 시스템과는) 완전히 다릅니다. 플로피 장치가 아예 없습니다. 이 플랫폼으로 작업할 때 다른 큰 차이점도 하나 있는데, (항상 그렇지는 않더라도) 대부분 원격에서 telnet이나 브라우저같은 클라이언트 소프트웨어를 이용해 작업합니다. 특별한 아키텍쳐때문인데 여기서 3215/3270 콘솔은 문자 단위가 아니라 라인 단위입니다.
pt: De modo a instalar !POXML_AMP!debian; em &arch-title; ou numa máquina zSeries primeiro tem de iniciar um kernel para o sistema. O mecanismo de arranque para esta plataforma é inerentemente diferente das outros, especialmente dos sistemas do tipo PC: não existe nenhum dispositivo de disquete disponível. Você vai notar outra grande diferença enquanto trabalha nesta plataforma: a maior parte (senão sempre) irá trabalhar remotamente, com a ajuda de um software cliente de sessão como o telnet, ou um browser. Isto é devido à arquitectura especial do sistema onde a consola 3215/3270 é baseada em linhas em vez de baseada em caracteres.
ru: Чтобы установить &debian; на &arch-title; или машины zSeries, сначала вам нужно загрузить в систему ядро. Механизм загрузки на этой платформе в корне отличается от всех остальных, особенно от PC-совместимых систем: на ней нет дисководов.Ещё одно большое отличие от других платформ: большинство (если не всё) времениработа с неё происходит удалённо, через клиентское программное обеспечение типаtelnet или browser. Это одна из особенностей архитектуры системы, где вместо символьных консолей используются линейные консоли 3215/3270.
zh_cn: 为了安装 &debian; 到 &arch-title; 或者 zSeries 机器上，您首先要将内核引导进系统。在此平台上的启动机制与其他类型，特别是类 PC 的系统，有着本质上的不同：它根本就没有软盘驱动器。您还会注意到此平台上的另外一个显著差异：大多数(如果不是全部)的时间，您将借助于其他客户机上的 telnet 这样的软件或者一个浏览器，通过远程方式使用。这归因于该系统上的 3215/3270 控制台是线型，而不是字符型的。
zh_tw: 為了安裝 &debian; 到 &arch-title; 或者 zSeries 機器上，您首先要將核心載入系統。在此平台上的開機機制與其他類型，特別是類 PC 的系統，有著本質上的不同：它根本就沒有軟碟機。您還會注意到此平台上的另外一個顯著差異：大多數 (如果不是全部) 的時間，您將借助於一些客戶端連線軟體如 telnet 或者一個瀏覽器， 透過遙控的方式使用。這歸因於該系統上的 3215/3270 控制台是線性，而不是字元型的。
