Repository: xobs/debian-installer
Catalog: doc/manual/po/*/preparing.po
Languages: el, ko, pt, ru, zh_cn, zh_tw

source: Linux on this platform runs either natively on the bare machine, in a so-called LPAR (Logical Partition) or in a virtual machine supplied by the VM system. You can use a boot tape on all of those systems; you may use some other boot media, too, but those may not be generally available. For example, you can use the virtual card reader of a virtual machine, or boot from the HMC (Hardware Management Console) of an LPAR if the HMC and this option is available for you.
el: Το Linux στην πλατφόρμα αυτή τρέχει είτε natively στο ίδιο το μηχάνημα σε μια λεγόμενη LPAR (Λογική Κατάτμηση) ή σε ένα εικονικό μηχάνημα που παρέχει το σύστημα VM. Μπορείτε να χρησιμοποιήσετε μια ταινία για εκκίνηση σε όλα αυτά τα μηχανήματα. Μπορείτε να χρησιμοποιήσετε κι άλλα μέσα εκκίνησης αλλά πιθανόν αυτά να μην είναι γενικά διαθέσιμα. Για παράδειγμα, μπορείτε να τον αναγνώστη εικονικής κάρτας ενός εικονικού μηχανήματος, ή να εκκινήσετε από την HMC (Hardware Management Console) μιας LPAR αν η κονσόλα HMC και αυτή η δυνατότητα είναι διαθέσιμες.
ko: 이 플랫폼의 리눅스는 LPAR(Logical Partition)이라고 하는 원래의 기계에서 돌아갈 수도 있고, VM 시스템의 가상 기계에서 동작할 수도 있습니다. 두 경우 모두 부팅 테이프를 사용할 수 있습니다. 다른 부팅 미디어를 사용할 수도 있지만 보통은 사용할 수 없습니다. 예를 들어서, 가상 기계의 경우 가상 카드 리더를 사용할 수도 있고, LPAR에서는 HMC에서 부팅할 수도 있습니다. (HMC가 있고 부팅 옵션이 있는 경우.)
pt: Nesta plataforma Linux corre quer nativamente numa máquina vazia, numa chamado LPAR (Partição Lógica) ou numa máquina virtual disponibilizada pelo sistema VM. Você pode utilizar uma tape de arranque em todos esses sistemas; você pode, também, utilizar outros media de arranque, mas esses podem não estar disponíveis. Por exemplo, você pode utilizar um leitor de cartões virtual de uma máquina virtual, ou arrancar a partir da HMC (Hardware Management Console) de uma LPAR se o HMC e esta opções estiverem disponíveis para si.
ru: Запуск Linux на этой платформе выполняется как родной на чистой машине в так называемомLPAR (Logical Partition (логическом разделе)) или на виртуальной машине, создаваемой системой VM.Вы можете использовать загрузочную ленту для любой из этих систем; вы можете также использовать другой загрузочный носитель, но они, обычно, недоступны. Например, вы можете использовать виртуальное устройство чтения перфокарт на виртуальной машине, или загрузиться с HMC (Hardware Management Console (консоль управления аппаратурой)) из LPAR, если HMC и эта опция вам доступны.
zh_cn: Linux 在该平台上可以是本地化方式运行于裸机上，以所谓的 LPAR(Logical Partition) 方式或者 由 VM 系统提供的虚拟机方式。您可以在所有的系统上使用启动磁带；您也可以使用其他的介质，但它们并不一定都可用。例如，您可以在虚拟机上使用虚拟读卡器，或者在 HMC (Hardware Management Console) 可用的情况下，从 LPAR 上的 HMC 启动。
zh_tw: Linux 在該平台上可以所謂的 LPAR(Logical Partition)方式在本地的本機上運行，或者在 VM 系統提供的虛擬機器上運行。您可以在所有的系統上使用開機磁帶﹔您也可以使用其他的媒介，但並不一定都可使用。例如，您可以在虛擬機器上使用虛擬讀卡器，或者在 HMC (Hardware Management Console) 可用的情況下，從 LPAR 上的 HMC 開機。

source: Before you actually perform an installation, you have to go over some design and preparation steps. IBM has made documentation available about the whole process, e.g. how to prepare an installation medium and how actually boot from that medium. Duplicating that information here is neither possible nor necessary. However, we will describe here which kind of Debian-specific data is needed and where do you find them. Based on both sources of information you have to prepare your machine and the installation medium and to perform a boot from it. When you see the welcome message in your client session join this document again for the Debian-specific installation steps.
el: Πριν κάνετε την πραγματική εγκατάσταση, πρέπει να κάνετε μια σειρά από βήματα σχεδιασμού και προετοιμασίας. Η IBM έχει κάνει διαθέσιμη την τεκμηρίωση που αφορά όλη την διαδικασία, πχ. πώς να προετοιμάσετε ένα μέσο εγκατάστασης και πώς πράγματι να να εκκινήσετε από το μέσο αυτό. Το να αναπαράγαμε αυτή την πληροφορία εδώ δεν είναι όυτε δυνατόν ούτε απαραίτητο. Θα περιγράψουμε όμως εδώ ποια στοιχεία αφορούν ειδικά το Debian και πού μπορείτε να τα βρείτε. Βασισμένοι και στις δυο πηγές πληροφορίας θα πρέπει να προετοιμάσετε το μηχάνημά σας και το μέσο εγκατάστασης και να πραγματοποιήσετε την εκκίνηση από αυτό. Όταν δείτε την οθόνη καλωσορίσματος στην απομακρυσμένη σύνοδό σας τότε επιστρέψτε στο κείμενο αυτό για τα βήματα εγκατάστασης που αφορούν ειδικά το Debian.
ko: 실제 설치를 하기 전에, 약간의 설계와 준비 단계를 거쳐야 합니다. IBM에서 나온 문서에서 전체 과정에 대해 다룹니다. 예를 들어 설치 미디어를 준비하고 그 미디어에 대해서 부팅하는 방법이 들어 있습니다. 여기서 거기 들어 있는 정보를 다시 반복하는 건 그렇게 할 수도 없고 그럴 필요도 없습니다. 하지만 여기서는 데비안에 특히 필요한 데이터가 어떤 것인지, 그리고 그 데이터를 어디서 찾을 수 있는 지에 대해서 설명합니다. IBM의 문서와 이 문서를 참고해서 기계와 설치 미디어를 준비하고 부팅해야 합니다. 클라이언트 세션에서 welcome 메세지를 보면 이 문서로 돌아와서 데비안에 관련된 설치 단계를 밟으십시오.
pt: Antes de você fazer realmente uma instalação, você tem de percorrer algumas etapas de design e de preparação. A IBM tornou disponível documentação acerca de todo o processo, p.e. como preparar um meio de instalação e como fazer o arranque a partir desse meio. Duplicar a informação aqui não é possível nem necessário. No entanto, nós vamos tentar descrever onde dados específicos de Debian são necessários e onde os pode encontrar. Baseado em ambas as fontes de informação você tem de preparar a sua máquina e o meio de instalação e depois fazer o arranque a partir dele. Quando vir a mensagem de boas vindas na sua sessão de cliente volte de novo a este documento para etapas de instalação específicas de Debian.
ru: Перед тем как выполнить установку, проведите планирование и некоторые предварительные шаги. IBM сделала доступной документацию о всём процессе, например, о подготовке среды установки и как загрузиться из этой среды. Дублировать эту информацию здесь нет необходимости. Однако, здесь мы опишем какие Debian-специфичные данные нужны и где их найти. Основываясь на обоих источниках информации вы подготовите машину и среду установки чтобы выполнить загрузку. Когда вы увидите приглашение в клиентской сессии, возьмите этот документ опять, чтобы проделать шаги установки специфичные для Debian.
zh_cn: 在真正进行安装之前，您必须仔细检查一些设计和准备步骤。IBM 已经有整个过程的文档，例如，如何准备安装介质和如何从该介质启动。这里复制那些信息既不需也不必。但基于必须给计算机所准备的信息资源和启动需要的安装介质，我们会在此说明需要哪些规格的 Debian 数据，以及在哪里能找到它们。当您在客户端对话中看到欢迎画面，再返回本文档查看 Debian 规格的安装步骤。
zh_tw: 在真正進行安裝之前，您必須仔細檢查一些設計和準備步驟。IBM 已經有整個過程的文件，例如，如何準備安裝媒介和如何從該媒介開機。我們無須在此複製那些資料。但我們會在此說明需要哪些規格的 Debian 資料，以及在哪裡能找到它們。根據資料您必須將您的機器和安裝媒介準備好並以之開機。當您在客戶端對話中看到歡迎畫面，再返回本文件查看 Debian 規格的安裝步驟。

source: Native and LPAR installations
el: Φυσικές εγκαταστάσεις και εγκαταστάσεις σε LPAR
ko: 네이티브 및 LPAR 설치
pt: Instalações Nativas e por LPAR
ru: Родная и LPAR установки
zh_cn: 本地化(Native)和 LPAR 安装
zh_tw: 本地的 (Native) 和 LPAR 安裝

source: Please refer to chapter 5 of the <ulink url="http://www.redbooks.ibm.com/pubs/pdfs/redbooks/sg244987.pdf"> Linux for &arch-title;</ulink> Redbook and chapter 3.2 of the <ulink url="http://www.redbooks.ibm.com/pubs/pdfs/redbooks/sg246264.pdf"> Linux for IBM eServer zSeries and &arch-title;: Distributions</ulink> Redbook on how to set up an LPAR for Linux.
el: Παρακαλούμε δείτε το κεφάλαιο 5 του <ulink url="http://www.redbooks.ibm.com/pubs/pdfs/redbooks/sg244987.pdf"> Linux for &arch-title;</ulink> Redbook και το κεφάλαιο 3.2 του <ulink url="http://www.redbooks.ibm.com/pubs/pdfs/redbooks/sg246264.pdf"> Linux για IBM eServer zSeries και &arch-title;:Διανομές</ulink> Redbook για το πώς να ρυθμίσετε μια Λογική Κατάτμηση για το Linux.
ko: 리눅스를 위해 LPAR을 설정하는 방법은 <ulink url="http://www.redbooks.ibm.com/pubs/pdfs/redbooks/sg244987.pdf"> Linux for &arch-title;</ulink> Redbook의 chapter 5와 <ulink url="http://www.redbooks.ibm.com/pubs/pdfs/redbooks/sg246264.pdf"> Linux for IBM eServer zSeries and &arch-title;: Distributions</ulink> Redbook의 chapter 3.2를 참고하십시오.
pt: Por favor veja o capítulo 5 do <ulink url="http://www.redbooks.ibm.com/pubs/pdfs/redbooks/sg244987.pdf">Linux for &arch-title;</ulink> Redbook e capítulo 3.2 do <ulink url="http://www.redbooks.ibm.com/pubs/pdfs/redbooks/sg246264.pdf">Linux for IBM eServer zSeries and &arch-title;: Distributions</ulink> Redbook acerca de como definir uma LPAR para Linux.
ru: Пожалуйста, обратитесь к главе 5 <ulink url="http://www.redbooks.ibm.com/pubs/pdfs/redbooks/sg244987.pdf"> Linux for &arch-title;</ulink> Redbook и к главе 3.2 of the <ulink url="http://www.redbooks.ibm.com/pubs/pdfs/redbooks/sg246264.pdf"> Linux for IBM eServer zSeries and &arch-title;: Distributions</ulink> Redbook о том как настроить LPAR для Linux.
zh_cn: 请参考 <ulink url="http://www.redbooks.ibm.com/pubs/pdfs/redbooks/sg244987.pdf"> Linux for &arch-title;</ulink> Redbook 第 5 章和 <ulink url="http://www.redbooks.ibm.com/pubs/pdfs/redbooks/sg246264.pdf"> Linux for IBM eServer zSeries and &arch-title;: Distributions</ulink> Redbook 第 3.2 节有关如何为 Linux 建立 LPAR 的部分。
zh_tw: 請參考 <ulink url="http://www.redbooks.ibm.com/pubs/pdfs/redbooks/sg244987.pdf"> Linux for &arch-title;</ulink> Redbook 第 5 章和 <ulink url="http://www.redbooks.ibm.com/pubs/pdfs/redbooks/sg246264.pdf"> Linux for IBM eServer zSeries and &arch-title;: Distributions</ulink> Redbook 第 3.2 節有關如何為 Linux 建立 LPAR 的部分。

source: Installation as a VM guest
el: Εγκατάσταση σαν VM guest
ko: VM guest로 설치
pt: Instalação como um VM guest
ru: Установка в качестве гостевой виртуальной машины (VM)
zh_cn: 作为一个 VM guest 安装
zh_tw: 以一個 VM guest 安裝

source: Please refer to chapter 6 of the <ulink url="http://www.redbooks.ibm.com/pubs/pdfs/redbooks/sg244987.pdf"> Linux for &arch-title;</ulink> Redbook and chapter 3.1 of the <ulink url="http://www.redbooks.ibm.com/pubs/pdfs/redbooks/sg246264.pdf"> Linux for IBM eServer zSeries and &arch-title;: Distributions</ulink> Redbook on how to set up a VM guest for running Linux.
el: Παρακαλούμε κοιτάξτε το κεφάλαιο 6 του <ulink url="http://www.redbooks.ibm.com/pubs/pdfs/redbooks/sg244987.pdf"> Linux for &arch-title;</ulink> Redbook και το κεφάλαιο 3.1 του <ulink url="http://www.redbooks.ibm.com/pubs/pdfs/redbooks/sg246264.pdf"> Linux for IBM eServer zSeries and &arch-title;: Distributions</ulink> Redbook για το πώς να ρυθμίσετε ένα VM guest για να τρέξετε Linux.
ko: VM guest를 설정해 리눅스를 실행하는 방법은 <ulink url="http://www.redbooks.ibm.com/pubs/pdfs/redbooks/sg244987.pdf"> Linux for &arch-title;</ulink> Redbook의 chapter 6과 <ulink url="http://www.redbooks.ibm.com/pubs/pdfs/redbooks/sg246264.pdf"> Linux for IBM eServer zSeries and &arch-title;: Distributions</ulink> Redbook의 chapter 3.1을 참고하십시오.
pt: Por favor veja o capítulo 6 do <ulink url="http://www.redbooks.ibm.com/pubs/pdfs/redbooks/sg244987.pdf">Linux for &arch-title;</ulink> Redbook e capítulo 3.1 do <ulink url="http://www.redbooks.ibm.com/pubs/pdfs/redbooks/sg246264.pdf">Linux for IBM eServer zSeries and !POXML_AMP!arch-title;: Distributions</ulink> Redbook em como definir um VM guest para correr Linux.
ru: Пожалуйста, обратитесь к главе 6 <ulink url="http://www.redbooks.ibm.com/pubs/pdfs/redbooks/sg244987.pdf"> Linux for &arch-title;</ulink> Redbook и к главе 3.1 <ulink url="http://www.redbooks.ibm.com/pubs/pdfs/redbooks/sg246264.pdf"> Linux for IBM eServer zSeries and &arch-title;: Distributions</ulink> Redbook о том как настроить виртуальную машину для запуска Linux.
zh_cn: 请参考 <ulink url="http://www.redbooks.ibm.com/pubs/pdfs/redbooks/sg244987.pdf"> Linux for &arch-title;</ulink> Redbook 第 6 章和 <ulink url="http://www.redbooks.ibm.com/pubs/pdfs/redbooks/sg246264.pdf"> Linux for IBM eServer zSeries and &arch-title;: Distributions</ulink> Redbook 第 3.1 节有关如何为运行 Linux 建立 VM guest 的部分。
zh_tw: 請參考 <ulink url="http://www.redbooks.ibm.com/pubs/pdfs/redbooks/sg244987.pdf"> Linux for &arch-title;</ulink> Redbook 第 6 章和 <ulink url="http://www.redbooks.ibm.com/pubs/pdfs/redbooks/sg246264.pdf"> Linux for IBM eServer zSeries and &arch-title;: Distributions</ulink> Redbook 第 3.1 節有關如何為運行 Linux 建立 VM guest 的部分。

source: You need to copy all the files from the <filename>generic</filename> sub-directory to your CMS disk. Be sure to transfer <filename>kernel.debian</filename> and <filename>initrd.debian</filename> in binary mode with a fixed record length of 80 characters.
el: Πρέπει να αντιγράψετε όλα τα αρχεία από τον υπο-κατάλογο <filename>generic</filename> στον CMS δίσκο σας. Σιγουρευτείτε ότι μεταφέρετε τα αρχεία <filename>kernel.debian</filename> και <filename>initrd.debian</filename> σε εκτελέσιμη μορφή με ένα προκαθορισμένο μήκος 80 χαρακτήρων.
ko: <filename>generic</filename> 서브 디렉토리에서 CMS 디스크로 모든 파일을 복사해 놓아야 합니다. <filename>kernel.debian</filename> 및 <filename>initrd.debian</filename> 파일은 반드시 80 character의 고정 레코드 길이로 바이너리 모드로 가져오십시오.
pt: Você necessita copiar todos os ficheiros a partir do subdirectório <filename>generic</filename> para o seu disco CMS. Assegure-se que transfere <filename>kernel.debian</filename> e <filename>initrd.debian</filename> em modo binário com um registo de tamanho fixo de 80 caracteres.
ru: Вам нужно скопировать все файлы из подкаталога <filename>generic</filename> на CMS диск. Проверьте, что копирование <filename>kernel.debian</filename> и <filename>initrd.debian</filename> выполняется в двоичном режиме с постоянной длиной записи равной 80 символам.
zh_cn: 您需要从 <filename>generic</filename> 子目录复制所有的文件到您的 CMS 磁盘。确保 <filename>kernel.debian</filename> 和 <filename>initrd.debian</filename> 是以固定 80 字符记录长度的二近制形式进行传输。
zh_tw: 您需要從 <filename>generic</filename> 子目錄複製所有的文件到您的 CMS 磁碟。請確認 <filename>kernel.debian</filename> 和 <filename>initrd.debian</filename> 是以固定 80 個字元長度的二進位形式進行傳輸。

source: Setting up an installation server
el: Ρύθμιση ενός server εγκατάστασης
ko: 설치 서버 설정하기
pt: Preparar um servidor de instalação
ru: Настройка сервера установки
zh_cn: 建立安装服务器
zh_tw: 設置安裝伺服器

source: If you don't have a connection to the Internet (either directly or via a web proxy) you need to create a local installation server that can be accessed from your S/390. This server keeps all the packages you want to install and must make them available using NFS, HTTP or FTP.
el: Αν δεν .έχετε μια σύνδεση στο Διαδίκτυο (είτε άμεσα είτε μέσω ενός web proxy) θα πρέπει να δημιουργήσετε έναν τοπικό server εγκατάστασης που να είναι προσβάσιμος από το μηχάνημά σας S/390. Αυτός ο server κρατά όλα τα πακέτα που θέλετε να εγκαταστήσετε και πρέπει να είναι διαθέσιμα μέσω NFS, HTTP ή FTP.
ko: (직접 혹은 웹 프록시를 통해) 인터넷에 연결하지 않는다면 S/390에서 접근할 수 있는 로컬 설치 서버를 만들어야 합니다. 이 서버에는 설치하려는 모든 꾸러미가 들어 있고 그 꾸러미를 NFS나 HTTP나 FTP로 외부에서 접근할 수 있게 합니다.
pt: Se você não tem uma ligação à Internet (quer directamente quer via uma proxy web) você necessita criar um servidor de instalação local que possa ser acedida a partir do seu S/390. Este servidor mantém todos os pacotes que você quer instalar e tem de os tornar disponíveis utilizando NFS, HTTP ou FTP.
ru: Если вы не имеете подключения к Интернет (или напрямую или через веб прокси), то вам нужно создать локальный сервер установки, который может быть доступен с S/390. Этот сервер хранит все пакеты, которые вы хотите установить и должен быть доступен через NFS, HTTP или FTP.
zh_cn: 如果您没有连接到互联网(直接或者间接通过 web 代理)，您需要创建一个您的 S/390 能访问的本地安装服务器。该服务器包含所有您需要安装的软件包，并可以通过 NFS，HTTP 或 FTP 访问。
zh_tw: 如果您沒有連接到網際網路 (直接或者間接透過網路代理)，您需要設置一個能從您的 S/390 存取的本地安裝伺服器。該伺服器包含所有您需要安裝的軟體套件，並可以透過 NFS，HTTP 或 FTP 存取。

source: The installation server needs to copy the exact directory structure from any &debian; mirror but of only the s390 and architecture-independent files are required. You can also copy the contents of all installation CDs into such a directory tree.
el: O server εγκατάστασης πρέπει να αντιγράψει την ακριβή δομή των καταλόγων από οποιοδήποτε &debian; καθρέφτη αλλά μόνο τα αρχεία που είναι συγκεκριμένα για τηναρχιτεκτονική s390 και αυτά που είναι ανεξάρτητα αρχιτεκτονικής χρειάζονται. Μπορείτε ακόμα να αντιγράψετε το περιεχόμενο όλων των CD εγκατάστασης σε ένα τέτοιο δέντρο καταλόγων.
ko: 설치 서버에는 &debian; 미러에서 디렉토리 구조를 정확히 복사해 놓아야 합니다. s390 아키텍쳐용 파일 및 아키텍쳐 공용 파일만 필요합니다. 그러한 디렉토리에서 설치 CD의 내용만 복사해 올 수도 있습니다.
pt: O servidor de instalação necessita copiar a estrutura exacta de directórios a partir de qualquer mirror &debian; mas apenas são necessários os ficheiros de s390 e os independentes de arquitectura.
ru: На сервер установки нужно скопировать полную структуру каталогов с любого сервера-зеркала &debian;, но нужны только для s390 и архитектуро-независимые файлы. Также, вы можете скопировать содержимое все установочных CD с таким жедеревом каталогов.
zh_cn: 安装服务器需要从任意 &debian; 镜像复制精确的目录结构，当然只需 s390 和一些独立于体系的文件。您也可以复制所有的安装 CD 到这样的目录树中。
zh_tw: 安裝伺服器需要從任意 &debian; 鏡像複製精確的目錄結構，當然只需複製 s390 相關和一些獨立於架構的檔案。您也可以複製所有的安裝光碟片到這樣的目錄樹中。

source: Hardware Issues to Watch Out For
el: Ζητήματα που θα πρέπει να προσέξετε για το υλικό
ko: 주의해야 할 하드웨어 이슈
pt: Assuntos de Hardware Para Estar Atento
ru: Аппаратные проблемы, которых нужно остерегаться
zh_cn: 需要留心的硬件问题
zh_tw: 需要留意的硬體問題

source: Many people have tried operating their 90 MHz CPU at 100 MHz, etc. It sometimes works, but is sensitive to temperature and other factors and can actually damage your system. One of the authors of this document over-clocked his own system for a year, and then the system started aborting the <command>gcc</command> program with an unexpected signal while it was compiling the operating system kernel. Turning the CPU speed back down to its rated value solved the problem.
el: Πολλοί άνθρωποι προσπάθησαν να λειτουργήσουν την CPU των 90 MHz στα 100 κοκ. Μερικές φορές αυτό δουλέυει, αλλά είναι πολύ ευαίσθητα εξαρτώμενο από την θερμοκρασία και άλλους παράγοντες και μπορεί στην ουσία να καταστρέψει το μηχάνημά σας. Ένας από τους συγγραφείς του κειμένου αυτού υπερ-χρόνισε (over-clocked ) το σύστημά του για έναν ολόκληρο χρόνο αλλά στη συνέχεια το σύστημα άρχισε να τερματίζει το πρόγραμμα <command>gcc</command> με ένα μη αναμενόμενο σήμα κι ενώ έκανε την μεταγλώττιση του πυρήνα. Κατεβάζοντας την συχνότητα της CPU πίσω στην κανονική της τιμή έλυσε το πρόβλημα.
ko: 많은 사람들이 CPU를 90 MHz를 100 MHz와 같이 오버클록킹해서 돌리고 있습니다. 이렇게 해도 동작하기도 하지만, 온도 및 그 밖의 요인에 민감하고 시스템이 망가질 수도 있습니다. 이 문서의 저자중의 한 명은 1년동안 시스템을 오버클록킹해서 써 왔는데 <command>gcc</command> 프로그램으로 운영 체제 커널을 컴파일할 때마다 예상치 못한 시그널로 이상 종료하곤 했습니다. CPU 속도를 원래대로 돌려 놓으니까 문제가 해결되었습니다.
pt: Muitas pessoas tentaram utilizar o seu CPU de 90 MHz a 100 MHz, etc. Por vezes funciona, mas é sensível à temperatura e a outros factores e pode mesmo danificar o seu sistema. Um dos autores deste documento fez overclock ao seu sistema durante um ano, e depois o sistema começou a abortar o programa <command>gcc</command> com um sinal não esperado enquanto compilava o kernel do sistema operativo. Voltando a colocar a velocidade do CPU de volta ao normal resolveu o problema.
ru: Многие люди пытаются заставить работать свои 90 МГц процессоры на 100 МГц и так далее. Иногда это даже работает, но зависит от температуры и других факторов и может реально повредить компьютер. Один из авторов этого документа работал на разогнанном компьютере целый год, а затем в системе стала падать программа <command>gcc</command> при сборке ядра операционной системы по неожидаемому сигналу . Возвращение скорости процессора в положенное значение решило проблему.
zh_cn: 有很多人曾试过把他们的 90 MHz 的 CPU 超频到 100 MHz 使用，以及其他诸如此类的做法。这有时可行，但是它有赖于外界的温度和其他因素，而且超频可能会损毁您的系统。这个文档的 作者之一曾把他的系统超频使用了有一年，从那以后他的系统在编译操作系统的内核时，总是发现 <command>gcc</command> 的运行被意外的信号中止了。后来，当把 CPU 的频率 调回它的标称速度后，问题迎刃而解。
zh_tw: 有很多人嘗試過把他們的 90 MHz 的處理器超頻到 100 MHz 使用，以及其他諸如此類的做法。這有時可行，但是這賴於外界的溫度和其他因素，而且超頻可能會損毀您的系統。這份文件的作者之一曾把他的系統超頻使用了有一年，從那以後他在編譯操作業系統核心時，<command>gcc</command> 總是會被意外的訊號中止。後來，把處理器的頻率調回標準速度後，問題迎刃而解。

source: The <command>gcc</command> compiler is often the first thing to die from bad memory modules (or other hardware problems that change data unpredictably) because it builds huge data structures that it traverses repeatedly. An error in these data structures will cause it to execute an illegal instruction or access a non-existent address. The symptom of this will be <command>gcc</command> dying from an unexpected signal.
el: Ο μεταγλωττιστής <command>gcc</command> είναι συνήθως το πρώτο πράγμα που αρχίζει να παγώνει εξαιτίας κάποιων κακών τμημάτων μνήμης (ή άλλων προβλημάτων υλικού που αλλάζουν δεδομένα κατά μη προβλέψιμο τρόπο) κι αυτό γιατί φτιάχνει τεράστιες δομές από δεδομένα τα οποία διατρέχει επανειλημμένα.Ένα σφάλμα στις δομές αυτές θα το αναγκάσει να εκτελέσει μια μη νόμιμη εντολή/οδηγία ή να προσπαθήσει να προσβεί μια ανύπαρκτη διεύθυνση μνήμης. Το σύμπτωμα αυτής της κατάστασης είναι το σταμάτημα του προγράμματος <command>gcc</command> από ένα απρόσμενο σήμα.
ko: 메모리 모듈에 문제가 있을 때 (아니면 데이터를 교환할 때 하드웨어 문제가 있을 때) 처음으로 죽는 프로그램은 보통 <command>gcc</command> 컴파일러입니다. <command>gcc</command>는 커다란 데이터 구조를 만들고 그 사이를 계속해서 왔다갔다 하기 때문입니다. 이 데이터 구조에 문제가 생기면 존재하지 않는 주소에 접근해서 잘못된 인스트럭션이 되어 버립니다. 그 증상은 <command>gcc</command>가 예상치 못한 시그널로 죽는 것입니다.
pt: O compilador <command>gcc</command> é muitas vezes a primeira coisa a sofrer devido a módulos de memória maus (ou outros problemas de hardware que modifiquem os dados inesperadamente) porque constrói grandes estruturas de dados que percorre repetidamente. Um erro nessas estruturas de dados irá causar a execução de uma instrução ilegal ou aceder a um endereço que não exista. O sintoma disto será o <command>gcc</command> morrer devido a um sinal não esperado.
ru: В первую очередь компилятор <command>gcc</command> часто валится из-за бракованных модулей памяти (или из-за других проблем с аппаратным обеспечением, которые приводят к непредсказуемым изменениям данных), так как он строит огромные структуры данных, которые постоянно просматриваются. Ошибка в этих структурах данных вызывает исполнение неверной инструкции или обращение по несуществующему адресу. Симптомом этого будет завершение <command>gcc</command> по неожидаемому сигналу.
zh_cn: 如果内存模块有故障的话(或者出现其他会使数据发生异变的硬件故障)，<command>gcc</command> 编译器经常是第一个停止工作的程序。因为它会生成庞大的数据结构，并把它们在内存中频繁移动。一旦这些 数据结构中有错，就会导致程序执行非法指令或者访问不存在的地址空间。表现出症状就是<command>gcc</command> 被一个意外的信号中止运行。
zh_tw: 如果記憶體模組有故障的話 (或者出現其他會使資料發生異變的硬體故障)，<command>gcc</command> 編譯器經常是第一個停止工作的程式。因為它會生成龐大的資料結構，並在記憶體中頻繁移動。一旦這些資料結構中有錯，就會導致程式執行非法指令或者存取不存在的位址空間。症狀就是 <command>gcc</command> 被一個意外的訊號中止執行。
