Repository: xobs/debian-installer
Catalog: doc/manual/po/*/preparing.po
Languages: el, ko, pt, ru, zh_cn, zh_tw

source: Tru64 UNIX, formerly known as Digital UNIX, which is in turn formerly known as OSF/1, uses the partitioning scheme similar to the BSD <quote>disk label</quote>, which allows for up to eight partitions per disk drive. The partitions are numbered <quote>1</quote> through to <quote>8</quote> in Linux and <quote>lettered</quote> <quote>a</quote> through to <quote>h</quote> in UNIX. Linux kernels 2.2 and higher always correspond <quote>1</quote> to <quote>a</quote>, <quote>2</quote> to <quote>b</quote> and so on. For example, <filename>rz0e</filename> in Tru64 UNIX would most likely be called <filename>sda5</filename> in Linux.
el: Το Tru64 UNIX, παλιότερα γνωστό σαν Digital UNIX, που με τη σειρά του ήταν προγουμένως γνωστό σαν OSF/1, χρησιμοποιεί ένα σχήμα διαμέρισης ανάλογο με αυτό των <quote>επικεφαλίδων δίσκου</quote> του BSD, που επιτρέπει μέχρι οχτώ κατατμήσεις για κάθε συσκευή δίσκου. Οι κατατμήσεις αυτές είναι αριθμημένες από το <quote>1</quote> μέχρι το <quote>8</quote> στο Linux και έχουν ένα γράμμα από το <quote>a</quote> μέχρι το <quote>h</quote> στο Unix. Οι πυρήνες του Linux από τον 2.2 και μεταγενέστερα αντιστοιχούν πάντα το <quote>1</quote> στο <quote>a</quote>, το <quote>2</quote> στο <quote>b</quote> κοκ. Για παράδειγμα, η κατάτμηση <filename>rz0e</filename> στο Tru64 UNIX θα εμφανιστεί το πιο πιθανόν σαν <filename>sda5</filename> στο Linux.
ko: Tru64 UNIX는 (예전 이름은 Digital UNIX이고, 그 다음에는 OSF/1이었습니다) BSD `디스크 레이블'과 비슷한 파티션 방식을 사용하는데, 이 방식은 각 디스크 드라이브마다 8개까지의 파티션을 만들 수 있습니다. 이 파티션은 리눅스에서는 <quote>1</quote>부터 <quote>8</quote>까지 번호를 붙이고 UNIX에서는 <quote>a</quote>에서 <quote>h</quote>까지 글자를 붙입니다. 리눅스 커널 2.2 이상의 버전에서는 <quote>1</quote>이 <quote>a</quote>에 해당하고, <quote>2</quote>가 <quote>b</quote>에 해당하는 식입니다. 예를 들어 Tru64 UNIX에서 <filename>rz0e</filename>는 리눅스에서는 <filename>sda5</filename>라고 합니다.
pt: Tru64 UNIX, antigamente conhecido como Digital UNIX, que era conhecido como OSF/1, utiliza um esquema de particionamento similar ao <quote>disk label</quote> de BSD, que permite até oito partições por disco. As partições são numeradas de <quote>1</quote> até <quote>8</quote> em Linux e com as letras de <quote>a</quote> até <quote>h</quote> em UNIX. Os kernel Linux 2.2 ou posteriores fazem sempre corresponder <quote>1</quote> a <quote>a</quote>, <quote>2</quote> a <quote>b</quote> e assim sucessivamente. Por exemplo, em Tru64 UNIX <filename>rz0e</filename> deverá ser chamado de <filename>sda5</filename> em Linux.
ru: Tru64 UNIX, ранее известный как Digital UNIX, который, в свою очередь, был ранее известен как OSF/1, использует схему разметки похожую на BSD <quote>disk label</quote>, которая позволяет иметь до восьми разделов на каждом диске. В Linux разделы нумеруются от <quote>1</quote> до <quote>8</quote> и в UNIX <quote>обукливаются</quote> с <quote>a</quote> по <quote>h</quote>. Ядра Linux версии 2.2 и выше всегда соотносят <quote>1</quote> в <quote>a</quote>, <quote>2</quote> в <quote>b</quote> и так далее. Например, <filename>rz0e</filename> из Tru64 UNIX в Linux будет называться <filename>sda5</filename>.
zh_cn: Tru64 UNIX，前身是 Digital UNIX，更早是 OSF/1，采用的分区方式类似于 BSD 的<quote>disk label</quote>，它允许每个磁盘上最多八个分区。分区命名在 Linux 下从<quote>1</quote>到<quote>8</quote>，在 UNIX 下是按<quote>字母次序</quote>从<quote>a</quote>到<quote>h</quote>。Linux 内核 2.2 或更高的版本是<quote>1</quote>对应<quote>a</quote>，<quote>2</quote>对应<quote>b</quote>，依此类推。例如，<filename>rz0e</filename> 是在 Tru64 UNIX 中的命名，而 <filename>sda5</filename> 是在 Linux 里的名称。
zh_tw: Tru64 UNIX 的前身是 Digital UNIX，更早是 OSF/1，採用的分割區方式類似於 BSD 的 <quote>disk label</quote>，它允許每個磁碟上最多有八個分割區。分割區命名在 Linux 下從 <quote>1</quote> 到 <quote>8</quote>，在 UNIX 下是按<quote>字母次序</quote>從 <quote>a</quote> 到 <quote>h</quote>。Linux 核心 2.2 或更高的版本是 <quote>1</quote> 對應 <quote>a</quote>，<quote>2</quote> 對應 <quote>b</quote>，依此類推。例如，<filename>rz0e</filename> 是在 Tru64 UNIX 中的命名，而 <filename>sda5</filename> 是在 Linux 裡的名稱。

source: Partitions in a Tru64 disk label may overlap. Moreover, if this disk will be used from Tru64, the <quote>c</quote> partition is required to span the entire disk (thus overlapping all other non-empty partitions). Under Linux this makes <filename>sda3</filename> identical to <filename>sda</filename> (<filename>sdb3</filename> to <filename>sdb</filename>, if present, and so on). However, the partman partitioning tool used by &d-i; cannot handle overlapping partitions at present. As a result, it is currently not recommended to share disks between Tru64 and Debian. Partitions on Tru64 disks can be mounted under Debian after installation has been completed.
el: Οι κατατμήσεις σε μια επικεφαλίδα διαμέρισης στο Tru64 μπορούν να αλληλεπικαλύπτονται. Ακόμα περισσότερο, αν αυτός ο δίσκος χρησιμοποιηθεί από το Tru64, τότε απαραίτητα η κατάτμηση <quote>c</quote> πρέπει να καταλαμβάνει ολόκληρο τον δίσκο (κατά συνέπεια υπερκαλύπτοντας όλες τις άλλες μη-κενές κατατμήσεις). Κάτω από το Linux, αυτό κάνει την κατάτμηση <filename>sda3</filename> ταυτόσημη με το <filename>sda</filename> (και μια κατάτμηση <filename>sdb3</filename> αν υπάρχει θα γίνει <filename>sdb</filename> κοκ.). Παρόλα αυτά, το εργαλείο διαμέρισης partman που χρησιμοποιείται από τον &d-i; δεν μπορεί προς το παρόν να διαχειριστείαλληλοκαλυπτόμενες κατατμήσεις. Σαν αποτέλεσμα, δεν συνίσταται αυτή τη στιγμή να μοιράζετε δίσκους μεταξύ του Tru64 και του Debian. Κατατμήσεις σε δίσκους του Tru64 μπορούν να προσαρτηθούν από το Debian μετά την ολοκλήρωση της εγκατάστασης.
ko: Tru64 디스크 레이블에서 파티션이 겹칠 수도 있습니다. 게다가 디스크를 Tru64에서 사용하는 경우, 전체 디스크에 걸쳐 있는 <quote>c</quote> 파티션이 필요합니다. (즉 비어 있지 않은 다른 모든 파티션과 겹칩니다.) 그것 때문에 리눅스에서는 <filename>sda3</filename>가 <filename>sda</filename>와 동일합니다. (<filename>sdb3</filename>은 <filename>sdb</filename>와 같고 기타 등등) 하지만 &d-i;에서 사용하는 partman 파티션 도구는 현재로선 겹치는 파티션을 처리하지 못합니다. 그래서 Tru64와 데비안 사이에 디스크를 같이 쓰지 않기를 권장합니다. Tru64의 파티션은 설치가 끝난 다음에 데비안에서 마운트할 수 있습니다.
pt: As partições num disk label de Tru64 podem sobrepor-se. E mais, se este disco for utilizado em Tru64, a partição <quote>c</quote> envolve todo o disco (e assim sobrepõe-se a todas as outras partições que não estejam vazias.). Em Linux isto torna <filename>sda3</filename> idêntico a <filename>sda</filename> (<filename>sdb3</filename> a <filename>sdb</filename>, se estiverem presentes, assim sucessivamente.). No entanto, o utilitário de particionamento partman utilizado pelo &d-i; de momento não pode lidar com partições que se sobrepõem. Como resultado, não é recomendado partilhar discos entre Tru64 e Debian. As partições em True64 podem ser montadas em Debian após a instalação ser completada.
ru: Разделы в Tru64 disk label могут перекрываться. Более того, если этот диск будет использоваться в Tru64, то для раздела <quote>c</quote> требуется, чтобы он распространялся на весь диск (то есть перекрывал все другие не пустые разделы). В Linux это делает <filename>sda3</filename> идентичным <filename>sda</filename> (если есть <filename>sdb3</filename>, то он одинаков с <filename>sdb</filename> и так далее). Однако, в настоящий момент, утилита разметки partman, используемая в &d-i; не работает с перекрывающимися разделами. Поэтому, не рекомендуется делать диски одновременно доступными и в Tru64 и в Debian. Разделы на Tru64 дисках могут быть смонтированы в Debian после завершения установки.
zh_cn: Tru64 磁盘标签下的分区可以重叠。此外，如果以前磁盘在 Tru64 下使用，<quote>c</quote>分区要求扩展到整个磁盘(因此会覆盖其他所有的非空分区)。在 Linux 下这是 <filename>sda3</filename> 源于 <filename>sda</filename> (<filename>sdb3</filename> 对应于 <filename>sdb</filename>，等等)。然而，&d-i; 使用的 partman 分区工具当前尚不能处理重叠的分区。因此，目前不推荐在 Tru64 和 Debian 之间共享磁盘。完成安装之后，Tru64 的磁盘分区可以挂载到 Debian 之下。
zh_tw: Tru64 磁碟標籤下的分割區可以重疊。此外，如果以前磁碟在 Tru64 下使用，<quote>c</quote> 分割區會要求擴展到整個磁碟 (因此會覆蓋其他所有的非空分割區)。在 Linux 下這使得 <filename>sda3</filename> 不同於 <filename>sda</filename> (<filename>sdb3</filename> 對應於 <filename>sdb</filename>，等等)。然而，&d-i; 使用的 partman 分割工具目前尚不能處理重疊的分割區。 因此，目前不建議在 Tru64 和 Debian 之間共享磁碟。完成安裝之後，Tru64 的磁碟分割區可以掛載到 Debian 之下。

source: Another conventional requirement is for the <quote>a</quote> partition to start from the beginning of the disk, so that it always includes the boot block with the disk label. If you intend to boot Debian from that disk, you need to size it at least 2MB to fit aboot and perhaps a kernel. Note that this partition is only required for compatibility; you must not put a file system onto it, or you'll destroy data.
el: Μια άλλη συνηθισμένη σύμβαση που απαιτείται είναι το να ξεκινά η κατάτμηση <quote>a</quote> από την αρχή του δίσκου, ώστε να περιλαμβάνει πάντα το μπλοκ εκκίνησης μαζί με την επικεφαλίδα του δίσκου. Αν σκοπεύετε να ξεκινάτε το Debian από αυτόν τον δίσκο θα πρέπει να κάνετε αυτήν την κατάτμηση τουλάχιστον 2 MB για να χωρέσει τουλάχιστον τον κατάλογο boot και ίσως έναν πυρήνα. Σημειώστε ότι η κατάτμηση αυτή απαιτείται μόνο για λόγους συμβατότητας. Δεν θα πρέπει να βάλετε κάποιο σύστημα αρχείων σε αυτήν, διαφορετικά θα καταστρέψετε τα δεδομένα.
ko: 전통적으로 필요한 또 한 가지는, <quote>a</quote> 파티션이 디스크의 맨 처음에서 시작한다는 것입니다. 그래서 이 파티션은 디스크 레이블에서 부팅 블럭을 포함합니다. 그 디스크에서 데비안을 부팅하려고 한다면, 이 파티션의 크기를 최소 2MB로 늘려야 aboot와 (아마도) 커널이 들어갈 수 있습니다. 이 파티션은 호환성을 위해서만 필요합니다. 여기에는 파일 시스템을 넣으면 안 됩니다. 여기에 파일 시스템을 넣으면 데이터가 망가집니다.
pt: Outra necessidade convencional é que a partição <quote>a</quote> comece no inicio do disco, de modo a incluir sempre o bloco de arranque com a disk label. Se pretende iniciar Debian a partir desse disco, tem de lhe dar um tamanho de pelo menos 2MB para que o aboot caiba e talvez o kernel. Note que esta partição só é necessária para compatibilidade; você não pode criar lá um sistema de ficheiros, ou irá destruir os dados.
ru: По другому стандартному правилу нужно, чтобы раздел <quote>a</quote> начинался с начала диска; отсюда следует, что он всегда содержит загрузочный блок и disk label. Если вы намереваетесь загружать Debian с этого диска, то его размер должен быть как минимум 2МБ, чтобы на него влез aboot и возможно, ядро. Заметим, что этот раздел нужен только для совместимости; на нём не нужна файловая система, или вы потеряете с неё данные.
zh_cn: 另外一个约定俗成的要求是分区<quote>a</quote>起始于磁盘开始处，因此它总包含具有磁盘标签的引导块。如果您从该磁盘启动 Debian，您至少需要给它 2MB 空间以在存储 aboot 和内核。注意，此分区仅为兼容考虑；您千万不要将文件系统置于其上，否则会破坏数据。
zh_tw: 另外一個約定俗成的要求是分割區 <quote>a</quote> 起始於磁碟開始處，因此它總包含具有磁碟標籤的開機磁區。如果您從該磁碟開機 Debian，您至少需要給它 2MB 空間以在儲存 aboot 和核心。注意，此分割區僅為相容考慮﹔您千萬不要將檔案系統置於其上，否則資料會破壞。

source: It is possible, and indeed quite reasonable, to share a swap partition between UNIX and Linux. In this case it will be needed to do a <command>mkswap</command> on that partition every time the system is rebooted from UNIX into Linux, as UNIX will damage the swap signature. You may want to run <command>mkswap</command> from the Linux start-up scripts before adding swap space with <command>swapon -a</command>.
el: Είναι πιθανόν και στην πραγματικότητα αρκετά εύλογο μοιράσετε μια κατάτμηση swap ανάμεσα στο Unix και στο Linux. Στην περίπτωση αυτή θα πρέπει να τρέχετε την εντολή <command>mkswap</command>στην κατάτμηση αυτή κάθε φορά που επανεκκινείτε το σύστημα από το Unix στο Linux καθώς το Unix καταστρέφει την υπογραφή της swap μνήμης. Μπορείτε να τρέχετε την <command>mkswap</command> από τα αρχεία εκκίνησης του Linux πριν την πρόσθεση χώρου για swap με την εντολή <command>swapon -a</command>.
ko: UNIX와 리눅스 사이에 스왑 파티션을 공유하는 게 가능하고, 공유하는 게 좋습니다. 이 경우 UNIX에서 리눅스로 부팅할 때마다 <command>mkswap</command> 명령을 실행해야합니다. UNIX에서 리눅스 스왑 시그너처를 망가뜨리기 때문입니다. <command>swapon -a</command> 명령으로 스왑 공간을 추가하기 전에 시작 스크립트에서 <command>mkswap</command>을 실행해야 합니다.
pt: É possível, e na verdade bastante razoável, partilhar uma partição swap entre Linux e UNIX. Neste caso irá necessitar de fazer <command>mkswap</command> nessa partição cada vez que o sistema reinicie de UNIX para Linux, porque UNIX irá danificar a assinatura de swap. Você pode querer correr <command>mkswap</command> a partir dos scripts de arranque de Linux antes de adicionar o espaço swap com <command>swapon -a</command>.
ru: Возможно, и это вполне логично, использовать раздел подкачки совместно UNIX и Linux. В этом случае нужно выполнять команду <command>mkswap</command> на этом разделе каждый раз когда система перезагружается из UNIX в Linux, так как UNIX уничтожает сигнатуру подкачки. Вы можете настроить запуск <command>mkswap</command> в Linux из сценария загрузки перед добавлением пространства подкачки командой <command>swapon -a</command>.
zh_cn: 我们可以，也有理由，让 UNIX 和 Linux 共享交换分区。这时就需要在该分区上使用 <command>mkswap</command>。因为 UNIX 将破坏 swap 标志，所以每次从 UNIX 到 Linux 重启后都要重新执行一次。您可以让 <command>mkswap</command> 从 Linux 的启动脚本里面运行，时间是在用 <command>swapon -a</command> 添加交换分区之前。
zh_tw: 我們可以，也有理由讓 UNIX 和 Linux 共享置換分割區。這時就需要在該分割區上使用 <command>mkswap</command>。因為 UNIX 將破壞 swap 標誌，所以每次從 UNIX 到 Linux 重啟後都要重新執行一次。 您可以讓 <command>mkswap</command> 從 Linux 的開機腳本裡面執行，將之放置在 <command>swapon -a</command> 添加置換分割區的指令之前。

source: If you want to mount UNIX partitions under Linux, note that Digital UNIX can use two different file system types, UFS and AdvFS, of which Linux only understands the former.
el: Αν θέλετε να προσαρτήσετε κατατμήσεις Unix στο Linux σημειώστε ότι το Digital Unix μπορεί να χρησιμοποιήσει δυο διαφορετικούς τύπους συστημάτων αρχείων, το UFS και το AdvFS, από τους οποίους το Linux "καταλαβαίνει" μόνο τον πρώτο.
ko: 리눅스에서 UNIX 파티션을 마운트하려면, Digital UNIX는 UFS와 AdvFS 두 종류의 파일 시스템을 사용할 수 있다는 점을 알아 두십시오. 이 중에서 리눅스는 UFS 파일시스템만 이해합니다.
pt: Se desejar montar partições UNIX em Linux, note que Digital UNIX pode utilizar dois tipos de sistemas de ficheiros, UFS e AdvFS, dos quais Linux apenas conhece o anterior.
ru: Если вы хотите монтировать разделы UNIX в Linux, заметим, что в Digital UNIX может использоваться два различных типа файловых систем, UFS и AdvFS, Linux понимает только последнюю.
zh_cn: 如果您想在 Linux 中挂载 UNIX 分区，注意 Digital UNIX 可以使用两种不同的文件系统类型，UFS 和 AdvFS，而 Linux 只能识别前者。
zh_tw: 如果您想在 Linux 中掛載 UNIX 分割區，注意 Digital UNIX 可以使用兩種不同的檔案系統類型，UFS 和 AdvFS，而 Linux 只能識別前者。

source: Partitioning in Windows NT
el: Κατάτμηση σε Windows NT
ko: Windows NT에서 파티션하기
pt: Particionamento em Windows NT
ru: Разметка дисков в Windows NT
zh_cn: Windows NT 下分区
zh_tw: Windows NT 下的分割

source: Windows NT uses the PC-style partition table. If you are manipulating existing FAT or NTFS partitions, it is recommended that you use the native Windows NT tools (or, more conveniently, you can also repartition your disk from the AlphaBIOS setup menu). Otherwise, it is not really necessary to partition from Windows; the Linux partitioning tools will generally do a better job. Note that when you run NT, the Disk Administrator may offer you to write a <quote>harmless signature</quote> on non-Windows disks if you have any. <emphasis>Never</emphasis> let it do that, as this signature will destroy the partition information.
el: Τα Windows NT χρησιμοποιούν τον τύπο PC-style για τον πίνακα κατατμήσεων. Αν θέλετε να χειριστείτε μια υπάρχουσα κατάτμηση FAT ή NTFS συνίσταται να χρησιμοποιήσετε τα φυσικά εργαλεία των Windows NT και (ή κάτι που είναι πιο βολικό, μπορείτε να επαναδιαμερίσετε τον δίσκο σας από το μενού ρύθμισης του AlphaBIOS). Σε κάθε άλλη περίπτωση δεν είναι αλήθεια απαραίτητο να κάνετε τη διαμέριση του δίσκου από τα Windows. Τα εργαλεία του Linux μπορούν να το κάνουν αυτό ακόμα καλίτερα. Προσέξτε επίσης ότι όταν τρέχετε τα NT, ο Διαχειριστής Δίσκων (Disk Administrator) μπορεί να σας προτείνει να γράψετε μια <quote>αθώα υπογραφή </quote> σε δίσκους που δεν έχουν Windows,αν υπάρχουν. <emphasis>Ποτέ</emphasis> μην αφήσετε να γίνει κάτι τέτοιο καθώς αυτή η υπογραφή θα καταστέψει την πληροφορία σχετικά με τη διαμέριση αυτών των δίσκων.
ko: Windows NT는 PC 방식 파티션 테이블을 사용합니다. 기존 FAT 혹은 NTFS 파티션을 변경하는 경우에는, Windows NT에 들어 있는 프로그램을 이용하길 권장합니다. (아니면 더 편하게 AlphaBIOS 설정 메뉴에서 디스크 파티션) 아니면, 꼭 Windows에서 디스크를 파티션할 필요는 없습니다. 보통 리눅스의 파티션 프로그램들이 더 잘 동작합니다. NT를 쓰는 경우, Disk Administrator에서는 Windows가 아닌 디스크가 있을 때 <quote>harmless signature</quote>를 쓰라고 할 수 있습니다. <emphasis>절대 하지 마십시오.</emphasis> 이 시그너처때문에 파티션 정보가 망가질 수 있습니다.
pt: O Windows NT utiliza uma tabela de partições do tipo PC. Se está a manipular partições FAT ou NTFS existentes, é recomendado que utilize utilitários nativos de Windows NT (ou, mais convenientemente, também pode reparticionar o seu disco a partir do menu de definições AlphaBIOS). Caso contrário, não é realmente necessário reparticionar a partir do Windows; Normalmente os utilitários de particionamento de Linux são melhores. Note que quando corre NT, o Disk Administrator pode oferecer-se para escrever uma <quote>assinatura inofensiva</quote> em discos que não tenham Windows, se você possuir algum. <emphasis>Nunca</emphasis> permita ele faça isso, já que a assinatura irá destruir a informação da partição.
ru: Windows NT использует обычную таблицу разделов PC. Если вы изменяете существующие разделы FAT или NTFS, рекомендуется использовать родные утилиты Windows NT (или, что более удобно, можно разметить диск из меню настройки AlphaBIOS). Иначе разметка из Windows необязательна; утилиты разметки Linux обычно хорошо справляются с этой работой. Заметим, что когда вы запускаете NT, Disk Administrator может предложить вам записать <quote>безвредную сигнатуру</quote> на не-Windows диски, если они у вас уже есть. <emphasis>Нигда</emphasis> не позволяйте делать этого, так как сигнатура уничтожает информацию о разделе.
zh_cn: Windows NT 使用 PC 风格的分区表。如果您要处理已存在的 FAT 或 NTFS 分区，推荐使用 Windows NT 本身的工具(或者，照惯例，您可以用 AlphaBIOS 配置菜单里面的工具重新分区)。否则，真没有必要从 Windows 来分区，Linux 的分区工具可以做得更好。注意，如果您运行 NT，磁盘管理器也许会建议您写一个<quote>harmless signature</quote>到您的非 Windows 的磁盘上。<emphasis>千万别</emphasis>让它那样做，这个标志会破坏该分区上的信息。
zh_tw: Windows NT 使用 PC 風格的分割表。如果您要處理已存在的 FAT 或 NTFS 分割區，建議使用 Windows NT 本身的工具 (或者，照慣例，您可以用 AlphaBIOS 設置選單裡面的工具重新分割)。否則，真沒有必要從 Windows 來分割磁區，Linux 的分割區工具可以做得更好。注意，如果您使用 NT，磁碟管理員也許會建議您寫一個<quote>無害的簽章</quote>到您的非 Windows 的磁碟上。<emphasis>千萬別</emphasis>讓它那樣做，這個標誌會破壞該分割區上的資料。

source: If you plan to boot Linux from an ARC/AlphaBIOS/ARCSBIOS console, you will need a (small) FAT partition for MILO. 5 MB is quite sufficient. If Windows NT is installed, its 6 MB bootstrap partition can be employed for this purpose. Debian &releasename; does not support installing MILO. If you already have MILO installed on your system, or install MILO from other media, Debian can still be booted from ARC.
el: Αν σκοπεύετε να ξεκινήσετε το Linux από μια κονσόλα ARC/AlphaBIOS/ARCSBIOS, θα χρειαστείτε μια μικρή κατάτμηση με FAT για το MILO. Τα 5 MB είναι πολυ ικανοποιητικά. Αν έχετε εγκατεστημένα Windows NT τα 6 MB της κατάτμησής τους για bootstrap μπορούν να χρησιμοποιηθούν για τον σκοπό αυτό. Η έκδοση &releasename; του Debian δεν υποστηρίζει την εγκατάσταση του MILO. Αν έχετε ήδη εγκατεστημένο το MILO στο σύστημά σας ή το εγκαταστήσετε από κάποιο άλλο μέσο, το Debian μπορεί ακόμα να εκκινηθεί από τηην κονσόλα ARC.
ko: ARC/AlphaBIOS/ARCSBIOS 콘솔에서 리눅스를 부팅하려면, MILO에 필요한 (작은) FAT 파티션이 필요합니다. 5MB면 충분합니다. Windows NT를 설치한 경우, 6MB의 부트스트랩 파티션을 이 목적으로 쓸 수 있습니다. 데비안 &releasename; 릴리스는 MILO 설치를 지원하지 않습니다. 시스템에 MILO가 이미 설치되어 있거나, 다른 미디어에서 MILO를 설치하는 경우에도, ARC에서 데비안을 부팅할 수 있습니다.
pt: Se você planeia iniciar Linux a partir de uma consola ARC/AlphaBIOS/ARCSBIOS, você vai necessitar de uma (pequena) partição para o MILO. 5 MB é suficiente. Se o Windows NT estiver instalado, a sua partição de bootstrap com 6 MB pode ser utilizada para esse efeito. Debian &releasename; não suporta a instalação do MILO. Se já tem o MILO instalado no seu sistema, ou instalar o MILO a partir de outro meio, Debian ainda pode ser iniciado a partir de ARC.
ru: Если вы планируете загружать Linux из консоли ARC/AlphaBIOS/ARCSBIOS, то вам потребуется (маленький) FAT раздел для MILO. 5МБ вполне хватит. Если установлена Windows NT, то её 6МБ загрузочный раздел может вполне подойти для этой цели. Debian &releasename; не поддерживает установку MILO. Если MILO уже установлен в ситеме, или вы установили MILO с другого носителя, то Debian можно загрузить на ARC.
zh_cn: 如果您计划从 ARC/AlphaBIOS/ARCSBIOS 控制台引导 Linux，您也许需要给 MILO 一个(小的) FAT 分区。5 Mb 就足够了。如果已经安装了 Windows NT，它的 6 Mb 启动分区可以用来满足此要求。Debian &releasename; 不支持安装 MILO。如果您的系统上已经有 MILO，或者从其他介质安装，Debian 仍然可以从 ARC 启动。
zh_tw: 如果您計劃從 ARC/AlphaBIOS/ARCSBIOS 控制台開機 Linux，您也許需要給 MILO 一個 (小的) FAT 分割區，5 Mb 就足夠了。 如果已經安裝了 Windows NT，它的 6 Mb 開機分割區可以用來滿足此要求。Debian &releasename; 不支援安裝 MILO。如果您的系統上已經有 MILO，或者從其他媒介安裝，Debian 仍然可以從 ARC 開機。

source: Partitioning From DOS or Windows
el: Κατάτμηση από DOS ή Windows
ko: DOS나 Windows에서 파티션하기
pt: Particionar a partir de DOS ou Windows
ru: Разметка дисков из DOS или Windows
zh_cn: 从 DOS 或 Windows 分区
zh_tw: DOS 或 Windows 下的分割

source: If you are manipulating existing FAT or NTFS partitions, it is recommended that you either use the scheme below or native Windows or DOS tools. Otherwise, it is not really necessary to partition from DOS or Windows; the Linux partitioning tools will generally do a better job.
el: Αν τροποποιείτε υπάρχουσες κατατμήσεις FAT ή NTFS, συνιστούμε να χρησιμοποιήσετε είτε το παρακάτω σχήμα είτε εργαλεία των ίδιων των Windows ή του DOS. Σε άλλη περίπτωση δεν υπάρχει αλήθεια λόγος για να κάνετε τη διαμέριση από το DOS ή τα Windows. Τα εργαλεία διαμέρισης του Linux μπορούν να κάνουν την ίδια δουλειά καλλίτερα.
ko: 기존 FAT나 NTFS 파티션을 변경하는 경우에는, 아래의 방법을 사용하거나 Windows나 DOS에 들어 있는 도구를 이용하십시오. 그 밖의 경우에는 DOS나 Windows에서 파티션할 필요는 없습니다. 보통 리눅스 파티션 도구가 더 좋습니다.
pt: Se está a manipular partições FAT ou NTFS existentes, é recomendado que utilize o esquema abaixo ou utilitários nativos de Windows ou DOS. Caso contrário, não é realmente necessário particionar a partir de DOS ou Windows; os utilitários de particionamento de Linux normalmente fazem-no melhor.
ru: Если вы преобразуете существующие разделы FAT или NTFS, то рекомендуется или следование схеме, приведённой ниже или использование родных утилит Windows или DOS. Иначе, нет никакой необходимости в разметке из DOS или Windows; утилиты разметки Linux обычно лучше подходят для этой работы.
zh_cn: 如果您想在已有的 FAT 或 NTFS 分区上动手，那么建议您或者按照下面介绍的方案操作，或者使用 Windows 或者 DOS 自己的工具软件。否则的话，真的没必要从 DOS 或者 Windows 分区，一般来说，Linux 的分区软件会做得更好。
zh_tw: 如果您想在已有的 FAT 或 NTFS 分割區上動手，那麼建議您或者按照下面介紹的方案操作，或者使用 Windows 或 DOS 自己的工具軟體。否則的話，真的沒必要從 DOS 或者 Windows 分割，一般來說，Linux 的分割軟體會做得更好。
