Repository: xobs/debian-installer
Catalog: doc/manual/po/*/preparing.po
Languages: el, ko, pt, ru, zh_cn, zh_tw

source: Here are some details about how to set the boot order. Remember to reset the boot order after Linux is installed, so that you restart your machine from the hard drive.
el: Δίνουμε μερικές λεπτομέρειες για το πώς μπορείτε να κανονίσετε την σειρά εκκίνησης. Θυμηθείτε να ξαναρυθμίσετε τη σειρά εκκίνησης μετά την εγκατάσταση του Linux ώστε η επανεκκίνηση του μηχανήματός σας να γίνει από τον σκληρό δίσκο.
ko: 여기서는 부팅 순서를 설정하는 법을 자세히 설명합니다. 리눅스를 설치한 다음에 부팅 순서를 원래대로 돌려 놓는 걸 잊지 마십시오. 그래야 하드 디스크에서 부팅할 수 있습니다.
pt: Aqui estão alguns detalhes acerca de como definir a ordem de arranque. Lembre-se de repor a ordem de arranque após Linux estar instalado, de modo a reiniciar a sua máquina a partir do disco rígido.
ru: Вот некоторые подробности о настройке порядка загрузки. Не забудьте изменить порядок после установки Linux на загрузку с жёсткого диска.
zh_cn: 下面讲述了有关如何设置启动顺序的一些细节。请记住，在安装完 Linux 后，要恢复原来的启动顺序，这样，您就能像以前一样从硬盘启动了。
zh_tw: 下面內容乃關於如何設置開機順序的一些細節。請記住，在安裝完 Linux 後，要恢復原來的開機順序，這樣，您就能像以前一樣從硬碟開機了。

source: Changing the Boot Order on IDE Computers
el: Αλλαγή της σειράς εκκίνησης σε υπολογιστές με IDE
ko: IDE 컴퓨터의 부팅 순서 바꾸기
pt: Alterar a Ordem de Arranque para Computadores Com IDE
ru: Изменение порядка загрузки на компьютерах с IDE
zh_cn: 修改 IDE 接口计算机的引导顺序
zh_tw: 修改 IDE 介面電腦的開機順序

source: As your computer starts, press the keys to enter the BIOS utility. Often, it is the <keycap>Delete</keycap> key. However, consult the hardware documentation for the exact keystrokes.
el: Καθώς ξεκινά ο υπολογιστής σας πατήστε τα πλήκτρα που χρειάζεται για να μπείτε στο πρόγραμμα ρύθμισης του BIOS. Συνήθως είναι το πλήκτρο <keycap>Delete</keycap>. Πάντως, συμβουλευτείτε και την τεκμηρίωση του υλικού σας για τον ακριβή συνδυασμό πλήκτρων.
ko: 컴퓨터가 시작할 때, BIOS 유틸리티에 들어가는 키를 누르십시오. 보통 그 키는 <keycap>Delete</keycap> 키입니다. 하지만 정확히 어떤 키를 눌러야 할 지는 하드웨어 문서를 참고하십시오.
pt: Quando o seu computador arrancar, carregue nas teclas para entrar no utilitário da BIOS. Muitas vezes, é a tecla <keycap>Delete</keycap>. No entanto, consulte a documentação de hardware para saber a combinação de teclas exacta.
ru: Как только компьютер начнёт загружаться, нажмите клавишу для входа в BIOS. Часто это клавиша <keycap>Delete</keycap>. Однако, посмотрите в документации на компьютер, какие клавиши предназначены для этого.
zh_cn: 当您的计算机启动时，可以按下某些键进入 BIOS 的设置软件。一般来说，按 <keycap>Delete</keycap> 键就可以了。若要知道按键的确切信息，可以参考硬件的相关文档。
zh_tw: 當您的電腦開機時，可以按某些鍵進入 BIOS 的設定軟體。一般來說，按<keycap>Delete</keycap> 鍵就可以了。若要知道按鍵的確切資料，可以參考硬體的相關文件。

source: Find the boot sequence in the setup utility. Its location depends on your BIOS, but you are looking for a field that lists drives.
el: Βρείτε την ρύθμιση της ακολουθίας εκκίνησης στο πρόγραμμα ρύθμισης του BIOS. Η θέση της εξαρτάται από το BIOS αλλά πρόκειται για ένα πεδίο που αναγράφει δίσκους.
ko: 설정 유틸리티에서 부팅 순서를 찾으십시오. 이 설정의 위치는 BIOS에 따라 다르지만, 드라이브 여러 개를 늘어 놓은 필드를 찾으면 됩니다.
pt: Encontrar a sequência de arranque no utilitário de configuração. A sua localização depende da sua BIOS, mas você está à procura de um campo que lista drives.
ru: Найдите в меню порядок загрузки. Его местоположение зависит от BIOS, но обычно вам нужно искать поле со списком дисководов.
zh_cn: 在 BIOS 设置软件中可以查看引导顺序。具体在 BIOS 的什么地方看，这和您的 BIOS 有关。不管如何，您要找的是列有驱动器名的栏位。
zh_tw: 在 BIOS 設定軟體中可以查看開機順序。在 BIOS 具體的什麼位置，和您的 BIOS 有關。不管如何，您要找的是列有設備的欄位。

source: Common entries on IDE machines are C, A, cdrom or A, C, cdrom.
el: Συνηθισμένες ακολουθίες σε μηχανήματα IDE είναι οι C, A, cdrom ή A, C, cdrom.
ko: IDE 기계에서는 보통 C, A, cdrom이거나 A, C, cdrom입니다.
pt: Entradas comuns em máquinas IDE são C, A, cdrom ou A, C, cdrom.
ru: Распространённые поля на машинах с IDE: C, A, cdrom или A, C, cdrom.
zh_cn: 对 IDE 机器而言，列表里常见的表项是 C、A、cdrom 或者 A、C、cdrom。
zh_tw: 對 IDE 機器而言，列表裡常見的選項是 C、A、cdrom 或者 A、C、cdrom。

source: C is the hard drive, and A is the floppy drive.
el: C είναι ο σκληρός δίσκος και A η συσκευή δισκέττας.
ko: C는 하드 드라이브이고, A는 플로피 드라이브입니다.
pt: C é o disco rígido, e A a drive de disquetes.
ru: C &mdash; это жёсткий диск, а A &mdash; дисковод гибких дисков.
zh_cn: C 就是硬盘，而 A 则是软驱。
zh_tw: C 就是硬碟，而 A 則是軟碟機。

source: Change the boot sequence setting so that the CD-ROM or the floppy is first. Usually, the <keycap>Page Up</keycap> or <keycap>Page Down</keycap> keys cycle through the possible choices.
el: Αλλάξτε την ακολουθία εκκίνησης ώστε να είναι πρώτη η συσκευή του CD-ROM είτε η συσκευή της δισκέττας. Συνήθως τα πλήκτρα <keycap>Page Up</keycap> ή <keycap>Page Down</keycap> δίνουν κυκλικά τις διάφορες πιθανές επιλογές.
ko: 부팅 순서 설정을 바꿔서 CD-ROM이나 플로피가 첫 번째가 되도록 하십시오. 보통 <keycap>Page Up</keycap>이나 <keycap>Page Down</keycap> 키로 여러가지 중의 하나를 선택합니다.
pt: Alterar a sequência de arranque de modo a que o primeiro seja o CD-ROM ou a disquete. Normalmente, as teclas <keycap>Page UP</keycap> ou <keycap>Page Down</keycap> permitem percorrer as escolhas possíveis.
ru: Измените порядок загрузки, так чтобы стояла первой была загрузка с CD-ROM или дискет. Обычно, для этого используются клавиши <keycap>Page Up</keycap> или <keycap>Page Down</keycap>, которые по циклу перебирают возможные значения.
zh_cn: 修改启动顺序的设置，让 CD-ROM 或者软盘排在第一位。通常，用 <keycap>Page Up</keycap>或者 <keycap>Page Down</keycap> 键能够循环地选中可能的选项。
zh_tw: 修改開機順序的設定，讓 CD-ROM 或者軟碟排在第一位。通常，用 <keycap>Page Up</keycap> 或者 <keycap>Page Down</keycap> 鍵能夠循環地切換可能的選項。

source: Save your changes. Instructions on the screen tell you how to save the changes on your computer.
el: Αποθηκεύστε τις αλλαγές. Οδηγίες στην οθόνη σας λένε πώς να σώσετε τις αλλαγές στον υπολογιστή σας.
ko: 바꾼 내용을 저장하십시오. 설정 화면의 안내에 따라 저장하십시오.
pt: Guardar as suas alterações. As instruções no ecrã dizem-lhe como gravar as alterações no seu computador.
ru: Сохраните изменения. Как это сделать написано в подсказке на экране.
zh_cn: 然后，保存您对设置的修改。屏幕上的提示会告诉您如何才能保存您的配置。
zh_tw: 然後，儲存您對設定的修改。螢幕上的提示會告訴您如何才能儲存您的設定。

source: Changing the Boot Order on SCSI Computers
el: Αλλαγή σειράς εκκίνησης σε υπολογιστές με SCSI
ko: SCSI 컴퓨터에서 부팅 순서 바꾸기
pt: Alterar a Ordem de Arranque em Computadores com SCSI
ru: Изменение порядка загрузки на компьютерах со SCSI
zh_cn: 修改 SCSI 接口计算机的引导顺序
zh_tw: 修改 SCSI 介面電腦的開機順序

source: As your computer starts, press the keys to enter the SCSI setup utility.
el: Καθώς ξεκινά ο υπολογιστής σας πατήστε τα πλήκτρα για να μπείτε στο πρόγραμμα ρύθμισης του SCSI.
ko: 컴퓨터가 시작하면, SCSI 설정 유틸리티로 들어가는 키를 누르십시오.
pt: Quando o seu computador arrancar, carregue nas teclas para entrar no utilitário de configuração SCSI.
ru: Как только компьютер начнёт загружаться, нажмите клавиши для входа в меню настройки SCSI.
zh_cn: 当您的计算机启动时，可以按下某些键进入 SCSI 的设置软件。
zh_tw: 當您的電腦開機時，可以按某些鍵進入 SCSI 的設定軟體。

source: You can start the SCSI setup utility after the memory check and the message about how to start the BIOS utility displays when you start your computer.
el: Μπορείτε να ξεκινήσετε το πρόγραμμα ρύθμισης SCSI μετά τον έλεγχο της μνήμης και την εμφάνιση του μηνύματος σχετικά με την έναρξη του BIOS μετά την εκκίνηση του υπολογιστή σας.
ko: 컴퓨터를 시작하면 메모리 검사를 하고, BIOS 유틸리티를 시작하는 방법을 표시한 다음, SCSI 설정 유틸리티로 들어갈 수 있습니다.
pt: Você pode iniciar a configuração SCSI após a verificação da memória e aparecer a mensagem de como iniciar o utilitário da BIOS quando liga o computador.
ru: Вы можете войти в меню настройки SCSI после проверки памяти, а о том как это сделать, появляется подсказка на экране.
zh_cn: 计算机启动过程中，您可以在内存检测结束后，当屏幕出现如何进入 BIOS 设置程序的提示的时候，启动 SCSI 设置软件。
zh_tw: 電腦開機過程中，您可以在記憶體檢測結束後，當螢幕出現如何進入 BIOS 設定程式的提示的時候啟動 SCSI 設定軟體。

source: The keystrokes you need depend on the utility. Often, it is <keycombo><keycap>Ctrl</keycap><keycap>F2</keycap></keycombo>. However, consult your hardware documentation for the exact keystrokes.
el: Ο συνδυασμός πλήκτρων που πρέπει να χρησιμοποιήσετε εξαρτάται από το πρόγραμμα. Συνήθως είναι τα <keycombo><keycap>Ctrl</keycap><keycap>F2</keycap></keycombo>. Όμως συμβουλευτείτε την τεκμηρίωση του υλικού σας για τον ακριβή συνδυασμό.
ko: 어떤 키를 눌러야 하는 지는 유틸리티에 따라 다릅니다. 보통 <keycombo><keycap>Ctrl</keycap><keycap>F2</keycap></keycombo>입니다. 정확한 키 조합은 하드웨어 문서를 보십시오.
pt: A combinação de teclas necessária depende do utilitário. Muitas vezes é <keycombo><keycap>Ctrl</keycap><keycap>F2</keycap></keycombo>. Mas, consulte a documentação do seu hardware para saber a combinação de teclas exacta.
ru: Нужная комбинация клавиш зависит от контроллера. Часто, это <keycombo><keycap>Ctrl</keycap><keycap>F2</keycap></keycombo>. Однако, нужную комбинацию посмотрите в документации на аппаратуру.
zh_cn: 您要按的键通常因设置软件而不同。一般来说，是按 <keycombo><keycap>Ctrl</keycap><keycap>F2</keycap></keycombo>。若要知道按键的确切信息，还是要参考硬件的相关文档。
zh_tw: 您要按的按鍵通常因設定軟體而不同。一般來說，是按 <keycombo><keycap>Ctrl</keycap><keycap>F2</keycap></keycombo>。若要知道按鍵的確切資料，還是要參考硬體的相關文件。

source: Find the utility for changing the boot order.
el: Βρείτε το βοήθημα για την αλλαγή της σειράς εκκίνησης.
ko: 부팅 순서를 바꾸는 유틸리티 찾기.
pt: Encontrar o utilitário para alterar a ordem de arranque.
ru: Найдите пункт изменения порядка загрузки.
zh_cn: 找到用来修改引导顺序的工具软件。
zh_tw: 尋找用來修改開機順序的工具軟體。

source: Set the utility so that the SCSI ID of the CD drive is first on the list.
el: Ρυθμίστε ώστε η συσκευή με το SCSI ID του CD-ROM να είναι πρώτη στη λίστα.
ko: CD 드라이브의 SCSI ID가 목록의 첫 번째가 되도록 유틸리티를 설정하십시오.
pt: Configurar o utilitário de modo que o SCSI ID da drive de CD fique em primeiro na lista.
ru: Настройте так, что SCSI ID привода CD был первым в списке.
zh_cn: 通过这个工具软件修改设置，让光盘驱动器的 SCSI ID 排在列表的首位。
zh_tw: 透過這個工具軟體修改設定，讓光碟機的 SCSI ID 排在列表的首位。

source: Save your changes. Instructions on the screen tell you how to save the changes on your computer. Often, you must press <keycap>F10</keycap>.
el: Αποθηκεύστε τις αλλαγές. Οδηγίες στην οθόνη σας λένε πώς να σώσετε τις αλλαγές στον υπολογιστή σας. Συνήθως με το πάτημα του πλήκτρου <keycap>F10</keycap>.
ko: 바뀐 부분을 저장하십시오. 화면의 안내에 따라 바뀐 부분을 컴퓨터에 저장하십시오. 보통 <keycap>F10</keycap>을 눌러야 합니다.
pt: Guardar as suas alterações. As instruções no ecrã dizem-lhe como guardar as alterações no seu computador. Frequentemente, tem de carregar em <keycap>F10</keycap>.
ru: Сохраните изменения. Как это сделать написано в подсказке на экране. Обычно, вы должны нажать <keycap>F10</keycap>.
zh_cn: 然后，保存您对设置的修改。屏幕上的提示会告诉您如何才能保存您的配置。通常，您需要按下 <keycap>F10</keycap>。
zh_tw: 然後，儲存您對設定的修改。螢幕上的提示會告訴您如何才能儲存您的設定。通常，您需要按 <keycap>F10</keycap>。

source: Miscellaneous BIOS Settings
el: Διάφορες άλλες ρυθμίσεις στο BIOS
ko: 기타 BIOS 설정
pt: Miscelânea de Definições na BIOS
ru: Другие настройки BIOS
zh_cn: BIOS 设置的其余项目
zh_tw: 其餘的 BIOS 設定項目

source: CD-ROM Settings
el: Ρυθμίσεις για το CD-ROM
ko: CD-ROM 설정
pt: Definições de CD-ROM
ru: Настройки CD-ROM
zh_cn: CD-ROM 的设置
zh_tw: CD-ROM 的設定

source: Some BIOS systems (such as Award BIOS) allow you to automatically set the CD speed. You should avoid that, and instead set it to, say, the lowest speed. If you get <userinput>seek failed</userinput> error messages, this may be your problem.
el: Μερικά συστήματα BIOS (όπως το Award BIOS) σας επιτρέπουν την αυτόματη ρύθμιση της ταχύτητας του CD. Θα πρέπει να το αποφύγετε αυτό, και αντίθετα να το ρυθμίσετε στην χαμηλότερη δυνατή τιμή. Αν παίρνετε μηνύματα λαθους όπως <userinput>seek failed</userinput>, ίσως αυτή να είναι η αιτία του προβλήματος.
ko: 어떤 BIOS 시스템은 (예: Award BIOS) CD 속도를 설정할 수 있습니다. 속도를 설정하지 말고, 그냥 최저 속도로 놔둬야 합니다. <userinput>seek failed</userinput> 오류 메세지가 나오게 된다면 이 문제 때문일 수도 있습니다.
pt: Alguns sistemas de BIOS (tal como a Award BIOS) permite-lhe automaticamente definir a velocidade do CD. Você deve evitar isso, e em vez disso defina-o, vamos dizer, para a velocidade mais baixa. Se obtiver mensagens de erro <userinput>seek failed</userinput>, este pode ser o seu problema.
ru: На некоторых системах BIOS (например, Award BIOS) позволяет автоматически выбирать скорость CD. Вы не должны делать этого и вместо этого выберите установку самой маленькой скорости. Если вы получаете сообщения об ошибке <userinput>seek failed</userinput>, вероятно, проблема в этом.
zh_cn: 有些 BIOS 系统(如 Award BIOS)允许让您能自动设置 CD 的读取速度。应当尽量不要那样设置，相反，应该把它设成最低速。要是您碰到了 <userinput>seek failed</userinput> 的错误提示，那么就有可能是您的设置问题了。
zh_tw: 有些 BIOS 系統(如 Award BIOS)能讓您把光碟的讀取速度設定為自動。您應該盡量不要那樣設定，相反，應該把它設成最低速。要是您碰到了 <userinput>seek failed</userinput> 的錯誤提示，那麼就有可能是您的設定有問題。

source: Extended vs. Expanded Memory
el: Εκτεταμένη εναντίον Επεκταμένης Μνήμης
ko: Extended와 Expanded Memory
pt: Memória Extendida vs. Expandida
ru: Расширенная и дополнительная память
zh_cn: 扩展内存与扩充内存
zh_tw: 延伸記憶體與擴充記憶體

source: If your system provides both ex<emphasis>ten</emphasis>ded and ex<emphasis>pan</emphasis>ded memory, set it so that there is as much extended and as little expanded memory as possible. Linux requires extended memory and cannot use expanded memory.
el: Αν το σύστημά σας παρέχει και τις δυο επιλογές ex<emphasis>ten</emphasis>ded και ex<emphasis>pan</emphasis>ded μνήμης, ρυθμίστε .ωστε να έχετε όσο το δυνατόν περισσότερη extended και όσο το δυνατόν λιγότερη expanded μνήμη. Το Linux απαιτεί extended μνήμη και δεν μπορεί να χρησιμοποιήσει expanded μνήμη.
ko: 시스템에서 ex<emphasis>ten</emphasis>ded와 ex<emphasis>pan</emphasis>ded memory가 모두 있다면, extended memory를 최대한으로 해 놓고 expanded memory를 최소한으로 맞춰 놓으십시오. 리눅스에는 extended memory가 필요하지만 expanded memory를 사용할 수 없습니다.
pt: Se o seu sistema disponibiliza ambas as memórias es<emphasis>ten</emphasis>dida e ex<emphasis>pan</emphasis>dida, configure-o de modo a ter o máximo de memória estendida e o mínimo de expandida. Linux necessita de memória estendida e não pode utilizar memória expandida.
ru: Если ваша система предоставляет и расширенную (<emphasis>extended</emphasis>) и дополнительную (<emphasis>expanded</emphasis>) память, задайте, если возможно, чтобы было много расширенной и мало дополнительной памяти. Linux нужна расширенная память и он не использует дополнительную память.
zh_cn: 如果您的系统同时提供了扩<emphasis>展</emphasis>(extended)和 扩<emphasis>充</emphasis>(expanded)内存，那么就把扩展内存设置得尽量大一些，而把扩充内存设置得尽量小。Linux 需要使用扩展内存，但无法利用扩充内存。
zh_tw: 如果您的系統同時提供了<emphasis>延伸</emphasis> (extended) 和<emphasis>擴充</emphasis> (expanded) 記憶體，那麼就把延伸記憶體設定得盡量大一些，而把擴充記憶體設定得盡量小。Linux 需要使用延伸記憶體，但無法利用擴充記憶體。

source: Virus Protection
el: Προστασία από Ιούς
pt: Protecção de Vírus
ru: Защита от вирусов
zh_cn: 病毒保护
zh_tw: 病毒保護

source: Disable any virus-warning features your BIOS may provide. If you have a virus-protection board or other special hardware, make sure it is disabled or physically removed while running GNU/Linux. These aren't compatible with GNU/Linux; moreover, due to the file system permissions and protected memory of the Linux kernel, viruses are almost unheard of<footnote> <para> After installation you can enable Boot Sector protection if you want. This offers no additional security in Linux but if you also run Windows it may prevent a catastrophe. There is no need to tamper with the Master Boot Record (MBR) after the boot manager has been set up. </para> </footnote>.
el: Απενεργοποιήστε οποιαδήποτε χαρακτηριστικά προειδοποίησης για ιούς παρέχει πιθανόν το BIOS σας. Αν έχετε κάποια συσκευή αντιϊκής προστασίας ή κάποιο άλλο ειδικό υλικό βεβαιωθείτε ότι είναι απενεργοποιημένο ή απομακρυσμένο φυσικά όταν τρέχετε το GNU/Linux. Τέτοιες συσκευές δεν είναι συμβατές με το GNU/Linux. Επιπλέον, λόγω των δικαιωμάτων χρήσης στα συστήματα αρχείων και στην προστασία μνήμης του πυρήνα του Linux οι ιοί στο GNU/Linux είναι κάτι σχεδόν ανήκουστο. <footnote> <para>Μετά την εγκατάσταση μπορείτε να ενεργοποιήσετε αν θέλετε την προστασία του τΤομέα Εκκίνησης. Αυτό δεν προσφέρει επιπρόσθετη ασφάλεια στο Linux αλλά αν τρέχετε παράλληλα Windows μπορεί να αποτρέψει μια καταστροφή. Δεν υπάρχει λόγος να πειράζετε το MBR μετά την ρύθμιση του φορτωτή εκκίνησης.</para> </footnote>.
ko: BIOS에서 제공하는 바이러스 경고 기능이 있다면 끄십시오. 바이러스 방지 보드나 기타 특수 하드웨어가 달려 있다면, GNU/리눅스를 돌리는 동안은 그 기능을 끄거나 물리적으로 제거하십시오. 이러한 기능이나 하드웨어는 GNU/리눅스와 호환되지 않습니다. 또 파일 시스템의 권한 및 리눅스의 보호 메모리때문에 리눅스에서 바이러스는 거의 없습니다.<footnote><para>설치가 끝난 뒤에 원하신다면 부트섹터 보호를 켤수 있습니다.이는 리눅스에 추가적인 보호를 제공하지 않습니다. 그러나 윈도를 같이 사용한다면 재난을 방지할 지 모릅니다. 부트 관리자가 설정된 후에는 마스터 부트 레코드(MBR)에 영향을 주지 않습니다.</para></footnote>
pt: Desligue os avisos que a sua BIOS possa dar da possibilidade de vírus. Se tem uma placa de protecção de vírus ou outro hardware especial, assegure-se que está desabilitado ou removido fisicamente enquanto executa GNU/Linux. Estes não são compatíveis com GNU/Linux; e mais, devido às permissões de ficheiros e à memória protegida do kernel Linux, os vírus são praticamente desconhecidos<footnote> <para> Após a instalação pode ligar a pretecção do Boot Sector se assim o desejar. Isto não ofereçe segurança adicional em Linux mas se você também utiliza Windows pode prevenir uma catástrofe. Não é preciso mexer no Master Boot Record (MBR) após o gestor de arranque ter sido configurado. </para> </footnote>.
ru: Выключите в BIOS любые антивирусные предупреждения. Если у вас плата с антивирусной защитой или другое специальное оборудование, убедитесь, что оно выключено или физически удалено при работе GNU/Linux. Оно не совместимо с GNU/Linux; более того, из-за файловой системы с разграничением доступа и с защищённой памятью ядра Linux, про вирусы практически ничего не слышно<footnote> <para> После установки вы можете включить защиту загрузочного сектора, если хотите. Это не добавит безопасности в Linux, но если вы также запускаете Windows, то может предотвратить катастрофу. Не нужно изменять в главную загрузочную запись (MBR) после настройки системного загрузчика. </para> </footnote>.
zh_cn: 禁用您的 BIOS 提供的所有病毒警告功能。如果您安装了防病毒卡或是其它特定的硬件，请在运行 GNU/Linux 期间，把它禁用或者拆除。它们与 GNU/Linux 是不兼容的。更进一步说，归功于文件系统的权限管理和 Linux 内核的内存保护机制，病毒已然绝迹<footnote> <para> 在安装完成之后，如果您希望的话也可以重新开启启动扇区保护功能这并不会为 Linux 带来任何额外的安全保护，但如果您还运行着 Windows，它还是有可能帮助您避免一声灾难。在启动管理器安装并设置好之后，就不再需要更动主引导扇区(MBR)了。</para> </footnote>。
zh_tw: 停用您的 BIOS 提供的所有病毒警告功能。如果您安裝了防病毒卡或是其它特定的硬件，請在運行 GNU/Linux 期間，把它停用或者拆除。它們與 GNU/Linux 是不相容的。更進一步說，歸功於檔案系統的權限管理和 Linux 核心的記憶體保護機制，病毒已然絕跡。<footnote> <para> 安裝完成之後，如果需要，您可以啟用開機磁區保護。這對 Linux 來說並不會提供更多的安全防護，但是如果您同時還保有 Windows，它能夠防止否些災難發生。當 boot manager 安裝完成之後，您不需要再去修改主開機磁區 (MBR) </para> </footnote>

source: Shadow RAM
el: Σκιώδης Μνήμη
zh_cn: 内存映像
zh_tw: 記憶體映像

source: Your motherboard may provide <emphasis>shadow RAM</emphasis> or BIOS caching. You may see settings for <quote>Video BIOS Shadow</quote>, <quote>C800-CBFF Shadow</quote>, etc. <emphasis>Disable</emphasis> all shadow RAM. Shadow RAM is used to accelerate access to the ROMs on your motherboard and on some of the controller cards. Linux does not use these ROMs once it has booted because it provides its own faster 32-bit software in place of the 16-bit programs in the ROMs. Disabling the shadow RAM may make some of it available for programs to use as normal memory. Leaving the shadow RAM enabled may interfere with Linux access to hardware devices.
el: Η μητρική σας μπορεί να παρέχει <emphasis>σκιώδη RAM</emphasis> ή BIOS caching. ϊσως δείτε ρυθμίσεις για <quote>Video BIOS Shadow</quote>, <quote>C800-CBFF Shadow</quote> κλπ. <emphasis>Απενεργοποιήστε</emphasis> κάθε σκιώδη μνήμη RAM. Η μνήμη αυτή χρησιμοποιείται για την επιτάχυνση της πρόσβασης στις ROM της μητρικής σας καθώς και σε κάποιες από τις κάρτες ελεγκτών. Το Linux δεν χρησιμοποιεί αυτές τις ROM από τη στιγμή της εκκίνησής του γιατί παρέχει το δικό του 32-μπιτο λογισμικό αντί των 16-μπιτων προγραμμάτων των ROM. Απενεργοποίηση της σκιώδους μνήμης μπορεί να αφαιρέσει κάποια από την μνήμη αυτή που θα ήταν διαθέσιμη για χρήση σαν κανονικής μνήμης από εφαρμογές. Αφήνοντάς την ενεργοποιημένη ίσως δημιουργήσει παρεμβολές στην πρόσβαση του Linux στις συσκευές του υλικού σας.
ko: 마더보드에서 <emphasis>shadow RAM</emphasis>이나 BIOS 캐싱을 제공할 수도 있습니다. <quote>Video BIOS Shadow</quote>나 <quote>C800-CBFF Shadow</quote>와 같은 설정을 볼 수 있을 것입니다. 모든 shadow RAM을 <emphasis>끄십시오</emphasis>. shadow RAM은 마더보드와 일부 컨트롤러 카드에 있는 ROM의 접근 속도를 높이는 데 쓰입니다. 리눅스는 일단 부팅하면 이러한 ROM을 사용하지 않습니다. ROM에 들어 있는 16비트 프로그램 대신에 직접 32비트 소프트웨어가 들어 있기 때문입니다. 어떤 경우에는 shadow RAM을 꺼야 shadow RAM을 다른 프로그램에서 일반 메모리로 사용할 수 있습니다. shadow RAM을 켜 놓으면 리눅스가 하드웨어에 접근할 때 문제가 발생할 수 있습니다.
pt: A sua motherboard pode disponibilizar <emphasis>shadow RAM</emphasis> ou cache da BIOS. Você pode ver as definições para <quote>Video BIOS Shadow</quote>, <quote>C800-CBFF Shadow</quote>, etc. <emphasis>Desligue</emphasis> toda a shadow RAM. A shadow RAM é utilizada para acelerar o acesso às ROMs da sua motherboard e de algumas cartas de controladores. Linux não utiliza essas ROMs após ter arrancado porque disponibiliza software 32-bit mais rápido do que os programas de 16-bit nas ROMs. Desligar a shadow RAM pode tornar disponível alguma da memória para os programas a utilizarem como memória normal. Deixar a shadow RAM ligada pode interferir com o acesso de Linux a dispositivos de hardware.
ru: Материнская плата может предоставлять <emphasis>shadow RAM</emphasis> или кэширование BIOS. Эта настройка может выглядеть как <quote>Video BIOS Shadow</quote>, <quote>C800-CBFF Shadow</quote> и т.д.. <emphasis>Выключите</emphasis> её. Shadow RAM использовалась для ускорения доступа к ПЗУ материнской платы и к некоторым контроллерам. Linux не использует эти ПЗУ после того как загрузится, так как он предоставляет свой быстрый 32-битный программный доступ вместо 16-битных программ из ПЗУ. Выключение shadow RAM может привести к появлению большей свободной памяти для программ. Оставление включённой shadow RAM может мешать Linux при доступе к аппаратуре.
zh_cn: 您的主板或许会有 <emphasis>内存映像</emphasis>(shadow RAM)或者 BIOS caching 的功能设置。您可能会发现<quote>Video BIOS Shadow</quote>、<quote>C800-CBFF Shadow</quote>等等的设置选项。<emphasis>禁用</emphasis>所有的内存映象。内存映像被用来提高对主板上或者某些控制卡上的 ROM 的访问速度。一旦 Linux 启动之后，它就不会再使用这些 ROM。Linux 弃之不用的原因是：Linux 自己提供了更快的32位的软件来替代了 ROM 中的16位程序的功能。禁用内存映像就可以让程序能使用更多的常规内存。而继续开启内存映像则有可能妨碍 Linux 存取硬件设备。
zh_tw: 您的主機或許會有<emphasis>記憶體映像</emphasis>(shadow RAM)或者 BIOS caching 的功能。您可能會發現 <quote>Video BIOS Shadow</quote>、<quote>C800-CBFF Shadow</quote> 等等的設定選項。<emphasis>停用</emphasis>所有的記憶體映像。記憶體映像被用來提高對主機板上或某些控制卡上的 ROM 的存取速度。一旦 Linux 開機之後，它就不會再使用這些 ROM。Linux 棄之不用的原因是：Linux 自己提供了更快的32位元的軟體來替代了 ROM 中的16位元程式的功能。停用記憶體映像就可以讓程式能使用更多的常規記憶體。而繼續開啟記憶體映像則有可能妨礙 Linux 存取硬體設備。

source: Memory Hole
el: Οπή Μνήμης
zh_cn: 内存空洞
zh_tw: 記憶體空洞

source: If your BIOS offers something like <quote>15&ndash;16 MB Memory Hole</quote>, please disable that. Linux expects to find memory there if you have that much RAM.
el: Αν το BIOS προσφέρει μια επιλογή του τύπου <quote>15&ndash;16 MB Οπή Μνήμης</quote> καλό θα ήταν να την απενεργοποιήσετε. Το Linux περιμένει να βρει μνήμη στη θέση αυτή αν έχετε αρκετή RAM.
ko: BIOS에 <quote>15&ndash;16 MB Memory Hole</quote>과 같은 게 있다면, 그 기능을 끄십시오. 그 만큼의 메모리가 있으면 리눅스에서는 이 구간의 메모리도 이용합니다.
pt: Se a sua BIOS oferece algo do tipo <quote>15&ndash;16 MB Memory Hole</quote>, por favor desligue-o. Linux espera encontrar lá memória se você tiver tanta memória como isso.
ru: Если BIOS предлагает что-то типа <quote>15&ndash;16 MB Memory Hole</quote>, выключите это. Linux найдёт эту память, если она есть.
zh_cn: 如果您的 BIOS 有类似<quote>15&ndash;16 MB Memory Hole</quote>的选项，请禁用它。如果您有那么多内存的话，Linux 就会认为在那儿应该能找到内存块。
zh_tw: 如果您的 BIOS 有類似 <quote>15&ndash;16 MB Memory Hole</quote> 的選項，請停用它。如果您有那麼多記憶體的話，Linux 就會認為在那兒應該能找到記憶體區塊。
