Repository: xobs/debian-installer
Catalog: doc/manual/po/*/preparing.po
Languages: el, ko, pt, ru, zh_cn, zh_tw

source: We have a report of an Intel Endeavor motherboard on which there is an option called <quote>LFB</quote> or <quote>Linear Frame Buffer</quote>. This had two settings: <quote>Disabled</quote> and <quote>1 Megabyte</quote>. Set it to <quote>1 Megabyte</quote>. When disabled, the installation floppy was not read correctly, and the system eventually crashed. At this writing we don't understand what's going on with this particular device &mdash; it just worked with that setting and not without it.
el: Υπάρχει κάποια αναφορά για μια μητρική Intel Endeavor στην οποία υπάρχει μια επιλογή που ονομάζεται <quote>LFB</quote> ή <quote>Linear Frame Buffer</quote>. Αυτή έχει δυο ρυθμίσεις. <quote>Disabled</quote> και <quote>1 Megabyte</quote>. Ρυθμίστε την στο <quote>1 Megabyte</quote>. Όταν ήταν απενεργοποιημένη, η δισκέττα εγκατάστασης δεν διαβαζόταν σωστά και τελικά το σύστημα κατέρρεε. Τη στιγμή που γράφονται αυτές οι γραμμές δεν ξέρουμε ακόμα ποιό ακριβώς είναι το πρόβλημα με την συγκεκριμένη μητρική &mdash; Απλά δούλευε με τη ρύθμιση αυτή ενώ χωρίς αυτήν όχι.
ko: Intel이 만든 어떤 마더보드에서 <quote>LFB</quote> 혹은 <quote>Linear Frame Buffer</quote>라고 하는 옵션이 있다는 보고를 받았습니다. 두 가지 설정을 할 수 있습니다: <quote>Disabled</quote> 및 <quote>1 Megabyte</quote>입니다. <quote>1 Megabyte</quote>로 설정하십시오. Disabled인 경우에는, 설치 플로피를 제대로 읽지 못하고, 시스템이 결국 멈추었습니다. 현재로서는 이 특정 마더보드에서 무슨 일이 벌어지고 있는 건지 알아내지 못했습니다 &mdash; <quote>1 Megabyte</quote>로 설정하면 동작하고 아니면 동작하지 않는 것 밖에 알지 못합니다.
pt: Nós temos um relatório acerca de uma motherboard Intel Endeavor na qual existe uma opção chamada <quote>LFB</quote> ou <quote>Linear Frame Buffer</quote>. Isto tem duas opções possíveis: <quote>Disabled</quote> e <quote>1 Megabyte</quote>. Ponha-a em <quote>1 Megabyte</quote>. Quando desligada, a disquete de instalação não foi lida correctamente, e o sistema eventualmente bloqueou. Quando isto foi escrito nós não compreendemos o que está a acontecer com este dispositivo em particular &mdash; apenas funcionou com essa definição e sem essa não.
ru: Нам сообщили о материнских платах Intel Endeavor, на которых есть опция называемая <quote>LFB</quote> или <quote>Linear Frame Buffer</quote>. Она может принимать значения <quote>Disabled</quote> и <quote>1 Megabyte</quote>. Установите в <quote>1 Megabyte</quote>. Если она выключена, установочные дискеты читаются неправильно, и следовательно система не работает. На момент написания руководства, мы не поняли что именно происходит с этим устройством &mdash; оно просто работает с этим значением, а может и без него.
zh_cn: 我们收到报告称，有一款 Intel 的主板，它的设置中有名为<quote>LFB</quote>或<quote>Linear Frame Buffer</quote>的选项。该选项有两个选择：<quote>Disabled</quote>和<quote>1 Megabyte</quote>。请把它设为<quote>1 Megabyte</quote>。如果禁用它，那么读取安装软盘时将会出错，而系统最后会崩溃。在撰写本文时，我们尚无法弄清这个设备出了什么问题 &mdash; 现在仅仅知道，如果这样设置，那么就一切正常，否则的话就不行。
zh_tw: 我們收到報告指稱，有一款 Intel 的主機的設定中有名為 <quote>LFB</quote> 或 <quote>Linear Frame Buffer</quote> 的選項。該選項有兩個選擇：<quote>Disabled</quote> 和 <quote>1 Megabyte</quote>。請把它設為 <quote>1 Megabyte</quote>。如果停用它，那麼讀取安裝軟碟時將會出錯，而系統最後會當機。在撰寫本文時，我們尚未弄清這個設備出了什麼問題。現在僅知道，如果這樣啟用該設定，則一切正常，否則就不行。

source: Advanced Power Management
el: Προχωρημένη Διαχείριση Ισχύος (APM)
ru: Усовершенствованное управление питанием (Advanced Power Management)
zh_cn: 高级电源管理
zh_tw: 進階電源管理

source: If your motherboard provides Advanced Power Management (APM), configure it so that power management is controlled by APM. Disable the doze, standby, suspend, nap, and sleep modes, and disable the hard disk's power-down timer. Linux can take over control of these modes, and can do a better job of power-management than the BIOS.
el: Αν η μητρική σας παρέχει τη δυνατότητα Προχωρημένης Διαχείρισης Ισχύος (Advanced Power Management , APM) ρυθμίστε την ώστε η διαχείριση της ισχύος να ελέγχεται από το APM. Απενεργοποιήστε τις επιλογές doze, standby, suspend, nap, και sleep καθώς και τον χρονομετρητή σβησίματος του σκληρού δίσκου.Το Linux μπορεί να αναλάβει τον έλεγχο αυτών των επιλογών κάνοντας καλλίτερη δουλειά στη διαχείριση ισχύος από το BIOS.
ko: 마더보드에서 Advanced Power Management (APM) 기능이 들어 있으면, APM에서 전원 관리 기능을 컨트롤하도록 설정하십시오. doze, standby, suspend, nap, sleep 모드를 끄시고, hard disk's power-down timer 기능을 끄십시오. 리눅스에서 이 모드에 대한 컨트롤을 할 수 있고, BIOS보다 더 전원 관리를 잘 합니다.
pt: Se a sua motherboard disponibiliza Advanced Power Management (APM), configure-a de modo a que a gestão de energia seja feita por APM. Desligue os modos doze, standby, suspend, nap, e sleep, e desligue o temporizador para desligar o disco. Linux pode tomar controlo desses modos, e fazer um trabalho melhor na gestão de energia do que a BIOS.
ru: Если материнская плата предоставляет усовершенствованное управление питанием (APM), настройте его так, чтобы питание управлялось APM. Выключите режимы doze, standby, suspend, nap и sleep, и выключите отключение питания жёсткого диска по таймеру. Linux может сам управять этими режимами, и делает это лучше чем BIOS.
zh_cn: 倘若您的主板提供了高级电源管理(APM)的支持，请配置让 APM 来管理电源。请同时禁用 doze、standby、suspend、nap 和 sleep 模式，另外还要禁用硬盘的电源关闭定时器。Linux 可以接管所有这些模式的控制权，而且能比 BIOS 的电源管理做得更好。
zh_tw: 倘若您的主機板提供了進階電源管理 (APM) 的支援，請設定讓 APM 來管理電源。請同時停用 doze、standby、suspend、nap 和 sleep 模式，另外還要停用硬碟的電源關閉定時器。Linux 可以接管這些模式的控制權，而且能比 BIOS 的電源管理做得更好。

source: Firmware Revisions and Existing OS Setup
el: Αναθεωρήσεις του Firmware και ρύθμιση του υπάρχοντος λειτουργικού συστήματος
ko: 펌웨어 버전 및 기존 운영 체제 설정
pt: Revisões de Firmware e Configuração do SO Existente
ru: Версии микропрограммы и настройка существующих ОС
zh_cn: 固件修订版和已有的 OS 配置
zh_tw: 韌體修訂版和既有的 OS 設定

source: &arch-title; machines are generally self-configuring and do not require firmware configuration. However, you should make sure that you have the appropriate ROM and system patches. On the Macintosh, MacOS version >= 7.1 is recommended because version 7.0.1 contains a bug in the video drivers preventing the boot loader from deactivating the video interrupts, resulting in a boot hang. On the BVM VMEbus systems you should make sure you are using BVMBug revision G or higher boot ROMs. The BVMBug boot ROMs do not come as standard on the BVM systems but are available from BVM on request free of charge.
el: Μηχανήματα αρχιτεκτονικής &arch-title; είναι γενικά αυτορυθμιζόμενα και δεν απαιτούν ρύθμιση του firmware. Βεβαιωθείτε όμως ότι έχετε τα κατάλληλα patches για την μνήμη ROM και το σύστημα. Για συστήματα Macintosh, συνίσταται έκδοση του MacOS >= 7.1 γιατι ή έκδοση 7.0.1 περιέχει ένα bug στους οδηγούς της κάρτας οθόνης που εμποδίζει τον φορτωτή εκκίνησης να απενεργοποίηση των διακοπών της κάρτας οθόνης με αποτέλεσμα πάγωμα του μηχανήματος. Σε συστήματα BVM VMEbus θα πρέπει να βεβαιωθείτε ότι χρησιμοποιείτε την αναθεώρηση G ή νεώτερη του BVMBug ROM εκκίνησης. Αυτές δεν έρχονται σαν στάνταρ στα συστήματα BVM αλλά είναι διαθέσιμα αν ζητηθούν χωρίς επιβάρυνση.
ko: &arch-title; 기계는 일반적으로 알아서 설정이 되고, 별도의 펌웨어 설정이 필요하지 않습니다. 하지만 올바른 ROM과 시스템 패치는 있어야 합니다. Macintosh에서는 버전 7.1 이상의 MacOS 버전을 추천합니다. MacOS 7.0.1에는 버그때문에 부트 로더가 비디오 인터럽트를 끌 수 없어서, 부팅할 때 멈춥니다. BVM VMEbus 시스템에서는 BVMBug 버전 G나 그보다 높은 boot ROM을 사용해야 합니다. BVMBug boog ROM은 BVM 시스템에 기본으로 들어있지 않지만, BVM에 요청하면 무료로 구할 수 있습니다.
pt: As &arch-title; são geralmente auto-configuráveis e não necessitam configuração do firmware. No entanto, você deve assegurar-se que tem os patches de ROM e de sistema adequados. No Macintosh, é recomendado o MacOS de versão >= 7.1 porque a versão 7.0.1 tem um bug nos controladores gráficos que impedem o instalador de desactivar as interrupções de vídeo, resultando num bloqueio no arranque. Nos sistemas BVM VMEbus você deve assegurar-se que utiliza ROMs de arranque BVMBug revisão G ou superior. As ROMs de arranque BVMBug não vêm com os sistemas BVM standard mas estão disponíveis na BVM por pedido e livre de encargos.
ru: &arch-title; машины обычно настраиваются автоматически и для них не требуется настройка микропрограммы. Однако, вы должны убедиться, что работаете с соответствующимROM и системными заплатками. На Macintosh, рекомендуется MacOS версии >= 7.1, так как версия 7.0.1 содержит ошибку в видео драйверах, которая не даёт системному загрузчику деактивировать прерывание видеокарты, что в результате приводит к зависанию машины. На системах BVM VMEbus вы должны убедиться, что используете BVMBug выпуска G или выше загрузчика ROM. BVMBug загрузчик ROM не является стандартным на системах BVM, но доступен по запросу к BVM бесплатно.
zh_cn: &arch-title; 机器通常自行配置，不需要设置固件。但是，您应该确定您用了适宜的 ROM 和系统补丁。在 Macintosh 上，推荐使用 MacOS >= 7.1 的版本，这是由于版本 7.0.1 在视频驱动方面包含 bug，它会阻挡 boot loader 禁止视频中断，造成 boot 挂起。在 BVM VMEbus 系统上，您应该确定使用 BVMBug 修订版 G 或更新的 boot ROM。BVMBug boot ROM 不属于 BVM 系统的标准配置，但可用从 BVM 免费获取。
zh_tw: &arch-title; 機器通常會自行設定，不需要設定韌體。但是，您應該確定您用了適宜的 ROM 和系統補丁。在 Macintosh 上，建議使用 MacOS >= 7.1 的版本，這是由於版本 7.0.1 在顯示驅動方面包含臭蟲，它會阻擋 boot loader 禁止顯示中斷呼叫，造成開機時當機。在 BVM VMEbus 系統上，您應該確定使用 BVMBug 修訂版 G 或更新的 boot ROM。BVMBug boot ROM 不屬於 BVM 系統的標準配置，但可用從 BVM 免費取得。

source: Invoking OpenFirmware
el: Επίκληση του OpenFirmware
ko: OpenFirmware 실행
pt: Invocar OpenFirmware
ru: Вход в OpenFirmware
zh_cn: 使用 OpenFireware
zh_tw: 使用 OpenFireware

source: There is normally no need to set up the BIOS (called OpenFirmware) on &arch-title; systems. PReP and CHRP are equipped with OpenFirmware, but unfortunately, the means you use to invoke it vary from manufacturer to manufacturer. You'll have to consult the hardware documentation which came with your machine.
el: Συνήθως δεν υπάρχει ανάγκη να ρυθμίσετε το BIOS (γνωστό και σαν OpenFirmware) σε συστήματα αρχιτεκτινικής &arch-title; Συστήματα PReP και CHRP είναι εφοδιασμένα με OpenFirmware, αλλά δυστυχώς τα μέσα που χρησιμοποιούνται για την επίκλησή του αλλάζουν από κατασκευαστή σε κατασκευαστή. Θα πρέπει να συμβουλευθείτε την τεκμηρίωση που συνοδεύει το μηχάνημά σας.
ko: &arch-title; 시스템에서는 BIOS를 (OpenFirmware) 설정할 필요가 없습니다. PReP 및 CHRP는 OpenFirmware가 들어 있지만, 아쉽게도 그 때문에 각 제조사마다 OpenFirmware가 실행 방법이 다릅니다. 기계에 들어 있는 하드웨어 문서를 참고하셔야 합니다.
pt: Normalmente em sistemas &arch-title; não há necessidade de configurar a BIOS (chamada de OpenFirmware) . PReP e CHRP são equipados com OpenFirmware, mas infelizmente, isto significa que você tem de o invocar de maneiras diferentes de fabricante para fabricante. Vai ter de consultar a documentação do hardware que veio com o a sua máquina.
ru: На &arch-title; системах обычно не нужно настроивать BIOS (который называется OpenFirmware). PReP и CHRP содержат OpenFirmware, но к несчастью, как в него войти зависит от производителя. Вам придётся поискать это в документации на железо, которая поставляется вместе с машиной.
zh_cn: 通常在 &arch-title; 系统上不需要去设置 BIOS(称为 OpenFirmware)。OpenFirmware 常常配备 PReP 与 CHRP，但这也意味着依不同厂商而不同。您必须参阅计算机手册中相关的硬件文档。
zh_tw: 通常在 &arch-title; 系統上不需要去設置 BIOS (稱為 OpenFirmware)。 OpenFirmware 常常配備 PReP 與 CHRP，但這也意味著依不同廠商而不同。您必須參閱電腦手冊中相關的硬體文件。

source: On &arch-title; Macintoshes, you invoke OpenFirmware with <keycombo><keycap>Command</keycap> <keycap>option</keycap> <keycap>O</keycap> <keycap>F</keycap></keycombo> while booting. Generally it will check for these keystrokes after the chime, but the exact timing varies from model to model. See <ulink url="&url-netbsd-powerpc-faq;"></ulink> for more hints.
el: Σε συστήματα Macintosh, &arch-title; μπορείτε να μπείτε στο OpenFirmware με τον συνδυασμό πλήκτρων <keycombo><keycap>Command</keycap> <keycap>option</keycap> <keycap>O</keycap> <keycap>F</keycap></keycombo> τη στιγμή της εκκίνησης. Συνήθως ο έλεγχος για τον συνδυασμό αυτόν γίνεται μετά το χαρακτηριστικό ήχο της εκκίνησης αλλά η ακριβής στιγμή ποικίλει από μοντέλο σε μοντέλο. Δείτε το <ulink url="&url-netbsd-powerpc-faq;"></ulink> για περισσότερες υποδείξεις.
ko: &arch-title; Macintosh에서는, 부팅할 때 <keycombo><keycap>Command</keycap> <keycap>option</keycap> <keycap>O</keycap> <keycap>F</keycap></keycombo> 키를 눌러 OpenFirmware를 시작합니다. 보통 삐 소리가 난 다음에 이 키가 눌렸는 지 검사하지만, 정확한 타이밍은 여러 모델마다 다릅니다. 더 많은 힌트는 <ulink url="&url-netbsd-powerpc-faq;"></ulink>의 내용을 참고하십시오.
pt: Em Macintoshes &arch-title;, você invoca o OpenFirmware com <keycombo><keycap>Command</keycap> <keycap>option</keycap> <keycap>O</keycap> <keycap>F</keycap></keycombo> enquanto arranca. Geralmente vai verificar pela combinação de teclas após o toque sonoro, mas a altura exacta varia de modelo para modelo. Veja <ulink url="&url-netbsd-powerpc-faq;"></ulink> para mais dicas.
ru: На &arch-title; Macintoshes, OpenFirmware вызывается клавишами <keycombo><keycap>Command</keycap> <keycap>option</keycap> <keycap>O</keycap> <keycap>F</keycap></keycombo> во время загрузки. Обычно надо нажать после звукового сигнала, но точный момент зависит от модели. Подробней смотрите <ulink url="&url-netbsd-powerpc-faq;"></ulink>.
zh_cn: 在 &arch-title; 的 Macintoshe 机器上，您在启动时通过 <keycombo><keycap>Command</keycap> <keycap>option</keycap> <keycap>O</keycap> <keycap>F</keycap></keycombo> 命令使用 OpenFirmware。一般情况下，它会按时钟顺序检验击键，但也会与不同的型号有关。参阅 <ulink url="&url-netbsd-powerpc-faq;"></ulink> 了解更多提示。
zh_tw: 在 &arch-title; 的 Macintoshe 機器上，開機時透過按下 <keycombo><keycap>Command</keycap> <keycap>option</keycap> <keycap>O</keycap> <keycap>F</keycap></keycombo> 以啟動 OpenFirmware。一般情況下，它會按時鐘順序檢驗按鍵，但也會與不同的型號有關。請參閱 <ulink url="&url-netbsd-powerpc-faq;"></ulink> 取得更多提示。

source: The OpenFirmware prompt looks like this: <informalexample><screen> ok 0 &gt; </screen></informalexample> Note that on older model &arch-title; Macs, the default and sometimes hardwired I/O for OpenFirmware user interaction is through the serial (modem) port. If you invoke OpenFirmware on one of these machines, you will just see a black screen. In that case, a terminal program running on another computer, connected to the modem port, is needed to interact with OpenFirmware.
el: Η αρχική οθόνη προτροπής του OpenFirmware μοιάζει κάπως έτσι:<informalexample><screen> ok 0 &gt; </screen></informalexample> Σημειώστε ότι σε παλιότερα μοντέλα Mac &arch-title; o προκαθορισμένος και μερικές φορές hardwired Ι/Ο αλληλεπίδρασης του OpenFirmware με τον χρήστη είναι μέσω της σειριακής (modem) θύρας. Αν μπείτε στο OpenFirmware σε ένα από αυτά τα μηχανήματα θα δείτε μόνο μια μαύρη οθόνη, Στην περίπτωση αυτή ένα πρόγραμμα κονσόλας που τρέχει σε έναν άλλο υπολογιστή συνδεδεμένο στην θύρα του modem χρειάζεται για να αλληλεπιδράσετε με το OpenFirmware.
ko: OpenFirmware 프롬프트는 다음과 같습니다: <informalexample><screen> ok 0 &gt; </screen></informalexample> 오래된 모델의 &arch-title; Mac에서는, OpenFirmware의 사용자 입출력은 기본값이 (혹은 고정된 값이) 시리얼 (모뎀) 포트입니다. 이러한 기계에서 OpenFirmware를 실행한 경우, 검은 화면만 보게 될 것입니다. 이 경우, 다른 컴퓨터에서 터미널 프로그램을 실행해 모뎀 포트에 연결해야 OpenFirmware를 쓸 수 있습니다.
pt: A linha de comandos do OpenFirmware parece-se com isto: <informalexample><screen> ok 0 &gt; </screen></informalexample> Note que em modelos antigos de Macs &arch-title;, por omissão e por vezes a interacção hardwired do utilizador para o OpenFirware é através da porta série (modem). Se invocar o OpenFirmware numa dessas máquinas, você apenas vai ver um ecrã vazio. Nesse caso, para interagir com o OpenFirmware é necessário um programa terminal a correr noutro computador, ligado à parta do modem.
ru: Строка приглашения OpenFirmware выглядит так: <informalexample><screen> ok 0 &gt; </screen></informalexample> Заметим, что в старых моделях &arch-title; Mac, по умолчанию и иногда прошитое в I/O, взаимодействие с пользователем установлено по последовательному(модемному) порту. При вызове OpenFirmware на таких машинах, вы увидите просто чёрный экран. В этом случае, для взаимодействия с OpenFirmware вам потребуется подключить другую машину через модемный порт и запустить на ней программу терминала.
zh_cn: OpenFirmware 的提示看起来像： <informalexample><screen> ok 0 &gt; </screen></informalexample> 注意旧型号的 &arch-title; Mac 机器，OpenFirmware 与用户交互所用的默认和 某些硬连线的 I/O 是通过串行(调制解调器)端口进行的。如果您在这样的机器上使用 OperFirmware，您只会看到黑屏。在这种情况下，需要用通过调制解调器端口连接到另外一台电脑上的终端程序来与 OpenFirmware 交互。
zh_tw: OpenFirmware 的提示看起來像：<informalexample><screen> ok 0 &gt; </screen></informalexample>注意舊型號的 &arch-title; Mac 機器，OpenFirmware 與使用者互動所用的預設實體 I/O 是透過序列 (調變解調器) 埠進行的。如果您在這樣的機器上使用 OperFirmware，您只會看到黑色背景。在這種情況下，需要通過調變解調器連接埠連接到另外一台電腦上的終端程式來與 OpenFirmware 交互。

source: The OpenFirmware on OldWorld Beige G3 machines, OF versions 2.0f1 and 2.4, is broken. These machines will most likely not be able to boot from the hard drive unless the firmware is patched. A firmware patch is included in the <application>System Disk 2.3.1</application> utility, available from Apple at <ulink url="ftp://ftp.apple.com/developer/macosxserver/utilities/SystemDisk2.3.1.smi.bin"></ulink>. After unpacking the utility in MacOS, and launching it, select the Save button to have the firmware patches installed to nvram.
el: Σε μηχανήματα OldWorld Beige G3 οι εκδόσεις του OpenFirmware OF 2.0f1 και 2.4,είναι προβληματικές.Τα μηχανήματα αυτά πιθανότατα δεν θα μπορούν να ξεκινήσουν από τόν σκληρό δίσκο αν δεν διορθωθεί το firmware. Ένα patch για το firmware περιέχεται στο βοηθητικό πρόγραμμα <application>System Disk 2.3.1</application>, διαθέσιμο από την Apple στο <ulink url="ftp://ftp.apple.com/developer/macosxserver/utilities/SystemDisk2.3.1.smi.bin"></ulink>. Μετά την αποσυμπίεση του βοηθήματος στο MacOS και την εκκίνησή του επιλέξτε το κουμπί Save για την εφαρμογή των patches στην nvram.
ko: OldWorld Beige G3 기계의 OpenFirmware, OF 2.0f1 및 2.4 버전은 심각한 문제가 있습니다. 이 기계에서는 펌웨어를 패치해야 하드 드라이브에서 부팅할 수 있습니다. 펌웨어 패치는 <application>System Disk 2.3.1</application> 유틸리티에 들어 있고, Apple의 <ulink url="ftp://ftp.apple.com/developer/macosxserver/utilities/SystemDisk2.3.1.smi.bin"></ulink>에서 구할 수 있습니다. MacOS에서 이 유틸리티의 압축을 풀고, 실행한 다음, Save 단추를 눌러 펌웨어 패치를 nvram에 설치하십시오.
pt: O OpenfirmWare em máquinas OldWorld Beige G3, está estragado nas versões 2.0f1 e 2.4. Estas máquinas muito provavelmente não serão capazes de arrancar a partir do disco rígido a menos que patche o firmware. Um patch de firmware está incluído no utilitário <application>System disk 2.3.1</application>, disponível a partir da Appl e em <ulink url="ftp://ftp.apple.com/developer/macosxserver/utilities/SystemDisk2.3.1.smi.bin"></ulink>. Após descomprimir o utilitário em MacOS, e o lançar, escolha o botão Save para ter os patches de firmware instalados na nvram.
ru: OpenFirmware на машинах OldWorld Beige G3, OF версий 2.0f1 и 2.4 не работает. Эти машины, по всей вероятности не смогут быть загружены с жёсткого диска, пока микропрограмма не будет исправлена. Заплатка для микропрограммы включена в утилиту <application>System Disk 2.3.1</application> и доступна уApple по адресу <ulink url="ftp://ftp.apple.com/developer/macosxserver/utilities/SystemDisk2.3.1.smi.bin"></ulink>. После распаковки утилиты в MacOS и запуске, выберите кнопку сохранить, чтобы установить заплатку микропрограммы в nvram.
zh_cn: 运行在 OldWorld Beige G3 机器上的 OF 版本 2.0f1 和 2.4 的 OpenFirmware 是坏的。这些机器如果没有打固件补丁，就不能够从硬盘启动。固件的补丁包括 <application>System Disk 2.3.1</application> 工具，位于 Apple 的 <ulink url="ftp://ftp.apple.com/developer/macosxserver/utilities/SystemDisk2.3.1.smi.bin"></ulink>。在 MacOS 上解包并运行它，选择保存按钮使固件补丁安装到 nvram。
zh_tw: 運行在 OldWorld Beige G3 機器上的 OF 版本 2.0f1 和 2.4 的 OpenFirmware 是損壞的。這些機器如果沒有使用韌體補丁，就不能夠從硬碟開機。韌體的補丁包括 位於 Apple <ulink url="ftp://ftp.apple.com/developer/macosxserver/utilities/SystemDisk2.3.1.smi.bin"></ulink> 的 <application>System Disk 2.3.1</application> 工具。在 MacOS 上解開並執行，選擇儲存按鈕使韌體補丁安裝到 nvram。

source: Invoking OpenBoot
el: Κλήση του OpenBoot
ko: OpenBoot 실행
pt: Invocar o OpenBoot
ru: Вызов OpenBoot
zh_cn: 使用 OpenBoot
zh_tw: 使用 OpenBoot

source: OpenBoot provides the basic functions needed to boot the &arch-title; architecture. This is rather similar in function to the BIOS in the x86 architecture, although much nicer. The Sun boot PROMs have a built-in forth interpreter which lets you do quite a number of things with your machine, such as diagnostics, simple scripts, etc.
el: To OpenBoot παρέχει τις βασικές λειτουργίες που απαιτούνται για την εκκίνηση στην αρχιτεκτονική &arch-title; Αυτό είναι ανάλογο της λειτουργίας του BIOS στην αρχιτεκτονική x86.αλλά μάλλον πολύ καλλίτερο. Οι PROM εκκίνησης της Sun έχουν ενσωματωμένον έναν μεταφραστή forth που σας επιτρέπουν να κάνετε αρκετά πράγματα με το μηχάνημά σας όπως διαγνωστικά, απλά scripts κλπ.
ko: OpenBoot에는 &arch-title; 아키텍쳐 부팅에 필요한 기능이 들어 있습니다. 이 기능은 x86 아키텍쳐의 BIOS와 비슷하지만, 훨씬 더 훌륭합니다. Sun boot PROM에는 fourth 인터프리터가 들어 있어서, 진단 기능이나 간단한 스크립트와 같은 여러 가지 일을 할 수 있습니다.
pt: OpenBoot disponibiliza as funções básicas necessárias para arrancar a arquitectura &arch-title;. Isto é similar à função da BIOS na arquitectura x86, embora muito melhor. As PROMs de arranque da SUN têm um interpretador forth incorporado que o deixa fazer un número grande de coisas com a sua máquina, tais como diagnósticos, scripts simples, etc.
ru: OpenBoot предоставляет основные функции, требуемые для загрузки машины на архитектуре &arch-title;. По функциям он очень напоминает BIOS на архитектуре x86, хотя намного симпотичнее. Sun boot PROM содержит встроенный интрепретатор языка форт, который позволяет вам делать довольно много разных вещей с вашей машиной, например диагностику, выполнять простые сценарии и т.д.
zh_cn: OpenBoot 提供了启动 &arch-title; 所需的基本功能。虽然做得比 x86 体系 BIOS 更好一些，但功能是非常接近的。Sun 的启动 PROM 内置了 forth 解释器，可以让您对计算机做很多事情，如诊断，简单脚本，等等。
zh_tw: OpenBoot 提供了開機 &arch-title; 所需的基本功能。雖然做得比 x86 架構 BIOS 更好一些，但功能是非常接近的。Sun 的開機 PROM 內建了 forth 直譯器，可讓您對電腦做很多事情如診斷，簡單腳本，等等。
