Repository: xobs/debian-installer
Catalog: doc/manual/po/*/preparing.po
Languages: el, ko, pt, ru, zh_cn, zh_tw

source: When <classname>debian-installer</classname> finishes, before the first system load, you have only a very basic command line driven system. The graphical interface which displays windows on your monitor will not be installed unless you select it during the final steps, with either <classname>tasksel</classname> or <classname>aptitude</classname>. It's optional because many &debian; systems are servers which don't really have any need for a graphical user interface to do their job.
el: Όταν τελειώσει ο <classname>debian-installer</classname> και πριν την πρώτη εκκίνηση του συστήματος, αυτό που έχετε στη διάθεσή σας είναι μόνο ένα πολύ βασικό σύστημα που καθοδηγείται από την γραμμή εντολών. Το γραφικό περιβάλλον που απεικονίζει παράθυρα στην οθόνη σας δεν θα εγκατασταθεί αν δεν το επιλέξετε κατά τα τελευταία βήματα, είτε με το <classname>tasksel</classname> είτε με το <classname>aptitude</classname>. Είναι προαιρετικό γιατί πολλά συστήματα &debian; είναι server που δεν χρειάζονται στην πραγματικότητα κάποιο γραφικό περιβάλλον για να κάνουν τη δουλειά τους.
ko: 맨 처음 시스템이 시작하기 전에 <classname>debian-installer</classname>가 끝나면, 아주 기본적인 명령행 기반 시스템만 사용할 수 있습니다. 모니터에 창이 여러 개 나오는 그래픽 인터페이스는 설치하지 않습니다. 마지막 단계에서 <classname>tasksel</classname>이나 <classname>aptitude</classname>를 이용해 따로 설치해야 합니다. 이건 많은 &debian; 시스템과 서버에서 그래픽 사용자 인터페이스가 전혀 필요없기 때문입니다.
pt: Quando o <classname>debian-installer</classname> termina, antes do primeiro carregamento do sistema, tem apenas um sistema muito básico comandado por uma linha de comandos. O interface gráfico que mostra as janelas no seu monitor não será instalado a menos que você o seleccione durante as etapas finais da instalação, com o <classname>tasksel</classname> ou com o <classname>aptitude</classname>. É opcional porque muitos sistemas &debian; são servidores e não têm qualquer necessidade de ter um GUI para fazer o seu trabalho.
ru: Когда <classname>debian-installer</classname> заканчивает работу перед первой загрузкой системы, у вас пока есть только основа системы с управлением из командной строки. Графический интерфейс, который показывает окна на мониторе не будет установлен, если вы не выберите его на последнем шаге или из <classname>tasksel</classname> или с помощью <classname>aptitude</classname>. Он необязателен, так как многие системы &debian; используются как серверы, которым не нужен графический интерфейс пользователя для работы.
zh_cn: 当 <classname>debian-installer</classname> 程序运行结束，系统首次加载之前，您只有一个非常简单的基于命令行的系统。除非您在最后一个步骤里用 <classname>tasksel</classname> 或 <classname>aptitude</classname> 选择安装了能在您的显示器上显示窗口的图形界面，否则它将不会被自动安装。因为许多 &debian; 系统是被用作服务器，它们的工作根本不需要任何图形化的用户界面，所以它在这里只是一个可选项。
zh_tw: 當 <classname>debian-installer</classname> 程式執行結束、系統首次載入之前，您只有一個非常簡單的命令列系統。除非您在最後一個步驟裡用 <classname>tasksel</classname> 或 <classname>aptitude</classname> 選擇安裝了能在您的顯示器上顯示視窗的圖形界面，否則它將不會被自動安裝。因為許多 &debian; 系統是被用作伺服器，它們的工作根本不需要任何圖形化的使用者界面，所以它在這裡只是一個選項。

source: Just be aware that the X system is completely separate from <classname>debian-installer</classname>, and in fact is much more complicated. Installation and trouble shooting of the X window installation is not within the scope of this manual.
el: Απλά λοιπόν να έχετε υπόψη σας ότι το σύστημα Χ είναι τελείως ανεξάρτητο από τον <classname>debian-installer</classname>, και στην πραγματικότητα είναι πολύ πιο περίπλοκο. Η εγκατάσταση και η επίλυση προβλημάτων του συστήματος Χ window δεν είναι στους σκοπούς αυτού του εγχειριδίου.
ko: X 시스템은 <classname>debian-installer</classname>와는 완전히 다르고, 실제로는 훨씬 더 복잡합니다. X 윈도우의 설치나 X 윈도우의 문제점 해결은 이 매뉴얼이 다루는 범위를 벗어납니다.
pt: Apenas fique alertado que o sistema X é completamente separado do <classname>debian-installer</classname>, e de facto é muito mais complicado. A instalação e a resolução de problemas do gestor de janelas X, não está no âmbito deste manual.
ru: Графический интерфейс (X Window System) &mdash; это полностью отдельная программа никак не связанная с <classname>debian-installer</classname>, и фактически, намного более сложная. Описание установки и устранение проблем с X Window System не предмет рассмотрения данного руководства.
zh_cn: 要知道，X 系统是与 <classname>debian-installer</classname> 完全分开的，实际上它的使用要复杂得多。X 窗口安装系统的安装和问题解答不在本手册所关注的范围之内。
zh_tw: X 系統是與 <classname>debian-installer</classname> 完全分開的，實際上它複雜的多了 X 視窗安裝系統的安裝和問題解答不在本手冊所關注的範圍之內。

source: Back Up Your Existing Data!
el: Σώστε τα Υπάρχοντα Δεδομένα σας!
ko: 기존 데이터를 백업하십시오!
pt: Salvaguardar os Seus Dados Existentes!
ru: Сохраните ваши данные в надежном месте!
zh_cn: 记得备份您的所有数据！
zh_tw: 備份您的所有資料！

source: Before you start, make sure to back up every file that is now on your system. If this is the first time a non-native operating system has been installed on your computer, it's quite likely you will need to re-partition your disk to make room for &debian;. Anytime you partition your disk, you should count on losing everything on the disk, no matter what program you use to do it. The programs used in installation are quite reliable and most have seen years of use; but they are also quite powerful and a false move can cost you. Even after backing up be careful and think about your answers and actions. Two minutes of thinking can save hours of unnecessary work.
el: Πριν ξεκινήστε σιγουρευτείτε να σώσετε όλα τα αρχεία που υπάρχουν ήδη στο σύστημά σας. Αν αυτή είναι η πρώτη φορά που ένα μη native λειτουργικό σύστημα εγκαθίσταται στον υπολογιστή σας, είναι πιθανόν ότι θα χρειαστεί να επανακατατμήσετε τον δίσκο σας ώστε να δημιουργήσετε χώρο για το &debian;. Κάθε φορά που ξαναχωρίζετε το δίσκο σας θα πρέπει να σκέφτεστε ότι μπορεί να χάσετε όλα τα δεδομένα στο δίσκο σας, άσχετα από το πρόγραμμα που θα χρησιμοποιήσετε γι΄αυτό. Τα προγράμματα που χρησιμοποιούνται στον εγκαταστάτη είναι πολύ αξιόπιστα και χρησιμοποιούνται για πολλά χρόνια αλλά ταυτόχρονα είναι και πολύ ισχυρά και μια λάθος κίνηση μπορεί να σας κοστίσει. Ακόμα και μετά το σώσιμο των αρχείων σας να είστε προσεκτικοί και σκεφτείτε σοβαρά τις απαντήσεις και τις πράξεις σας. Δυο λεπτά σκέψης μπορεί να σας σώσουν πολλές ώρες αχρείαστης δουλειάς.
ko: 시작하기 전에, 지금 시스템에 있는 모든 파일을 백업해 두십시오. 컴퓨터에 처음으로 네이티브가 아닌 운영 체제를 설치하는 거라면, &debian;의 루트로 쓸 디스크를 다시 파티션해야 합니다. 디스크를 파티션하면 파티션 프로그램으로 어떤 프로그램을 쓰든 간에 그 디스크에 있는 모든 파일을 잃게 됩니다. 설치에 사용하는 프로그램은 상당히 안정적이고 수년동안 사용해 온 프로그램이지만, 그만큼 강력하기도 해서 조금만 잘못하면 막심한 손해가 발생합니다. 백업을 한 뒤에도 대답을 할 때나 어떤 작업을 할 때 신중을 기하십시오. 2분만 더 생각하면 수 시간의 불필요한 작업을 방지할 수 있습니다.
pt: Antes de você começar, certifique-se que salvaguarda cada ficheiro que está agora no seu sistema. Se esta é a primeira vez que um sistema operativo não-nativo está a ser instalado no teu computador, o mais provável é ter de reparticionar o seu disco rígido para disponibilizar espaço para &debian;. Cada vez que particionar o seu disco, deve contar em perder tudo o que está no disco, independentemente do programa que está a utilizar para o fazer. Os programas utilizados na instalação são de confiança e a maioria tem anos de utilização; mas eles são bastante poderosos e um movimento em falso pode sair-lhe caro. Mesmo depois de salvaguardar tenha cuidado e pense nas suas respostas e acções. Dois minutos a pensar podem salvar horas de trabalho desnecessário.
ru: Перед тем как начать, убедитесь, что вы сохранили каждый файл из вашей системы. Если вы впервые устанавливаете на компьютер не родную операционную систему, скорее всего вам придётся переразметить диск, чтобы выделить место для &debian;. Всегда при разметке диска вы должны считать, что теряете всё на диске, вне зависимости от используемого для этого инструмента. Программы, используемые в установке, достаточно надёжны; с большинством из них люди работают не первый год; но они достаточно мощны для того, чтобы одно неосторожное движение дорого вам обошлось. Даже после сохранения данных будьте осторожны и думайте над даваемыми ответами и действиями. Две минуты раздумий могут спасти вас от нескольких часов ненужной работы.
zh_cn: 开始安装之前，请确定您已经把系统中所有数据都进行了备份。除了购买机器时预装的操作系统以外，如果这是您计算机上的第一个其他操作系统，很可能您得对硬盘进行重新分区，来给 Debian 腾出安装的空间。不管您用什么程序，分区都会使硬盘上的所有数据全部丢失。在我们的安装过程中使用的分区程序经过多年使用，被证明非常可靠，但它的功能也非常强大，您可能会为一次错误操作而付出代价。即使是已经备份过数据，您也要谨慎使用，最好在每次操作之前先认真考虑一下： 两分钟的思考可能会为您节省几个小时的不必要的恢复工作。
zh_tw: 開始安裝之前，請確定您已經對系統中所有資料都進行了備份。除了購買機器時預先安裝的作業系統以外，如果這是您電腦上的第一個非原始作業系統，很可能您得對硬碟進行重新分割，為 Debian 騰出安裝的空間。不管您用什麼程式，分割區都會使硬碟上的所有資料消失。我們的安裝過程中使用的分割程式經過多年使用之後，被證明非常可靠，但它的功能也非常強大，您可能會為一次錯誤操作而付出代價。即使是已經備份過資料，您也要謹慎使用，最好在每次操作之前先認真考慮一下：兩分鐘的思考可能會為您節省幾個小時的不必要恢復工作。

source: If you are creating a multi-boot system, make sure that you have the distribution media of any other present operating systems on hand. Especially if you repartition your boot drive, you might find that you have to reinstall your operating system's boot loader, or in many cases the whole operating system itself and all files on the affected partitions.
el: Αν χρησιμοποιείτε ένα σύστημα με πολλά λειτουργικά σιγουρευτείτε ότι έχετε διαθέσιμα τα μέσα εγκατάστασης που διανέμονται για τα άλλα λειτουργικά που υπάρχουν στο σύστημά σας.Ειδικότερα αν ξαναχωρίσετε τον δίσκο σας ίσως να διαπιστώσετε ότι πρέπει να επανεγκαταστήσετε τον φορτωτή εκκίνησης για το υπάρχον λειτουργικό σας σύστημα ή σε αρκετές περιπτώσεις ολόκληρο το λειτουργικό σύστημα και όλα τα αρχεία στα επηρρεαζόμενα τμήματα του δίσκου.
ko: 멀티 부팅 시스템을 만든다면, 현재 운영 체제의 배포 미디어를 가지고 있으십시오. 특히 부팅 드라이브를 다시 파티션하는 경우라면, 운영 체제의 부트 로더를 다시 설치해야 하거나, 아니면 더 많은 경우에 운영 체제 전체를 해당 파티션에 다시 설치해야 합니다.
pt: Se você está a criar um sistema com várias opções de arranque, certifique-se que tem a mão o meio de distribuição dos outros sistemas operativos instalados. Especialmente se reparticionar a sua drive de arranque, você pode descobrir que tem de reinstalar o gestor de arranque do seu sistema operativo, ou em muitos casos o sistema operativo em si e todos os ficheiros nas partições afectadas.
ru: Если вы создаёте мульти-загрузочную систему, убедитесь, что у вас под рукой есть носители с дистрибутивами всех операционных систем, присутствующих на диске. Особенно если вы переразмечаете загрузочный диск, то можете обнаружить, что затёрли системный загрузчик операционной системы или, в большинстве случаев, всю операционную систему и все файлы на разделах.
zh_cn: 如果您是想把电脑做成多重引导的系统，请先确定您手头上有电脑里已经存在的这些操作系统的安装介质。特别是当您把启动盘重新分区以后，您可能会发现必须重新安装原有操作系统的启动引导程序，某些情况下，还得重新安装该操作系统并恢复受影响分区上的文件。
zh_tw: 如果您想把電腦做成多重開機的系統，請先確定您手頭上有電腦裡已存在的作業系統的安裝媒介。特別是當您把開機磁碟重新分割以後，您可能會發現必須重新安裝原有作業系統的 boot-loader，某些情況下，還得重新安裝該作業系統並恢復受影響分割區上的檔案。

source: With the exception of the BVM and Motorola VMEbus computers, the only supported installation method for m68k systems is booting from a local disk or floppy using an AmigaOS/TOS/MacOS-based bootstrap, for these machines you will need the original operating system in order to boot Linux. In order to boot Linux on the BVM and Motorola VMEbus machines you will need the <quote>BVMBug</quote> or <quote>16xBug</quote> boot ROMs.
el: Με την εξαίρεση των υπολογιστών BVM και Motorola VMEbus η μόνη υποστηριζόμενη μέθοδος εγκατάστασης για συστήματα m68k είναι η εκκίνηση από ένα τοπικό δίσκο ή δισκέττα χρησιμοποιώντας bootstrap βασισμένη σε ένα από τα AmigaOS/TOS/MacOS. Για τα συστήματα αυτά θα χρειαστείτε το αρχικό λειτουργικό σύστημα για να εκκινήσετε το Linux. Για να εκκινήσετε το Linux σε μηχανήματα BVM και Motorola VMEbus θα χρειαστείτε τις ROM εκκίνησης <quote>BVMBug</quote> ή <quote>16xBug</quote>.
ko: BVM과 Motorola VMEbus 컴퓨터를 제외하면 m68k 시스템에서 지원하는 유일한 설치 방법은, AmigaOS/TOS/MacOS기반 부트스트랩을 이용해 로컬 디스크 혹은 플로피 디스크에서 부팅하는 것입니다. 이 시스템에서 리눅스를 부팅하려면 원래 운영 체제를 가지고 있어야 합니다. BVM과 Motorola VMEbus 기계에서는 <quote>BVMBug</quote> 혹은 <quote>16xBug</quote> 부트롬을 사용합니다.
pt: Com a excepção do BVM e de computadores Motorola VMEbus, o único método de instalação suportado para sistemas m68k é iniciar o sistema através de um disco local ou diskette utilizando um AmigaOS/TOS/MacOS-based bootstrap, para estas máquinas você vai precisar do sistema operativo original de maneira a poder iniciar Linux. Para que possa iniciar em Linux nas máquinas BVM e Motorola VMEbus vai necessitar das ROMs de arranque <quote>BVMBug</quote> ou <quote>16xBug</quote>.
ru: За исключением BVM и компьютеров Motorola VMEbus, единственным поддерживаемым методом установки для систем m68k является загрузка с локального диска или с дискеты, используя загрузчик, основанный на AmigaOS/TOS/MacOS. Для этих машин вам нужна исходная операционная система для загрузки Linux. Для загрузки Linux на BVM и машинах Motorola VMEbus вам нужен загрузочные ПЗУ <quote>BVMBug</quote> или <quote>16xBug</quote>.
zh_cn: 除了 BVM 和摩托罗拉 VMEbus 系列的计算机外，m68k 系统的计算机唯一支持的安装方式就是用 AmigaOS、TOS 或 MacOS 的引导程序从本地的硬盘或软盘上启动。所以，对于这种类型的计算机，您必须要有原来的操作系统用来启动 Linux。而为了在 BVM 和摩托罗拉 VMEbus 系列的计算机上启动 Linux，<quote>BVMBug</quote>或<quote>16xBug</quote>引导存储器是必须的。
zh_tw: 除了 BVM 和 Motorola VMEbus 系列的電腦，m68k 系統的電腦，唯一支援的安裝方式就是用 AmigaOS、TOS 或 MacOS 的 boot-loader 從本地的硬碟或軟碟開機。所以，對於這種類型的電腦，您必須要有原始作業系統來開機 Linux。而為了在 BVM 和 Motorola VMEbus 系列的電腦上開機 Linux，<quote>BVMBug</quote> 或 `<quote>16xBug</quote> boot-loader 是必須的。

source: Information You Will Need
el: Πληροφορίες που θα χρειαστείτε
ko: 필요한 정보
pt: Informação Que Vai Necessitar
ru: Информация, которая понадобится
zh_cn: 一些有用的信息
zh_tw: 一些有用的資料

source: Documentation
el: Τεκμηρίωση
ko: 문서
pt: Documentação
ru: Документация
zh_cn: 文档
zh_tw: 文件

source: Installation Manual
el: Εγχειρίδιο Εγκατάστασης
ko: 설치 매뉴얼
pt: Manual de Instalação
ru: Руководство по установке
zh_cn: 安装手册
zh_tw: 安裝手冊

source: Hardware documentation
el: Τεκμηρίωση Υλικού
ko: 하드웨어 문서
pt: Documentação de Hardware
ru: Техническая документация
zh_cn: 硬件文档
zh_tw: 硬體文件

source: Often contains useful information on configuring or using your hardware.
el: Συχνά περιέχει χρήσιμες πληροφορίες για την ρύθμιση ή την χρήση του υλικού του υπολογιστή σας.
ko: 하드웨어를 설정하고 이용하는 법에 관한 유용한 정보가 들어있습니다.
pt: Muitas vezes contém informação útil sobre a configuração ou utilização do seu hardware.
ru: Часто содержит полезную информацию по настройке и использованию вашего аппаратного обеспечения.
zh_cn: 通常包含设置和使用您硬件的有用信息。
zh_tw: 通常包含設置和使用您的硬體的實用資料。

source: Linux Hardware Compatibility HOWTO
el: Οδηγός βοήθειας Συμβατότητας Υλικού για το Linux
pt: Compatibilidade de Hardware em Linux HOWTO
ru: Совместимость Linux и аппаратного обеспечения HOWTO
zh_cn: Linux 硬件兼容性指南
zh_tw: Linux 硬體相容指南

source: Linux/m68k FAQ
zh_tw: Linux/m68k 常見問答集

source: Linux/Alpha FAQ
zh_tw: Linux/Alpha 常見問答集

source: Linux for SPARC Processors FAQ
el: Συχνές Ερωτήσεις (FAQ) για το Linux σε επεξεργαστές SPARC
pt: Linux para Processadores SPARC FAQ
ru: Linux на процессорах SPARC FAQ
zh_tw: Linux for SPARC Processors 常見問答集

source: Installation instructions and device drivers (DASD, XPRAM, Console, tape, z90 crypto, chandev, network) for Linux on &arch-title; using kernel 2.4
el: Οδηγίες εγκατάστασης και οδηγοί συσκευών (DASD, XPRAM, κονσόλα, ταινία, z90, crypto, chandev, δίκτυο) για το Linux στην αρχιτεκτονική &arch-title; χρησιμοποιώντας πυρήνα 2.4
ko: 커널 2.4를 사용한 리눅스 설치 방법 및 장치 드라이버 (DASD, XPRAM, 콘솔, 테이프, z90 crypto, chandev, 네트워크)
pt: Instruções de instalação e controladores de dispositivos (DASD, XPRAM, Consola, tape, z90 crypto, chandev, rede) para Linux em &arch-title; utilizando o kernel 2.4.
ru: Инструкции по установке и драйверам устройств (DASD, XPRAM, Console, tape, z90 crypto, chandev, network)для Linux на &arch-title; с ядром 2.4
zh_cn: 在 &arch-title; 上 Linux 2.4 版内核的安装指引和设备驱动程序 (DASD, XPRAM, Console, tape, z90 crypto, chandev, network)
zh_tw: 在 &arch-title; 上使用Linux 2.4 版核心的安裝指示和設備驅動程式 (DASD, XPRAM, Console, tape, z90 crypto, chandev, network)

source: Device Drivers and Installation Commands
el: Οδηγοί Συσκευών και Εντολές Εγκατάστασης
ko: 장치 드라이버 및 설치 명령어
pt: Controladores de Dispositivos e Comandos de Instalação
ru: Драйвера устройств и команды установки
zh_cn: 设备驱动程序与安装命令
zh_tw: 設備驅動程式與安裝指令

source: IBM Redbook describing how Linux can be combined with z/VM on zSeries and &arch-title; hardware.
el: Το Redbook της IBM που περιγράφει πώς μπορείτε να συνδυάσετε το Linux με το z/VM σε υλικό zSeries και την αρχιτεκτονική &arch-title;.
ko: IBM Redbook, zSeries 및 &arch-title; 하드웨어에서 z/VM에 리눅스를 쓰는 방법을 설명합니다
pt: O IBM RedBook descreve como o Linux pode ser combinado com z/VM no zSeries e &arch-title; hardware.
ru: IBM Redbook описывает как Linux можно объединить с z/VM на zSeries и&arch-title; аппаратным обеспечением.
zh_cn: IBM Redbook 讲述了如何将 Linux 与 zSeries 的 z/VM 和 &arch-title; 硬件组合。
zh_tw: IBM Redbook 描述如何將 Linux 與 zSeries 的 z/VM 和 &arch-title; 硬體結合。

source: Linux for &arch-title;
el: Linux για την αρχιτεκτονική &arch-title;
ko: &arch-title;용 리눅스
pt: Linux para &arch-title;
ru: Linux на &arch-title;
zh_cn: 用于 &arch-title; 的 Linux
zh_tw: 用於 &arch-title; 的 Linux

source: IBM Redbook describing the Linux distributions available for the mainframe. It has no chapter about Debian but the basic installation concepts are the same across all &arch-title; distributions.
el: Το IBM Redbook που περιγράφει τις διαθέσιμες διανομές Linux για mainframes. Δεν περιέχει κάποιο κεφάλαιο για το Debian αλλά οι βασικές ιδέες εγκατάστασης είναι κοινές μεταξύ όλων των &arch-title; διανομών.
ko: 메인프레임용 리눅스 배포판에 대해 설명하는 IBM Redbook입니다. Redbook에는 데비안에 관한 내용이 들어 있지 않지만 기본적인 설치 방법은 모든 &arch-title; 배포판에서 똑같습니다.
pt: O IBM Readbook descreve as distribuições de Linux disponíveis para o mainframe. Não há nenhum capítulo sobre Debian mas os conceitos básicos da instalação básica são os mesmos para todas as distribuições de &arch-title;.
ru: IBM Redbook описывает дистрибутивы Linux, работающие на мэйнфреймах. В нём не главы про Debian, но основные концепции установки подходят от всех &arch-title; дистрибутивов.
zh_cn: IBM Redbook 介绍了可用于 mainframe 的 Linux 发行版。其中没有关于 Debian 的章节，但对于所有的 &arch-title; 发行版，基本的安装概念是相同的。
zh_tw: IBM Redbook 介紹可用於大型主機的 Linux 發行套件。其中沒有關於 Debian 的章節，但對於所有的 &arch-title; 發行套件，基本的安裝概念是相同的。

source: Linux for IBM eServer zSeries and &arch-title;: Distributions
el: Linux για IBM eServer zSeries και Διανομές &arch-title;
pt: Linux para IBM eServer zSeries e &arch-title;: Distribuições
ru: Linux на IBM eServer zSeries и &arch-title;: дистрибутивы
zh_tw: IBM eServer zSeries and &arch-title; 的發行套件：

source: Finding Sources of Hardware Information
el: Βρίσκοντας πηγές για πληροφορίες σχετικά με το Υλικό σας
ko: 하드웨어 정보가 있는 곳 찾기
pt: Encontrar Fontes de Informação de Hardware
ru: Поиск источников технической информации
zh_cn: 提供硬件信息的资源
zh_tw: 尋找硬體資訊來源

source: In many cases, the installer will be able to automatically detect your hardware. But to be prepared, we do recommend familiarizing yourself with your hardware before the install.
el: Σε πολλές περιπτώσεις ο εγκαταστάτης θα είναι σε θέση να ανιχνεύσει αυτόματα το υλικό σας. Αλλά για να είστε προετοιμασμένοι συνιστούμε να εξοικειωθείτε με το υλικό του υπολογιστή σας πριν την εγκατάσταση.
ko: 많은 경우에 설치 프로그램에서 자동으로 하드웨어를 찾아 냅니다. 하지만 철저히 준비하려면, 설치하기 전에 하드웨어에 대해 잘 알아 두는 게 좋습니다.
pt: Em muitos casos, o instalador poderá ser capaz de automaticamente detectar o seu hardware. Mas para estar preparado, nós recomendamos familiarizar-se com o seu hardware antes da instalação.
ru: В большинстве случаев программа установки способна определить используемое оборудованиеавтоматически. Но всё же мы рекомендуем вам перед установкой самостоятельно ознакомиться с имеющимся оборудованием.
zh_cn: 许多情况下，安装程序能自动检测您的硬件。但作为预备，我们建议您还是在安装之前熟悉一下您的硬件比较好。
zh_tw: 許多情況下，安裝程式能自動檢測您的硬體。但作為預備，我們建議您還是在安裝之前熟悉一下您的硬體比較好。

source: Hardware information can be gathered from:
el: Πληροφορίες για το Υλικό σας μπορούν να συγκεντρωθούν από:
ko: 하드웨어 정보는 다음에서 얻을 수 있습니다:
pt: Informação sobre o hardware pode ser reunida a partir de:
ru: Информацию по аппаратному обеспечению можно найти:
zh_cn: 获取硬件信息的途径有：
zh_tw: 取得硬體資料的途徑有：

source: The manuals that come with each piece of hardware.
el: Τα εγχειρίδια που έρχονται με κάθε κομμάτι του υλικού.
ko: 하드웨어에 같이 들어 있는 매뉴얼.
pt: Os manuais que vêm com cada peça de hardware.
ru: В руководствах, которые были вместе с приобретённым аппаратным обеспечением.
zh_cn: 每个硬件附带的手册。
zh_tw: 每個硬體附帶的手冊。

source: The BIOS setup screens of your computer. You can view these screens when you start your computer by pressing a combination of keys. Check your manual for the combination. Often, it is the <keycap>Delete</keycap> key.
el: Οι οθόνες ρυθμίσεων του BIOS στον υπολογιστή σας. Μπορείτε να δείτε αυτές τις οθόνες όταν ξεκινάτε τον υπολογιστή σας πατώντας έναν κατάλληλο συνδυασμό πλήκτρων. Συχνά είναι το πλήκτρο <keycap>Delete</keycap>.
ko: 컴퓨터의 BIOS 설정 화면. 컴퓨터가 시작할 때 어떤 키 조합을 누르면 BIOS 설정 화면을 볼 수 있습니다. 보통 <keycap>Delete</keycap> 키입니다.
pt: Os ecrãs da BIOS no seu computador. Você pode ver esses ecrãs quando inicia o seu computador pressionando uma combinação de teclas. Verifique o seu manual para a combinação. Muitas vezes, é a tecla <keycap>Delete</keycap>.
ru: В настройках BIOS. Вы можете увидеть эти настройки, если нажмёте комбинацию клавиш во время загрузки компьютера. Посмотрите в руководстве нужную комбинацию. Часто это клавиша <keycap>Delete</keycap>.
zh_cn: 您计算机的 BIOS 配置画面。在计算机启动时，您可以通过按组合健查看这些画面。请从您的手册确认组合健。通常，它是 <keycap>Delete</keycap> 健。
zh_tw: 您電腦 BIOS 設定畫面。在電腦開機時，您可以透過按鍵組合查看這些畫面。請從您的手冊確認按鍵。通常，它是 <keycap>Delete</keycap> 鍵。

source: The cases and boxes for each piece of hardware.
el: Οι συσκευασίες και τα κουτιά για κάθε κομμάτι του υλικού σας.
ko: 하드웨어의 케이스 및 포장.
pt: As caixas para cada peça de hardware.
ru: На коробках и ящиках от аппаратного обеспечения.
zh_cn: 每个硬件的包装盒。
zh_tw: 每個硬體的包裝盒。

source: The System window in the Windows Control Panel.
el: Το παράθυρο για το Σύστημα στον πίνακα ελέγχου των Windows.
ko: Windows 제어판의 시스템 창.
pt: A janela de Sistema no Painel de Controlo do Windows.
ru: Щёлкнув на значке "Система" в панели управления Windows.
zh_cn: Windows 控制面板里面的系统窗口。
zh_tw: Windows 控制台裡面的系統視窗。

source: System commands or tools in another operating system, including file manager displays. This source is especially useful for information about RAM and hard drive memory.
el: Εντολές συστήματος ή εργαλεία από ένα άλλο λειτουργικό σύστημα, περιλαμβανομένων διαχειριστών αρχείων. Αυτή η πηγή είναι ιδιαίτερα χρήσιμη για πληροφορίες σχετικά με την μνήμη RAM και την μνήμη του σκληρού δίσκου.
ko: 파일 관리자에서 표시하는 것 등과 같은, 다른 운영체제의 시스템 명령어 및 시스템 도구들. 특히 RAM과 하드 드라이브에 대한 정보를 알아내는 데 유용합니다.
pt: Os comandos de sistema ou utilitários noutro sistema operativo, incluindo do gestor de ficheiros. Esta fonte é especialmente útil para informações acerca da RAM e memória do disco rígido.
ru: С помощью системных команд и инструментов других операционных систем, включая файловый менеджер. Это особенно полезный источник информации об оперативной памяти и жёстких дисках.
zh_cn: 其他操作系统里面的系统命令或工具，包括文件管理器的显示。该资源对了解 RAM 和硬盘特别有用。
zh_tw: 其他作業系統裡面的系統指令或工具，包括檔案管理員的顯示。該資源對瞭解隨機存取記憶體和硬碟特別有用。

source: Your system administrator or Internet Service Provider. These sources can tell you the settings you need to set up your networking and e-mail.
el: Ο διαχειριστής του συστήματος ή ο Παροχέας Διαδικτύου σας. Οι πηγές αυτές μπορούν να σας δώσουν τα στοιχεία που χρειάζεστε για τη ρύθμιση του δικτύου και του ηλεκτρονικού ταχυδρομείου σας.
ko: 시스템 관리자 혹은 인터넷 서비스 회사. 여기서는 네트워크 및 전자메일 설정에 관련된 사항을 알 수 있습니다.
pt: O seu administrador de sistema ou o Fornecedor do Serviço de Internet (ISP). Estas fontes poderão dizer as definições que necessita para configurar a rede e o correio electrónico.
ru: Узнать у вашего системного администратора или провайдера услуг Интернет. Они могут рассказать вам о настройках почты и подключении к сети.
zh_cn: 您的系统管理员或者互联网服务提供商。他们可以告诉您所需的网络和 e-mail 配置信息。
zh_tw: 您的系統管理員或者網際網路服務提供商。他們可以告訴您所需的設定網路和電子郵件的相關資料。

source: Hardware Information Needed for an Install
el: Πληροφορίες για το υλικό σας που χρειάζονται για μια εγκατάσταση
ko: 설치하는 데 필요한 하드웨어 정보
pt: Informação Necessária Sobre Hardware para uma Instalação
ru: Информация об аппаратном обеспечении, требуемая для установки
zh_cn: 安装所需的硬件信息
zh_tw: 安裝所需的硬體資料
