Repository: xobs/debian-installer
Catalog: doc/manual/po/*/preparing.po
Languages: el, ko, pt, ru, zh_cn, zh_tw

source: Before Installing &debian;
el: Πριν την εγκατάσταση του Debian
ko: &debian; 설치하기 전에
pt: Antes de Instalar &debian;
ru: Перед установкой &debian;
zh_cn: 开始安装 &debian; 之前
zh_tw: 安裝 &debian; 之前

source: This chapter deals with the preparation for installing Debian before you even boot the installer. This includes backing up your data, gathering information about your hardware, and locating any necessary information.
el: Tο κεφάλαιο αυτό ασχολείται την προετοιμασία που πρέπει να κάνετε για την εγκατάσταση του Debian πριν καν ξεκινήσετε τον εγκαταστάτη. Αυτή περιλαμβάνει την διάσωση των δεδομένων σας, την συγκέντρωση πληροφοριών για το υλικό του συστήματος και τον εντοπισμό οποιασδήποτε αναγκαίας πληροφορίας.
ko: 이 장에서는 설치 프로그램을 부팅하기도 전에 해야 하는 데비안 설치 준비에 대해 다룹니다. 데이터 백업, 하드웨어에 대한 정보 모으기, 그 밖에 필요한 정보 찾기와 같은 준비를 해야 합니다.
pt: Este capítulo trata da preparação para instalar o Debian antes mesmo de iniciar o instalador. Isto inclui salvaguardar os seus dados e recolher informação sobre o seu hardware, e localizar qualquer informação que seja necessária.
ru: В этой главе рассказывается о том, что нужно сделать перед запуском программы установки Debian: резервное копирование данных, сбор информации об оборудовании и поиск необходимой информации.
zh_cn: 本章用于处理在启动安装程序安装 Debian 之前的准备工作。这包括备份您的数据，搜集您硬件的信息，以及获取其他一些必要的信息。
zh_tw: 本章用於處理在開機安裝程式以安裝 Debian 之前的準備工作。這包括備份您的資料，搜集您的硬體資訊，以及取得其他一些必要的資料。

source: Overview of the Installation Process
el: Επισκόπηση της Διαδικασίας Εγκατάστασης
ko: 설치 과정의 개요
pt: Vista Geral do Processo de Instalação
ru: Обзор процесса установки
zh_cn: 安装概述
zh_tw: 安裝概述

source: First, just a note about re-installations. With Debian, a circumstance that will require a complete re-installation of your system is very rare; perhaps mechanical failure of the hard disk would be the most common case.
el: Καταρχήν μια σημείωση για τις επανεγκαταστάσεις. Με το Debian είναι πολύ σπάνια η περίπτωση που θα χρειαστείτε να κάνετε μια πλήρη επανεγκατάσταση του συστήματός σας. Τις περισσότερες φορές μια βλάβη του σκληρού δίσκου είναι η πιο κοινή αιτία.
ko: 먼저, 다시 설치하는 것에 대해서 설명합니다. 데비안에서는, 처음부터 시스템을 다시 설치해야 하는 상황은 아주 드뭅니다. 다시 설치해야 하는 경우는 아마도 하드 디스크가 물리적으로 망가진 경우가 대부분일 것입니다.
pt: Primeiro, apenas uma nota sobre re-instalações. Com debian, a circunstância em que você necessita de uma reinstalação completa do seu sistema é muito rara; talvez por falha mecânica do disco rígido na maior parte dos casos.
ru: Во-первых, немного о переустановках. Случаи, когда приходится полностью переустанавливать Debian очень редки; наиболее часто это делается при механической поломке жёсткого диска.
zh_cn: 先说一下有关重新安装的事情。使用 Debian 时，极少出现必须进行完全重新 安装的情况，可能导致这种情况的大多是硬盘的物理故障。
zh_tw: 首先，提一下關於重新安裝的事情。使用 Debian 時，必須進行完全重新安裝的情況非常少見，可能導致這種情況的大多是硬碟的物理故障。

source: Many common operating systems may require a complete installation to be performed when critical failures take place or for upgrades to new OS versions. Even if a completely new installation isn't required, often the programs you use must be re-installed to operate properly in the new OS.
el: Αρκετά άλλα γνωστά λειτουργικά συστήματα μπορεί να απαιτούν μια πλήρη εγκατάσταση μετά από κάποιες κρίσιμες βλάβες ή όταν πρέπει να γίνει αναβάθμιση σε μια καινούρια έκδοση του λειτουργικού. Ακόμα κι αν δεν χρειαστεί να κάνετε μια καινούρια εγκατάσταση, συχνά τα προγράμματα που χρησιμοποιείτε πρέπει να επανεγκατασταθούν για να δουλέψουν σωστά με το καινούριο λειτουργικό σύστημα.
ko: 널리 쓰이는 많은 운영체제들에서는 치명적인 문제점이 발생하거나 새로운 운영체제의 버전으로 업그레이드하려는 경우 완전한 설치 과정을 거쳐야 합니다. 처음부터 완전히 새로 설치할 필요가 없다고 해도, 새로운 운영 체제에서 제대로 동작하려면 프로그램들을 다시 설치해야 합니다.
pt: Muitos sistemas operativos usuais podem necessitar de uma instalação completa quando ocorrem falhas críticas ou em actualizações para novas versões do SO. Mesmo quando não é necessária uma instalação completamente nova, muitas vezes os programas utilizados são reinstalados para funcionarem correctamente no novo SO.
ru: Большинство операционных систем могут требовать выполнения полной установки при критических сбоях или для обновления версии операционной системы. Даже если новая установка не требуется, часто приходится переустанавливать другие программы, чтобы они стали работать в новой версии ОС.
zh_cn: 许多常见的操作系统在遇到严重错误或者要升级到新的版本时，必须进行重新安装。就算不需要完全重新安装，您通常还得把您的各种程序在新的系统里也再重新安装一遍才行。
zh_tw: 許多常見的作業系統在遇到嚴重錯誤或者要升級到新的版本時，必須進行重新安裝。就算不需要完全重新安裝，您通常還得把您的應用程式在新系統裡也再重新安裝一遍才行。

source: Under &debian;, it is much more likely that your OS can be repaired rather than replaced if things go wrong. Upgrades never require a wholesale installation; you can always upgrade in-place. And the programs are almost always compatible with successive OS releases. If a new program version requires newer supporting software, the Debian packaging system ensures that all the necessary software is automatically identified and installed. The point is, much effort has been put into avoiding the need for re-installation, so think of it as your very last option. The installer is <emphasis>not</emphasis> designed to re-install over an existing system.
el: Με το &debian;, είναι πολύ πιο πιθανό ότι το λειτουργικό σας μπορεί να επιδιορθωθεί μάλλον και όχι να αντικατασταθεί αν κάτι πάει λάθος. Οι αναβαθμίσεις ποτέ δεν απαιτούν μια ολοκληρωμένη εγκατάσταση και μπορείτε πάντα να κάνετε επί τόπου αναβάθμιση. Τα προγράμματα είναι επίσης σχεδόν πάντα συμβατά με διαδοχικές εκδόσεις του λειτουργικού συστήματος.Αν μια καινούρια έκδοση ενός προγράμματος απαιτεί πιο πρόσφατο λογισμικό υποστήριξης, το σύστημα πακέτων του Debian σιγουρεύει ότι όλο το απαραίτητο λογισμικό ταυτοποιείται και εγκαθίσταται αυτόματα. Και το γεγονός είναι ότι έχει αφιερωθεί πολύς κόπος ακριβώς στο να μην υπάρχει ανάγκη για επανεγκαταστάσεις, οπότε θεωρήστε την πραγματικά σαν την τελευταία σας λύση. Ο εγκαταστάτης <emphasis>δεν</emphasis> έχει σχεδιαστέι για επανεγκατάσταση πάνω από ένα υπάρχον σύστημα.
ko: &debian;에서는 운영체제에서 무언가 문제점이 있으면, 운영체제를 바꿔 버리지 않고 바로 잡습니다. 업그레이드할 때 전부 다 설치할 필요는 없고, 항상 그 자리에서 업그레이드할 수 있습니다. 그리고 프로그램은 거의 언제나 뒤의 운영체제 릴리스에서도 호환됩니다. 어떤 프로그램의 새 버전에서 다른 소프트웨어의 새로운 버전이 필요한 경우라면, 데비안 꾸러미 시스템에서 필요한 소프트웨어를 모두 알아서 자동으로 설치합니다. 즉, 다시 설치할 필요가 없도록 많은 노력이 들어가 있기 때문에, 다시 설치는 마지막 선택으로 남겨 두십시오. 설치 프로그램은 기존 시스템 위에 다시 설치하도록 설계되지 <emphasis>않았습니다</emphasis>.
pt: Em &debian;, é muito provável que o seu SO possa ser reparado em vez de ser substituído se as coisas correrem mal. As actualizações nunca precisam de uma instalação completa; Podem-se sempre fazer actualizações no local. E os programas são quase sempre compatíveis com as sucessivas versões do SO. Se uma nova versão do programa necessitar de software de suporte mais recente, o sistema de pacotes da Debian assegura-se que todo o software necessário é automaticamente identificado e instalado. O ponto é que, muito esforço tem sido empreendido para evitar a necessidade de reinstalação, por isso pense nisso como a sua última opção. O instalador <emphasis>não</emphasis> é projectado para se reinstalar sobre o sistema operativo já existente.
ru: C &debian; у вас намного больше шансов что ОС будет восстановлена и переустановка не потребуется. Для обновлений никогда не требуется переустановки "всего"; вы всегда можете выполнить обновление не прерывая работы. Все программы почти всегда совместимы с новыми версиями операционной системы. Если новая версия программы требует более нового программного обеспечения, система управления пакетами Debian обеспечивает автоматическое обнаружение и установку всего необходимого программного обеспечения. Много труда было вложено именно в то, чтобы избежать переустановки, поэтому думайте об этом как о последней причине вашего выбора. Программа установки <emphasis>не</emphasis> разрабатывалась для переустановки поверх существующей системы.
zh_cn: 在 &debian; 里，如果操作系统遇到出错的情况，大多数的时候您都能把它修复而不用重新安装。在这里，升级不再需要进行大规模的安装操作，您可以就地升级它，而这些程序也总能和新版的操作系统和平共处。如果一个程序的新版本需要其他程序的更新的版本来支持它，Debian 软件包管理系统会自动帮您确定所有必须的软件并把它们安装上。关键是，Debian 为了避免重新安装而做了大量努力，所以您 尽可以不用去烦心这些问题了：我们的安装程序<emphasis>不是</emphasis> 设计用来重装您的旧系统的。
zh_tw: 在 &debian; 裡，如果作業系統遇到錯誤，大多數的時候您都能把它修復而不用重新安裝。在這裡，升級不再需要進行大規模的安裝動作，您可以就地升級它，而這些程式也總能和新版的作業系統和平共處。如果一個程式的新版本需要其他程式的更新來支援它，Debian 軟體套件管理系統會自動幫您把所有必須的軟體一併安裝上。關鍵是，Debian 為了避免重新安裝而做了大量努力，所以您盡可以不用去煩心這些問題：我們的安裝程式<emphasis>不是</emphasis>設計來重裝您的舊系統的。

source: Here's a road map for the steps you will take during the installation process.
el: Αυτό είναι ένα διάγραμμα των βημάτων που θα κάνετε κατά τη διάρκεια της διαδικασίας εγκατάστασης.
ko: 다음은 설치 과정에서 해야 할 단계입니다.
pt: Aqui está um roadmap para as etapas que você vai tomar durante o processo de instalação.
ru: Вот путь, который вам предстоит совершить.
zh_cn: 这是安装过程的每个步骤：
zh_tw: 以下將帶領您走過安裝過程的每個步驟：

source: Back up any existing data or documents on the hard disk where you plan to install.
el: Σώστε οποιαδήποτε δεδομένα ή αρχεία που υπάρχουν ήδη στο δίσκο όπου σκοπεύετε να κάνετε την εγκατάσταση.
ko: 설치하려는 하드 디스크에 들어 있는 데이터나 문서를 백업하십시오.
pt: Salvaguardar todos os dados existentes ou documentos que estão no disco rígido onde está a planear instalar.
ru: Сделать резервную копию существующих данных и документов жёсткого диска, на который вы планируете выполнить установку.
zh_cn: 把将要用来安装系统的硬盘上的所有数据或者文档都备份下来；
zh_tw: 把將要用來安裝系統的硬碟上的所有資料或者文件都備份下來﹔

source: Gather information about your computer and any needed documentation, before starting the installation.
el: Μαζέψτε πληροφορίες σχετικά με τον υπολογιστή σας και οποιαδήποτε απαραίτητη τεκμηρίωση πριν ξεκινήσετε την εγκατάσταση.
ko: 설치를 시작하기 전에, 해당 컴퓨터에 대한 정보와 필요한 문서를 모으십시오.
pt: Recolher informação sobre o seu computador e qualquer documentação necessária, antes de começar com a instalação.
ru: Перед началом установки собрать информацию о компьютере и всю необходимую документацию.
zh_cn: 在开始整个安装过程之前，收集您的计算机的硬件信息和可能会用到的文档；
zh_tw: 在開始安裝之前，收集您電腦的硬體資料和可能會用到的文件﹔

source: Create partition-able space for Debian on your hard disk.
el: Δημιουργήστε για το Debian έναν διαμερίσιμο χώρο στο δίσκο σας.
ko: 하드 디스크에 데비안에 쓸 파티션 가능한 공간을 만드십시오.
pt: Criar espaço para partições para o Debian no seu disco rígido.
ru: Выделить место под Debian на жёстком диске.
zh_cn: 在硬盘上为 Debian 留出可以用来创建分区的空间；
zh_tw: 在硬碟上為 Debian 保留一塊可以用來建立分割區的空間﹔

source: Locate and/or download the installer software and any specialized driver files your machine requires (except Debian CD users).
el: Εντοπίστε και/ή κατεβάστε το λογισμικό του εγκαταστάτη μαζί με οποιουσδήποτε ειδικούς οδηγούς που πιθανόν απαιτεί το σύστημά σας (όχι για τους χρήστες των CD του Debian).
ko: 해당 컴퓨터에 필요한 설치 프로그램 소프트웨어 및 필요한 드라이버 파일을 찾아서 내려받으십시오. (데비안 CD 사용자 제외)
pt: Localizar e/ou fazer o download do instalador e de alguns ficheiros de drivers específicos que a sua máquina necessite (excepto utilizadores do CD Debian).
ru: Найти и/или загрузить программу установки и все нужные для вашей машины специальные драйверы (пользователям компакт-дисков Debian этого делать не надо).
zh_cn: 如果您不是使用 Debian 安装光盘，请寻找和(或)下载安装程序软件，还有用于您电脑上的特殊硬件的驱动程序；
zh_tw: 如果您不是使用 Debian 安裝光碟，請尋找和 (或) 下載安裝程式軟體，還有用於您電腦上特殊硬體的驅動程式﹔

source: Set up boot tapes/floppies/USB sticks, or place boot files (most Debian CD users can boot from one of the CDs).
el: Ρυθμίστε ταινίες/δισκέττες/USB sticks εκκίνησης ή τοποθετήστε τα αρχεία εκκίνησης (οι περισσότεροι χρήστες των Debian CD μπορούν να ξεκινήσουν από ένα από τα CD).
ko: 부팅 테이프/플로피/USB 스틱을 만드십시오. 혹은 부팅 파일을 저장해 놓으십시오. (데비안 CD 사용자는 대부분 데비안 CD 중 한장으로 부팅합니다)
pt: Preparar tapes/disquetes/sticks USB de arranque, ou colocar ficheiros de arranque (a maior parte dos utilizadores do CD Debian conseguem iniciar automaticamente de um dos cds).
ru: Создать ленты/дискеты/USB-карты памяти или разместить загрузочные файлы (большинство пользователей компакт-дисков Debian могут загрузиться с одного из компакт-дисков).
zh_cn: 设置从磁带、软盘、USB 盘，或者其它存有系统启动文件的设备上启动 (对于大多数 Debian 安装光盘的使用者来说，可以直接用这些光盘启动)；
zh_tw: 設置從開機磁帶、軟碟、USB 隨身碟，或者其它存有系統開機檔案的設備 (對於大多數 Debian 安裝光碟的使用者來說，可以直接用這些光碟開機)﹔

source: Boot the installation system.
el: Ξεκινήστε το σύστημα εγκατάστασης.
ko: 설치 시스템을 부팅하십시오.
pt: Arrancar a partir do instalador de sistema.
ru: Загрузить систему установки.
zh_cn: 启动安装系统；
zh_tw: 開機安裝系統﹔

source: Select installation language.
el: Επιλέξτε γλώσσα εγκατάστασης.
ko: 설치 언어를 선택하십시오.
pt: Seleccionar o idioma de instalação.
ru: Выбрать язык установки.
zh_cn: 选择要安装的语言；
zh_tw: 選擇要安裝的語言﹔

source: Activate the ethernet network connection, if available.
el: Ενεργοποιήστε, αν είναι διαθέσιμη, την σύνδεση του δικτύου Ethernet.
ko: 이더넷 네트워크 연결이 있으면 활성화하십시오.
pt: Activar a ligação de rede ethernet, se disponível.
ru: Активировать если есть подключение к сети ethernet.
zh_cn: 如果可能，激活网络连接；
zh_tw: 如果可能，啟用網路連結﹔

source: Configure one network interface.
el: Ρυθμίστε ένα δικτυακό interface.
ko: 네트워크 인터페이스를 하나 설정하십시오.
pt: Configurar um interface de rede.
ru: Настроить один сетевой интерфейс.
zh_cn: 配置一个网络接口；
zh_tw: 設定一個網路介面﹔

source: Open a ssh connection to the new system.
el: Ανοίξτε μια σύνδεση με ssh στο καινούριο σας σύστημα.
ko: 새 시스템에 ssh 연결을 여십시오.
pt: Abrir uma ligação ssh para o novo sistema.
ru: Открыть ssh соединение с новой системой.
zh_cn: 开启新系统的 ssh 连接；
zh_tw: 開啟新系統的 ssh 連線﹔

source: Attach one or more DASDs (Direct Access Storage Device).
el: Συνδέστε ένα ή περισσότερα DASD (Συσκευή Αποθήκευσης Άμεσης Πρόσβασης).
ko: 한 개 이상의 DASD를 (Direct Access Storage Device) 부착하십시오.
pt: Ligar um ou mais DASDs (Direct Access Storage Device).
ru: Подключить один или более DASD (Direct Access Storage Device (прямой доступ к устройству хранения)).
zh_cn: 加上一个或多个直接存取设备(DASD)；
zh_tw: 加上一個或多個直接存取儲存設備(Direct Access Storage Device, DASD)﹔

source: Create and mount the partitions on which Debian will be installed.
el: Δημιουργήστε και προσαρτήστε τα τμήματα δίσκου στα οποία θα εγκατασταθεί το Debian.
ko: 데비안을 설치할 파티션을 만들고 마운트하십시오.
pt: Criar e montar as partições nas quais Debian vai ser instalado.
ru: Создать и смонтировать разделы, на которые будет установлен Debian.
zh_cn: 创建并挂载用来安装 Debian 的分区；
zh_tw: 建立並掛載用來安裝 Debian 的分割區﹔

source: Watch the automatic download/install/setup of the <firstterm>base system</firstterm>.
el: Παρακολουθήστε το αυτόματα κατέβασμα/εγκατάσταση/ρύθμιση του <firstterm>βασικού συστήματος</firstterm>.
ko: <firstterm>베이스 시스템</firstterm>의 자동 내려받기/설치/설정을 보십시오.
pt: Visualizar o download/instalação/setup automático do <firstterm>sistema base</firstterm>.
ru: Присматривать за автоматической загрузкой/установкой/настройкой <firstterm>базовой системы</firstterm>.
zh_cn: 等待自动下载、安装和设置 <firstterm>基本系统</firstterm>。
zh_tw: 等待自動化的下載、安裝和設置<firstterm>基本系統</firstterm>。

source: Install a <firstterm>boot loader</firstterm> which can start up &debian; and/or your existing system.
el: Εγκαταστήστε έναν <firstterm>φορτωτή εκκίνησης</firstterm>.που μπορεί να ξεκινήσει το &debian; και/ή το υπάρχον σύστημά σας.
ko: 데비안 그리고/혹은 기존 시스템을 시작할 수 있는 <firstterm>부트 로더</firstterm>를 설치하십시오.
pt: Instalar um <firstterm>gestor de arranque</firstterm> que possa iniciar o &debian; e/ou o seu sistema existente.
ru: Установить <firstterm>системный загрузчик</firstterm>, который сможет запускать &debian; и/или другую существующую систему.
zh_cn: 安装 <firstterm>启动引导器(boot loader)</firstterm> ，它负责启动 &debian; 和(或)已有的其他系统。
zh_tw: 安裝<firstterm>boot loader</firstterm>，它負責開機 &debian; 和 (或) 已有的其他系統。

source: Load the newly installed system for the first time, and make some initial system settings.
el: Φορτώστε το μόλις εγκατεστημένο σύστημα για πρώτη φορά και κάντε κάποιες αρχικές ρυθμίσεις συστήματος.
ko: 새로 설치한 시스템을 맨 처음 시작하고, 몇 가지 초기 시스템 설정을 하십시오.
pt: Carregar o novo sistema instalado pela primeira vez, e fazer algumas configurações iniciais do sistema.
ru: Загрузить только что установленную систему первый раз, и выполнить начальную настройку системы.
zh_cn: 第一次加载新安装的系统，做一些系统初始设定；
zh_tw: 第一次載入新安裝的系統，做一些系統初始設定﹔

source: Install additional software (<firstterm>tasks</firstterm> and/or <firstterm>packages</firstterm>), at your discretion.
el: Εγκαταστήστε επιπρόσθετο λογισμικό (<firstterm>καθήκοντα/tasks</firstterm> και/ή <firstterm>πακέτα</firstterm>), κατά τη θέλησή σας.
ko: 필요하다고 생각하는 추가 소프트웨어를 (<firstterm>태스크</firstterm> 및/혹은 <firstterm>꾸러미</firstterm>) 설치하십시오.
pt: Instalar programas adicionais (<firstterm>tarefas</firstterm> e/ou <firstterm>pacotes</firstterm>), ao seu critério.
ru: Установить дополнительное программное обеспечение (выбрав нужные <firstterm>задачи</firstterm> и/или <firstterm>пакеты</firstterm>) на ваше усмотрение.
zh_cn: 选择安装您要使用的其他的软件 (<firstterm>程序单元</firstterm> 和/或 <firstterm>软件包</firstterm>)；
zh_tw: 選擇安裝您要使用的其他的軟體(<firstterm>程式單元</firstterm>和/或<firstterm>軟體套件</firstterm>)﹔

source: If you have problems during the installation, it helps to know which packages are involved in which steps. Introducing the leading software actors in this installation drama:
el: Αν έχετε προβλήματα κατά την εγκατάσταση βοηθάει να ξέρει κανείς ποια πακέτα εμπλέκονται και σε ποια βήματα. Ας παρουσιάσουμε λοιπόν τα προγράμματα-πρωταγωνιστές σε αυτό το "έργο" της εγκατάστασης:
ko: 설치할 때 문제가 발생할 때를 대비해서, 각 단계가 어떤 꾸러미와 상관이 있는지 알아 두는 게 좋습니다. 이 설치 단계의 주요 소프트웨어들을 소개하면:
pt: Se tiver problemas durante a instalação, ajuda saber quais os pacotes que estão envolvidos em cada etapa. Introduzindo o actor principal do software em questão neste drama da instalação:
ru: Если у вас возникли проблемы во время установки, хорошо иметь представление о том, какими пакетами это могло быть вызвано и на каком шаге. Представляем основных актёров от программного обеспечения в драме "установка":
zh_cn: 如果您在安装过程中遇到问题，下面的信息可以帮助您找到每个步骤里涉及到那些软件包。有关这场安装“戏剧”的“主角”的介绍：
zh_tw: 如果您在安裝過程中遇到問題，下面的資訊可以幫助您找到每個步驟裡牽涉到的軟體套件。有關這場安裝「戲劇」的「主角」的介紹：

source: The installer software, <classname>debian-installer</classname>, is the primary concern of this manual. It detects hardware and loads appropriate drivers, uses <classname>dhcp-client</classname> to set up the network connection, and runs <classname>debootstrap</classname> to install the base system packages. Many more actors play smaller parts in this process, but <classname>debian-installer</classname> has completed its task when you load the new system for the first time.
el: Ο εγκαταστάτης, <classname>debian-installer</classname>, είναι το κύριο μέλημα αυτού του εγχειριδίου. Ανιχνεύει το υλικό του συστήματος και φορτώνει τους κατάλληλους οδηγούς, χρησιμοποιεί το <classname>dhcp-client</classname> για να δημιουργήσει μια δικτυακή σύνδεση και τρέχει το <classname>debootstrap</classname> για να εγκαταστήσει τα πακέτα του βασικού συστήματος. Πολλοί ακόμα ηθοποιοί παίζουν μικρότερους ρόλους στη διαδικασία αυτή αλλά ο <classname>debian-installer</classname> έχει ολοκληρώσει το καθήκον του όταν φορτώσετε το καινούριο σύστημά σας για πρώτη φορά.
ko: 설치 소프트웨어인 <classname>debian-installer</classname>는 이 매뉴얼에서 가장 중점적으로 다룹니다. <classname>debian-installer</classname>는 하드웨어를 찾아서 적당한 드라이버를 읽어들이고, <classname>dhcp-client</classname>를 이용해 네트워크 연결을 설정하고, <classname>debootstrap</classname>을 실행해 베이스 시스템 꾸러미를 설치합니다. 이 외에 더 많은 소프트웨어들이 각 단계에서 작은 역할들을 담당하고 있지만, 새 시스템이 처음 시작하기까지 전까지는 <classname>debian-installer</classname>가 작업을 마칩니다.
pt: O software instalador, <classname>debian-installer</classname>, é a principal preocupação deste manual. Ele detecta hardware e carrega os controladores apropriados, utiliza o <classname>dhcp-client</classname> para configurar a ligação de rede, e corre o <classname>debootstrap</classname> para instalar os pacotes da base do sistema. Muitos mais actores participam em pequenos papéis neste processo, mas o <classname>debian-installer</classname> já completou a sua tarefa quando você carrega o novo sistema pela primeira vez.
ru: Программа установки, <classname>debian-installer</classname> &mdash; это про что писалось в первую очередь данное руководство. Она обнаруживает аппаратное обеспечение и загружает соответствующие драйверы, использует <classname>dhcp-client</classname> для настройки подключения к сети и запускает <classname>debootstrap</classname> для установки пакетов базовой системы. Намного больше актёров играют меньшие роли этого процесса, а <classname>debian-installer</classname> завершает свою работу после первой загрузки операционной системы.
zh_cn: 安装软件，<classname>debian-installer</classname>，是本手册的关注焦点。她将探测硬件并挂载相应的驱动程序，还要指导 <classname>dhcp-client</classname> 去设置网络连接，还将运行 <classname>debootstrap</classname> 去安装基本系统的软件包。在这个过程中，还有许多其他程序扮演着各自的角色，而 <classname>debian-installer</classname> 将一直到您第一次启动新系统时才完成她的使命。
zh_tw: 安裝軟體，<classname>debian-installer</classname>，是本手冊的主要焦點。它將偵側硬體並掛載適當的驅動程式，使用 <classname>dhcp-client</classname>去設定網路連線，並且執行 <classname>debootstrap</classname> 去安裝基本系統的軟體套件。 在這個過程中，還有許多其他程式扮演著各自的角色，而 <classname>debian-installer</classname> 將一直到您第一次開機新系統時才完成它的使命。

source: Upon loading the new base system, <classname>base-config</classname> supervises adding users, setting a time zone (via <classname>tzsetup</classname>), and setting up the package installation system (using <classname>apt-setup</classname>). It then launches <classname>tasksel</classname> which can be used to select large groups of related programs, and in turn can run <classname>aptitude</classname> which allows you to choose individual software packages.
el: Κατά το ξεκίνημα του καινούριου συστήματος, το <classname>base-config</classname> επιβλέπει την προσθήκη χρηστών, την ρύθμιση της χρονικής ζώνης (μέσω του <classname>tzsetup</classname>), και την ρύθμιση του συστήματος εγκατάστασης πακέτων.(χρησιμοποιώντας το <classname>apt-setup</classname>).Στη συνέχεια ξεκινά το <classname>tasksel</classname> που μπορεί να χρησιμοποιηθεί για την επιλογή μεγάλων ομάδων σχετιζόμενων πακέτων, ενώ μπορεί να τρέξει στη συνέχεια και το <classname>aptitude</classname>που σας επιτρέπει να διαλέξετε μεμονωμένα πακέτα λογισμικού.
ko: 베이스 시스템을 새로 시작하면, <classname>base-config</classname>를 통해 사용자를 추가하고, 시간대를 설정하고 (<classname>tzsetup</classname>을 통해), 꾸러미 설치 시스템을 설정합니다 (<classname>apt-setup</classname> 이용). 다음에 <classname>tasksel</classname>을 실행해 여러 관련된 프로그램의 모음을 선택하고, <classname>aptitude</classname>를 실행해 각각의 소프트웨어 꾸러미를 선택합니다.
pt: Durante o carregamento do novo sistema base, o <classname>base-config</classname> supervisiona a criação de utilizadores, configura o fuso horário (através do <classname>tzsetup</classname>), e configura o sistema de instalação de pacotes (utilizando o <classname>apt-setup</classname>). Depois lança o <classname>tasksel</classname> que pode ser utilizado para seleccionar grandes grupos de programas relacionados, ou permite correr o <classname>aptitude</classname> que permite que se escolham individualmente os pacotes de software.
ru: При загрузке новой базовой системы, <classname>base-config</classname> заведует добавлением пользователей, настройкой часового пояса (через <classname>tzsetup</classname>) и системы управления пакетами (с помощью <classname>apt-setup</classname>). Затем запускается <classname>tasksel</classname> для выбора больших групп взаимосвязных программ, и в свою очередь, может запустить <classname>aptitude</classname> для выбора отдельных пакетов программного обеспечения.
zh_cn: 在加载新装的基本系统时，<classname>base-config</classname> 指导您添加用户、设置时区(通过 <classname>tzsetup</classname>)，并进行软件包安装系统的配置(使用 <classname>apt-setup</classname>)。然后，它将启动 <classname>tasksel</classname> 程序来安装以相互关系分成的几个大组软件，或者 <classname>aptitude</classname> 程序来让您挑选单独的软件包。
zh_tw: 在載入新裝的基本系統時，<classname>base-config</classname> 帶領您新增使用者帳號、設定時區 (透過 <classname>tzsetup</classname>)，並進行軟體套件安裝系統的配置 (使用 <classname>apt-setup</classname>)。然後，它將開機 <classname>tasksel</classname> 程式來安裝以相互關聯分成的幾個軟體大組件，或者 <classname>aptitude</classname> 程式來讓您挑選單獨的軟體套件。
