Repository: xobs/debian-installer
Catalog: doc/manual/po/*/preparing.po
Languages: el, ko, pt, ru, zh_cn, zh_tw

source: But if you have a large IDE disk, and are using neither LBA addressing, overlay drivers (sometimes provided by hard disk manufacturers), nor a new (post 1998) BIOS that supports large disk access extensions, then you must locate your Debian boot partition carefully. In this case, you will have to put the boot partition into the first 1024 cylinders of your hard drive (usually around 524 megabytes, without BIOS translation). This may require that you move an existing FAT or NTFS partition.
el: Αν έχετε όμως έναν μεγάλο δίσκο IDE και δεν χρησιμοποιείτε ούτε LBA addressing, overlay drivers (που διατίθενται μερικές φορές από κατασκευαστές σκληρών δίσκων) ούτε ένα πρόσφατο (μετά το 1998) BIOS που υποστηρίζει επεκτάσεις πρόσβασης μεγάλων δίσκων, τότε θα πρέπει να προσδιορίσετε την κατάτμηση εκκίνησης του Debian προσεκτικά.Στην περίπτωση αυτή θα πρέπει να τοποθήσετε την κατάτμηση εκκίνησης στους πρώτους 1024 κυλίνδρους του σκληρού σας δίσκου (συνήθως γύρω στα 524 megabytes, χωρίς "μετάφραση" BIOS).Αυτό μπορεί να απαιτήσει την μετακίνηση μιας υπάρχουσας κατάτμησης FAT ή NTFS.
ko: 큰 IDE 디스크가 있고, LBA 주소나 오버레이 드라이버나 (하드 디스크 제조사에서 제공하기도 함) 큰 디스크 접근 확장 기능을 지원하는 새로운 (1998년 후) BIOS를 사용하지 않는 경우에는 데비안 부팅 파티션 위치를 잘 잡아야 합니다. 이런 경우 부팅 파티션을 하드 드라이브의 첫 번째 1024실린더 안에 놓아야 합니다 (보통 BIOS에서 변환하지 않은 용량으로 약 524 메가바이트입니다). 이렇게 하려면 기존 FAT나 NTFS 파티션을 옮겨야 할 수도 있습니다.
pt: Mas se você tem um disco IDE grande, e não está a utilizar o endereçamento LBA, drivers overlay (ás vezes disponibilizados pelos fabricantes de discos rígidos), nem uma BIOS nova (após 1998) que suporte extensões de acesso a discos grandes, então você deve posicionar a sua partição de arranque cuidadosamente. Neste caso, você vai ter de colocar a partição boot nos primeiros 1024 cilindros do seu disco rígido (normalmente por volta dos 524 megabytes, sem o mapeamento da BIOS). Isto pode necessitar que você tenha de mover partições FAT ou NTFS existentes.
ru: Но если вы имеете большой IDE диск и не используете ни LBA адресацию, ни вспомогательный драйвер (иногда поставляемый производителями жёстких дисков ), у вас не новый (после 1998 года) BIOS, который поддерживает расширенный доступ к большим дискам, то вы должны правильно разместить загрузочный раздел Debian. В этом случае нужно разместить загрузочный раздел на первых 1024 цилиндрах жёсткого диска (обычно это первые 524 мегабайта, без BIOS трансляции). Для этого может потребоваться перемещение существующего FAT или NTFS раздел.
zh_cn: 但是，如果您有一块 IDE 接口的大硬盘，而且使用的既不是 LBA 寻址或 overlay 驱动 (有时候硬盘厂商会提供这种驱动)，也没用新款(1998 年以后)的支持大硬盘访问扩展的 BIOS，那么您必须小心地划分 Debian 的引导(boot)分区。在这种情形下，您一定要把引导分区分在 硬盘开始的 1024 柱面之内(BIOS 不换算的话，大约 524 MB)。为此，您可能需要移动硬盘上的 FAT 或 NTFS 分区。
zh_tw: 但是，如果您有一顆 IDE 介面的大硬碟，而且使用的既不是 LBA 定址或 overlay 驅動程式 (有時候硬碟廠商會提供這種驅動)，也沒用新款 (1998 年以後) 支援大硬碟追蹤擴展的 BIOS，那麼您必須小心地劃分 Debian 的開機 (boot) 分割區。在這種情形下，您一定要把開機分割區分在硬碟開始的前 1024 磁柱之內 (BIOS 不換算的話，大約 524 MB)。為此，您可能需要移動硬碟上的 FAT 或 NTFS 分割區。

source: Lossless Repartitioning When Starting From DOS, Win-32 or OS/2
el: Επανακατάτμηση χωρίς απώλειες όταν ξεκινάτε από DOS, Win-32 ή OS/2
ko: DOS나 Win-32나 OS/2에서 시작할 때 데이터 손실없이 다시 파티션하기
pt: Reparticionamento Sem Perdas Quando Inicia a Partir de DOS, Win-32 ou OS/2
ru: Переразметка без потерь при запуске из DOS, Win-32 или OS/2
zh_cn: 在 DOS、Win-32 或者 OS/2 上的无损分区
zh_tw: 在 DOS、Win-32 或者 OS/2 下的無害分割

source: One of the most common installations is onto a system that already contains DOS (including Windows 3.1), Win32 (such as Windows 95, 98, Me, NT, 2000, XP), or OS/2, and it is desired to put Debian onto the same disk without destroying the previous system. Note that the installer supports resizing of FAT and NTFS filesystems as used by DOS and Windows. Simply start the installer, select the option to <menuchoice> <guimenuitem>Manually edit partition table</guimenuitem> </menuchoice>, select the partition to resize, and specify its new size. So in most cases you should not need to use the method described below.
el: Μια από τις πιο συνηθισμένες εγκαταστάσεις είναι αυτή σε ένα σύστημα που περιέχει ήδη DOS (περιλαμβανομένων των Windows 3.1), Win32 (όπως Windows 95, 98, Me, NT, 2000, XP) ή OS/2, και όπου επιθυμείτε να εγκαταστήσετε το Debian στον ιδιο δίσκο χωρίς να καταστρέψετε το προηγούμενο σύστημα.Σημειώστε ότι ο εγκαταστάτης υποστηρίζει την μεταβολή του μεγέθους συστημάτων αρχείων FAT και NTFS που χρησιμοποιούνται από το DOS και τα Windows. Απλά ξεκινήστε τον εγκαταστάτη, κάντε την επιλογή <menuchoice> <guimenuitem>Χειροκίνητη επεξεργασία του πίνακα διαμέρισης</guimenuitem> </menuchoice>, επιλέξτε την κατάτμηση που θέλετε να μεταβάλλετε και καθορίστε το καινούριο μέγεθός της.Έτσι δεν θα χρειαστεί τις περισσότερες φορές να χρησιμοποιήσετε την μέθοδο που περιγράφεται αμέσως παρακάτω.
ko: 설치할 때 가장 많은 경우는 이미 DOS (Windows 3.1 포함), Win32 (Windows 95, 98, Me, NT, 2000, XP), 혹은 OS/2와 같은 시스템이 들어 있고, 이전의 시스템을 망가뜨리지 않고 같은 디스크에 데비안을 설치하려는 경우입니다. 설치 프로그램에는 DOS나 Windows에서 사용하는 FAT와 NTFS 파일시스템의 크기를 조정하는 기능이 들어 있습니다. 설치 프로그램에서 <menuchoice> <guimenuitem>수동으로 파티션 테이블 편집</guimenuitem> </menuchoice> 옵션을 선택하고 크기를 조정하려는 파티션을 선택하고 새로운 크기를 지정하십시오. 이렇게 하면 대부분 아래에 설명한 방법을 쓰지 않아도 됩니다.
pt: Uma das instalações mais comuns é num sistema que já contém o DOS (incluindo Windows 3.1), Win32 (tal como o Windows 95, 98, Me, NT, 2000, XP), ou OS/2, e é desejado colocar Debian no mesmo disco sem destruir o sistema anterior. Note que o instalador suporta redimensionamento dos sistemas de ficheiros FAT e NTFS tal como os que são utilizados pelo DOS e Windows. Simplesmente inicie o instalador, seleccione a opção <menuchoice> <guimenuitem>Editar manualmente a tabela de partições </guimenuitem> </menuchoice>, seleccionar a partição a redimensionar, e especificar o seu novo tamanho. Assim na maioria dos casos não é necessário utilizar o método descrito abaixo.
ru: Одна из наиболее распространённых установок: на машину, которая уже содержит DOS (включая Windows 3.1), Win32 (все Windows 95, 98, Me, NT, 2000, XP) или OS/2, и желательно разместить Debian на том же диске без уничтожения предыдущей системы. Заметим, что программа установки поддерживает изменение размера файловых систем FAT и NTFS, используемых DOS и Windows. Просто запустите программу установки, выберите <menuchoice> <guimenuitem>Редактировать вручную таблицу разделов</guimenuitem> </menuchoice>, изменяемый раздел и задайте новый размер. Поэтому в большинстве случаев вы не должны использовать метод, описываемый ниже.
zh_cn: 各常见的安装中，其中有一种就是希望在已经安装有 DOS(含 Windows 3.1)、Win32(如 Windows 95、98、Me、NT、2000、XP) 或者 OS/2 的系统上加装 Debian 到同一块硬盘的同时，保留原有系统。注意，安装程序支持重设被 DOS 和 Windows 使用的 FAT 和 NTFS 文件系统的容量。您只需启动安装程序，选择 <menuchoice> <guimenuitem>手动修改分区表</guimenuitem> </menuchoice> 选项，并选择需要调整大小的分区，指定新的尺寸。在多数情况下您毋须使用下面说明的方法。
zh_tw: 各常見的安裝中，其中有一種就是希望在已經安裝有 DOS (含 Windows 3.1)、 Win32 (如 Windows 95、98、Me、NT、2000、XP) 或者 OS/2 的系統上加裝 Debian 到同一顆硬碟的同時，還保留原有系統。注意，安裝程式支援重新設定被 DOS 和 Windows 使用的 FAT 和 NTFS 檔案系統的容量大小。您只需開機安裝程式，選擇 <menuchoice> <guimenuitem> 手動修改分割區表 </guimenuitem> </menuchoice> 選項，並選擇需要調整大小的分割區，指定新的大小。在多數情況下您毋須使用下面說明的方法。

source: Before going any further, you should have decided how you will be dividing up the disk. The method in this section will only split a partition into two pieces. One will contain the original OS and the other will be used for Debian. During the installation of Debian, you will be given the opportunity to use the Debian portion of the disk as you see fit, i.e., as swap or as a file system.
el: Πριν προχωρήσετε θα πρέπει να αποφασίσετε για το πώς θα χωρίσετε τον δίσκο σας. Η μέθοδος που περιγράφεται στην ενότητα αυτή αφορά το χώρισμα του δίσκου σε μόνο δυο μέρη.Το ένα θα περιέχει το αρχικόλειτουργικό σύστημα ενώ το άλλο θα χρησιμοποιηθεί από το Debian. Κατά τη διάρκεια της εγκατάστασης του Debian, θα έχετε την ευκαιρία να χρησιμοποιήσετε το κομμάτι του δίσκου που προορίζεται για το Debian όπως πιστεύετε ότι είναι καλίτερο, δηλ. για swap ή για ένα σύστημα αρχείων.
ko: 계속 진행하기 전에, 디스크를 어떻게 나눌 지 결정해야 합니다. 여기에 쓰여 있는 방법은 파티션을 두 개로 나누는 것 뿐입니다. 한 파티션에는 원래 OS가 들어 있고, 다른 파티션에 데비안이 들어 있습니다. 데비안을 설치할 때 데비안이 사용하는 디스크 부분을 어떻게 사용할 지 (스왑이나 파일 시스템) 결정하는 부분이 있습니다.
pt: Antes de ir mais longe, você deve ter decidido como vai dividir o disco O método nesta secção apenas vai dividir a partição em duas partes. Uma vai conter o SO original, e a outra será utilizada para Debian. Durante a instalação de Debian, ser-lhe-á dada a oportunidade para utilizar a parte do disco para Debian como achar melhor, i.e., como swap ou como um sistema de ficheiros.
ru: Перед тем как что-то сделать дальше, вы должны решить как вы разделите диск. Метод в этом разделе описывает разделение только на две части. Одна будет содержать имеющуюся ОС, а другая будет использоваться для Debian. Во время установки Debian вам предоставят возможность выбора как использовать часть диска Debian, то есть, под раздел подкачки или в качестве файловой системы.
zh_cn: 在您继续之前，您应该先想好如何分割硬盘。本节所述的方法只会把一个分区一分为二。分出来的其中一片放原来的操作系统，而另一片则归 Debian 使用。在 Debian 的 安装过程中，您会有机会把您认为合适的那部分硬盘划归 Debian 使用。比如说，用作交换分区或者放置文件系统。
zh_tw: 在您繼續之前，您應該先想好如何分割硬碟。本節所述的方法只會把一個分割區一分為二。分出來的其中一塊放至原來的作業系統，而另一塊則歸 Debian 使用。在 Debian 的安裝過程中，您會有機會把您認為合適的那部分硬碟歸為 Debian 使用。例如，用作置換分割區或者放置檔案系統。

source: The idea is to move all the data on the partition to the beginning, before changing the partition information, so that nothing will be lost. It is important that you do as little as possible between the data movement and repartitioning to minimize the chance of a file being written near the end of the partition as this will decrease the amount of space you can take from the partition.
el: Η ιδέα είναι να μεταφέρετε όλα τα δεδομένα στην πρώτη κατάτμηση πριν αλλάξετε την πληροφορία για την διαμέριση ώστε να ,μην χάσετε τίποτα από τα δεδομένα σας. Είναι σημαντικό να αποφύγετε κάθε περιττή ενέργεια στο διάστημα ανάμεσα στην μετακίνηση των δεδομένων και την αλλαγή μεγέθους της κατάτμησης ώστε να ελαχιστοποιήσετε την πιθανότητα να γραφεί ένα αρχείο κοντά στο τέλος της κατάτμησης κάτι που μπορεί να ελαττώσει το χώρο που μπορείτε να αφαιρέσετε από την κατάτμηση αυτή.
ko: 하려는 일은 파티션 정보를 바꾸기 전에 그 안의 모든 데이터를 앞쪽으로 옮기는 것입니다. 그래야 아무것도 잃지 않습니다. 데이터 이동과 파티션을 가능하면 조금 하는 게 중요합니다. 그래야 파일이 파티션 끝 부분에 들어 있지 않게 됩니다. 끝 부분에 파일이 들어가면 그 파티션에서 뽑아낼 수 있는 공간이 줄어듭니다.
pt: A ideia é mover todos os dados na partição para o inicio, antes de alterar a informação da partição, de modo a que nada seja perdido. É importante que você faça o mínimo possível entre o movimento de dados e o reparticionamento para minimizar a hipótese de um ficheiro ser escrito perto do fim da partição porque isto iria diminuir a quantidade de espaço que pode ser tirado da partição.
ru: Идея в том, что перед изменением информации о разделах для того чтобы ничего не потерять переместить все данные в начало раздела. Важно сделать как можно меньшим промежуток между перемещаемыми данными и переразмечаемой областью, чтобы минимизировать вероятность того, что файл будет в конце раздела, а это уменьшает количество места, которое можно вычленить из раздела.
zh_cn: 办法就是在更改分区信息之前，把这个分区中的所有的数据移到分区的前面部分，这样数据就会分毫无损。有一点很重要，即，在移动数据之后，和重新分区之前这段时间之内，尽量不要往分区的后部写数据。否则就会减少从能该分区分出去的空间大小。
zh_tw: 辦法就是在更改分割區資料之前，把這個分割區中的所有的資料移到分割區的前面部分，這樣資料就會分毫無損。有一點很重要，即在移動資料之後，和重新分割區之前這段時間內，盡量不要往分割區的後端寫入資料。否則就會減少從能該分割區分割出去的空間大小。

source: The first thing needed is a copy of <command>fips</command> which is available in the <filename>tools/</filename> directory on your nearest Debian mirror. Unzip the archive and copy the files <filename>RESTORRB.EXE</filename>, <filename>FIPS.EXE</filename> and <filename>ERRORS.TXT</filename> to a bootable floppy. A bootable floppy can be created using the command <filename>sys a:</filename> under DOS. <command>fips</command> comes with very good documentation which you may want to read. You will definitely need to read the documentation if you use a disk compression driver or a disk manager. Create the disk and read the documentation <emphasis>before</emphasis> you defragment the disk.
el: Το πρώτο πράγμα που χρειάζεστε είναι ένα αντίγραφο του <command>fips</command> που βρίσκεται στον κατάλογο <filename>tools/</filename> στον κοντινότερο σας καθρέφτη του Debian. Αποσυμπιέστε τον κατάλογο και αντιγράψετε τα αρχεία <filename>RESTORRB.EXE</filename>, <filename>FIPS.EXE</filename> και <filename>ERRORS.TXT</filename> σε μια εκκινήσιμη δισκέττα.Μπορείτε να δημιουργήσετε μια τέτοια δισκέττα με την εντολή <filename>sys a:</filename> στο DOS. Το πρόγραμμα <command>fips</command> συνοδεύεται από πολύ καλή τεκμηρίωση που ίσως θελήσετε να διαβάσετε. Θα πρέπει οπωσδήποτε να διαβάσετε την τεκμηρίωση αυτή αν χρησιμοποιείτε έναν οδηγό συμπίεσης δίσκου ή έναν διαχειριστή δίσκων. Δημιουργήστε τον δίσκο και διαβάστε την τεκμηρίωση <emphasis>πριν</emphasis> τον κάνετε defragment.
ko: 첫 번째로 필요한 건 데비안 미러 사이트에서 <filename>tools/</filename> 디렉토리에 있는 <command>fips</command> 프로그램입니다. 압축 파일을 풀고 <filename>RESTORRB.EXE</filename>, <filename>FIPS.EXE</filename>, <filename>ERRORS.TXT</filename> 파일을 부팅 가능 플로피에 넣으십시오. 부팅 가능 플로피는 DOS에서 <filename>sys a:</filename> 명령으로 만듭니다. <command>fips</command>에는 아주 좋은 문서가 들어 있으니 읽어 보십시오. 디스크 압축 드라이버나 디스크 관리자를 사용하고 있는 경우라면 반드시 문서를 읽어 봐야 합니다. 디스크 단편화를 없애기 <emphasis>전에</emphasis> 디스크를 만들고 문서를 읽어 보십시오.
pt: A primeira coisa necessária é uma cópia de <command>fips</command> que está disponível no directório <filename>tools/</filename> no seu mirror Debian mais próximo. Unzip ao arquivo e copie os ficheiros <filename>RESTORRB.EXE</filename>, <filename>FIPS.EXE</filename> e <filename>ERRORS.TXT</filename> para uma disquete de arranque. A disquete de arranque pode ser criada utilizando o comando <filename>sys a:</filename> no DOS. O <command>fips</command> vem com uma documentação bastante boa. Você decididamente necessita ler a documentação se está a utilizar um driver de compressão de disco ou um gestor de disco. Crie o disco e leia a documentação <emphasis>antes</emphasis> de desfragmentar o disco.
ru: Во-первых, нужно скопировать <command>fips</command> из каталога <filename>tools/</filename> с ближайшего сервера-зеркала Debian. Распакуйте архив и скопируйте файлы <filename>RESTORRB.EXE</filename>, <filename>FIPS.EXE</filename> и <filename>ERRORS.TXT</filename> на загрузочную дискету. Загрузочную дискету можно создать с помощью команды <filename>sys a:</filename> из DOS. По <command>fips</command> есть хорошая документация, с которой не плохо было бы ознакомиться. Вам однозначно нужно прочитать её, если вы используете драйвер сжатия или дисковый менеджер. Создайте диск и прочитайте документацию <emphasis>перед</emphasis> дефрагментацией диска.
zh_cn: 第一件需要的东西是一份 <command>fips</command> 的拷贝。您可以从离您最近的 Debian 镜像里的 <filename>tools/</filename> 目录下载它。解开这个 zip 压缩文件，把 <filename>RESTORRB.EXE</filename>、<filename>FIPS.EXE</filename> 和 <filename>ERRORS.TXT</filename> 复制到一张启动软盘里。您可以用在 DOS 下面用 <filename>sys a:</filename> 来制作启动盘。<command>fips</command> 带有相当不错的文档，您也许会想看看的。倘若您正在用磁盘压缩驱动程序或者磁盘管理器，那么您绝对有必要读一下那个文档。在您为这块硬盘清理磁盘碎片<emphasis>之前</emphasis> 请先做一张启动盘并好好阅读那份文档。
zh_tw: 第一件需要的東西是一份 <command>fips</command> 的拷貝。您可以從離您最近的 Debian 鏡像裡的 <filename>tools/</filename> 目錄下載它。解開這個 zip 壓縮檔案，把 <filename>RESTORRB.EXE</filename>、<filename>FIPS.EXE</filename> 和 <filename>ERRORS.TXT</filename> 複製到一張開機軟碟裡。您可以用在 DOS 下面用 <filename>sys a:</filename> 來製作開機磁片。<command>fips</command> 含有相當不錯的文件，您也許會想看看。倘若您正在用磁碟壓縮驅動程式或者磁碟管理員，那麼您絕對有必要讀一下這份文件。在您為這顆硬碟清理零碎磁區<emphasis>之前</emphasis>請先做一張開機片並好好閱讀該文件。

source: The next thing needed is to move all the data to the beginning of the partition. <command>defrag</command>, which comes standard with DOS 6.0 and later, can easily do the job. See the <command>fips</command> documentation for a list of other software that may do the trick. Note that if you have Windows 9x, you must run <command>defrag</command> from there, since DOS doesn't understand VFAT, which is used to support for long filenames, used in Windows 95 and higher.
el: Το επόμενο πράγμα που έχετε να κάνετε είναι να μεταφέρετε όλα τα δεδομένα στην αρχή της κατάτμησης. Το πρόγραμμα <command>defrag</command>, που έρχεται από πριν με κάθε έκδοση του DOS από την 6.0 και μεταγενέστερη, μπορεί να το κάνει αυτό εύκολα. Κοιτάξτε την τεκμηρίωση του <command>fips</command> για μια λίστα άλλων προγραμμάτων που μπορούν επίσης να κάνουν αυτό το τρικ. Σημειώστε ότι αν έχετε Windows 9x, θα πρέπει να τρέξετε την εντολή <command>defrag</command> από το λειτουργικό αυτό, μιας και το DOS δεν καταλαβαίνει το σύστημα αρχείων VFAT που χρησιμοποποιείται για την υποστήριξη ονομάτων με πολλούς χαρακτήρες όπως συμβαίνει στα Windows 95 και μεταγενέστερα.
ko: 그 다음에 필요한 건 모든 데이터를 파티션의 처음으로 옮기는 일입니다. DOS 6.0 이후에 포함되어 있는 <command>defrag</command>가 이 작업을 합니다. 이런 일을 하는 다른 소프트웨어 목록을 보려면 <command>fips</command> 문서를 보십시오. Windows 9x를 사용한다면 Windows 9x에서 <command>defrag</command>를 실행해야 합니다. DOS는 Windows 95 이상에서 긴 파일이름을 지원하기 위해 사용하는 VFAT를 인식하지 못합니다.
pt: A próxima coisa necessária é mover os dados para o inicio da partição. O comando <command>defrag</command>, que vem com o DOS 6.0 e posteriores, pode facilmente executar essa tarefa. Depois veja a documentação do <command>fips</command> para consultar uma lista de software que pode servir para fazer isso. Note que se tem o Windows 9x, você deve correr o <command>defrag</command> a partir dele, já que o DOS não compreende VFAT, que é utilizado para suportar nomes de ficheiros longos, utilizados no Windows 95 e superiores.
ru: Далее, нужно переместить все данные в начало раздела. Стандартная команда <command>defrag</command> из DOS версии 6.0 и более поздней легко выполняет эту работу. Смотрите в документации к <command>fips</command> список других программ, которые делают тоже самое. Заметим, что если у вас Windows 9x, то вы должны запускать <command>defrag</command> из неё, так как DOS не понимает VFAT, который используется в Windows 95 и выше для поддержки длинных имён.
zh_cn: 下一件要做的事，是把所有的数据移动到分区的前面部分。DOS 自 6.0 后就带有 <command>defrag</command> 程序，它可以很方便地完成这个任务。请参阅 <command>fips</command> 文档查看其他可用来执行此任务的软件列表。要提醒一下，如果您用的是 Windows 9x，那么必须在 Windows 里运行 <command>defrag</command>，原因是 DOS 不能识别 Windows 95 及其以后版本所使用的支持长文件名的 VFAT 分区。
zh_tw: 下一件要做的事，是把所有的資料移動到分割區的前面。DOS 自 6.0 後就包含了 <command>defrag</command> 程式，它可以很方便地完成這個任務。請參閱 <command>fips</command> 文件查看其他可用來執行此任務的軟體列表。要提醒的是，如果您用的是 Windows 9x，那麼必須在 Windows 裡執行 <command>defrag</command>，原因是 DOS 不能識別 Windows 95 及其以後版本所使用的支援長檔名的 VFAT 分割區。

source: After running the defragmenter (which can take a while on a large disk), reboot with the <command>fips</command> disk you created in the floppy drive. Simply type <filename>a:\fips</filename> and follow the directions.
el: Αφού τρέξετε τον defragmenter (κάτι που μπορεί να διαρκέσει αρκετή ώρα σε ένα μεγάλο δίσκο) επανεκκινήστε με την δισκέττα <command>fips</command> που δημιουργήσατε.Τυπώστε απλά <filename>a:\fips</filename> και ακολουθήστε τις οδηγίες.
ko: defragmenter를 실행한 다음에 (디스크가 크면 꽤 오래 걸립니다), 플로피 드라이브에 새로 만든 <command>fips</command> 디스크를 넣고 다시 부팅하십시오. <filename>a:\fips</filename>를 실행해 안내에 따르십시오.
pt: Após correr o desfragmentador (o que pode demorar um pouco num disco grande), reinicie com o disco criado com o <command>fips</command> na drive de disquetes. Escreva simplesmente, <filename>a:\fips</filename> e siga as instruções.
ru: После завершения дефрагментации (которая занимает много времени на большом диске), перезагрузитесь с дискеты <command>fips</command>. Просто введите <filename>a:\fips</filename> и следуйте инструкциям.
zh_cn: 磁盘碎片清理程序(defragmenter)运行完毕后(如果是硬盘比较大，那么得等上一会儿了)，用您在软驱里生成的 <command>fips</command> 软盘重启。只须输入 <filename>a:\fips</filename> 然后按照提示操作。
zh_tw: 零碎磁區清理程式 (defragmenter) 運行完畢後 (如果硬碟容量較大需要等比較久)，用您在軟碟機裡製作的 <command>fips</command> 軟碟重新開機。只須輸入 <filename>a:\fips</filename> 然後按照提示操作。

source: Note that there are many other partition managers out there, in case <command>fips</command> doesn't do the trick for you.
el: Σημειώστε ότι υπάρχουν αρκετοί άλλοι διαθέσιμοι διαχειριστές για διαμέριση σε περίπτωση που το <command>fips</command> δεν κάνει τη δουλειά για σας.
ko: <command>fips</command>에서 파티션 크기 조정을 하지 못하는 경우에도, 다른 파티션 관리자들이 많이 있습니다.
pt: Note que existem muitos outros gestores de partições, nesse caso o <command>fips</command> pode não o ajudar.
ru: Заметим, что существует много других менеджеров разделов, если <command>fips</command> чем-то не подошёл вам.
zh_cn: 需要提醒一下，如果觉得 <command>fips</command> 不好用，还有许多其它的分区工具可供差遣。
zh_tw: 請注意，如果覺得 <command>fips</command> 不好用，還有許多其它的分割工具可供差遣。

source: Partitioning for DOS
el: Κατάτμηση για DOS
ko: DOS용 파티션하기
pt: Particionar para DOS
ru: Разметка для DOS
zh_cn: 为 DOS 分区
zh_tw: DOS 下的分割

source: If you are partitioning for DOS drives, or changing the size of DOS partitions, using Linux tools, many people experience problems working with the resulting FAT partitions. For instance, some have reported slow performance, consistent problems with <command>scandisk</command>, or other weird errors in DOS or Windows.
el: Αν κάνετε μια διαμέριση για δίσκους με DOS ή αλλάζετε το μέγεθος κατατμήσεων DOS χρησιμοποιώντας εργαλεία του Linux είναι πιθανόν να αντιμετωπίσετε προβλήματα με τις κατατμήσεις FAT που προκύπτουν (όπως έχει αναφερθεί από αρκετούς χρήστες). Για παράδειγμα, κάποιοι αναφέρουν χαμηλή απόδοση, συστηματικά προβλήματα με το <command>scandisk</command>,και άλλα παράξενα σφάλματα στο DOS ή στα Windows.
ko: 리눅스 도구를 이용해 DOS 드라이브를 파티션하는 경우나, DOS 파티션의 크기를 바꾸는 경우, 만들어 낸 FAT 파티션에서 많은 문제가 발생했습니다. 예를 들면, 어떤 사람은 속도가 느려지기도 했고, <command>scandisk</command>를 사용했을 때 계속 문제가 발생하기도 했고, 그 외에 DOS나 Windows에서 괴상한 오류들이 발생했습니다.
pt: Se está a particionar para drives de DOS, ou modificar o tamanho de partições de DOS, utilizando utilitários de Linux, muitas pessoas experimentam problemas ao trabalhar com as partições FAT resultantes. Por exemplo, algumas pessoas relataram fraca performance, problemas de consistência com o <command>scandisk</command>, ou outros erros estranhos em DOS e em Windows.
ru: Если вы делаете раздел для диска DOS или изменяете размер разделов DOS с помощью утилит Linux, надо сказать, что много людей испытывали проблемы при работе с получившимися разделами FAT. Например, некоторые рассказывали о плохой производительности, проблемах целостности с <command>scandisk</command> и других странных ошибках в DOS или Windows.
zh_cn: 如果您用 Linux 的工具软件来为 DOS 硬盘分区，或者改动 DOS 分区的大小的话，请注意，有许多人在这样做了以后，在使用新分出来的或者大小被改变的 FAT 分区的过程中发现存在着各种各样的问题。举例来说，有些人回报说发现性能下降，有的人则在使用 <command>scandisk</command> 时发现有一致性(consistent)的问题，还有其它在 DOS 或 Windows 中发现的各种古怪的错误。
zh_tw: 如果您用 Linux 的工具軟體來為 DOS 硬碟分割區或更動了 DOS 分割區大小，請注意，有許多人在這樣做了以後，於使用新分割出來的或者大小被改變的 FAT 分割區的過程中發現各式各樣的問題。舉例來說，有些人回報發現性能下降，有的人則在使用 <command>scandisk</command> 時發現有一致性 (consistent) 的問題， 還有其它在 DOS 或 Windows 中發現的各種古怪的錯誤。
