Repository: xobs/debian-installer
Catalog: doc/manual/po/*/preparing.po
Languages: el, ko, pt, ru, zh_cn, zh_tw

source: Partitioning tools for Macintosh tested include <command>pdisk</command>, <command>HD SC Setup</command> 7.3.5 (Apple), <command>HDT</command> 1.8 (FWB), <command>SilverLining</command> (LaCie), and <command>DiskTool</command> (Tim Endres, GPL). Full versions are required for <command>HDT</command> and <command>SilverLining</command>. The Apple tool requires a patch in order to recognize third-party disks (a description on how to patch <command>HD SC Setup</command> using <command>ResEdit</command> can be found at <ulink url="http://www.euronet.nl/users/ernstoud/patch.html"></ulink>).
el: Εργαλεία διαμέρισης για το MacOS που έχουν δοκιμαστεί είναι τα <command>pdisk</command>, <command>HD SC Setup</command> 7.3.5 (Apple), <command>HDT</command> 1.8 (FWB), <command>SilverLining</command> (LaCie), και τα <command>DiskTool</command> (Tim Endres, GPL). Πλήρεις εκδόσεις χρειάζονται για τα <command>HDT</command> και <command>SilverLining</command>. Το Apple tool απαιτεί ένα patch για να αναγωρίσει δίσκους από τρίτα μέρη (μια περιγραφή του πώς να τροποποιήσετε το <command>HD SC Setup</command> χρησιμοποιώντας την εντολή <command>ResEdit</command> μπορεί να βρεθεί στο <ulink url="http://www.euronet.nl/users/ernstoud/patch.html"></ulink>).
ko: 테스트한 Macintosh의 파티션 도구는 <command>pdisk</command>, <command>HD SC Setup</command> 7.3.5 (Apple), <command>HDT</command> 1.8 (FWB), <command>SilverLining</command> (LaCie), 그리고 <command>DiskTool</command>이 (Tim Endres, GPL) 있습니다. <command>HDT</command>와 <command>SilverLining</command>의 경우 완전한 버전이 필요합니다. Apple의 도구는 써드파티 디스크를 인식하려면 패치가 필요합니다. (<command>HD SC Setup</command>을 <command>ResEdit</command>로 패치하는 방법은 <ulink url="http://www.euronet.nl/users/ernstoud/patch.html"></ulink>에 있습니다.)
pt: Os utilitários de particionamento testados para Macintosh incluem <command>pdisk</command>, <command>HD SC Setup</command> 7.3.5 (Apple), <command>HDT</command> 1.8 (FWB), <command>SilverLining</command> (LaCie), e <command>DiskTool</command> (Tim Endres, GPL). São necessárias versões completas para <command>HDT</command> e <command>SilverLining</command>. Para reconhecer discos de terceiros o utilitário Apple necessita de um patch (uma descrição em como aplicar o patch <command>HD SC Setup</command> utilizando <command>ResEdit</command> pode ser encontrada em <ulink url="http://www.euronet.nl/users/ernstoud/patch.html"></ulink>).
ru: Для разметки в Macintosh тестировались следующие инструменты: <command>pdisk</command>, <command>HD SC Setup</command> 7.3.5 (Apple), <command>HDT</command> 1.8 (FWB), <command>SilverLining</command> (LaCie) и <command>DiskTool</command> (Tim Endres, GPL). Для <command>HDT</command> и <command>SilverLining</command> нужны полные версии. Для утилиты Apple требуется заплатка, чтобы появилась возможность определять диски сторонних производителей (описание как наложить заплатку <command>HD SC Setup</command> с помощью <command>ResEdit</command> можно найти здесь <ulink url="http://www.euronet.nl/users/ernstoud/patch.html"></ulink>).
zh_cn: Macintosh 下经过测试的分区工具包括 <command>pdisk</command>、<command>HD SC Setup</command> 7.3.5 (Apple)、<command>HDT</command> 1.8 (FWB)、<command>SilverLining</command> (LaCie) 和 <command>DiskTool</command> (Tim Endres, GPL)。对 <command>HDT</command> 和 <command>SilverLining</command> 要完整版。Apple 工具需要打补丁才能识别第三方的磁盘 (如何给 <command>HD SC Setup</command> 打补丁(使用 <command>ResEdit</command>)的说明位于 <ulink url="http://www.euronet.nl/users/ernstoud/patch.html"></ulink>)。
zh_tw: Macintosh 下經過測試的分割工具包括 <command>pdisk</command>、<command>HD SC Setup</command> 7.3.5 (Apple)、<command>HDT</command> 1.8 (FWB)、<command>SilverLining</command> (LaCie) 和 <command>DiskTool</command>(Tim Endres, GPL)。對 <command>HDT</command> 和 <command>SilverLining</command> 需要完整版才可完成工作。Apple 工具需要補丁才能識別第三方的磁碟 (如何給 <command>HD SC Setup</command> 補丁(使用 <command>ResEdit</command>)的說明位於 <ulink url="http://www.euronet.nl/users/ernstoud/patch.html"></ulink>)。

source: For IDE based Macs, you need to use <command>Apple Drive Setup</command> to create empty space for the Linux partitions, and complete the partitioning under Linux, or use the MacOS version of pdisk available from the MkLinux FTP server.
el: Για συστήματα Mac με δίσκους IDE, θα πρέπει να χρησιμοποιήσετε το <command>Apple Drive Setup</command> για να δημιουργήσετε κενό χώρο για τις κατατμήσεις του Linux και να ολοκληρώσετε την διαμέριση αργότερα μέσα από το Linux., ή να χρησιμοποιήσετε την έκδοση του pdisk για το MacOS που είναι διαθέσιμο από τον FTP server του MkLinux.
ko: IDE 기반 Mac의 경우, <command>Apple Drive Setup</command>을 이용해 리눅스 파티션을 위한 빈 공간을 만들어야 합니다. 그리고 리눅스에서 나머지 파티션을 하거나, MkLinux FTP 서버에 있는 pdisk의 MacOS 버전을 사용합니다.
pt: Para Macs baseados em IDE, você necessita utilizar <command>Apple Drive Setup</command> para criar espaço vazio para as partições de Linux, e completar o particionamento em Linux, ou utilizar a versão MacOS do pdisk disponível no servidor FTP de MkLinux.
ru: Для Mac с IDE, вам нужно использовать <command>Apple Drive Setup</command> чтобывыделить пустое места для разделов Linux, и завершить разметку в Linux, или воспользоваться MacOS версией pdisk доступной с ftp сервера MkLinux.
zh_cn: 对基于 IDE 的 Mac，您需要使用 <command>Apple Drive Setup</command> 为 Linux 分区创建空闲空间，然后在 Linux 下完成分区，或者使用 MacOS 版的 pdisk，它可以从 MkLinux FTP 服务器获得。
zh_tw: 對於使用 IDE 的 Mac，您需要使用 <command>Apple Drive Setup</command> 來為 Linux 分割區建立空間，然後在 Linux 下完成分割，或者使用 MacOS 版的 pdisk，它可以從 MkLinux FTP 伺服器取得。

source: Partitioning from SunOS
el: Κατάτμηση από SunOS
ko: SunOS에서 파티션하기
pt: Particionar em SunOS
ru: Разметка из SunOS
zh_cn: 在 SunOS 下分区
zh_tw: SunOS 下的分割

source: It's perfectly fine to partition from SunOS; in fact, if you intend to run both SunOS and Debian on the same machine, it is recommended that you partition using SunOS prior to installing Debian. The Linux kernel understands Sun disk labels, so there are no problems there. Just make sure you leave room for the Debian root partition within the first 1GB area of the boot disk. You can also place the kernel image on a UFS partition if that is easier than putting the root partition there. SILO supports booting Linux and SunOS from either EXT2 (Linux), UFS (SunOS), romfs and iso9660 (CDROM) partitions.
el: Μπορείτε άνετα να κάνετε την διαμέριση των δίσκων σας από το SunOS. Μάλιστα, αν σκοπεύετε να τρέξετε το SunOS και το Debian στο ίδιο μηχάνημα, συνίσταται να κάνετε τη διαμέριση του δίσκου από το SunOS πριν εγκαταστήσετε το Debian. Ο πυρήνας του Linux καταλαβαίνει τις επικεφαλίδες δίσκου της Sun, οπότε δεν θα έχετε προβλήματα με αυτό. Απλά βεβαιωθείτε να αφήσετε χώρο για την ριζική κατάτμηση του Debian στην περιοχή του πρώτου 1 GB του δίσκου εκκίνησης. Μπορείτε ακόμα να τοποθετήσετε τον πυρήνα του Linux σε μια κατάτμηση με UFS, αν αυτό είναι ευκολότερο από το προηγούμενο. O φορτωτής εκκίνησης SILO υποστηρίζει εκκίνηση του Linux και του SunOS από κατατμήσεις με συστήματα αρχείων EXT2 (Linux), UFS (SunOS), romfs και iso9660 (CDROM).
ko: SunOS에서 파티션하는 건 문제가 없습니다. 실제로 SunOS와 데비안을 같은 기계에서 돌리려면, 데비안을 설치하기 전에 SunOS에서 파티션하는 게 좋습니다. 리눅스 커널은 Sun 디스크 레이블을 인식하기 때문에, 여기서는 아무런 문제가 없습니다. 단 부팅 디스크의 첫 번째 1GB 안에 데비안 루트 파티션을 위한 공간을 만들어 놓으십시오. UFS 파티션에 루트 파티션을 넣기가 더 편하다면 커널 이미지를 그 UFS 파티션에 놓으십시오. SILO는 EXT2 (리눅스), UFS (SunOS), romfs 및 iso9660 (CD-ROM) 파티션에서 리눅스와 SunOS 부팅을 지원합니다.
pt: É perfeitamente possível particionar a partir de SunOS; de facto, se você pretende correr ambos SunOS e Debian na mesma máquina, é recomendado que particione utilizando o SunOS antes de instalar Debian. O kernel Linux lida perfeitamente com disk labels Sun, por isso aí não existem problemas. Assegure-se apenas que deixa espaço para a partição raiz de Debian no primeiro 1GB no disco de arranque. Você pode também colocar uma imagem do kernel numa partição UFS se isso for mais fácil do que lá colocar a partição raiz. O SILO suporta o arranque de Linux e SunOS a partir de qualquer das partições EXT2 (Linux), UFS (SunOS), romfs e iso9660 (CDROM).
ru: Это замечательно делается из SunOS; фактически, если вы намереваетесь работать и в SunOS и в Debian на одной машине, то даже рекомендуется делать разметку с помощью SunOS перед установкой Debian. Ядро Linux понимает таблицу разделов Sun (disk labels), поэтому с этим не будет никаких проблем. Только проверьте, что разместили корневой раздел Debian в пределах первого гигабайта загрузочного диска. Также вы можете положить образ ядра в UFS раздел, если это легче чем создавать корневой раздел. SILO поддерживает загрузку Linux и SunOS с разделов EXT2 (Linux), UFS (SunOS), romfs и iso9660 (CDROM).
zh_cn: 从 SunOS 分区非常完美。事实上，如果您倾向在同一台计算机上使用 SunOS 和 Debian，推荐在安装 Debian 之前使用 SunOS 进行分区。Linux 内核可以识别 Sun 的磁盘标签，因此不会有任何问题。只需要在启动盘的首 1GB 范围里面给 Debian 根分区留有足够空间。您也可以将内核映像放在 UFS 分区里，如果这比设定根分区的位置更简单的话。SILO 支持从 EXT2 (Linux)、UFS (SunOS)、romfs 和 iso9660 (CDROM) 分区启动 Linux 和 SunOS。
zh_tw: 從 SunOS 分割區是非常好的。事實上，如果您傾向在同一台電腦上使用 SunOS 和 Debian，我們建議在安裝 Debian 之前使用 SunOS 進行分割區。Linux 核心可以識別 Sun 的磁碟標籤，因此不會有任何問題。只需要在開機磁碟的首 1GB 範圍裡面賦予 Debian 根區留足夠空間即可。如果比設定根分割區的位置更簡單，您也可以將核心映像放在 UFS 分割區裡。SILO 支援從 EXT2 (Linux)、UFS (SunOS)、romfs 和 iso9660 (CDROM) 分割區開機 Linux 和 SunOS。

source: Partitioning from Linux or another OS
el: Κατάτμηση από Linux ή άλλο Λειτουργικό Σύστημα
ko: Linux 및 그 밖의 OS에서 파티션하기
pt: Particionar a partir de Linux ou outro SO
ru: Разметка из Linux или другой ОС
zh_cn: 从 Linux 或其他 OS 分区
zh_tw: Linux 或其他 OS 下的分割

source: Whatever system you are using to partition, make sure you create a <quote>Sun disk label</quote> on your boot disk. This is the only kind of partition scheme that the OpenBoot PROM understands, and so it's the only scheme from which you can boot. In <command>fdisk</command>, the <keycap>s</keycap> key is used to create Sun disk labels. You only need to do this on drives that do not already have a Sun disk label. If you are using a drive that was previously formatted using a PC (or other architecture) you must create a new disk label, or problems with the disk geometry will most likely occur.
el: Οποιοδήποτε σύστημα και αν χρησιμοποιήσετε για την διαμέριση, βεβαιωθείτε να δημιουργήσετε μια <quote>επικεφαλίδα δίσκου Sun</quote> στον δίσκο εκκίνησης. Αυτό είναι το μοναδικό είδος σχήματος διαμέρισης που καταλαβαίνει το OpenBoot PROM κι επομένως το μόνο σχήμα από το οποίο μπορείτε να εκκινήσετε. Με το <command>fdisk</command> χρησιμοποιήστε το πλήκτρο <keycap>s</keycap> για να δημιουργήσετε μια επικεφαλίδα δίσκου Sun. Αυτό βέβαια θα χρειαστεί να το κάνετε μόνο για δίσκους που δεν έχουν ήδη μια τέτοια επικεφαλίδα. Αν χρησιμοποιείτε έναν δίσκο που έχει προηγουμένως μορφοποιηθεί σε ένα PC (ή μια 'αλλη αρχιτεκτονική) θα πρέπει να δημιουργήσετε μια καινούρια επικεφαλίδα, διαφορετικά είναι πιθανόν να αντιμετωπίσετε προβλήματα με τηνγεωμετρία του δίσκου.
ko: 파티션할 때 어떤 시스템을 사용하든 간에, 부팅 디스크에 <quote>Sun 디스크 레이블</quote>을 만들도록 하십시오. OpenBoot PROM이 이해하는 유일한 파티션 방식이고, 그래서 부팅할 수 있는 유일한 방식입니다. <command>fdisk</command>에서, <keycap>s</keycap> 키를 누르면 Sun 디스크 레이블을 만들 수 있습니다. Sun 디스크 레이블이 없는 드라이브의 경우에만 레이블을 새로 만들 필요가 있습니다. PC에서 (아니면 다른 아키텍쳐에서) 포맷한 드라이브가 있다면 새로운 디스크 레이블을 만들어야 하고, 아니면 디스크 크기에 관련한 오류가 발생할 것입니다.
pt: Qualquer que seja o sistema que você está a utilizar para particionar, assegure-se que cria um <quote>Sun disk label</quote> no seu disco de arranque. Este é o único esquema de particionamento que OpenBoot PROM compreende, por isso é o único esquema pelo qual consegue arrancar. No <command>fdisk</command>, a tecla <keycap>s</keycap> é utilizada para criar Sun disk labels. Você apenas fazer isto em drives que ainda não tenham um Sun disk label. Se está a utilizar um disco que foi previamente formatada com um PC (ou outra arquitectura) você tem de criar um novo disk label, ou muito provavelmente terá problemas com a geometria do disco.
ru: Какую бы систему вы не использовали для разметки, убедитесь, что создали <quote>Sun disk label</quote> на загрузочном диске. Это единственная схема разделов, которую понимает OpenBoot PROM, и поэтому эта единственная схема, из которй вы можете загрузиться. В <command>fdisk</command>используйте клавишу <keycap>s</keycap>, чтобы создать Sun disk label. Это вам может потребоваться только в случае если на диске ещё нет Sun disk label. Если вы используете диск, который ранее был отформатирован для PC (или другой архитектуры), то вы должны создать новый disk label, или, вероятнее всего возникнут проблемы с геометрией диска.
zh_cn: 无论使用什么系统分区，您要确保在您的启动盘上创建<quote>Sun disk label</quote>标签。这是 OpenBoot PROM 能识别的唯一分区方案，也是您唯一可以启动的方案。在 <command>fdisk</command> 里面，<keycap>s</keycap> 键用于创建 Sun 磁盘标签。您只须在没有 Sun 磁盘标签的磁盘上执行这个操作。如果您使用了一个被 PC (或其他体系)格式化过的磁盘，您必须创建新的磁盘标签，不然会有磁盘排列问题出现。
zh_tw: 無論使用什麼系統分割區，您要確保在您的開機磁碟上建立 <quote>Sun disk label</quote> 標籤。這是 OpenBoot PROM 能識別的唯一分割區方案，也是您唯一可以開機的方案。在 <command>fdisk</command> 裡面，<keycap>s</keycap> 鍵用於建立 Sun 磁碟標籤。您只須在沒有 Sun 磁碟標籤的磁碟上執行這個動作。如果您使用了一個被 PC (或其他架構)格式化過的磁碟，您必須建立新的磁碟標籤，不然會有磁碟排列問題出現。

source: You will probably be using <command>SILO</command> as your boot loader (the small program which runs the operating system kernel). <command>SILO</command> has certain requirements for partition sizes and location; see <xref linkend="partitioning"/>.
el: Το πιο πιθανόν είναι ότι θα χρησιμοποιήσετε το <command>SILO</command> σαν τον φορτωτή εκκίνησης (το μικρό πρόγραμμα που φορτώνει τον πυρήνα του λειτουργικού συστήματος). Το <command>SILO</command> έχει κάποιες συγκεκριμένες απαιτήσεις όσον αφορά το μέγεθος των κατατμήσεων και την θέση τους δείτε και το <xref linkend="partitioning"/>.
ko: 부트로더(운영 체제 커널을 실행하는 작은 프로그램)로 <command>SILO</command>를 사용합니다. <command>SILO</command>를 쓰려면 파티션 크기와 위치에 대해 엄격한 제한이 있습니다. <xref linkend="partitioning"/> 부분을 참고하십시오.
pt: Você provavelmente irá utilizar o <command>SILO</command> como o seu gestor de arranque (um pequeno programa que corre o kernel do sistema operativo). O <command>SILO</command> tem alguns requisitos para tamanhos de partições e localização; veja <xref linkend="partitioning"/>.
ru: Вероятно, вы будуте использовать <command>SILO</command> в качестве системного загрузчика (маленькая программа, которая запускает ядро операционной системы). <command>SILO</command> имеет определённые требования к размеру и местоположению раздела; смотрите <xref linkend="partitioning"/>.
zh_cn: 您也许使用 <command>SILO</command> 作为您的 boot loader (运行操作系统内核的小程序)。<command>SILO</command> 对分区尺寸和位置有明确的要求，请参阅 <xref linkend="partitioning"/>。
zh_tw: 您也許使用 <command>SILO</command> 作為您的 boot loader(執行作業系統核心的小程式)。<command>SILO</command> 對分割區大小和位置有明確的要求，請參閱 <xref linkend="partitioning"/>。

source: MacOS/OSX Partitioning
el: Κατάτμηση από MacOS/OSX
ko: MacOS/OSX 파티션하기
pt: Particionar com MacOS/OSX
ru: Разметка MacOS/OSX
zh_cn: 在 MacOS/OSX 下分区
zh_tw: MacOS/OSX 下的分割

source: The <application>Apple Drive Setup</application> application can be found in the <filename>Utilities</filename> folder on the MacOS CD. It will not adjust existing partitions; it is limited to partitioning the entire disk at once. The disk driver partitions don't show up in <application>Drive Setup</application>.
el: Η εφαρμογή <application>Apple Drive Setup</application> μπορεί να βρεθεί στον κατάλογο <filename>Utilities</filename> στο CD του MacOS. Δεν μπορεί να προσαρμόσει υπάρχουσες κατατμήσεις. Έχει τον περιορισμό ότι κάνει την διαμέριση ολόκληρου του δίσκου δια μιας. Οι κατατμήσεις του δίσκου δεν φαίνονται στο <application>Drive Setup</application>.
ko: MacOS CD의 <filename>Utilities</filename> 폴더에 <application>Apple Drive Setup</application> 애플리케이션이 있습니다. 이 프로그램은 기존 파티션을 조정하지 않고, 전체 디스크를 한 번에 파티션하는 데만 쓸 수 있습니다. 디스크 드라이버 파티션은 <application>Drive Setup</application>에 나타나지 않습니다.
pt: A aplicação <application>Apple Drive Setup</application> pode ser encontrada na pasta <filename>Utilities</filename> no CD de MacOS. Não irá ajustar as partições existentes; é limitado a particionar todo o disco de uma vez. As partições do disco de drivers não irão aparecer em <application>Drive Setup</application>.
ru: Приложение <application>Apple Drive Setup</application> можно найти в папке <filename>Utilities</filename> компакт-диске MacOS. Оно не работает с существующими разделами; оно размечается весь диск сразу. Драйвер дисковой разметки не показан в <application>Drive Setup</application>.
zh_cn: <application>Apple Drive Setup</application> 程序可以在 MacOS CD 的 <filename>Utilities</filename> 文件夹里面找到。它并不能调整已经存在的分区，而仅限于一次性完成整个磁盘的分区。硬盘分区并不会展现在 <application>Drive Setup</application> 中。
zh_tw: <application>Apple Drive Setup</application> 程式可以在 MacOS CD 的 <filename>Utilities</filename> 目錄裡面找到。它並不能調整已經存在的分割區，而且僅限於一次性完成整個磁碟的分割區。硬碟分割區並不會出現在 <application>Drive Setup</application> 中。

source: Remember to create a placeholder partition for GNU/Linux, preferably positioned first in the disk layout. it doesn't matter what type it is, it will be deleted and replaced later inside the &debian; installer.
el: Θυμηθείτε να δημιουργήσετε μια θέση υποδοχής για το GNU/Linux, κατά προτίμηση στην πρώτη θέση στην διάταξη του δίσκου. Δεν έχει σημασία ο τύπος αυτής της κατάτμησης αφού θα διαγραφεί και θα αντικατασταθεί αργότερα μέσα από τον εγκαταστάτη του &debian;.
ko: GNU/리눅스가 들어갈 위치에 공간을 차지하는 파티션을 만들도록 하십시오. 가능하면 디스크에서 첫 번째에 놓으십시오. 파티션 종류는 중요하지 않습니다. &debian; 설치 프로그램에서 나중에 그 파티션을 지워서 다른 파티션으로 바꾸게 됩니다.
pt: Lembre-se de criar uma partição para marcar o espaço para GNU/Linux, de preferência posicionada no inicio da disposição do disco. Não interessa de que tipo é, posteriormente será apagada e substituída pelo instalador de !&debian;.
ru: Не забудьте создать раздел болванку для GNU/Linux, желательно в начале диска. Неважно какого типа он будет, это поправит позже сама программа установки &debian;.
zh_cn: 记住要为 GNU/Linux 创建一个占位用的是分区，最好是磁盘布局中的第一个。它的类型无关紧要，在后面的 &debian; 安装程序中，它会被删除并替换。
zh_tw: 記得要建立一個給 GNU/Linux 佔用的分割區，最好是磁碟分割中的第一個分割區。它的類型無關緊要，在後面的 &debian; 安裝程式中，它會被刪除並替換。

source: If you are planning to install both MacOS 9 and OS X, it is best to create separate partitions for OS 9 and OS X. If they are installed on the same partition, <application>Startup Disk</application> (and reboot) must be used to select between the two; the choice between the two systems can't be made at boot time. With separate partitions, separate options for OS 9 and OS X will appear when holding the <keycap>option</keycap> key at boot time, and separate options can be installed in the <application>yaboot</application> boot menu as well. Also, Startup Disk will de-bless all other mountable partitions, which can affect GNU/Linux booting. Both OS 9 and OS X partitions will be accessible from either OS 9 or OS X.
el: Αν σχεδιάζετε να εγκαταστήσετε και το MacOS 9 και το OS X, είναι καλίτερο να δημιουργήσετε ξεχωριστές κατατμήσεις για το κάθε λειτουργικό σύστημα. Αν εγκατασταθούν στην ίδια κατάτμηση θα πρέπει να χρησιμοποιήσετε το <application>Startup Disk</application> (και βέβαια με επανεκκίνηση) για να επιλέξετε ανάμεσα στα δύο. Η επιλογή αυτή μεταξύ των δύο λειτουργικών δεν μπορεί να γίνει κατά τη στιγμή της επανεκκίνησης. Αν όμως έχετε διαφορετικές κατατμήσεις για το καθένα, τότε θα εμφανιστούν αντίστοιχα διαφορετικές επιλογές για το OS X και το MacOS 9 κρατώντας κάτω το πλήκτρο <keycap>option</keycap> κατά την εκκίνηση ενώ διαφορετικές επιλογές μπορούν να τοποθετηθούν και στο μενού εκκίνησης του <application>yaboot</application>. Επίσης το Startup Disk θα απενεργοποιήσει όλες τις άλλες προσαρτήσιμες κατατμήσεις που μπορούν να επηρρεάσουν την εκκίνηση του GNU/Linux. Οι κατατμήσεις τόσο του OS 9 όσο και του OS Χ θα είναι προσβάσιμες είτε από το OS 9 είτε το OS X.
ko: MacOS 9과 OS X를 모두 설치하려는 경우, OS 9과 OS X에 별도의 파티션을 만드는 게 가장 좋습니다. 같은 파티션에 설치하는 경우 <application>Startup Disk</application>를 이용해서 두 가지 중에서 하나를 선택해야 합니다 (그리고 다시 부팅). 부팅할 때는 두 시스템 사이에 선택할 수 없습니다. 별도의 파티션을 이용하면, <keycap>option</keycap> 키를 부팅할 때 누르고 있으면 OS 9과 OS X 중의 하나를 선택할 수 있습니다. 또 <application>yaboot</application> 부팅 메뉴에서도 별도 옵션을 만들 수 있습니다. 게다가 Startup Disk는 다른 마운트 가능 파티션을 없애 버리기 때문에, GNU/리눅스가 부팅하는 데 문제가 생깁니다. OS 9과 OS X 파티션은 OS 9과 OS X 모두에서 접근할 수 있습니다.
pt: Se está a planear instalar ambos MacOS 9 e OS X, o melhor é criar partições separadas para o OS 9 e OS X. Se estiverem instalados na mesma partição, deve ser utilizado o <application>Startup Disk</application> (e reiniciar) para escolher entre os dois; a escolha entre os dois sistemas não pode ser feita durante o arranque. Com partições separadas, aparecerão opções em separado para OS 9 e OS X quando pressionar a tecla <keycap>option</keycap> durante o arranque, e opções em separado também podem ser instaladas no menu de arranque de <application>yaboot</application>. Além disso, o Startup Disk irá tirar a benção a outras partições que possam ser montadas, o que pode afectar o arranque de GNU/Linux. As partições de ambos OS 9 e OS X serão acessíveis quer a partir de OS 9 ou de OS X.
ru: Если вы планируете установить сразу MacOS 9 и OS X, то лучше создать отдельный раздел для каждой из нихi. Если они установлены на одном разделе, то для выбора одной из них нужно воспользоваться <application>Startup Disk</application> (и перезагрузка); выбор из двух систем нельзя сделать во время загрузки. В случае отдельных разделов, появятся раздельные пункты для OS 9 и OS X, если удерживать клавишу <keycap>option</keycap> во время загрузки, и отдельный пункт можно установить в меню загрузки <application>yaboot</application>. Также, Startup Disk не показывает все остальные загружабельные разделы , которые могут повлиять на загрузку GNU/Linux. Оба раздела OS 9 и OS X доступны и из OS 9 и из OS X.
zh_cn: 如果您计划同时安装 MacOS 9 与 OS X，最好为 OS 9 和 OS X 创建不同的分区。如果将它们安装在同一分区，就必须使用 <application>Startup Disk</application> (并重启)来选择它们两个，而在启动时是无法对两个操作系统进行选择的。使用不同的分区，如果在启动时按住 <keycap>option</keycap> 键就可以显示出 OS 9 和 OS X 两个不同的选项，而且这些分开的选项也可以被安装到 <application>yaboot</application> 启动菜单里面。还有，Startup Disk 将无法保证其他可挂载的分区的可靠性，这可能会影响 GNU/Linux 启动。OS 9 和 OS X 分区从 OS 9 和 OS X 中都能访问。
zh_tw: 如果您計劃同時安裝 MacOS 9 與 OS X，最好為 OS 9 和 OS X 建立不同的分割區。如果將它們安裝在同一分割區，就必須使用 <application>Startup Disk</application> (並重啟) 來選擇它們兩個，而在開機時是無法對兩個作業系統進行選擇的。使用不同的分割區時，如果在開機時按住 <keycap>option</keycap> 鍵就可以顯示出 OS 9 和 OS X 兩個不同的選項，而且這些分開的選項也可以被安裝到 <application>yaboot</application> 開機選單裡面。還有，Startup Disk 將無法保證其他可掛載的分割區的可靠性，這可能會影響 GNU/Linux 的開機。從 OS 9 和 OS X 中都能讀取OS 9 和 OS X 分割區。
