Repository: xobs/debian-installer
Catalog: doc/manual/po/*/preparing.po
Languages: el, ko, pt, ru, zh_cn, zh_tw

source: GNU/Linux is unable to access information on UFS partitions, but does support HFS+ (aka MacOS Extended) partitions. OS X requires one of these two types for its boot partition. MacOS 9 can be installed on either HFS (aka MacOS Standard) or HFS+. To share information between the MacOS and GNU/Linux systems, an exchange partition is handy. HFS, HFS+ and MS-DOS FAT partitions are supported by both MacOS and Linux.
el: To GNU/Linux δεν μπορεί να προσπελάσει πληροφορία σε ένα σύστημα αρχείων UFS, αλλά υποστηρίζει κατατμήσεις HFS+ (γνωστό και σαν MacOS Extended). Το OS X απαιτεί έναν από τους δυο αυτούς τύπους για την εκκινήσιμη κατάτμησή του. Το MacOS μπορεί να εγκατασταθεί είτε σε μια κατάτμηση HFS (γνωστό και σαν MacOS Standard) ή και HFS+. Για το μοίρασμα πληροφορίας ανάμεσα στα συστήματα MacOS και GNU/Linux είναι βολική μια κοινή κατάτμηση ανταλλαγής. Κατατμήσεις με HFS, HFS+ και MS-DOS FAT υποστηρίζονται και από το MacOS και από το Linux.
ko: GNU/리눅스는 UFS 파티션에 있는 정보를 접근할 수 없습니다, 그러나 HFS+ (다른 말로 MacOS Extended)는 지원합니다.. OS X는 부팅 파티션에 이 두가지 중의 하나의 파일시스템을 써야 합니다. MacOS 9은 HFS에 (다른 말로 MacOS Standard) 설치할 수도 있고 HFS+에 설치할 수도 있습니다. MacOS와 GNU/리눅스 시스템 사이에 정보를 공유하려면, 데이터 교환용 파티션을 만드는 게 편리합니다. HFS,HFS+와 MS-DOS FAT 파티션은 MacOS와 리눅스 모두에서 지원합니다.
pt: GNU/Linux não consegue aceder à informação em partições UFS, mas suporta partições HFS+ (aka MacOS Extended). O OS X precisa de um destes dois tipos para a partição de arranque. MacOS 9 pode ser instalado quer em HFS (aka MacOS Standard) ou em HFS+. Para partilhar informação entre os sistemas MacOS e GNU/Linux, é útil ter uma partição para trocas. Partições HFS. HFS+ e MS-DOS FAT são suportadas por ambos MacOS e Linux.
ru: GNU/Linux недоступна информация с HFS+ (так называемый MacOS Extended) или с разделов UFS. OS X требует один из этих типов для своего загрузочного раздела. MacOS 9 можно установить или на HFS (так называемый MacOS Standard) или на HFS+. Чтобы обмениваться информацией между системами MacOS и GNU/Linux, удобно создать раздел для обмена. Разделы HFS и MS-DOS FAT поддерживаются и MacOS и Linux.
zh_cn: GNU/Linux 不能读取 UFS 分区，但支持 HFS+ (又称 MacOS Extended) 分区。OS X 要求使用这两个分区类型之一作为引导分区。MacOS 9 能安装到 HFS (又称 MacOS Standard) 或 HFS+ 上。建一个交换信息分区就可以很方便地在 MacOS 和 GNU/Linux 系统间共享信息。HFS，HFS+ 和 MS-DOS FAT 分区都能被 MacOS 和 Linux 支持。
zh_tw: GNU/Linux 不能讀取 UFS 分割區但是支援 HFS+ 分割區 (又稱 MacOS Extended)。OS X 要求使用這兩個分割區類型之一作為開機分割區。MacOS 9 能安裝到 HFS (又稱 MacOS Standard) 或 HFS+ 上。建一個交換資料分割區就可以很方便地在 MacOS 和 GNU/Linux 系統間共享資訊。HFS 和 MS-DOS FAT 分割區都能被 MacOS 和 Linux 支援。

source: Pre-Installation Hardware and Operating System Setup
el: Ρύθμιση του Υλικού και του Λειτουργικού συστήματος πριν την εγκατάσταση
ko: 설치하기 전에 하드웨어 및 운영 체제 설정
pt: Pré-Instalação do Hardware e Configuração do Sistema Operativo
ru: Настройка аппаратного обеспечения и операционной системы перед установкой
zh_cn: 安装前的硬件和操作系统的相关设置
zh_tw: 安裝前硬體和作業系統的相關設定

source: This section will walk you through pre-installation hardware setup, if any, that you will need to do prior to installing Debian. Generally, this involves checking and possibly changing firmware settings for your system. The <quote>firmware</quote> is the core software used by the hardware; it is most critically invoked during the bootstrap process (after power-up). Known hardware issues affecting the reliability of &debian; on your system are also highlighted.
el: Η ενότητα αυτή θα σας καθοδηγήσει στην ρύθμιση του υλικού σας πριν την εγκατάσταση αν κάτι τέτοιο είναι απαραίτητο πριν εγκαταστήσετε το Debian.Αυτό περιλάμβάνει τον έλεγχο και και πιθανά την αλλαγή κάποιων ρυθμίσεων στο firmware του συστήματός σας. Το <quote>firmware</quote> είναι το βασικό λογισμικό που χρησιμοποιείται από το υλικό του υπολογιστή και η πιο κρίσιμη επίκληση του είναι κατά τη διαδικασία της πρώτης εκκίνησης (bootstrap) μετά το άνοιγμα του υπολογιστή. Γνωστά προβλήματα που επηρρεάζουν την αξιοπιστία του &debian; στο σύστημά σας επίσης τονίζονται.
ko: 여기서는 데비안을 설치하기 전에 해야 할 하드웨어 설정에 대해 (설정이 따로 필요하다면) 다룹니다. 보통 시스템의 펌웨어 설정을 확인하고 필요하다면 설정을 바꾸는 일들입니다. <quote>펌웨어</quote>는 하드웨어가 사용하는 주요 소프트웨어로, 전원을 켠 다음에 부트스트랩 과정에서 반드시 동작합니다. 여러분 시스템에서의 &debian; 안정성과 관련된 하드웨어 문제들도 다룹니다.
pt: Esta secção vai leva-lo através da preparação do hardware da pré-instalação, se existir alguma, que você necessite fazer antes de instalar Debian. Normalmente isto envolve verificar e possivelmente alterar definições no firmware para o seu sistema. O <quote>firmware</quote> é o software mais importante utilizado pelo hardware; é o mais crítico invocado pelo processo de arranque (depois de o ligar). Também são sublinhados alguns casos conhecidos de hardware que afectam a estabilidade de &debian; no seu sistema.
ru: Этот раздел расскажет про аппаратное обеспечение, для которого требуется настройка перед установкой Debian. Обычно, для этого производится проверка и возможно, изменение настроек микропрограммы вашей системы. <quote>Микропрограмма (firmware)</quote> &mdash; это программное обеспечение используемое аппаратным обеспечением; она почти всегда вызывается во время загрузки машины (после подачи питания). Здесь также описаны известные проблемы аппаратного обеспечения, которые влияют на надёжность &debian;.
zh_cn: 在本节中，我们将讨论安装之前有关硬件设置的一些问题。如果这些问题的确存在的话，您就需要在安装 Debian 前先做一些准备工作了。一般来说，准备工作包括：检查固件(firmware) 以及为您的系统修改固件中的设定。所谓<quote>固件</quote>就是硬件运行所需的核心软件。它在系统引导过程(即开机之后)中起到了至关重要的作用。我们同时也会着重提出一些硬件问题，您系统上这些硬件问题在将会影响到 &debian; 的可靠性。
zh_tw: 在本節中，我們將討論安裝之前有關硬體設定的一些問題。如果這些問題的確存在，您就需要在安裝 Debian 前先做一些準備工作了。一般來說，準備工作包括：檢查韌體(firmware)以及為您的系統修改韌體中的設定。所謂<quote>韌體</quote>就是硬體運行所需的核心軟體。它在系統開機過程中有至關重要的作用。我們同時也會著於重提出一些硬體問題，您系統上這些硬體問題在將會影響到 &debian; 的可靠性。

source: Invoking the BIOS Set-Up Menu
el: Κλήση του BIOS Set-Up Menu
ko: BIOS 설정 메뉴 들어가기
pt: Invocar o Menu de Configuração da BIOS
ru: Вызов меню настройки BIOS
zh_cn: BIOS 设置菜单的使用
zh_tw: 使用 BIOS 設定選單

source: BIOS provides the basic functions needed to boot your machine to allow your operating system to access your hardware. Your system probably provides a BIOS set-up menu, which is used to configure the BIOS. Before installing, you <emphasis>must</emphasis> ensure that your BIOS is setup correctly; not doing so can lead to intermittent crashes or an inability to install Debian.
el: Το BIOS παρέχει τις βασικές λειτουργίες που χρειάζονται για την εκκίνηση του μηχανήματός σας ώστε με τη σειρά του να επιτρέψει στο λειτουργικό σύστημα να έχει πρόσβαση στο υλικό σας. Πιθανότατα το σύστημά σας παρέχει ένα μενού ρύθμισης του BIOS που χρησιμεύει στη διαμόρφωση του. Πριν εγκαταστήσετε το Debian θα <emphasis>must</emphasis> να βεβαιωθείτε ότι το BIOS σας έχει ρυθμιστεί σωστά. Αν δεν το κάνετε αυτό μπορεί να οδηγήσει το σύστημα σε απρόβλεπτες διακοπές ή σε μια αδυναμία εγκατάστασης του Debian.
ko: BIOS는 기계를 부팅시키고 운영 체제에서 하드웨어를 접근하도록 하는 기본적인 기능들이 들어 있습니다. 시스템에서 BIOS 설정 메뉴가 있으면, 그 메뉴를 이용해 BIOS를 설정할 수 있습니다. 설치하기 전에, BIOS를 제대로 설정했는 지 확인해야 <emphasis>합니다</emphasis>. 그렇지 않으면 갑자기 멈출 수도 있고 데비안을 설치하지 못할 수도 있습니다.
pt: A BIOS disponibiliza as funções básicas necessárias para arrancar a sua máquina e permitir ao seu sistema operativo aceder ao seu hardware. Provavelmente o seu sistema disponibiliza um menu, que é utilizado para configurar a BIOS. Antes de instalar, você <emphasis>tem</emphasis> de assegurar-se que a BIOS está correctamente configurada; se não o fizer pode levar a bloqueios intermitentes ou a não poder instalar Debian.
ru: BIOS предоставляет основные функции, необходимые для загрузки машины, чтобы позволить операционной системе получить доступ к оборудованию. Обычно система для конфигурирования BIOS предоставляет меню настройки. Перед установкой вы <emphasis>должны</emphasis> убедиться, что ваш BIOS корректно настроен; невыполнение этого может вызвать случайные сбои или невозможность установки Debian.
zh_cn: BIOS 为引导您的机器提供了基本的帮助，进而能让您的操作系统能访问您的硬件。您的系统应该会有 BIOS 的设置菜单，通过它，我们就能配置 BIOS。在进行安装 前，您 <emphasis>一定要</emphasis> 确保您 BIOS 的设置是正确无误的。否则，可能会导致经常性的系统崩溃或者根本无法安装 Debian。
zh_tw: BIOS 為啟動您的機器提供了基本的幫助，進而能讓您的作業系統能存取您的硬體。您的系統應該會有 BIOS 的設定選單，透過它，我們就能配置 BIOS。在進行安裝前，您<emphasis>一定要</emphasis>確保您 BIOS 的設置是正確無誤的。否則，可能會導致經常性的系統當機或者根本無法安裝 Debian。

source: The rest of this section is lifted from the <ulink url="&url-pc-hw-faq;"></ulink>, answering the question, <quote>How do I enter the CMOS configuration menu?</quote>. How you access the BIOS (or <quote>CMOS</quote>) configuration menu depends on who wrote your BIOS software:
el: Η υπόλοιπη ενότητα έχει προέλθει από το <ulink url="&url-pc-hw-faq;"></ulink>,που απαντά στην ερώτηση <quote>Πώς μπαίνουμε στο μενού ρύθμισης του CMOS</quote>. Η πρόσβαση στο μενού ρύθμισης του BIOS (ή του <quote>CMOS</quote>) εξαρτάται από το ποιός έγραψε το λογισμικό του BIOS:
ko: 이 장의 나머지 부분은 <ulink url="&url-pc-hw-faq;"></ulink>에서 가져온 <quote>어떻게 CMOS 설정 메뉴로 들어가는가?</quote>라는 질문에 대한 답입니다. BIOS (아니면 <quote>CMOS</quote>) 설정 메뉴에 들어가는 방법은 BIOS 소프트웨어를 만든 회사에 따라 다릅니다.
pt: O resto desta secção é levantada a partir do <ulink url="&url-pc-hw-faq;"></ulink>, respondendo à questão, <quote>Como é que entro no menu de configuração da CMOS?</quote>. Como aceder ao menu da BIOS (ou <quote>CMOS</quote>) depende de quem escreveu o software da BIOS:
ru: Остаток главы взят из <ulink url="&url-pc-hw-faq;"></ulink> и отвечает на вопрос, <quote>Как мне войти в меню настройки CMOS?</quote>. Как получить доступ в меню настройки BIOS (или <quote>CMOS</quote>), зависит от производителя программы BIOS:
zh_cn: 本节接下来的部分取自 <ulink url="&url-pc-hw-faq;"></ulink>中对<quote>如何进入 CMOS 设置菜单</quote>一问的回答。您怎样才能进入 BIOS(或<quote>CMOS</quote>) 设置菜单取决于 BIOS 软件的作者是谁：
zh_tw: 本節接下來的部分取自 <ulink url="&url-pc-hw-faq;"></ulink> 中對<quote>如何進入CMOS 設定選單</quote>一問的回答。您怎樣才能進入 BIOS(或<quote>CMOS</quote>) 設定選單取決於 BIOS 軟體的作者是誰：

source: <keycap>Delete</keycap> key during the POST (power on self test)
el: Πλήκτρο <keycap>Delete</keycap> κατά τη διάρκεια του POST (power on self test)
ko: POST (power on self test, 최초 테스트) 도중에 <keycap>Delete</keycap> 키
pt: tecla <keycap>Delete</keycap> durante o POST (Power On Self Test)
ru: Клавиша <keycap>Delete</keycap> во время POST (power on self test, самотестирование при включении питания)
zh_cn: <keycap>Delete</keycap> 键，在 POST(开机自检) 过程中
zh_tw: 在 POST (開機自檢) 過程中按 <keycap>Delete</keycap> 鍵

source: <keycombo> <keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>Esc</keycap> </keycombo>, or <keycap>Delete</keycap> key during the POST
el: <keycombo> <keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>Esc</keycap> </keycombo>, ή <keycap>Delete</keycap> στη διάρκεια του POST
ko: POST 도중에 <keycombo> <keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>Esc</keycap> </keycombo>, 아니면 <keycap>Delete</keycap> 키
pt: <keycombo> <keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>Esc</keycap> </keycombo>, ou <keycap>Delete</keycap> durante o POST
ru: Клавиши <keycombo> <keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>Esc</keycap> </keycombo> или <keycap>Delete</keycap> во время POST
zh_cn: <keycombo> <keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>Esc</keycap> </keycombo>，或 <keycap>Delete</keycap>键，在 POST 过程中
zh_tw: 在 POST 過程中按 <keycombo> <keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>Esc</keycap> </keycombo>，或 <keycap>Delete</keycap>鍵

source: <keycap>Esc</keycap> key during the POST
el: πλήκτρο <keycap>Esc</keycap> στη διάρκεια του POST
ko: POST 도중에 <keycap>Esc</keycap> 키
pt: tecla <keycap>Esc</keycap> key durante o POST
ru: Клавиша <keycap>Esc</keycap> во время POST
zh_cn: <keycap>Esc</keycap>键，在 POST 过程中
zh_tw: 在 POST 過程中按 <keycap>Esc</keycap>鍵

source: <keycombo> <keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>Insert</keycap> </keycombo> after <keycombo> <keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>Delete</keycap> </keycombo>
el: <keycombo> συνδυασμός πλήκτρων <keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>Insert</keycap> </keycombo> after <keycombo> <keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>Delete</keycap> </keycombo>
ko: <keycombo> <keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>Delete</keycap> </keycombo> 다음에 <keycombo> <keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>Insert</keycap> </keycombo>
pt: <keycombo> <keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>Insert</keycap> </keycombo> seguido de <keycombo> <keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>Delete</keycap> </keycombo>
ru: <keycombo> <keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>Insert</keycap> </keycombo> после <keycombo> <keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>Delete</keycap> </keycombo>
zh_cn: <keycombo> <keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>Insert</keycap> </keycombo> 在按下面的组合键之后 <keycombo> <keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>Delete</keycap> </keycombo>
zh_tw: <keycombo> <keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>Insert</keycap> </keycombo> 在按下面的組合鍵之後 <keycombo> <keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>Delete</keycap> </keycombo>

source: <keycombo> <keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>Esc</keycap> </keycombo> or <keycombo> <keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>S</keycap> </keycombo> or <keycap>F1</keycap>
el: <keycombo>συνδυασμός πλήκτρων <keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>Esc</keycap> </keycombo> ή <keycombo> <keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>S</keycap> </keycombo> ή <keycap>F1</keycap>
ko: <keycombo> <keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>Esc</keycap> </keycombo> 아니면 <keycombo> <keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>S</keycap> </keycombo> 아니면 <keycap>F1</keycap>
pt: <keycombo> <keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>Esc</keycap> </keycombo> ou <keycombo> <keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>S</keycap> </keycombo> ou <keycap>F1</keycap>
ru: <keycombo> <keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>Esc</keycap> </keycombo> или <keycombo> <keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>S</keycap> </keycombo> или <keycap>F1</keycap>
zh_cn: <keycombo> <keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>Esc</keycap> </keycombo> 或 <keycombo> <keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>S</keycap> </keycombo> 或 <keycap>F1</keycap>
zh_tw: <keycombo> <keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>Esc</keycap> </keycombo> 或 <keycombo> <keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>S</keycap> </keycombo> 或 <keycap>F1</keycap>

source: Information on invoking other BIOS routines can be found in <ulink url="&url-invoking-bios-info;"></ulink>.
el: Πληροφορίες για την επίκληση άλλων ρουτινών του BIOS μπορούν να βρεθούν στο <ulink url="&url-invoking-bios-info;"></ulink>.
ko: 다른 BIOS를 실행하는 방법에 대한 정보는 <ulink url="&url-invoking-bios-info;"></ulink>에 있습니다.
pt: Informações de como invocar outras rotinas da BIOS podem ser encontradas em <ulink url="&url-invoking-bios-info;"></ulink>.
ru: Информацию о процедуре вызовы других BIOS можно найти в <ulink url="&url-invoking-bios-info;"></ulink>.
zh_cn: 若希望知道有关 BIOS 其它功能和设置的信息，您可以参阅 <ulink url="&url-invoking-bios-info;"></ulink>。
zh_tw: 若希望知道有關 BIOS 其它功能和設定的相關資料，您可以參閱 <ulink url="&url-invoking-bios-info;"></ulink>。

source: Some &arch-title; machines don't have a CMOS configuration menu in the BIOS. They require a software CMOS setup program. If you don't have the Installation and/or Diagnostics diskette for your machine, you can try using a shareware/freeware program. Try looking in <ulink url="&url-simtel;"></ulink>.
el: Μερικά μηχανήματα &arch-title; δεν έχουν ένα μενού ρύθμισης του CMOS στο BIOS. Απαιτούν ένα πρόγραμμα ρύθμισης του CMOS. Αν δεν έχετε τη δισκέττα εγκατάστασης και/ή διαγνωστικών για το μηχάνημά σας, μπορείτε να προσπαθήσετε να χρησιμοποιήσετε ένα πρόγραμμα shareware/freeware. Προσπαθείστε να κοιτάξετε το <ulink url="&url-simtel;"></ulink>.
ko: 일부 &arch-title; 기계에는 BIOS에 CMOS 설정 메뉴가 없습니다. 소프트웨어 CMOS 설정 프로그램이 필요합니다. 해당 기계의 설치 및/혹은 진단 디스켓이 없다면, 셰어웨어/프리웨어 프로그램을 사용해 볼 수 있습니다. <ulink url="&url-simtel;"></ulink> 사이트를 살펴 보십시오.
pt: Algumas máquinas !POXML_AMP!arch-title; não têm menu de configuração da CMOS na BIOS. Estes requerem um programa de configuração da CMOS. Se você não tiver nenhuma disquete de Instalação e/ou de Diagnósticos para a sua máquina, pode tentar utilizar um programa shareware/freeware. Tente procurar em <ulink url="&url-simtel;"></ulink>.
ru: Некоторые машины &arch-title; не содержат меню настройки CMOS в BIOS. Им необходимо программное обеспечение для настройки CMOS. Если у вас нет установочной и/или диагностической дискеты для машины, можете попробовать использовать shareware/freeware программу. Попытайтесь поискать на <ulink url="&url-simtel;"></ulink>.
zh_cn: 有些 &arch-title; 架构的机器在 BIOS 中没有附带 CMOS 设置菜单。要对它们进行设置，就需要有相应的 CMOS 设置软件。如果您没有与您机器对应的安装或者诊断盘片，那么您不妨试一下共享软件或自由软件。请去以下网址找找看 <ulink url="&url-simtel;"></ulink>。
zh_tw: 有些 &arch-title; 架構的機器在 BIOS 中沒有包含 CMOS 設定選單。要對它們進行設定，就需要有相應的 CMOS 設定軟體。如果您沒有與您機器對應的安裝或者診斷磁片，那麼您不妨試一下共享軟體或自由軟體。請去以下網址找找看 <ulink url="&url-simtel;"></ulink>。

source: Boot Device Selection
el: Επιλογή συσκευής εκκίνησης
ko: 부팅 장치 선택
pt: Selecção de Dispositivo Para Arranque
ru: Выбор загрузочного устройства
zh_cn: 选择引导设备
zh_tw: 選擇開機設備

source: Many BIOS set-up menus allow you to select the devices that will be used to bootstrap the system. Set this to look for a bootable operating system on <filename>A:</filename> (the first floppy disk), then optionally the first CD-ROM device (possibly appearing as <filename>D:</filename> or <filename>E:</filename>), and then from <filename>C:</filename> (the first hard disk). This setting enables you to boot from either a floppy disk or a CD-ROM, which are the two most common boot devices used to install Debian.
el: Πολλά μενού ρύθμισης του BIOS σας επιτρέπουν να επιλέξετε τις συσκευές που θα χρησιμοποιηθούν για την αρχική εκκίνηση του συστήματος. Θέστε σαν τέτοιο ένα εκκινήσιμο λειτουργικό σύστημα σε <filename>A:</filename> (την πρώτη συσκευή δισκέττας) και μετά προαιρετικά την πρώτη συσκευή CD-ROM (πιθανόν να εμφανίζεται σαν <filename>D:</filename> or <filename>E:</filename>) και στη συνέχεια από το <filename>C:</filename> (τον πρώτο σκληρό δίσκο). Η ρύθμιση αυτή σας επιτρέπει να εκκινήσετε είτε από μια δισκέττα είτε από ένα CD-ROM, που είναι και οι δυο πιο συνηθισμένες συσκευές εκκίνησης για την εγκατάσταση του Debian.
ko: 많은 BIOS의 설정 메뉴에서는 시스템을 부팅하는 데 쓸 장치를 선택할 수 있습니다. 여기에서 <filename>A:</filename>에서 운영 체제를 부팅하도록 설정하고, 그 다음에 첫 번째 CD-ROM 장치로 (아마도 <filename>D:</filename>나 <filename>E:</filename>) 하고, 그 다음에 <filename>C:</filename>로 (첫 번째 하드 디스크) 설정하십시오. 이렇게 설정하면 플로피 디스크나 CD-ROM에서 부팅합니다. 대부분 데비안을 부팅할 때 이 둘 중의 하나에서 부팅합니다.
pt: Os menus de configuração de muitas BIOS permitem-lhe seleccionar os dispositivos utilizados para o arranque do sistema. Defina esta opção para procurar um sistema operativo de arranque em <filename>A:</filename> (a primeira drive de disquetes), e depois como opção o primeiro dispositivo de CD-ROM (possivelmente aparece como <filename>D:</filename> ou <filename>E:</filename>), e depois a partir de <filename>C:</filename> (o primeiro disco rígido). Estas definições permitem-lhe arrancar a partir de uma disquete ou CD-ROM, que são os dois dispositivos de arranque mais comuns utilizados para instalar Debian.
ru: Многие меню настройки BIOS позволяют выбрать устройство, с которого будет загружаться система. Настройте этот параметр так, чтобы сначала операционная система пыталась загрузиться с <filename>A:</filename> (первый дисковод гибких дисков), затем, необязательно, с привода CD-ROM (вероятно, называется <filename>D:</filename> или <filename>E:</filename>) и затем с <filename>C:</filename> (первый жёсткий диск). Такая настройка позволит вам загрузиться или с дискеты или с CD-ROM, которые являются двумя наиболее распространёнными загрузочными устройствами, используемыми для установки Debian.
zh_cn: 许多 BIOS 的设置菜单都能让您选择用来引导系统的设备。我们来设置一下，让它先在 <filename>A:</filename> (第一个软驱)中找寻可引导的操作系统，不行的话，再在第一个 CD-ROM 设备(有可能就是 <filename>D:</filename> 或 <filename>E:</filename>)中找，然后接着在 <filename>C:</filename>(第一块硬盘)找。照这样设定的话，就能让您从软盘或者 CD-ROM 引导。这是安装 Debian 最常用的两个引导设备。
zh_tw: 許多 BIOS 的設定選單都能讓您選擇啟動系統的設備。讓它先在 <filename>A:</filename> (第一個軟碟機) 中找尋可開機的作業系統，不行的話，再在到第一個光碟機設備 (有可能就是 <filename>D:</filename> 或 <filename>E:</filename>) 中尋找，然後接著在 <filename>C:</filename>(第一塊硬碟)尋找。照這樣設定的話，就能讓您從軟碟或者光碟機開機。這是安裝 Debian 最常用的兩個開機設備。

source: If you have a newer SCSI controller and you have a CD-ROM device attached to it, you are usually able to boot from the CD-ROM. All you have to do is enable booting from a CD-ROM in the SCSI-BIOS of your controller.
el: Αν έχετε έναν πιο καινούριο ελεγκτή SCSI και μια συσκευή CD-ROM προσαρτημένη σε αυτόν θα είστε σε θέση συνήθως να εκκινήσετε από αυτήν. Το μόνο που έχετε να κάνετε είναι να ενεργοποιήσετε την εκκίνηση από CD-ROM στο SCSI-BIOS του ελεγκτή σας.
ko: 최신의 SCSI 컨트롤러가 있고 SCSI에 CD-ROM 장치가 붙어 있다면 보통 CD-ROM에서 부팅할 수 있을 것입니다. 해야 되는 일은 컨트롤러의 SCSI BIOS에서 CD-ROM 부팅을 켜는 일 뿐입니다.
pt: Se você possuir um controlador SCSI recente e tiver um dispositivo de CD-ROM ligado a ele, normalmente você conseguirá arrancar a partir do CD-ROM. Tudo o que tem de fazer é permitir o arranque a partir de CD-ROM na BIOS do seu controlador SCSI.
ru: Если у вас новый SCSI контроллер и к нему подключён привод CD-ROM, то обычно, возможна загрузка с этого CD-ROM. Всё, что нужно сделать, это разрешитьзагрузку с CD-ROM в SCSI-BIOS контроллера.
zh_cn: 如果您有较新型号的 SCSI 控制器，而且您的 CD-ROM 是接在它上面的，那么您很可能 可以从这个 CD-ROM 引导。您所要做的仅仅是在您的控制器的 SCSI-BIOS 的设置中 允许从 CD-ROM 引导系统。
zh_tw: 如果您有較新型號的 SCSI 控制器，而且您的光碟機是接在它上面的，那麼您很可能 可以從這個光碟機開機。您所要做的僅僅是在您的控制器的 SCSI-BIOS 的設置中允許從光碟機啟動系統。

source: Other popular option is to boot from a USB storage (also called USB memory stick or USB key). Some BIOSes can boot USB storage directly, and some cannot. You may need to configure your BIOS to boot from a <quote>Removable drive</quote> or even a <quote>USB-ZIP</quote> to get it to boot from the USB device.
el: Μια άλλη δημοφιλής επιλογή είναι η εκκίνηση από ένα σύστημα αποθήκευσης USB (γνωστό και σαν USB stick μνήμης ή κλειδί USB). Μερικά BIOS μπορούν να εκκινήσουν μια τέτοια συσκευή USB κατευθείαν ενώ κάποια άλλα όχι. Ίσως πρέπει να ρυθμίσετε το BIOS σας να ξεκινά από ένα <quote>Removable drive</quote> ή ακόμα και από ένα <quote>USB-ZIP</quote> για να πετύχετε εκκίνηση από τη συσκευή USB.
ko: 그 밖의 많이 쓰는 옵션으로, USB 저장 장치에서 (USB 메모리나 USB 키라고도 함) 부팅하는 옵션입니다. 어떤 BIOS에서는 USB 저장 장치에서 직접 부팅할 수 있고, 그렇지 않은 BIOS도 있습니다. BIOS를 설정해서 <quote>Removable drive</quote> 혹은 <quote>USB-ZIP</quote>에서 부팅하도록 하면 USB 장치에서 부팅합니다.
pt: Outra opção popular é arrancar a partir de armazenamento USB (também chamado memory stick ou chave USB). Algumas BIOS podem iniciar directamente a partir de armazenamento USB, e outras não podem. Você pode ter de configurar a sua BIOS para arrancar a partir de <quote>Removable Drive</quote> ou mesmo de <quote>USB-ZIP</quote> para que arranque a partir do dispositivo USB.
ru: Другой популярный параметр &mdash; загрузка с накопителя USB (также называемого как карта памяти USB или ключ USB). Некоторые BIOS могут загружать систему непосредственно с накопителя USB, а некоторые нет. Вам может потребоваться настроить BIOS на загрузку с <quote>Removable drive</quote> или даже с <quote>USB-ZIP</quote>, чтобы загрузиться с USB устройства.
zh_cn: 另外一个常见的选项是从 USB 存储器(也叫 USB 记忆棒或者 U 盘)引导。有些 BIOS 支持从 USB 存储器直接引导，而有的 BIOS 不行。如果要从 USB 设备引导系统的话，您可能需要在 BIOS 设置中，让系统从 <quote>Removable drive</quote> 或者 <quote>USB-ZIP</quote> 引导。
zh_tw: 另外一個常見的選項是從 USB 隨身碟設備 (也叫 USB 隨身碟或者大姆碟)開機。有些 BIOS 支援從 USB 隨身碟設備直接開機，有的則不行。如果要從 USB 設備啟動系統的話，您可能需要在 BIOS 設定中，讓系統從 <quote>Removable drive</quote> 或者 <quote>USB-ZIP</quote> 開機。
