Repository: xobs/debian-installer
Catalog: doc/manual/po/*/preparing.po
Languages: el, ko, pt, ru, zh_cn, zh_tw

source: Apparently, whenever you create or resize a partition for DOS use, it's a good idea to fill the first few sectors with zeros. Do this prior to running DOS's <command>format</command> command, from Linux:
el: Κατά τα φαινόμενα, όποτε δημιουργείτε ή αλλάζετε το μέγεθος σε μια κατάτμηση για χρήση με DOS, είναι καλή ιδέα να γεμίσετε λίγους από τους πρώτους τομείς με μηδενικά! Κάντε κάτι τέτοιο πριν τρέξετε την εντολή του DOS <command>format</command> κι ενώ είστε στο Linux:
ko: DOS에 사용할 파티션을 만들거나 파티션 크기를 변경한 경우, 처음 섹터 몇 개를 0으로 채워 넣는 게 좋습니다. DOS에서 <command>format</command> 명령어를 실행하기 전에 하십시오. 리눅스에서:
pt: Aparentemente, quando você criar ou redimensionar uma partição para utilizar com o DOS, é uma boa ideia encher os primeiros sectores com zeros. Faça isto antes de correr o <command>format</command> do DOS, a partir de Linux:
ru: Очевидно, что при создании или изменении размера раздела для использования в DOS, хорошей идеей будет заполнить несколько первых секторов нулями. Сделайте это из Linux перед запуском DOS-вой команды <command>format</command>:
zh_cn: 显然，当您为 DOS 新建分区或者改动分区大小时，最好总是把第一个扇区全部清零。在运行 DOS 的 <command>format</command> 命令之前，在 Linux 系统中，像这样做：
zh_tw: 顯然地，當您為 DOS 建立新分割區或者更動分割區大小時，最好總是把第一個磁區全部清除為零。執行 DOS 的 <command>format</command> 指令之前，於 Linux 系統中，請這麼做：

source: Partitioning in AmigaOS
el: Κατάτμηση σε AmigaOS
ko: AmigaOS에서 파티션하기
pt: Particionar em AmigaOS
ru: Разметка в AmigaOS
zh_cn: 在 AmigaOS 下分区
zh_tw: AmigaOS 下的分割

source: If you are running AmigaOS, you can use the <command>HDToolBox</command> program to adjust your native partitions prior to installation.
el: Αν τρέχετε AmigaOS, μπορείτε να χρησιμοποιήσετε το πρόγραμμα <command>HDToolBox</command> για να προσαρμόσετε τις αρχικές σας κατατμήσεις πριν την εγκατάσταση.
ko: AmigaOS를 사용한다면, 설치하기 전에 <command>HDToolBox</command> 프로그램으로 파티션을 조정할 수 있습니다.
pt: Se está a executar AmigaOS, você pode utilizar o programa <command>HDToolBox</command> para ajustar as suas partições nativas antes da instalação.
ru: Если вы запускаете AmigaOS, то можете использовать программу <command>HDToolBox</command> для изменения существующих разделов перед установкой.
zh_cn: 如果您运行 AmigaOS，您可以使用 <command>HDToolBox</command> 程序在安装之前调整您的分区。
zh_tw: 如果您執行 AmigaOS，您可以使用 <command>HDToolBox</command> 程式在安裝之前調整您的分割區。

source: Partitioning in Atari TOS
el: Κατάτμηση σε Atari TOS
ko: Atari TOS에서 파티션하기
pt: Particionar em Atari TOS
ru: Разметка в Atari TOS
zh_cn: 在 Atari TOS 下分区
zh_tw: Atari TOS 下的分割

source: Atari partition IDs are three ASCII characters, use <quote>LNX</quote> for data and <quote>SWP</quote> for swap partitions. If using the low memory installation method, a small Minix partition is also needed (about 2 MB), for which the partition ID is <quote>MNX</quote>. Failure to set the appropriate partition IDs not only prevents the Debian installation process from recognizing the partitions, but also results in TOS attempting to use the Linux partitions, which confuses the hard disk driver and renders the whole disk inaccessible.
el: Τα διακριτικά ID στο Atari για τις κατατμήσεις είναι τρεις ASCII χαρακτήρες. Χρησιμοποιήστε <quote>LNX</quote> για δεδομένα και <quote>SWP</quote> για κατάτμηση swap. Αν χρησιμοποιήσετε την μέθοδο εγκατάστασης με λίγη μνήμη θα χρειαστείτε επίσης μια μικρή κατάτμηση Minix (περίπου 2 MB) για την οποία το ID είναι <quote>MNX</quote>. Αποτυχία να βάλετε σωστά τα ID των κατατμήσεων όχι μόνο εμποδίζει τη διαδικασία εγκατάστασης του Debian αλλά επιπλέον έχει σαν αποτέλεσμα να προσπαθεί το TOS να χρησιμοποιήσει τις κατατμήσεις του Linux, γεγονός που μπερδεύει τον οδηγό του δίσκου και καθιστά τον ίδιο το δίσκο μη προσβάσιμο.
ko: Atari 파티션 ID는 세 개의 ASCII 문자로 되어 있습니다. 데이터는 <quote>LNX</quote>를 사용하고 스왑은 <quote>SWP</quote>를 사용하십시오. 메모리가 적은 설치 방법을 이용한다면, 작은 Minix 파티션도 필요합니다 (약 2MB). 이 파티션의 ID는 <quote>MNX</quote>입니다. 올바른 파티션 ID를 설정해 놓지 않으면 데비안을 설치할 때 파티션을 인식하지 못할 뿐만 아니라, TOS에서 리눅스 파티션을 사용하게 되서, 하드 디스크 드라이버에 혼란을 일으키고 전체 디스크를 사용할 수 없게 됩니다.
pt: Os IDs das partições de Atari são três caracteres ASCII, utilize <quote>LNX</quote> para dados e <quote>SWP</quote> para partições swap. Se está a utilizar o método de instalação de pouca memória, também é necessária uma pequena partição de Minix (cerca de 2 MB), para a qual o ID da partição é <quote>MNX</quote>. A não definição dos IDs apropriados fará com que o processo de instalação de Debian não reconheça as partições, mas resulta também na tentativa do TOS tentar utilizar as partições de Linux, o que irá confundir o controlador do disco rígido e tornar todo o disco inacessível.
ru: ID разделы Atari состоят из трёх ASCII символов, для данных используется <quote>LNX</quote>, для разделов подкачки <quote>SWP</quote>. Если используется метод установки с пониженным потреблением памяти, то также нужен маленький Minix раздел (около 2МБ), ID раздел которого помечается как <quote>MNX</quote>. Неправильная установка нужного ID не только повлиет на процесс установки Debian (не распознаются разделы), но и в результате при попытке TOS использовать Linux разделы собьёт с толку драйвер жёсткого диска и приведёт к недоступности всего диска.
zh_cn: Atari 的分区 ID 是三个 ASCII 字符，<quote>LNX</quote>用于数据，<quote>SWP</quote>用于交换分区。如果使用小内存安装方式，还需要一个小的 Minix 分区(大约 2MB)，它的 ID 是<quote>MNX</quote>。错误的设置分区 ID 不仅会因为 Debian 无法识别分区而中断安装进程，还会造成 TOS 使用 Linux 分区，让硬盘驱动程序混乱，使得整个磁盘无法访问。
zh_tw: Atari 的分割區 ID 是三個 ASCII 字元，<quote>LNX</quote> 用於資料，<quote>SWP</quote> 用於置換分割區。如果使用小記憶體安裝方式，還需要一個小的 Minix 分割區(大約 2MB)，它的 ID 是``MNX''。錯誤的分割區 ID 不僅會因為 Debian 無法識別分割區而中斷安裝進程，還會造成 TOS 使用 Linux 分割區，讓硬碟驅動程式混亂，使得整個磁碟無法使用。

source: There are a multitude of third party partitioning tools available (the Atari <command>harddisk</command> utility doesn't permit changing the partition ID); this manual cannot give detailed descriptions for all of them. The following description covers <command>SCSITool</command> (from Hard+Soft GmBH).
el: Υπάρχει αρκετα ανεξάρτητα εργαλεία διαμέρισης διαθέσιμα (το βοηθητικό πρόγραμμα του Atari <command>harddisk</command> δεν επιτρέπει την αλλαγή του ID της κατάτμησης). Δεν μπορούμε να δώσουμε στο εγχειρίδιο αυτό αναλυτική περιγραφή για το καθένα από αυτά. Η περιγραφή που ακολουθεί καλύπτει το <command>SCSITool</command> (από την εταιρεία Hard+Soft GmBH).
ko: 아주 많은 써드파티 파티션 도구가 있습니다. (Atari <command>harddisk</command> 유틸리티에서는 파티션 ID를 바꿀 수 없습니다) 이 매뉴얼에서는 그 도구들을 모두 설명하지 않습니다. 다음 설명은 (Hard+Soft GmBH에서 만든) <command>SCSITool</command>에 관해서 다룹니다.
pt: Existem muitos utilitários de particionamento de terceiros (o comando do utilitário Atari <command>harddisk</command> não permite modificar o ID das partições); este manual não pode dar uma descrição detalhada de todos eles. As seguintes descrições cobrem <command>SCSITool</command> (da Hard+Soft GmBH).
ru: Существует множество инструментов разметки сторонних разработчиков (утилита Atari <command>harddisk</command> не позволяет изменять ID раздела); это руководство не приводит подробное описание всех. Здесь дано описание<command>SCSITool</command> (от Hard+Soft GmBH).
zh_cn: 有很多第三方的分区工具(Atari <command>harddisk</command> 工具不允许修改分区 ID)，本手册无法对它们都进行详细说明。下面的说明涵盖了 <command>SCSITool</command> (来自 Hard+Soft GmBH)。
zh_tw: 有很多第三方的分割工具(Atari <command>harddisk</command> 工具不允許修改分割區 ID)，本手冊無法對它們進行詳細說明。下面為 <command>SCSITool</command> (來自 Hard+Soft GmBH)的說明。

source: Start <command>SCSITool</command> and select the disk you want to partition (<guimenu>Disk</guimenu> menu, item <guimenuitem>select</guimenuitem>).
el: Ξεκινήστε το πρόγραμμα <command>SCSITool</command> και διαλέξτε τον δίσκο που θέλετε να διαμερίσετε: στο μενού <guimenu>Disk</guimenu>, είναι η επιλογή <guimenuitem>select</guimenuitem>).
ko: <command>SCSITool</command>을 시작해서 파티션하려는 디스크를 선택하십시오. (<guimenu>Disk</guimenu> 메뉴, <guimenuitem>select</guimenuitem> 항목)
pt: Inicie o <command>SCSIToll</command> e seleccione o disco que deseja particionar (menu <guimenu>Disk</guimenu>, item <guimenuitem>select</guimenuitem>).
ru: Запустите <command>SCSITool</command> и выберите диск, который вы хотите разметить (меню <guimenu>Disk</guimenu>, пункт <guimenuitem>select</guimenuitem>).
zh_cn: 启动 <command>SCSITool</command> 然后选择您要分区的磁盘(<guimenu>Disk</guimenu> 菜单中的 <guimenuitem>select</guimenuitem>)。
zh_tw: 啟動 <command>SCSITool</command> 然後選擇您要分割區的磁碟 (<guimenu>Disk</guimenu> 選單中的 <guimenuitem>select</guimenuitem>)。

source: From the <guimenu>Partition</guimenu> menu, select either <guimenuitem>New</guimenuitem> to add new partitions or change the existing partition sizes, or <guimenuitem>Change</guimenuitem> to change one specific partition. Unless you have already created partitions with the right sizes and only want to change the partition ID, <guimenuitem>New</guimenuitem> is probably the best choice.
el: Από το μενού <guimenu>Partition</guimenu> , διαλέξτε είτε <guimenuitem>New</guimenuitem> για να προσθέσετε καινούριες κατατμήσεις ή για να αλλάξετε το μέγεθος αυτών που ήδη υπάρχουν, ή <guimenuitem>Change</guimenuitem> για να αλλάξετε μια συγκεκριμένη κατάτμηση. Αν δεν έχετε δημιουργήσει ήδη κατατμήσεις με τα σωστά μεγέθη και απλά θέλετε να αλλάξετε τον αριθμό ID της κατάτμησης τότε η επιλογή <guimenuitem>New</guimenuitem> είναι πιθανότατα η καλίτερη.
ko: <guimenu>Partition</guimenu> 메뉴에서, <guimenuitem>New</guimenuitem>로 새 파티션을 추가하거나 현재 파티션 크기를 바꾸고, 아니면 <guimenuitem>Change</guimenuitem>로 한 개 특정 파티션을 바꾸십시오. 이미 적당한 크기로 파티션을 만든 상태에서 파티션 ID만 바꾸려는 경우가 아니라면, <guimenuitem>New</guimenuitem>를 이용하는 게 올바릅니다.
pt: A partir do menu <guimenu>Partition</guimenu>, seleccione ou <guimenuitem>New</guimenuitem> para adicionar novas partições ou modificar o tamanho das partições existentes, ou <guimenuitem>Change</guimenuitem> para alterar uma partição específica. A menos que já tenha criado as partições com os tamanhos correctos e apenas queira alterar o ID da partição, a melhor escolha será provavelmente <guimenuitem>New</guimenuitem>.
ru: Из меню <guimenu>Partition</guimenu>, выберите или <guimenuitem>New</guimenuitem> чтобы добавить разделы или изменить размеры существующих, или <guimenuitem>Change</guimenuitem> для изменения одного раздела. Если вы уже на создали разделы с правильными размерами и только хотите изменить ID раздела, то <guimenuitem>New</guimenuitem>, вероятно, лучший выбор.
zh_cn: 从 <guimenu>Partition</guimenu> 菜单，选择 <guimenuitem>New</guimenuitem> 来添加新分区或者修改现有分区的大小，或选择 <guimenuitem>Change</guimenuitem> 来修改指定的分区。除非您已经创建了合适大小的分区并只想修改分区 ID，否则 <guimenuitem>New</guimenuitem> 大概是最佳选择。
zh_tw: 從 <guimenu>Partition</guimenu> 選單選擇 <guimenuitem>New</guimenuitem> 以添加新分割區或者修改現有分割區的大小，或選擇 <guimenuitem>Change</guimenuitem> 來修改指定的分割區。除非您已經建立了大小合適的分割區並只想修改分割區 ID，否則 <guimenuitem>New</guimenuitem> 大概是最佳選擇。

source: For the <guimenuitem>New</guimenuitem> choice, select <guilabel>existing</guilabel> in the dialog box prompting the initial settings. The next window shows a list of existing partitions which you can adjust using the scroll buttons, or by clicking in the bar graphs. The first column in the partition list is the partition type; just click on the text field to edit it. When you are finished changing partition settings, save the changes by leaving the window with the <guibutton>OK</guibutton> button.
el: Αν η επιλογή σας είναι η <guimenuitem>New</guimenuitem>τότε διαλέξτε <guilabel>existing</guilabel> στο πλαίσιο διαλόγου που προτρέπει για τις αρχικές ρυθμίσεις. Το επόμενο παράθυρο δείχνει μια λίστα από τις υπάρχουσες κατατμήσεις που μπορείτε να προσαρμόσετε χρησιμοποιώντας την κουμπιά κύλισης ή κλικάροντας στις γραφικές μπάρες.Η πρώτη στήλη στην λίστα των κατατμήσεων είναι ο τύπος της κατάτμησης. Πατήστε απλά το πεδίο κειμένου για να το αλλάξετε. Όταν τελειώσετε τις αλλαγές στις ρυθμίσεις των κατατμήσεων, σώστε τις αλλαγές βγαίνοντας από το παράθυρο με το κουμπί <guibutton>OK</guibutton>.
ko: <guimenuitem>New</guimenuitem>에서는, 최초 설정을 표시하는 대화 상자에서 <guilabel>existing</guilabel>을 선택하십시오. 다음 창에서는 기존 파티션의 목록이 나오고, 스크롤 단추나 막대 그래프를 클릭해서 크기를 조정할 수 있습니다. 파티션 목록의 첫 번째 열에는 파티션 종류가 있고, 클릭해서 편집할 수 있습니다. 파티션 설정을 다 바꿨으면, <guibutton>OK</guibutton> 단추를 눌러서 창을 닫으면 저장합니다.
pt: Para a escolha <guimenuitem>New</guimenuitem>, escolha <guilabel>existing</guilabel> na caixa de diálogo que pede as definições iniciais. A próxima janela mostra uma lista de partições existentes que podem ser ajustadas com o os botões de scroll, ou clicando nos gráficos de barras. A primeira coluna na lista de partições é o tipo da partição; basta clicar no campo de texto para o editar. Quando tiver terminado de alterar as definições das partições, grave as alterações saindo da janela com o botão <guibutton>OK</guibutton>.
ru: В <guimenuitem>New</guimenuitem>, выберите <guilabel>existing</guilabel> в предлагаемом диалоговом окне начальных настроек. В следующем окне будут показаны существующие разделы, которые вы можете пролистать с помощью клавиш прокрутки, или нажав на полосы прокрутки. В первой колонке списка разделов показан типа раздела; просто нажмите не это поле и отредактируйте его. Когда вы закончите изменение настроек раздела, сохраните их нажав кнопку <guibutton>OK</guibutton>.
zh_cn: 在 <guimenuitem>New</guimenuitem> 选项中，从提示初始设置的对话框里选择 <guilabel>existing</guilabel>。接下来的窗口显示的是现有分区的列表，您可以通过滚动按钮进行调节，或者直接点击条图。分区列表的第一列是分区类型，点击文本框就可以编辑它。当您完成分区设置，用 <guibutton>OK</guibutton> 按钮保存并离开窗口。
zh_tw: 在 <guimenuitem>New</guimenuitem> 選項中，從提示初始設定的對話框裡選擇 <guilabel>existing</guilabel>。接下來的視窗顯示的是現有分割區的列表，您可以透過滑鼠滾動鈕進行調整，或者直接點擊長條圖。分割區列表的第一列是分割區類型，點擊文字欄位就可以編輯它。當您完成分割區設定，用 <guibutton>OK</guibutton> 按鈕儲存並離開視窗。

source: For the <guimenuitem>Change</guimenuitem> option, select the partition to change in the selection list, and select <guilabel>other systems</guilabel> in the dialog box. The next window lists detailed information about the location of this partition, and lets you change the partition ID. Save changes by leaving the window with the <guibutton>OK</guibutton> button.
el: Για την επιλογή <guimenuitem>Change</guimenuitem>, διαλέξτε την κατάτμηση που θέλετε να αλλάξετε από την λίστα επιλογής και επιλέξτε <guilabel>other systems</guilabel> στο πλαίσιο διαλόγου. Το επόμενο παράθυρο αναφέρει λεπτομερειακές πληροφορίες για την κατάτμηση και σας δίνει την δυνατότητα να αλλάξετε το ID της. Σώστε τις αλλαγές βγαίνοντας από το παράθυρο με το κουμπί <guibutton>OK</guibutton>.
ko: <guimenuitem>Change</guimenuitem>에서는, 선택할 목록에서 바꿀 파티션을 선택하고, 대화 상자에서 <guilabel>other systems</guilabel>을 선택하십시오. 다음 창에서는 이 파티션의 위치에 대한 정보가 나옵니다. 거기서 파티션 ID를 바꿉니다. <guibutton>OK</guibutton> 버튼을 눌러 창을 닫으면 저장합니다.
pt: Para a opção <guimenuitem>Change</guimenuitem>, seleccione na lista a partição a modificar, e seleccione na caixa de diálogo <guimenuitem>other systems</guimenuitem>. A próxima janela lista informação detalhada acerca da localização desta partição, e permite-lhe alterar o ID da partição. Guarde as alterações ao deixar a janela com o botão <guibutton>OK</guibutton>.
ru: В <guimenuitem>Change</guimenuitem>, выберите изменяемый раздел из списка, и выберите <guilabel>other systems</guilabel> в диалоговом окне. В следующем окне показана подробная информация о положении этого раздела, и можно изменить ID раздела. Сохраните изменения, нажав на кнопку<guibutton>OK</guibutton>.
zh_cn: 在 <guimenuitem>Change</guimenuitem> 选项中，从列表里面选择要修改的分区，然后在对话框中选择 <guilabel>other systems</guilabel>。接下来的窗口会列出该分区位置的详细信息，并让您修改分区 ID。用 <guibutton>OK</guibutton> 按钮保存并离开窗口。
zh_tw: 在 <guimenuitem>Change</guimenuitem> 選項中，從列表裡面選擇要修改的分割區，然後在對話框中選擇 <guilabel>other systems</guilabel>。接下來的視窗會列出該分割區位置的詳細資料，並讓您修改分割區 ID。用 <guibutton>OK</guibutton> 按鈕儲存並離開視窗。

source: Write down the Linux names for each of the partitions you created or changed for use with Linux &mdash; see <xref linkend="device-names"/>.
el: Καταγράψτε καπου τα ονόματα στο Linux για κάθε μια από τις κατατμήσεις που δημιουργήσατε ή αλλάξατε για χρήση με το Linux &mdash; κοιτάξτε και το <xref linkend="device-names"/>.
ko: 리눅스용으로 새로 만들거나 바꾼 파티션의 리눅스 이름을 적어 놓으십시오 &mdash; <xref linkend="device-names"/> 부분을 참고하십시오.
pt: Escreva agora os nomes em Linux para cada uma das partições que você tenha criado ou alterado para utilizar com Linux &mdash; veja <xref linkend="device-names"/>.
ru: Зарегистрируйте название каждого раздела Linux, который был создан или изменён, чтобы быть использованным в Linux &mdash; смотрите <xref linkend="device-names"/>.
zh_cn: 记下您为了使用 Linux 而创建或修改的每个分区的 Linux 名称 &mdash; 参考 <xref linkend="device-names"/>。
zh_tw: 記下您為了使用 Linux 而建立或修改的分割區的 Linux 名稱 &mdash; 請參考 <xref linkend="device-names"/>。

source: Quit <command>SCSITool</command> using the <guimenuitem>Quit</guimenuitem> item from the <guimenu>File</guimenu> menu. The computer will reboot to make sure the changed partition table is used by TOS. If you changed any TOS/GEM partitions, they will be invalidated and have to be reinitialized (we told you to back up everything on the disk, didn't we?).
el: Βγείτε από το <command>SCSITool</command> με την επιλογή <guimenuitem>Quit</guimenuitem> από το μενού <guimenu>File</guimenu>.Ο υπολογιστής θα επανεκκινηθεί για να βεβαιωθείτε ότι ο αλλαγμένος πίνακας διαμέρισης χρησιμοποιείται από το TOS, Αν αλλάξατε κάποιες από τις κατατμήσεις TOS/GEM αυτές θα καταστούν ανενεργές και θα πρέπει να επαναρχικοποιηθούν (σας είπαμε να σώστε όλα σας τα δεδομένα στο δίσκο, έτσι δεν είναι:!).
ko: <guimenu>File</guimenu> 메뉴에서 <guimenuitem>Quit</guimenuitem> 항목을 선택해 <command>SCSITool</command>을 마치십시오. 컴퓨터가 다시 부팅하게 되고 바꾼 파티션 테이블을 TOS가 제대로 사용하는 지 확인하십시오. TOS/GEM 파티션을 바꿨다면, 그 파티션은 사용할 수 없게 되므로 다시 초기화해야 합니다. (앞에서 디스크를 백업해야 한다고 말했지요?)
pt: Deixe o <command>SCSITool</command> utilizando o item <guimenuitem>Quit</guimenuitem> a partir do menu <guimenu>File</guimenu>. O computador irá reiniciar para garantir que a tabela de partições alterada é utilizada pelo TOS.Se alterou alguma partição TOS/GEM, estas serão invalidadas e terão de ser reinicializadas (nós dissemos-lhe para salvaguardar tudo, não dissemos?).
ru: Выйдите из <command>SCSITool</command> выбрав пункт <guimenuitem>Quit</guimenuitem> из меню <guimenu>File</guimenu>. Компьютер перезагрузится, чтобы изменения таблицы разделов дошли до TOS. Если вы изменили любой из TOS/GEM разделов, то изменения будут аннулированы и реинциализированы (разве мы не говорили, что нужно сделать резервную копию?).
zh_cn: 退出 <command>SCSITool</command> 使用 <guimenuitem>Quit</guimenuitem> 选项，位于 <guimenu>File</guimenu> 菜单下。计算机将重新启动以确保 TOS 会使用修改过的分区表。如果您修改了任何 TOS/GEM 分区，它们将会失效并要重新初始化(我们已经告诉过您需要备份磁盘上的所有数据，不是吗？)。
zh_tw: 從 <guimenu>File</guimenu> 選單下使用 <guimenuitem>Quit</guimenuitem> 選項退出 <command>SCSITool</command>。電腦將重新開機以確保 TOS 會使用修改過的分割區表。如果您修改了任何 TOS/GEM 分割區，它們將會失效並要重新初始化 (我們已經告訴過您需要備份磁碟上的所有資料，不是嗎？)。

source: There is a partitioning tool for Linux/m68k called <command>atari-fdisk</command> in the installation system, but for now we recommend you partition your disk using a TOS partition editor or some disk tool. If your partition editor doesn't have an option to edit the partition type, you can do this crucial step at a later stage (from the booted temporary install RAMdisk). <command>SCSITool</command> is only one of the partition editors we know of which supports selection of arbitrary partition types. There may be others; select the tool that suits your needs.
el: Υπάρχει ένα εργαλείο διαμέρισης για το Linux/m68k που ονομάζεται <command>atari-fdisk</command> στο σύστημα εγκατάστασης, αλλά προς το παρόν συνιστούμε να διαμερίσετε τον δίσκο σας με έναν εκδότη κατατμήσεων του TOS ή κάποιο εργαλείο δίσκων. Αν ο εκδότης των κατατμήσεων δεν σας δίνει την δυνατότητα να αλλάξετε τον τύπο των κατατμήσεων, μπορείτε να κάνετε αυτό το κρίσιμο βήμα έτσι κι αλλίως αργότερα (από την προσωρινή εγκατάσταση της RAMdisk κατά την εκκίνηση). Το <command>SCSITool</command> είναι μόνο ένα από τους εκδότες διαμέρισης που ξέρουμε ότι υποστηρίζει την επιλογή τύπων κατατμήσεων με διάφορους τύπους. Πιθανόν να υπάρχουν κι άλλοι, διαλέξτε αυτόν που ταιριάζει σε σας.
ko: Linux/m68k에는 설치 시스템 안에 <command>atari-fdisk</command>라는 파티션 도구가 있습니다. 하지만 현재로서는 TOS 파티션 편집 프로그램이나 다른 디스크 도구를 이용해 디스크를 파티션하기를 권장합니다. 파티션 편집 프로그램에 파티션 종류를 편집하는 옵션이 없다면, 나중에 이 작업을 할 수 있습니다 (설치할 때 임시로 만든 램디스크에서). <command>SCSITool</command>이 임의의 파티션 종류를 선택할 수 있는 (우리가 알고 있는 유일한) 파티션 편집 프로그램입니다. 다른 프로그램이 있을 지도 모르니, 필요에 따라 적합한 도구를 이용하십시오.
pt: No sistema de instalação existe um utilitário de particionamento para Linux/m68k chamado <command>atari-fdisk</command>, mas por agora nós recomendamos-lhe que particione o seu disco utilizando um editor de partições TOS ou algum utilitário de discos. Se o seu editor de partições não tiver uma opção para editar o tipo de partição, pode fazer esta etapa crucial posteriormente (a partir do RAMdisk temporário de instalação de que iniciou). <command>SCSITool</command> é apenas um dos editores de partições que nós sabemos suportar a selecção de tipos de partição arbitrários. Podem existir outros; escolha o utilitário que melhor se lhe adequa.
ru: Существует утилита разметки под Linux/m68k, которая в системе установки называется <command>atari-fdisk</command>, но сейчас мы рекомендуем разметить диск с помощью редактора разделов TOS или подобной дисковой утилиты. Если ваш редактор разделов не умеет изменять тип раздела, то вы можете выполнить этот важный шагна последней стадии (из временно загруженного установочного RAMдиска). <command>SCSITool</command>, как мы знаем, является единственным редактором разделов, которые разрешают выбрать из заданных типов раздела. Естественно, могут быть и ещё какие-то; выберите, то что вам подходит.
zh_cn: 在 Linux/m68k 中有一个分区工具，在安装系统中被称为 <command>atari-fdisk</command>，但是我们现在建议您使用 TOS 分区编辑器或其他的磁盘工具来对硬盘分区。如果您的分区编辑器没有编辑分区类型的选项，您可以在后续阶段做这项重要任务 (从启动临时安装 RAMdisk)。<command>SCSITool</command> 是我们所知的唯一支持选择任意分区类型的分区编辑器。也许还有其他的，请选择一个符合您要求的工具。
zh_tw: Linux/m68k 中有一個分割工具，在安裝系統中被稱為 <command>atari-fdisk</command>，但是我們現在建議您使用 TOS 分割區編輯器或其他的磁碟工具來對硬碟做分割。如果您的分割區編輯器沒有編輯分割區類型的選項，您可以在後續階段執行這項重要工作(從開機臨時安裝 RAMdisk)。<command>SCSITool</command> 是我們所知唯一支援任意選擇分割區類型的分割區編輯器。也許還有其他的，請選擇一個符合您要求的工具。

source: Partitioning in MacOS
el: Κατάτμηση σε MacOS
ko: MacOS에서 파티션하기
pt: Particionar em MacOS
ru: Разметка в MacOS
zh_cn: 在 MacOS 下分区
zh_tw: MacOS 下的分割
