Repository: xobs/debian-installer
Catalog: doc/manual/po/*/preparing.po
Languages: el, ko, pt, ru, zh_cn, zh_tw

source: Hardware
el: Υλικό
ko: 하드웨어
ru: Аппаратное обеспечение
zh_cn: 硬件
zh_tw: 硬體

source: Information You Might Need
el: Πληροφορίες που πιθανόν να χρειαστείτε
ko: 필요할 수도 있는 정보
pt: Informação Que Pode Necessitar
ru: Информация, которая может потребоваться
zh_cn: 您需要了解的信息
zh_tw: 您需要瞭解的資料

source: Hard Drives
el: Σκληροί Δίσκοι
ko: 하드 드라이브
pt: Discos Rígidos
ru: Жёсткие диски
zh_cn: 硬盘
zh_tw: 硬碟

source: How many you have.
el: Πόσους έχετε.
ko: 용량이 얼마나 되는 지.
pt: Quantos você tem.
ru: Количество дисков.
zh_cn: 拥有的容量
zh_tw: 您擁有的容量

source: Their order on the system.
el: Η σειρά τους στο σύστημα.
ko: 시스템에 붙어 있는 순서.
pt: A sua ordem no sistema.
ru: Их порядок в системе.
zh_cn: 它们在系统上的次序
zh_tw: 它們在系統上的順序

source: Whether IDE or SCSI (most computers are IDE).
el: Είναι IDE ή SCSI ; (οι περισσότεροι υπολογιστές έχουν IDE).
ko: IDE인지 SCSI인지 (대부분의 컴퓨터는 IDE입니다).
pt: Se são IDE ou SCSI (a maioria dos computadores usam IDE).
ru: IDE или SCSI (в большинстве компьютеров IDE).
zh_cn: 是 IDE 还是 SCSI(大多数计算机上是 IDE)
zh_tw: 是 IDE 還是 SCSI(大多數電腦上是 IDE)

source: Available free space.
el: Διαθέσιμος ελεύθερος χώρος.
ko: 사용 가능한 빈 공간.
pt: Espaço livre disponível.
ru: Доступное дисковое пространство.
zh_cn: 可用空间
zh_tw: 可用空間

source: Partitions.
el: Τμήματα δίσκου.
ko: 파티션.
pt: Partições.
ru: Разделы.
zh_cn: 分区。
zh_tw: 分割區。

source: Partitions where other operating systems are installed.
el: Τμήματα δίσκου όπου βρίσκονται εγκατεστημένα άλλα λειτουργικά συστήματα.
ko: 다른 운영 체제가 설치되어 있는 파티션.
pt: Partições onde outros sistemas operativos estão instalados.
ru: Разделы, на которых установлены операционные системы.
zh_cn: 安装有其他操作系统的分区。
zh_tw: 安裝有其他作業系統的分割區。

source: Monitor
el: Οθόνη
ko: 모니터
ru: Монитор
zh_cn: 显示器
zh_tw: 顯示器

source: Model and manufacturer.
el: Μοντέλο και κατασκευαστής.
ko: 모델 및 제조사.
pt: Modelo e Fabricante.
ru: Модель и производитель.
zh_cn: 型号与制造商。
zh_tw: 型號與製造商。

source: Resolutions supported.
el: Υποστηριζόμενες αναλύσεις.
ko: 지원하는 해상도.
pt: Resoluções suportadas.
ru: Поддерживаемые разрешения.
zh_cn: 支持的分辨率。
zh_tw: 支援的解析度。

source: Horizontal refresh rate.
el: Ρυθμός οριζόντιας ανανέωσης.
ko: 가로 출력 주파수.
pt: Taxa de refrescamento horizontal.
ru: Частота горизонтальной развёртки.
zh_cn: 水平扫描频率。
zh_tw: 水平掃瞄頻率。

source: Vertical refresh rate.
el: Ρυθμός κάθετης ανανέωσης.
ko: 세로 출력 주파수.
pt: Taxa de refrescamento vertical.
ru: Частота вертикальной развёртки.
zh_cn: 垂直扫描频率。
zh_tw: 垂直掃瞄頻率。

source: Color depth (number of colors) supported.
el: Βάθος χρώματος (αριθμός χρωμάτων) που υποστηρίζει.
ko: 지원하는 색상수.
pt: Profundidade da cor (número de cores) suportada.
ru: Поддерживаемая глубина цвета (число цветов).
zh_cn: 支持的颜色深度(颜色数)
zh_tw: 支援的顏色深度(顏色數)

source: Screen size.
el: Μέγεθος οθόνης.
ko: 화면 크기.
pt: Tamanho do ecrã.
ru: Размер экрана.
zh_cn: 屏幕尺寸。
zh_tw: 螢幕大小。

source: Mouse
el: Ποντίκι
ko: 마우스
pt: Rato
ru: Мышь
zh_cn: 鼠标
zh_tw: 滑鼠

source: Type: serial, PS/2, or USB.
el: Τύπος: σειριακό, PS/2, ή USB.
ko: 종류: 시리얼, PS/2, 혹은 USB.
pt: Tipo: série, PS/2, ou USB.
ru: Тип интерфейса: последовательный, PS/2 или USB.
zh_cn: 类型：串口、PS/2 或 USB。
zh_tw: 類型：序列、PS/2 或 USB。

source: Port.
el: Θύρα.
ko: 포트.
pt: Porta.
ru: Порт.
zh_cn: 端口。
zh_tw: 埠。

source: Manufacturer.
el: Κατασκευαστής.
ko: 제조사.
pt: Fabricante.
ru: Производитель.
zh_cn: 制造商。
zh_tw: 製造商。

source: Number of buttons.
el: Αριθμός κουμπιών.
ko: 단추 개수.
pt: Número de botões.
ru: Число кнопок.
zh_cn: 按键数。
zh_tw: 按鍵數。

source: Network
el: Δίκτυο
ko: 네트워크
pt: Rede
ru: Сеть
zh_cn: 网络
zh_tw: 網路

source: Type of adapter.
el: Τύπος υποδοχέα.
ko: 어댑터 종류.
pt: Tipo de adaptador.
ru: Тип адаптера.
zh_cn: 适配器类型。
zh_tw: 適配器類型。

source: Printer
el: Εκτυπωτής
ko: 프린터
pt: Impressora
ru: Принтер
zh_cn: 打印机
zh_tw: 印表機

source: Printing resolutions supported.
el: Υποστηριζόμενες Αναλύσεις Εκτύπωσης.
ko: 지원하는 인쇄 해상도.
pt: Resoluções de impressão suportadas.
ru: Поддерживаемое разрешение печати.
zh_cn: 支持的打印分辨率。
zh_tw: 支援的印表機解析度。

source: Video Card
el: Κάρτα Οθόνης
ko: 비디오 카드
pt: Placa de Vídeo
ru: Видеокарта
zh_cn: 视频卡
zh_tw: 顯示卡

source: Video RAM available.
el: Διαθέσιμη Μνήμη κάρτας οθόνης.
ko: 비디오 RAM 크기.
pt: Vídeo RAM disponível.
ru: Размер видеопамяти.
zh_cn: 可用显存
zh_tw: 可用顯示記憶體

source: Resolutions and color depths supported (these should be checked against your monitor's capabilities).
el: Αναλύσεις και αριθμός (βάθος) χρωμάτων που υποστηρίζονται (αυτά πρέπει να ελεγχθούν ως προς τις δυνατότητες της οθόνης σας).
ko: 지원하는 해상도 및 색상수 (모니터에서도 지원하는 지 확인해야 합니다).
pt: Resolução e profundidade de cor suportadas (devem ser verificadas de acordo com as capacidades do seu monitor).
ru: Поддерживаемые разрешения и глубина цвета (это должно быть проверено вместе с возможностями монитора).
zh_cn: 支持的分辨率和颜色数(还需检验您显示器的能力)。
zh_tw: 支援的解析度和顏色數 (還需檢驗您顯示器的能力)。

source: Device number(s).
el: Αριθμός συσκευών.
ko: 장치 번호.
pt: Número do dispositivo(s).
ru: Номер устройства(в).
zh_cn: 设备数。
zh_tw: 設備編號。

source: Device numbers.
el: Αριθμός συσκευών.
ko: 장치 번호.
pt: Números de dispositivo.
ru: Номера устройств.
zh_cn: 设备数。
zh_tw: 設備編號。

source: Relative adapter number for OSA cards.
el: Σχετικός αριθμός υποδοχέα για κάρτες OSA.
ko: OSA 카드의 상대 어댑터 번호.
pt: Número relativo do adaptador para placas OSA.
ru: Относительный номер адаптера OSA карт.
zh_cn: OSA 卡的相对适配器号。
zh_tw: OSA 卡的相對應適配器編號。

source: Hardware Compatibility
el: Συμβατότητα Υλικού
ko: 하드웨어 호환성
pt: Compatibilidade de Hardware
ru: Совместимость аппаратного обеспечения
zh_cn: 硬件兼容性
zh_tw: 硬體相容性

source: Many brand name products work without trouble on Linux. Moreover, hardware for Linux is improving daily. However, Linux still does not run as many different types of hardware as some operating systems.
el: Πολλά επώνυμα προϊόντα δουλεύουν χωρίς προβλήματα στο Linux. Επιπλέον το υλικό για Linux βελτιώνεται καθημερινά. Παρόλα αυτά, το Linux ακόμα δεν μπορεί να λειτουργήσει με τόσα διαφορετικά είδη υλικού όπως κάποια άλλα λειτουργικά συστήματα.
ko: 많은 유명 제품들에서 아무 문제없이 리눅스가 동작합니다. 또 리눅스용 하드웨어가 날이 갈 수록 발전하고 있습니다. 하지만 아직도 리눅스는 다른 운영체제만큼 다양한 종류의 하드웨어에서 동작하지는 못합니다.
pt: Muitas marcas de produtos funcionam sem problemas em Linux. Cada vez mais, o hardware para Linux está a melhorar diariamente. No entanto, Linux não suporta tantos tipos de hardware como alguns outros sistemas operativos.
ru: Многие продукты под известными торговыми марками без проблем работают в Linux. Кроме того, работа с аппаратным обеспечением в Linux ежедневно улучшается. Однако, Linux всё равно пока не может сравниться по количеству поддерживаемой аппаратуры с другими операционными системами.
zh_cn: 多数品牌的产品在 Linux 上运行不会遇到麻烦。而且，对 Linux 的硬件支持每天都在改善。然而，Linux 仍然不能像某些操作系统那样可以在各种不同的硬件上运行。
zh_tw: 多數品牌的產品在 Linux 上運作不會遇到麻煩。而且，對 Linux 的硬體支援每天都在改善。 然而，Linux 仍然不能像某些作業系統那樣可以在各種不同的硬體上運行。

source: In particular, Linux usually cannot run hardware that requires a running version of Windows to work.
el: Πιο συγκεκριμένα, το Linux συνήθως δεν μπορεί να δουλέψει με υλικό που απαιτεί την μια ενεργή έκδοση των Windows για να δουλέψει.
ko: 특히, Windows가 있어야 동작하는 하드웨어는 리눅스에서 이용하지 못합니다.
pt: Em particular, Linux usualmente não consegue correr hardware que precisa de uma versão do Windows para funcionar.
ru: В частности, на Linux не работает аппаратное обеспечение, для которого требуется работающая версия Windows.
zh_cn: 特别是，Linux 通常不能驱动那些需要某些版本 Windows 才运行的硬件上。
zh_tw: 特別的是，Linux 通常不能驅動那些需要在某些 Windows 版本上才能運作的硬體。

source: Although some Windows-specific hardware can be made to run on Linux, doing so usually requires extra effort. In addition, Linux drivers for Windows-specific hardware are usually specific to one Linux kernel. Therefore, they can quickly become obsolete.
el: Αν και κάποια είδη υλικού για Windows μπορούν να ρυθμιστούν ώστε να δουλέψουν και στο Linux αυτό απαιτεί συνήθως επιπλέον κόπο και προσπάθεια. Επιπρόσθετα, οδηγοί Linux που χρειάζονται για τέτοιο Windows βασισμένο υλικό συνήθως αφορούν ένα συγκεκριμένο πυρήνα του Linux. Σαν αποτέλεσμα μπορεί γρήγορα να είναι ξεπερασμένοι.
ko: 일부 Windows 전용 하드웨어는 리눅스에도 쓸 수 있긴 하지만, 보통 추가적인 노력이 필요합니다. 게다가 보통 Windows 전용 하드웨어의 리눅스 드라이버는 한 개의 리눅스 커널 버전에서만 쓸 수 있습니다. 그래서 그러한 드라이버는 금방 사용할 수 없게 됩니다.
pt: Mesmo assim, algum hardware específico para Windows pode correr em Linux, fazê-lo pode assim necessitar de um esforço adicional. Além disso, os controladores de Linux para hardware específico para Windows são usualmente específicos para um kernel de Linux. Consequentemente, podem-se rapidamente tornar obsoletos.
ru: Хотя некоторое аппаратное обеспечение "только-для-Windows" можно заставить работать под Linux, но чтобы добиться этого обычно нужно приложить дополнительные усилия. Кроме того, драйвера под Linux для Windows-специфичного оборудования обычно работают только с определённой версией ядра. Поэтому, они могут быстро устареть.
zh_cn: 虽然可以让某些 Windows 规格的硬件运行在 Linux 上，但这通常需要额外的工作。另外，对应 Windows 规格硬件的 Linux 驱动程序常指定在某一特定版本的 Linux 内核上。因此，它们很快就会被废弃。
zh_tw: 雖然可以讓某些 Windows 規格的硬體運行在 Linux 上，但這通常需要額外的工作。另外，對應 Windows 規格硬體的 Linux 驅動程式常指定在某一特定版本的 Linux 核心上。 因此，它們很快就會被廢棄。

source: So called win-modems are the most common type of this hardware. However, printers and other equipment may also be Windows-specific.
el: Τα λεγόμενα win-modems είναι ο πιο συνηθισμένος τύπος τέτοιου υλικού. Όμως και εκτυπωτές ή άλλος εξοπλισμός μπορεί να είναι απευθύνεται ειδικά σε Windows.
ko: 이른바 win-modem은 그러한 가장 전형적인 하드웨어입니다. 프린터와 그 외의 장치도 윈도우 전용이 있습니다.
pt: Os chamados win-modems são o tipo mais comuns deste tipo de hardware. No entanto, as impressoras e outro equipamento podem também ser específicos para Windows.
ru: Так называемые вин-модемы &mdash; наиболее распространённый тип такого аппаратного обеспечения. Однако, принтеры и другое оборудование также может оказаться Windows-специфичным.
zh_cn: 被称为 win-modem 的设备是这类硬件的典型。但打印机和其他设备也有是 Windows 规格的。
zh_tw: 所謂的 win-modem 設備是這類硬體的典型。但印表機和其他設備也有是 Windows 規格的。

source: You can check hardware compatibility by:
el: Μπορείτε να ελέγξετε την συμβατότητα του υλικού σας:
ko: 다음 방법으로 하드웨어 호환성을 알아볼 수 있습니다:
pt: Pode-se verificar a compatibilidade de hardware fazendo:
ru: Вы можете проверить совместимость аппаратного обеспечения:
zh_cn: 您可以通过以下方式检验硬件兼容性：
zh_tw: 您可以透過以下方式檢驗硬體相容性：

source: Checking manufacturers' web sites for new drivers.
el: Ελέγχοντας τους δικτυακούς τόπους των κατασκευαστών για καινούριους οδηγούς.
ko: 제조사의 웹사이트에서 새 드라이버 확인하기.
pt: Verificar as páginas web dos fabricantes acerca de novos controladores.
ru: Поискав новые драйверы на веб сайте производителя.
zh_cn: 检查制造商的网站来得到新的驱动程序。
zh_tw: 檢查製造商的網站來得到新的驅動程式。

source: Looking at web sites or manuals for information about emulation. Lesser known brands can sometimes use the drivers or settings for better-known ones.
el: Ψάχνοντας σε δικτυακούς τόπους ή εγχειρίδια για πληροφορίες σχετικά με προσωμοίωση. Λιγότερο γνωστές μάρκες υλικού μπορεί μερικές φορές να χρησιμοποιούν τους οδηγούς ή τις ρυθμίσεις περισσότερο επώνυμων.
ko: 웹사이트와 매뉴얼에서 에뮬레이션에 대한 정보 찾아보기. 덜 알려진 상표의 제품이 더 많이 알려진 제품의 드라이버와 설정들을 그대로 사용하기도 합니다.
pt: Visualizar páginas web e manuais procurando informação sobre emulação. Marcas menos conhecidas podem às vezes usar os controladores ou configurações de outras mais conhecidas.
ru: Поискав на веб сайте или в руководствах информацию об эмуляции. Менее известные производители иногда могут использовать драйверы или настройки более известных.
zh_cn: 查看关于仿真信息的网站或者手册。不常见的品牌有时可以使用常见品牌设备的驱动程序或者设置。
zh_tw: 查看網站或者手冊關於模擬的資料。不常見的品牌有時可以使用常見品牌設備的驅動程式或設定。

source: Checking hardware compatibility lists for Linux on web sites dedicated to your architecture.
el: Ελέγχοντας για λίστες συμβατότητας του υλικού για το Linux σε δικτυακούς τόπους αφιερωμένους στην αρχιτεκτονική σας.
ko: 해당 아키텍쳐에 관한 웹사이트에서 리눅스 하드웨어 호환성 목록 확인.
pt: Verificar a lista de compatibilidade de hardware para Linux em páginas web dedicadas à sua arquitectura.
ru: Проверив совместимость аппаратного обеспечения Linux на веб сайтах, посвящённых архитектуре вашей машины.
zh_cn: 检查您计算机体系的 Linux 兼容性列表网站。
zh_tw: 檢查您電腦架構的 Linux 相容性列表網站。

source: Searching the Internet for other users' experiences.
el: Ψάχνοντας στο διαδίκτυο για εμπειρίες άλλων χρηστών.
ko: 인터넷에서 다른 사용자의 사용담 검색해 보기.
pt: Procurar na Internet pela experiência de outros utilizadores.
ru: Поискав в Интернете отзывы о работе других пользователей.
zh_cn: 搜索互联网查找其他用户的经验。
zh_tw: 搜索網際網路尋找其他使用者的經驗。

source: Network Settings
el: Ρυθμίσεις Δικτύου
ko: 네트워크 설정
pt: Configurações de rede
ru: Настройки сети
zh_cn: 网络设置
zh_tw: 網路設置

source: If your computer is connected to a network 24 hours a day (i.e., an Ethernet or equivalent connection &mdash; not a PPP connection), you should ask your network's system administrator for this information.
el: Αν ο υπολογιστής σας είναι συνδεδεμένος σε ένα δίκτυο 24 ώρες την ημέρα (πχ. μια σύνδεση Ethernet ή κάποια ισοδύναμη &mdash; όχι μια σύνδεση PPP) θα πρέπει να ρωτήσετε τον διαχειριστή του δικτύου σας για την σχετική πληροφορία.
ko: 컴퓨터가 하루 24시간 내내 네트워크에 연결되어 있다면 (이더넷이나 그같은 연결의 경우 &mdash; PPP 아님), 네트워크 시스템 관리자에게 이러한 정보를 알아봐야 합니다.
pt: Se o seu computador está ligado a uma rede 24 horas por dia ( i.e., uma ligação Ethernet ou ligação equivalente &mdash; não uma ligação PPP), Você deve perguntar ao administrador da rede do sistema por esta informação.
ru: Если компьютер подключён к сети 24 часа в сутки (например, по Ethernet или через аналогичное подключение, но не PPP соединение), вы должны попросить у вашего сетевого системного администратора следующую информацию:
zh_cn: 如果您的计算机一天 24 小时都连在网上(即，以太网或等价的连接 &mdash; 而不是拨号连接)，您需要向您的网络系统管理员咨询这项信息。
zh_tw: 如果您的電腦一天 24 小時都連在網上 (即以太網路或相等的連接 &mdash; 而不是撥號連接)，您需要向您的網路系統管理員咨詢這項資料。

source: Your host name (you may be able to decide this on your own).
el: Το όνομα του συστήματός σας (πιθανόν να μπορείτε να το διαλέξετε οι ίδιοι).
ko: 호스트 이름 (직접 결정할 수도 있습니다).
pt: O seu hostname (você poderá ser decidir à sua maneira).
ru: Имя вашей машины (возможно вы можете выбрать его самостоятельно).
zh_cn: 您的主机名(您也许可以自己决定)。
zh_tw: 您的主機名(也許可以自己決定)。

source: Your domain name.
el: Το όνομα του τομέα του δικτύου σας.
ko: 도메인 이름.
pt: O seu nome de domínio.
ru: Имя домена.
zh_cn: 您的域名。
zh_tw: 您的網網域名稱。

source: Your computer's IP address.
el: Η διεύθυνση IP του υπολογιστή σας.
ko: 컴퓨터의 IP 주소.
pt: O endereço IP do seu computador.
ru: IP-адрес компьютера.
zh_cn: 您的计算机 IP 地址。
zh_tw: 您電腦的 IP 位址。

source: The netmask to use with your network.
el: Η μάσκα δικτύου που θα χρησιμοποιηθεί στο δίκτυο σας.
ko: 네트워크에 사용할 네트마스크.
pt: A máscara de rede para utilizar na sua rede.
ru: Маска сети.
zh_cn: 您网络的网络掩码。
zh_tw: 您網路的網路遮罩。

source: The IP address of the default gateway system you should route to, if your network <emphasis>has</emphasis> a gateway.
el: Την διεύθυνση IP της προκαθορισμένης πύλης μέσω του οποίου θα πρέπει να δρομολογηθεί το σύστημά σας, αν το δίκτυο σας <emphasis>έχει</emphasis>μια τέτοια πύλη.
ko: 라우팅하는 데 쓸 기본 게이트웨이 시스템의 IP 주소 (게이트웨이가 <emphasis>있는 경우</emphasis>).
pt: O endereço IP da gateway do sistema para onde o seu sistema deve ser encaminhado, se a sua rede <emphasis>tiver</emphasis> uma gateway.
ru: IP-адрес шлюза по умолчанию, если в вашей сети <emphasis>есть</emphasis> такой шлюз.
zh_cn: 路由经过的默认网关的 IP 地址，如果您的网络 <emphasis>有</emphasis> 网关的话。
zh_tw: 預設路由閘道的 IP 位址，如果您的網路<emphasis>有</emphasis>閘道器的話。

source: The system on your network that you should use as a DNS (Domain Name Service) server.
el: Το σύστημα στο δίκτυο σας που θα πρέπει να χρησιμοποιηθεί σαν DNS server (Domain Name Server).
ko: 네트워크에서 DNS (Domain Name Service) 서버로 사용할 시스템.
pt: O sistema na sua rede que você deverá utilizar como servidor DNS (Domain Name Service).
ru: Система в сети, которая используется как DNS (Domain Name Service) сервер.
zh_cn: 您的网络中作为 DNS(域名服务) 服务器的系统。
zh_tw: 您的網路中作為 DNS (網域名稱稱服務) 伺服器的系統。

source: On the other hand, if your administrator tells you that a DHCP server is available and is recommended, then you don't need this information because the DHCP server will provide it directly to your computer during the installation process.
el: Από την άλλη, αν ο διαχειριστής σας σάς πει ότι είναι διαθέσιμος κάποιος DHCP server και συνίσταται η χρήση του, τότε δεν χρειάζεστε αυτή την πληροφορία γιατί ο DHCP server θα την δώσει κατευθείαν στο σύστημά σας κατά τη διάρκεια της διαδικασίας εγκατάστασης.
ko: 한편 관리자가 DHCP 서버를 사용할 수 있다고 하고 DHCP 서버 사용을 추천한다고 하면, 이 정보가 필요 없습니다. 설치할 때 DHCP 서버에서 컴퓨터에 이 정보를 알려줍니다.
pt: Por outro lado, se o seu administrador diz que um servidor DHCP está disponível e é recomendado, então você não precisará desta informação porque o servidor DHCP poderá providenciar tudo isso directamente para o seu computador durante o processo de instalação.
ru: С другой стороны, если администратор говорит, что существует DHCP сервер и рекомендуется использовать его для настройки, то вам не нужна вся эта информация, так как DHCP сервер передаст её вашему компьютеру автоматически во время процесса установки.
zh_cn: 另一方面，如果您的系统管理员告诉您有 DHCP 服务器可用，并且推荐使用，那么您不需了解这项信息，因为 DHCP 服务器会在安装过程中直接提供。
zh_tw: 另一方面，如果您的系統管理員告訴您有 DHCP 伺服器可用，並且建議使用，那麼您不需瞭解這項資料，因為 DHCP 伺服器會在安裝過程中直接提供。

source: If you use a wireless network, you should also find out:
el: Αν χρησιμοποιείτε ασύρματο δίκτυο, θα πρέπει επίσης να βρείτε:
ko: 무선 네트워크를 사용한다면, 다음도 알아봐야 합니다:
pt: Se utiliza uma rede wireless, então deverá também identificar:
ru: Если вы используете беспроводную сеть, то также нужно выяснить:
zh_cn: 如果您有一个无线网络，您应该找出：
zh_tw: 如果您有一個無線網路，您應該找出：

source: ESSID of your wireless network.
el: το όνομα (ESSID) του ασύρματου δικτύου σας.
ko: 무선 네트워크의 ESSID.
pt: ESSID da sua rede wireless.
ru: ESSID беспроводной сети.
zh_cn: 您的无线网络的 ESSID。
zh_tw: 您無線網路的 ESSID。

source: WEP security key (if applicable).
el: Το κλειδί ασφαλείας WEP (αν χρειάζεται).
ko: WEP 보안 키 (있다면).
pt: Chave de segurança WEP (Se aplicável).
ru: WEP ключ безопасности (если он применяется).
zh_cn: WEP 安全 key(如果可用)。
zh_tw: WEP 安全金鑰 (如果可用)。

source: Meeting Minimum Hardware Requirements
el: Ικανοποίηση των ελάχιστων απαιτήσεων Υλικού
ko: 최소 하드웨어 요구사항 맞추기
pt: Reunir os Requisitos Mínimos de Hardware
ru: Минимальные требования к аппаратному обеспечению
zh_cn: 满足最低的硬件要求
zh_tw: 滿足最低的硬體要求

source: Once you have gathered information about your computer's hardware, check that your hardware will let you do the type of installation that you want to do.
el: Από τη στιγμή που έχετε μαζέψει πληροφορίες σχετικά με το υλικό του υπολογιστή σας, ελέγξτε ότι το υλικό σας θα σας επιτρέψει να κάνετε τον τύπο της εγκατάστασης που θέλετε να κάνετε.
ko: 컴퓨터의 하드웨어에 대한 정보를 모았으면, 하드웨어에서 설치하려는 방법대로 설치할 수 있는 지 확인하십시오.
pt: Assim que juntar a informação sobre o hardware existente no seu computador, certifique-se que o seu hardware permite fazer o tipo de instalação que deseja.
ru: После сбора всей информации о компонентах компьютера, проверьте, что ваше аппаратное обеспечение соответствует требованиям желаемого типа установки.
zh_cn: 一旦您收集好您的计算机上硬件配置的相关信息，再复查一下您的硬件，就可以让您如愿以偿，安装上系统。
zh_tw: 一旦您收集好您的電腦硬體配備的相關資料，再檢查一下您的硬體，就可以讓您如願以償的安裝系統。

source: Depending on your needs, you might manage with less than some of the recommended hardware listed in the table below. However, most users risk being frustrated if they ignore these suggestions.
el: Ανάλογα με τις ανάγκες σας, ίσως να τα καταφέρετε με λιγότερες απαιτήσεις για το υλικό σας από αυτές που αναφέρονται στον πίνακα παρακάτω. Όμως οι περισσότεροι χρήστες θα διακινδυνέψουν να απογοητευτούν αν τις αγνοήσουν.
ko: 필요에 따라서는, 아래의 표에 나온 하드웨어보다 못한 하드웨어를 가지고 있을 수도 있습니다. 하지만 아래 제안을 무시할 경우 대부분의 사용자들은 짜증나는 문제를 겪게 됩니다.
pt: Dependendo das suas necessidades, pode conseguir com menos do que algum do hardware recomendado na tabela listada abaixo. No entanto, a maioria dos utilizadores arriscam-se a sair frustrados se ignorarem estas sugestões.
ru: В зависимости от потребностей, у вас может оказаться машина меньшей мощности, чем рекомендовано в таблице ниже. Однако, большинство пользователей рискуют оказаться расстроенными, если проигнорируют эти советы.
zh_cn: 基于您的需求，您也许可以用低于下面表格所列的配置装上系统。但是，如果无视这些建议的话，多数用户会安装失败。
zh_tw: 基於您的需求，您也許可以用低於下面表格所列的配備安裝系統。但是，如果無視這些建議的話，多數使用者會安裝失敗。

source: A Pentium 100 is the minimum recommended for desktop systems, and a Pentium II-300 for a Server.
el: Ένα σύστημα Pentium 100 είναι η ελάχιστα προτεινόμενη απαίτηση για ένα σύστημα γραφείου και ένα σύστημα Pentium II 300 αντίστοιχα για έναν Server.
ko: 데스크탑은 최소 Pentium 100, 서버는 최소 Pentium II-300을 추천합니다.
pt: O Pentium 100 é o mínimo recomendado para sistemas desktop, e um Pentium II-300 para um servidor.
ru: Для настольных систем минимальная машина &mdash; Pentium 100, а для сервера &mdash; Pentium II-300.
zh_cn: 奔腾 100 是桌面系统的最低推荐配置，而 奔腾 II-300 则是服务器要求的最低推荐配置。
zh_tw: Pentium 100 是桌面系統的最低建議配備，而 Pentium II-300 則是伺服器要求的最低建議配備。

source: A 68030 or better processor is recommended for m68k installs. You may get by with a little less drive space than shown.
el: Ένας επεξεργαστής 68030 ή καλλίτερος είναι ο ενδεικνυόμενος για εγκατάσταση σε συστήματα m68k. Ίσως τα καταφέρετε με ελαφρά λιγότερο διαθέσιμο χώρο από τον αναγραφόμενο.
ko: m68k에서 설치할 때는 68030이나 그보다 상위 프로세서를 추천합니다. 보기보다 약간 더 적은 드라이브 공간으로 설치할 수도 있습니다.
pt: Para a instalação em m68k é recomendado um processador 68030 ou melhor. Poderá instalar com um pouco menos de espaço do disco do que é mostrado.
ru: Для архитектуры m68k рекомендуется 68030 или лучший процессор. Вы можете использовать немного меньшее дисковое пространство, чем показано.
zh_cn: 在 m68k 机器上安装，推荐使用 68030 或更快的处理器。您可能用比推荐稍小的硬盘空间就能完成安装。
zh_tw: 在 m68k 機器上安裝，建議使用 68030 或更快的處理器。您可能用比建議稍小的硬碟空間就能完成安裝。

source: Any OldWorld or NewWorld PowerPC can serve well as a Desktop System. For servers, a minimum 132-Mhz machine is recommended.
el: Οποιοδήποτε OldWorld ή NewWorld PowerPC μπορεί να χρησιμοποιηθεί σαν σύστημα γραφείου. Για server, ένας επεξεργαστής με ελάχιστη συχνότητα 132-Mhz προτείνεται.
ko: OldWorld 혹은 NewWorld PowerPC는 데스크탑 시스템으로 쓸 수 있습니다. 서버로 쓰려면 최소 132 Mhz 기계를 추천합니다.
pt: Qualquer OldWorld ou NewWorld PowerPC podem servir bem para um Sistema Desktop. Para servidores, no mínimo, é recomendada uma máquina 132-Mhz.
ru: Любой OldWorld или NewWorld PowerPC может использоваться в качестве настольной системы. Для серверов рекомендуется минимум132-МГц машина.
zh_cn: 任何一台 OldWorld 或 NewWorld PowerPC 都可以用作一个不错的桌面系统。要是作服务器的话，建议至少要 132 Mhz 的机器才行。
zh_tw: 任何一台 OldWorld 或 NewWorld PowerPC 都可以用來作為不錯的桌面系統。要是作為伺服器的話，建議至少要 132 Mhz 的機器才行。

source: Recommended Minimum System Requirements
el: Προτεινόμενες ελάχιστες απαιτήσεις του συστήματος
ko: 추천하는 최소 시스템 요구사항
pt: Requisitos Mínimos de Sistema Recomendados
ru: Рекомендуемые минимальные требования к системе
zh_cn: 推荐的最低系统配置
zh_tw: 建議的最低系統需求

source: Install Type
el: Τύπος Εγκατάστασης
ko: 설치 종류
pt: Tipo de Instalação
ru: Тип установки
zh_cn: 安装类别
zh_tw: 安裝類別

source: <entry>RAM</entry>
ru: <entry>Оперативная память</entry>
zh_cn: <entry>内存</entry>
zh_tw: <entry>記憶體</entry>

source: Hard Drive
el: Σκληρός Δίσκος
ko: 하드 드라이브
pt: Disco Rígido
ru: Жёсткий диск
zh_cn: 硬盘
zh_tw: 硬碟

source: No desktop
el: Χωρίς Γραφείο
ko: 데스크탑 없음
pt: Sem desktop
ru: Без настольных приложений
zh_cn: 无桌面的系统
zh_tw: 無桌面系統

source: 24 megabytes
el: 24 megabyte
ko: 24메가바이트
ru: 24 мегабайта
zh_cn: 24 M
zh_tw: 24 MB

source: 450 megabytes
el: 450 megabyte
ko: 450메가바이트
ru: 450 мегабайт
zh_cn: 450 M
zh_tw: 450 MB

source: With Desktop
el: Με Γραφείο
ko: 데스크탑 포함
pt: Com Desktop
ru: С настольными приложениями
zh_cn: 桌面系统
zh_tw: 有桌面系統

source: 64 megabytes
el: 64 megabyte
ko: 64메가바이트
ru: 64 мегабайта
zh_cn: 64 M
zh_tw: 64 MB

source: 1 gigabyte
ko: 1기가바이트
ru: 1 гигабайт
zh_cn: 1 G
zh_tw: 1 GB

source: Server
ko: 서버
pt: Servidor
ru: Сервер
zh_cn: 服务器
zh_tw: 伺服器

source: 128 megabytes
el: 128 megabyte
ko: 128메가바이트
ru: 128 мегабайт
zh_cn: 128 M
zh_tw: 128 MB

source: 4 gigabytes
ko: 4기가바이트
ru: 4 гигабайта
zh_cn: 4 G
zh_tw: 4 GB
