Repository: xobs/debian-installer
Catalog: doc/manual/po/*/preparing.po
Languages: el, ko, pt, ru, zh_cn, zh_tw

source: Atari TT RAM boards are notorious for RAM problems under Linux; if you encounter any strange problems, try running at least the kernel in ST-RAM. Amiga users may need to exclude RAM using a booter memfile. <phrase condition="FIXME"><emphasis> FIXME: more description of this needed. </emphasis></phrase>
el: Οι μητρικές μνήμης Atati TT είναι πασίγνωστες για προβλήματα RAM με το Linux. Αν συναντήσετε οποιαδήποτε προβλήματα προσπαθήστε να τρέξετε τουλάχιστον τον πυρήνα σε ST-RAM. Οι χρήστες των Amiga ίσως χρειαστεί να αποτρέψουν την RAM από το να χρησιμοποιεί ένα memfile του εκκινητή.<phrase condition="FIXME"><emphasis> FIXME: αυτό χρειάζεται αναλυτικότερη περιγραφή. </emphasis></phrase>
ko: Atari TT RAM 보드는 리눅스에서 문제 많기로 유명합니다. 어떤 문제가 발생하면 ST-RAM에 있는 커널을 실행해 보십시오. Amiga 사용자는 booter memfile로 RAM을 제외해야 할 수도 있습니다. <phrase condition="FIXME"><emphasis> FIXME: more description of this needed. </emphasis></phrase>
pt: As placas Atari TT RAM são conhecidas pelos seus problemas de RAM em Linux; se você encontrar quaisquer problemas estranhos, tente correr pelo menos o kernel em ST-RAM. Os utilizadores de Amiga podem necessitar de excluir RAM utilizando um booter memfile. <phrase condition="FIXME"><emphasis> FIXME: more description of this needed. </emphasis></phrase>
ru: Платы Atari TT RAM пользуются в Linux дурной славой из-за проблем с оперативной памятью; если у вас возникают странные проблемы, попробуйте запустить ядро в ST-RAM. Пользователям Amiga нужно исключить оперативную память с помощью загрузчика memfile. <phrase condition="FIXME"><emphasis> FIXME: more description of this needed. </emphasis></phrase>
zh_cn: Atari TT 内存条因其在 Linux 下的内存故障而获臭名。无论您 碰到了何种怪异的问题，请至少试试换用 ST-RAM 来运行内核。Amiga 的用户可能需要用 booter menfile 来排除部分内存。<phrase condition="FIXME"><emphasis> FIXME: more description of this needed. </emphasis></phrase>
zh_tw: Atari TT 記憶體以在 Linux 下的記憶體問題而獲臭名。無論您碰到了何種怪異的問題，請至少試試換用 ST-RAM 來運作核心。Amiga 的使用者可能需要用 booter menfile 來排除部分記憶體。 <phrase condition="FIXME"><emphasis> FIXME: more description of this needed. </emphasis></phrase>

source: The very best motherboards support parity RAM and will actually tell you if your system has a single-bit error in RAM. Unfortunately, they don't have a way to fix the error, thus they generally crash immediately after they tell you about the bad RAM. Still, it's better to be told you have bad memory than to have it silently insert errors in your data. Thus, the best systems have motherboards that support parity and true-parity memory modules; see <xref linkend="Parity-RAM"/>.
el: Οι καλλίτερες μητρικές χρησιμοποιούν parity RAM (ισότιμη RAM) και θα σας ειδοποιήσουν αν το σύστημά σας έχει σφάλμα έστω και σε ένα bit στη RAM. Δυστυχώς, δεν έχουν τρόπο για να διορθώσουν το σφάλμα και έτσι γενικά καταρρέουν απλά αμέσως αφού σας πουν για την ελλαττωματική RAM. Βέβαια ακόμα κι έτσι, είναι καλλίτερο να ξέρετε ότι έχετε μια ελλαττωματική RAM παρά να έχετε μια μνήμη που σιωπηλά εισάγει λάθη στα δεδομένα σας. Έτσι τα καλλίτερα συστήματα έχουν μητρικές που υποστηρίζουν parity και true-parity modules για την μνήμη. Δείτε το <xref linkend="Parity-RAM"/>.
ko: 아주 좋은 마더보드는 패리티 RAM을 지원하고 RAM에 한 비트 오류가 발생했을 때 알려줍니다. 아쉽게도, 그 오류를 고칠 수 있는 방법은 없기 때문에, 그 RAM이 있다는 사실을 알자 마자 죽어 버립니다. 그래도 데이터에 오류를 집어 넣는 것보다는 메모리가 잘못되었다고 알려주는 편이 낫습니다. 아주 좋은 시스템에는 마더보드가 패리티를 지원하고 진짜 패리티 메모리 모듈이 들어 있습니다. <xref linkend="Parity-RAM"/> 부분을 참고하십시오.
pt: As melhores motherboards suportam RAM com paridade e avisam-no se houver um erro num bit na RAM. Infelizmente, não têm um meio de resolver o erro, e geralmente bloqueiam imediatamente após o alertarem acerca da RAM com erro. Mesmo assim, é melhor ser avisado que tem RAM má do que introduzir silenciosamente erros nos seus dados. Desta forma, os melhores sistemas têm motherboards que suportam paridade e módulos de memória true-parity; veja <xref linkend="Parity-RAM"/>.
ru: Очень хорошие материнские платы поддерживают оперативную память с чётностью и скажут вам, если в оперативной памяти вашей системы возникнет ошибка в одном бите. К сожалению, они не могут исправить ошибку, то есть они обычно вешают систему после того как скажут о плохой оперативной памяти. Всё равно это лучше, чем просто молча вставить ошибки в ваши данные. То есть, очень хорошими системами считаются материнские платы имеющие поддержку чётности и модули с настоящей чётностью; смотрите <xref linkend="Parity-RAM"/>.
zh_cn: 最好的主板应该会支持奇偶校验内存(parity RAM)，它在会发现内存中有一个位错误时向您报告。可惜的是，主板并没有办法修正这个错误，因此它通常会在向您报告内存故障之后 立即崩溃。不管怎样，报告内存故障总归比不声不响地在您的数据中插入错误数据 要强。所以，最好的系统应当配备支持奇偶校验和实奇偶校验(true-parity)的内存。另外还可以参阅： <xref linkend="Parity-RAM"/>。
zh_tw: 最好的主機板應該會支援奇偶檢驗記憶體 (parity RAM)，它會在發現記憶體中有一個錯誤位元時向您報告。可惜的是，主機板並沒有辦法修正錯誤，因此它通常會在向您報告記憶體錯誤之後立即當機。無論如何，有報告錯誤總比不聲不響地在您的資料中插入錯誤數據來的好。所以，最好的系統應當配備支援奇偶檢驗和真奇偶檢驗 (true-parity) 的記憶體。另外還可以參閱 <xref linkend="Parity-RAM"/>。

source: If you do have true-parity RAM and your motherboard can handle it, be sure to enable any BIOS settings that cause the motherboard to interrupt on memory parity errors.
el: Αν έχετε true-parity RAM και η μητρική σας μπορεί να την διαχειριστεί, βεβαιωθείτε να ενεργοποιήσετε οποιαδήποτε ρύθμιση του BIOS προκαλεί την διακοπή από την μητρική σε σφάλματα parity μνήμης.
ko: 진짜 패리티 RAM이 있고 마더보드에서 패리티 RAM을 지원한다면, BIOS 설정에서 그 기능을 켜서 메모리 패리티 오류가 발생했을 때 인터럽트를 내도록 하십시오.
pt: Se você tem RAM de paridade e a sua motherboard não consegue lidar com ela, assegure-se que liga quaisquer definições da BIOS que fazem com que a motherboard pare nos erros de paridade da memória.
ru: Если вы имеете модули памяти с настоящей чётностью и ваша материнская плата может работать с ними, проверьте, что вы включили настройку в BIOS, которая вызывает прерывание при ошибке чётности в памяти.
zh_cn: 如果您配备有实奇偶校验的内存，而且您的主板也支持这种内存，那么请一定要 在 BIOS 的设置里开启相应的选项，好让主板在发现奇偶校验错时发生中断。
zh_tw: 如果您配備有真奇偶檢驗的記憶體，而且您的主機板也支援這種記憶體，那麼請一定要在 BIOS 的設定裡開啟相應的選項，好讓主機板在發現奇偶檢驗錯時送出中斷呼叫。

source: The Turbo Switch
el: Tο κουμπί Turbo
ko: Turbo 스위치
pt: O Botão Turbo
ru: Переключатель Тurbo
zh_cn: 加速(Turbo)开关
zh_tw: 加速 (Turbo) 開關

source: Many systems have a <emphasis>turbo</emphasis> switch that controls the speed of the CPU. Select the high-speed setting. If your BIOS allows you to disable software control of the turbo switch (or software control of CPU speed), do so and lock the system in high-speed mode. We have one report that on a particular system, while Linux is auto-probing (looking for hardware devices) it can accidentally touch the software control for the turbo switch.
el: Πολλά συστήματα έχουν ένα κουμπί <emphasis>turbo</emphasis> που ελέγχει την ταχύτητα της CPU. Επιλέξτε την ρύθμιση υψηλής ταχύτητας. Αν το BIOS σας σάς επιτρέπει να απενεργοποιήσετε τον έλεγχο από το λογισμικό του κουμπιού turbo (ή έλεγχο από το λογισμικό της ταχύτητας της CPU) κάντε το και κλειδώστε το σύστημα στην κατάσταση υψηλής ταχύτητας, Έχουμε μια αναφορά για ένα συγκεκριμένο σύστημα , ενώ το Linux κάνει τον αυτο-εντοπισμό (ψάχνοντας για συσκευές υλικού) μπορεί κατά λάθος να πειράξει τον έλεγχο από το λογισμικό του κουμπιού turbo.
ko: 많은 시스템에서는 <emphasis>turbo</emphasis> 스위치가 있어서 CPU의 속도를 조절합니다. 고속의 설정을 선택하십시오. BIOS에서 소프트웨어적으로 turbo 스위치를 조정할 수 있다면 (아니면 CPU 속도를 소프트웨어로 조정한다면), 시스템을 고속 모드로 고정해 놓으십시오. 어떤 시스템에서는 리눅스가 하드웨어 장치를 검색하는 동안 turbo 스위치의 소프트웨어 컨트롤 기능을 건드렸다는 보고가 있었습니다.
pt: Muitos sistemas têm um botão <emphasis>turbo</emphasis> que controla a velocidade do CPU. Seleccione a velocidade mais alta. Se a sua BIOS permitir desligar o controlo de software do botão turbo (ou software controle da velocidade do CPU), faça-o e bloqueie o sistema no modo de velocidade mais alta. Nós temos um relato de um determinado sistema, em que enquanto o Linux está a auto-detectar (à procura de dispositivos de hardware) pode acidentalmente tocar no controle de software do botão turbo.
ru: Много систем имеют переключатель <emphasis>turbo</emphasis>, который контролирует скорость процессора. Выберите самую высокую скорость. Если BIOS позволяет запретить программное управление турбо переключателем (или программное управление скоростью процессора CPU), включите этот режим и заблокируйте систему в высокоскоростном режиме. Нам сообщили про одну систему, на которой во время тестирования оборудования Linux (при опросе аппаратного обеспечения) смог случайно включить программное управление турбо переключателем.
zh_cn: 有许多系统带有一个 <emphasis>turbo</emphasis> 开关，通过这个开关可以控制 CPU 的 运行速度。请把它调节到“高速”。如果您的 BIOS 能让您禁用对加速开关的软件控制(或者 对 CPU 速度的软件控制)，那么就请禁用它，这会将系统锁定为高速运行模式。我们曾受到过报告称，在某台特别的系统上，当 Linux 在自动检测(搜寻硬件设备)时，会无意中触动加速开关的软件控制。
zh_tw: 有許多系統配有一個 <emphasis>turbo</emphasis> 開關，透過這個開關可以控制處理器的運行速度。請把它調節到``高速''。如果您的 BIOS 能讓您停用讓軟體控制加速開關的功能(或者對軟體對處理器速度的控制)，那麼就請停用它，這會將系統鎖定為高速運行模式。我們曾受到過報告稱，在某特別的系統上， Linux 在自動檢測 (搜尋硬體設備)時，會無意觸動加速開關的軟體控制。

source: Cyrix CPUs and Floppy Disk Errors
el: Cyrix CPU και Σφάλματα Δισκέττας
ko: Cyrix CPU 및 플로피 디스크 오류
pt: CPUs Cyrix e Erros de Disquete
ru: Процессоры Cyrix и ошибки при работе с дискетами
zh_cn: Cyrix 出品的 CPU 和软盘错误
zh_tw: Cyrix 處理器和軟碟錯誤

source: Many users of Cyrix CPUs have had to disable the cache in their systems during installation, because the floppy disk has errors if they do not. If you have to do this, be sure to re-enable your cache when you are finished with installation, as the system runs <emphasis>much</emphasis> slower with the cache disabled.
el: Πολλοί χρήστες επεξεργαστών Cyrix έπρεπε να απενεργοποιήσουν την cache στα συστήματά τους κατά τη διάρκεια της εγκατάστασης, γιατί η συσκευή της δισκέττας δημιουργούσε λάθη αν δεν το έκαναν. Αν πρέπει να το κάνετε κι εσείς αυτό βεβαιωθείτε να επανεργοποιήσετε την cache όταν έχετε ολοκληρώσει την εγκατάσταση, καθώς το σύστημα τρέχει <emphasis>πολύ</emphasis> αργότερα με την cache απενεργοποιημένη.
ko: 많은 Cyrix CPU 사용자들은 설치하는 동안 캐시 기능을 꺼야 했습니다. 끄지 않으면 플로피 디스크에서 오류가 발생했습니다. 캐시 기능을 꺼야 하는 경우, 설치를 마치면 캐시를 다시 켜십시오. 캐시를 끈 상태에서는 시스템이 <emphasis>훨씬</emphasis> 더 느리게 동작합니다.
pt: Muitos utilizadores de CPUs Cyrix tiveram de desabilitar a cache nos seus sistemas durante a instalação, porque a disquete dava erros se não o fizessem. Se você tiver de fazer isto, assegura-se de voltar a ligar a cache depois de terminar a instalação, porque o sistema corre <emphasis>muito</emphasis> lento com a cache desligada.
ru: Многие пользователи процессоров Cyrix должны выключить кэш в своих системах на время установки, так как при работе с дискетами возникнут ошибки, если этого не сделать. Если у вас сделали это, не забудьте обратно включить кэш после завершения установки, так как система с заблокированным кэшем работает <emphasis>намного</emphasis> медленнее.
zh_cn: 许多 Cyrix CPU 的用户在安装时，必须禁用系统的高速缓存(cache)。如果不这样的话，就会发生软盘错误。如果您禁用了高速缓存，请在安装完成后重新开启它。因为如果您继续 禁用的话，系统会变慢 <emphasis>很多</emphasis>。
zh_tw: 許多 Cyrix 處理器的使用者在安裝時，必須停用系統的高速快取 (cache)。如果不如此，就會發生軟碟錯誤。如果您停用了高速快取，請在安裝完成後重新開啟它。因為如果您繼續停用，系統會變慢<emphasis>很多</emphasis>。

source: We don't think this is necessarily the fault of the Cyrix CPU. It may be something that Linux can work around. We'll continue to look into the problem. For the technically curious, we suspect a problem with the cache being invalid after a switch from 16-bit to 32-bit code.
el: Δεν πιστεύουμε ότι αυτό είναι σίγουρα το σφάλμα του επεξεργαστή Cyrix. Ίσως είναι κάτι που το Linux μπορεί να το λύσει. Θα συνεχίσουμε να ψάχνουμε το πρόβλημα αυτό. Για όσους είναι περίεργοι όσον αφορά τα τεχνικά ζητήματα, υππψιαζόμαστε ότι υπάρχει κάποιο πρόβλημα ακύρωσης της cache μετά από μια αλλαγή από 16-μπιτο σε 32-μπιτο κώδικα.
ko: 이 현상이 Cyrix CPU의 문제라고 생각하지는 않습니다. 아마도 리눅스에서 이 문제를 피해갈 수 있을 것입니다. 이 문제의 원인은 계속 찾아볼 것입니다. 기술적인 문제가 궁금하신 분들을 위해 말씀드리면, 16비트에서 32비트 코드로 넘어갈 때 캐시가 무효화되면서 발생하는 문제라고 추정됩니다.
pt: Nós não pensamos que seja necessariamente uma falha dos CPUs Cyrix. Poderá ser qualquer coisa que Linux precise de contornar. Nós vamos continuar a olhar para o problema. Para os curiosos da técnica, nós suspeitamos de um problema com a cache se tornar inválida após mudar de código de 16-bit para 32-bit.
ru: Не думайте, что это ошибка процессора Cyrix. Это то, что Linux может обойти как ошибку. Мы продолжаем исследовать эту проблему. Для справки: мы подозреваем, что проблема в том, что данные в кэше устаревают после переключения из 16-битного в 32-битный код.
zh_cn: 我们并不认为这一定是 Cyrix CPU 的过错。Linux 或许能想办法避免它。我们将继续 关注这个问题。基于技术上的好奇，我们猜测这可能是系统从 16 位切换到 32 位模式时，导致高速缓存失效造成的。
zh_tw: 我們並不認為這一定是 Cyrix 處理器的過錯。Linux 或許能想辦法避免它。我們將繼續 關注這個問題。基於技術上的好奇，我們猜測這可能是系統從 16 位元切換到 32 位元模式時，導致高速快取失效造成的。

source: Peripheral Hardware Settings
el: Ρυθμίσεις περιφερειακών
ko: 주변 장치 하드웨어 설정
pt: Definições de Periféricos de Hardware
ru: Настройки периферийного оборудования
zh_cn: 外设硬件的设置
zh_tw: 周邊硬體的設置

source: You may have to change some settings or jumpers on your computer's peripheral cards. Some cards have setup menus, while others rely on jumpers. This document cannot hope to provide complete information on every hardware device; what it hopes to provide is useful tips.
el: Ίσως πρέπει να αλλάξετε τις ρυθμίσεις ή jumpers στις κάρτες των περιφερειακών του υπολογιστή σας. Μερικές κάρτες έχουν μενού ρύθμισης ενώ άλλες εξαρτώνται από jumpers. Το κείμενο αυτό δεν φιλοδοξεί να δώσει ολοκληρωμένες πληροφορίες για κάθε συσκευή του υλικού σας, αυτό που ελπίζει είναι να παρέξει κάποιες χρήσιμες υποδείξεις.
ko: 컴퓨터의 주변 장치 카드의 설정을 바꾸거나 점퍼를 바꿔야 할 수도 있습니다. 일부 카드는 설정 메뉴가 있고, 어떤 카드는 점퍼를 바꿔야 합니다. 이 문서에서는 각각의 모든 하드웨어 장치에 대한 정보가 들어 있지는 않습니다. 그저 유용한 팁들을 전달하길 바랄 뿐입니다.
pt: Você pode ter de alterar algumas definições ou jumpers nas cartas de periféricos do seu computador. Algumas cartas têm menus de configuração, enquanto outras são baseadas em jumpers. Este documento não pode disponibilizar todas as informações acerca de cada dispositivo de hardware; o que se deseja que disponibilize são dicas úteis.
ru: Вам может потребоваться изменить некоторые настройки или перемычки на платах периферийного оборудования. Одни платы имеют меню настроек, другие настраиваются через переключатели. Этот документ не может описать каждое устройство; надеемся, что поможем вам полезными советами.
zh_cn: 您也许必须得修改您计算机外设板卡上的一些设置或者跳线。有的板卡有设置菜单，而另一些则使用 跳线。本文档无意为您提供所有硬件设备的全面信息，只不过希望能提供一些有用的提示。
zh_tw: 您也許必須得修改您周邊設備卡上的一些設定或跳線。有的卡有設定選單，而另一些則使用跳線。本文件無意為您提供所有硬體設備的全面資料，只不過希望能提供一些有用的提示。

source: If any cards provide <quote>mapped memory</quote>, the memory should be mapped somewhere between 0xA0000 and 0xFFFFF (from 640K to just below 1 megabyte) or at an address at least 1 megabyte greater than the total amount of RAM in your system.
el: Αν κάποιες κάρτες παρέχουν <quote>απεικονισμένη μνήμη</quote> (<quote>mapped memory</quote>), η μνήμη θα πρέπει να απεικονιστεί κάπου ανάμεσα στις τιμές 0xA0000 και 0xFFFFF (από τα 640K σε μόλις λιγότερο από 1 megabyte) ή σε μια τιμή τουλάχιστον κατά 1 megabyte μεγαλύτερη από την συνολική μνήμη RAM στο σύστημά σας.
ko: 카드에서 <quote>mapped memory</quote>를 지원한다면, 메모리는 0xA0000과 0xFFFFF 사이에 (640K 위에서 1메가바이트 아래) 들어 있거나, 시스템의 전체 RAM보다 최소 1메가바이트 큰 위치에 들어 있어야 합니다.
pt: Se alguma das cartas disponibilizar <quote>memória mapeada</quote>, a memória deve ser mapeada algures entre 0xA0000 e 0xFFFFF (a partir de 640K até abaixo de 1 megabyte) ou num endereço pelo menos 1 megabyte superior ao total de RAM no seu sistema.
ru: Если карта использует <quote>отображаемую память(mapped memory)</quote>, то память должна указывать на диапазон между 0xA0000 и 0xFFFFF (после 640K, чуть ниже 1 мегабайта) или адресовываться в пространство как минимум на 1 мегабайт больше, чем доступной оперативной памяти в системе.
zh_cn: 如果有板卡提供了<quote>内存映射(mapped memory)</quote>，那么这块内存应该被映射到介于 0xA0000 和 0xFFFFF (从 640K 到正好 1M)的某块地方，也可以映射到您系统中总内存容量后 1 MB 以上的地址。
zh_tw: 如果有周邊卡提供了<quote>記憶體映射</quote> (mapped memory)，那麼這塊記憶體應該被映射到介於 0xA0000 和 0xFFFFF (從 640K 到正好 1M) 的某個地方，也可以映射到您系統中總記憶體 1 MB 以後的位址。

source: USB BIOS support and keyboards
el: Υποστήριξη USB στο BIOS και πληκτρολόγια
ko: USB BIOS 지원 및 키보드
pt: Suporte USB da BIOS e teclados
ru: Поддержка USB в BIOS и клавиатуры
zh_cn: USB BIOS 支持与键盘
zh_tw: USB BIOS 支援與鍵盤

source: If you have no AT-style keyboard and only a USB model, you may need to enable legacy AT keyboard emulation in your BIOS setup. Only do this if the installation system fails to use your keyboard in USB mode. Conversely, for some systems (especially laptops) you may need to disable legacy USB support if your keyboard does not respond. Consult your main board manual and look in the BIOS for <quote>Legacy keyboard emulation</quote> or <quote>USB keyboard support</quote> options.
el: Αν δεν έχετε κάποιο πληκτρολόγιο τύπου-AT αλλά μόνο ένα τύπου USB, ίσως να πρέπει να ενεργοποιήσετε την προσομοίωση legacy AT πληκτρολογίου στις ρυθμίσεις του BIOS. Κάντε κάτι τέτοιο μόνο αν το σύστημα εγκατάστασης αποτύχει να χρησιμοποιήσει το USB πληκτρολόγιο σας σε κατάσταση USB. Αντίστροφα, για κάποια συστήματα (ιδιαίτερα φορητούς υπολογιστές) ίσως πρέπει να απενεργοποιήσετε την υποστήριξη legacy USB αν το πληκτρολόγιο σας δεν αποκρίνεται. Συμβουλευτείτε το εγχειρίδιο της μητρικής σας και ψάξτε στο BIOS για τις επιλογές <quote>Legacy keyboard emulation</quote> ή <quote>USB keyboard support</quote>.
ko: AT 방식 키보드가 없고 USB 키보드만 있는 경우에는, BIOS 설정에서 legacy AT keyboard emulation을 켜야 할 수도 있습니다. 설치 시스템에서 USB 모드로 키보드를 사용할 수 없는 경우에만 사용하십시오. 반대로 어떤 시스템에서는 (특히 노트북 컴퓨터의 경우) 키보드가 동작하지 않을 때 legacy USB 지원을 꺼야 할 수도 있습니다. 메인보드 매뉴얼을 살펴 보시고 BIOS에서 <quote>Legacy keyboard emulation</quote>이나 <quote>USB keyboard support</quote> 옵션을 찾으십시오.
pt: Se não possuir nenhum teclado do tipo AT e apenas um modelo USB, você pode necessitar de habilitar emulação de teclado AT legacy na sua configuração da BIOS. Faça isto apenas se o sistema de instalação falhar devido à utilização do seu teclado em modo USB. Pelo contrário, para alguns sistemas (especialmente portáteis) você pode ter de desabilitar o suporte legacy USB se o seu teclado não responder. Consulte o manual da sua motherboard e veja as opções para <quote>Legacy keyboard emulation</quote> ou <quote>USB keyboard support</quote>.
ru: Если в имеете клавиатуру не AT, а только USB модель, то вам может потребоваться включить эмуляцию старых(legacy) AT клавиатур в настройках BIOS. Сделайте это только после того как система установки не сможет использовать клавиатуру в USB режиме. И наоборот, для некоторых систем (особенно ноутбуки) вам может потребоваться запретить эмуляцию, если клавиатура не работает. Посмотрите руководство к материнской плате и найдите параметры в BIOS <quote>Legacy keyboard emulation</quote> или <quote>USB keyboard support</quote>.
zh_cn: 倘若您没有 AT 键盘，只有一个 USB 的键盘的话，您需要在 BIOS 设置里开启老式 AT 键盘模拟功能。这只在安装系统使用 USB 模式失败的情况下进行。反之，对其他系统(特别是便携机)也许您的键盘没有响应，这需要禁止老式 USB 支持。请查阅您的主板手册并查看 BIOS 中<quote>Legacy keyboard emulation</quote>或<quote>USB keyboard support</quote>选项。
zh_tw: 倘若您沒有 AT 鍵盤，只有一個 USB 的鍵盤的話，您需要在 BIOS 設定裡開啟老式 AT 鍵盤模擬功能。這動作只在安裝系統使用 USB 模式失敗的情況下執行。 反之，對其他系統 (特別是筆記型電腦) 也許您的鍵盤沒有回應，這需要停用老式 USB 支援。請查閱您的主機板手冊並查看 BIOS 中的 <quote>Legacy keyboard emulation</quote> 或 <quote>USB keyboard support</quote> 選項。

source: More than 64 MB RAM
el: Περισσότερη μνήμη από 64 MB
ko: 64 MB RAM 이상
pt: Mais do que 64 MB RAM
ru: Больше чем 64 МБ оперативной памяти
zh_cn: 大于 64 MB 内存
zh_tw: 大於 64 MB 的記憶體

source: The Linux Kernel cannot always detect what amount of RAM you have. If this is the case please look at <xref linkend="boot-parms"/>.
el: Ο πυρήνας του Linux δεν μπορεί πάντα να ανιχνεύσει πόση μνήμη RAM έχετε. Αν συμβαίνει αυτό κοιτάξτε στην ενότητα <xref linkend="boot-parms"/>.
ko: 리눅스 커널에서 RAM의 용량을 항상 정확히 알아내지는 못합니다. 그런 경우, <xref linkend="boot-parms"/>에 있는 내용을 참고하십시오.
pt: O Kernel Linux não consegue sempre detectar sempre a quantidade de RAM que você tem. Se é o seu caso por favor veja em <xref linkend="boot-parms"/>.
ru: Ядро Linux не всегда может обнаружить правильно количество доступной оперативной памяти. В этом случае смотрите <xref linkend="boot-parms"/>.
zh_cn: Linux 内核有时不能检测出您系统中的内存大小。如果这正符合您的情况，请参阅一下<xref linkend="boot-parms"/>。
zh_tw: Linux 核心有時不能檢測出您系統中的記憶體大小。如果您遇到這種情況，請參閱 <xref linkend="boot-parms"/>。

source: &arch-title; Hardware References
el: &arch-title; Αναφορές Υλικού
ko: &arch-title; 하드웨어 레퍼런스
pt: &arch-title; Referências de Hardware
ru: Справочники по аппаратному обеспечению &arch-title;

source: FIXME: write about HP-UX disks?
el: ΔΙΟΡΘΩΣΕ ΜΕ: γράψε για δίσκους σε HP-UX?
pt: FIXME: escrever acerca de discos HP-UX?
ru: FIXME: написать о дисках HP-UX?

source: FIXME: more information needed &mdash; from a Redbook?
el: ΔΙΟΡΘΩΣΕ ΜΕ: χρειάζονται περισσότερες πληροφορίες &mdash; από ένα Redbook?
pt: FIXME: mais informação necessária &mdash; de um Redbook?
ru: FIXME: нужно больше информации из Redbook?
