Repository: xobs/debian-installer
Catalog: doc/manual/po/*/preparing.po
Languages: el, ko, pt, ru, zh_cn, zh_tw

source: Here is a sampling of some common Debian system configurations. You can also get an idea of the disk space used by related groups of programs by referring to <xref linkend="tasksel-size-list"/>.
el: Εδώ είναι ένα δείγμα μερικών τυπικών διαμορφώσεων για συστήματα Debian. Μπορείτε επίσης να πάρετε μια ιδέα για τον χώρο που χρειάζονται διάφορες ομάδες προγραμμάτων κοιτώντας στο <xref linkend="tasksel-size-list"/>.
ko: 많이 쓰이는 데비안 시스템의 예제입니다. <xref linkend="tasksel-size-list"/>에 보면 관련된 프로그램들이 차지하는 디스크 공간이 얼마나 되는 지 대략 알 수 있습니다.
pt: Aqui estão alguns exemplos de configuração de sistema comuns em Debian. Poderá ter uma ideia do espaço em disco usado por diversos grupos de programas usando a <xref linkend="tasksel-size-list"/>.
ru: Вот примеры некоторых распространённых конфигураций Debian систем. Также, по занимаемому размеру дискового пространства вы можете ориентироваться на группы программ в <xref linkend="tasksel-size-list"/>.
zh_cn: 这里有些常规 Debian 系统配置的样本。要了解各类软件需要占多大的硬盘空间，请参考<xref linkend="tasksel-size-list"/>。
zh_tw: 這裡有些一般 Debian 系統設定的樣本。您可以參閱 <xref linkend="tasksel-size-list"/> 以瞭解各類軟體需要佔多大的硬碟空間。

source: Standard Server
el: Συνηθισμένος server
ko: 표준 서버
pt: Servidor Padrão
ru: Стандартный сервер
zh_cn: 常规服务器
zh_tw: 標準伺服器

source: This is a small server profile, useful for a stripped down server which does not have a lot of niceties for shell users. It includes an FTP server, a web server, DNS, NIS, and POP. For these 100MB of disk space would suffice, and then you would need to add space for any data you serve up.
el: Αυτό είναι το προφίλ για έναν μικρό server, χρήσιμο για έναν server χωρίς πολλά εργαλεία για χρήστες κελύφους. Περιλαμβάνει ένα FTP server, έναν web server, καθώς και υπηρεσίες DNS. NIS και POP. Για αυτά χώρος δίσκου 100 MB θα είναι επαρκής, και στη συνέχεια θα πρέπει να προσθέσετε επιπλέον χώρο για οποιαδήποτε δεδομένα θα σερβίρετε.
ko: 작은 서버 프로파일입니다. 쉘 사용자들이 쓰는 여러가지 프로그램들이 없는, 용량을 줄인 서버에 씁니다. FTP 서버, 웹 서버, DNS, NIS, POP 서버가 들어 있습니다. 100MB의 디스크 공간이면 충분하고, 서비스하려는 데이터에 필요한 공간이 더 필요합니다.
pt: Aqui está um perfil de pequeno servidor, útil para um servidor sem mais nada que não tem muitas das comodidades para os utilizadores da shell. Inclui um servidor de FTP, um servidor web, DNS, NIS, e POP. Para estes, 100MB de espaço de disco seria suficiente, e então só necessita de adicionar o espaço para todos os dados que irá servir.
ru: Небольшой сервер без многих свойств, полезных для пользователей работающих в командной строке. Он содержит FTP сервер, веб сервер, DNS, NIS и POP. Для всего этого достаточно 100МБ дискового пространства, а для данных вам потребуется дополнительное место.
zh_cn: 这里有一台小型服务器范例，它适用于精简型服务器，即没有为 shell 的用户安装过多合用称手的软件。这类服务器 安装有：一个 FTP 服务、一个 web 服务、DNS、NIS 以及 POP 服务。这些服务总共需要用掉 100MB 的磁盘空间，您还需要另外算上服务所需的 数据占用的空间。
zh_tw: 這裡有一台小型伺服器範例，它適用於精簡型伺服器，即沒有為 shell 的使用者安裝過多好用的軟體。這類伺服器裝有：FTP 伺服、web 伺服、DNS、NIS 以及 POP 服務。這些服務總共需要 100MB 磁碟空間，您還需要另外算上服務所需資料所佔用的空間。

source: Desktop
el: Γραφείου
ko: 데스크탑
ru: Настольный компьютер
zh_cn: 桌面
zh_tw: 桌面

source: A standard desktop box, including the X window system, full desktop environments, sound, editors, etc. You'll need about 2GB using the standard desktop task, though it can be done in far less.
el: Ένα συνηθισμένο "κουτί" γραφείου, που περιλαμβάνει το σύστημα X window, πλήρη περιβάλλοντα γραφείου, ήχο, επεξεργαστές κειμένου κλπ. Θα χρειαστείτε περίπου 2 GB χρησιμοποιώντας το καθορισμένο "καθήκον" γραφείου, αν και μπορείτε να τα καταφέρετε και σε σημαντικά λιγότερο χώρο.
ko: 표준 데스크탑 컴퓨터로, X 윈도우 시스템, 완전한 데스크탑 환경, 사운드, 문서 편집기 등이 들어 있습니다. 표준 데스크탑 태스크를 설치하면 약 2GB가 필요하지만, 그보다 적은 용량으로도 가능합니다.
pt: Uma máquina desktop padrão, incluindo o sistema de janelas X, um ambiente desktop completo, som, editores, etc. Poderá necessitar à volta de 2GB usando a tarefa de Desktop padrão, embora possa ser feito com menos.
ru: Стандартный настольный компьютер, содержащий X window system, среду настольной системы, поддержку звука, редакторы и так далее. Вам потребуется около 2ГБ для стандартных настольных задач, хотя для них может потребоваться и значительно меньше места.
zh_cn: 标准的桌面用机安装有 X 窗口系统、完整的桌面环境、音频软件、编辑器等。这些软件包将总共需要约 2G 空间，尽管也可以不用这么多。
zh_tw: 標準的桌面用機器安裝有 X 視窗系統、完整的桌面環境、音效軟體、編輯器等。這些軟體套件將總共需要約 2G 空間，儘管也可以不需要這麼多。

source: Work Console
el: Τερματικό εργασίας
ko: 작업용 콘솔
pt: Trabalho de Consola
ru: Рабочая консоль
zh_cn: 工作控制台
zh_tw: 工作控制台

source: A more stripped-down user machine, without the X window system or X applications. Possibly suitable for a laptop or mobile computer. The size is around 140MB.
el: Ένα πιο λιτό σύστημα για χρήστες, χωρίς το σύστημα X window ή εφαρμογές X. Πιθανόν κατάλληλο για laptop ή φορητούς υπολογιστές.Το απαραίτητο μέγεθος είναι περίπου 140 MB.
ko: 크기를 더 줄인 사용자 컴퓨터로, X 윈도우 시스템이나 X 프로그램이 없습니다. 노트북이나 휴대용 컴퓨터에도 적합합니다. 크기는 약 140MB입니다.
pt: Uma máquina mais dedicada a utilizadores, sem o sistema de janelas X ou aplicativos X. Possivelmente adequado para um computador portátil ou móvel. O tamanho ronda os 140MB.
ru: Сильно урезанная пользовательская машина, без X window system и X приложений. Возможно подойдёт для ноутбука или мобильного компьютера. Занимает около 140МБ.
zh_cn: 这是被高度精简的用户机器，它没有安装 X 窗口系统或者 X 软件。可能适用于笔记本电脑或者手持计算机。其所需空间约为 140MB。
zh_tw: 這是被高度精簡的使用者機器，它沒有安裝 X 視窗系統或者 X 軟體。可能適用於筆記型電腦或者手提電腦。其所需空間約為 140MB。

source: Developer
el: Για προγραμματισμό-ανάπτυξη
ko: 개발자
ru: Для разработчика
zh_cn: 开发人员
zh_tw: 開發人員

source: A desktop setup with all the development packages, such as Perl, C, C++, etc. Size is around 475MB. Assuming you are adding X11 and some additional packages for other uses, you should plan around 800MB for this type of machine.
el: Μια διαμόρφωση γραφείου με όλα τα πακέτα για ανάπτυξη, όπως Perl, C, C++ κ.α. Το μέγεθος είναι περίπου 475 MB. Υποθέτοντας ότι προσθέτετε το περιβάλλον X11 και κάποια επιπλέον πακέτα για άλλη χρήση θα πρέπει να υπολογίσετε περίπου 800 MB για αυτόν τον τύπο μηχανήματος.
ko: Perl, C, C++ 등과 같은 모든 개발용 꾸러미들이 들어 있는 데스크탑. 크기는 약 475MB입니다. X11과 그 외에 추가 꾸러미를 더 설치한다고 하면, 이런 컴퓨터에는 약 800MB를 확보해 놓아야 합니다.
pt: A instalação do Desktop com todos os pacotes de desenvolvimento, tais como o Perl, C, C++, etc. O tamanho ronda os 475MB. Assumindo que você adiciona o X11 e alguns pacotes adicionais para outras necessidades, deverá planear cerca de 800MB para este tipo de máquina.
ru: Настольная система со всеми пакетами для разработки, такими как Perl, C, C++ и так далее. Занимает около 475МБ. Если добавить X11 и некоторые другие пакеты, то планируйте выделить около 800МБ для машины такого типа.
zh_cn: 这是包括所有开发软件包的桌面设置，例如 Perl、C、C++ 等。其所需空间约为 475MB。若是您为了其它用途，而另行安装了 X11 和其它的软件包，那么您需要为这类机器规划出约 800MB 空间。
zh_tw: 這是包括所有開發軟體套件的桌面設置，例如 Perl、C、C++ 等。其所需空間約為 475MB。若是您為了其它用途，而另行安裝了 X11 和其它的軟體套件，那麼您需要為這類機器規劃出約 800MB 空間。

source: Remember that these sizes don't include all the other materials which are usually to be found, such as user files, mail, and data. It is always best to be generous when considering the space for your own files and data. Notably, the <filename>/var</filename> partition contains a lot of state information specific to Debian in addition to its regular contents like logfiles. The <command>dpkg</command> files (with information on all installed packages) can easily consume 20MB. Also, <command>apt-get</command> puts downloaded packages here before they are installed. You should usually allocate at least 100MB for <filename>/var</filename>.
el: Θυμηθείτε ότι τα μεγέθη αυτά δεν περιλαμβάνουν όλο το υπόλοιπο υλικό που συνήθως βρίσκεται σε ένα σύστημα, όπως αρχεία χρηστών. αλληλογραφία και δεδομένα. Είναι πάντα καλό να είστε γενναιόδωροι όταν πρόκειται για το χώρο που θα διαθέσετε στα αρχεία σας και άλλα δεδομένα. Σημειώστε ότι το τμήμα δίσκου <filename>/var</filename>περιέχει μεγάλο όγκο πληροφοριών για την κατάσταση του συστήματος και που αφορούν συγκεκριμένα το Debian πέρα από τα συνηθισμένα περιεχόμενά του όπως τα αρχεία καταγραφής (logfiles). Τα αρχεία για το <command>dpkg</command> (με πληροφορίες για όλα τα εγκατεστημένα πακέτα) μπορεί εύκολα να καταναλώσει 20 MB. Επίσης το <command>apt-get</command> βάζει εδώ τα πακέτα που κατεβαίνουν πριν την εγκατάστασή τους. Συνήθως θα πρέπει να δώσετε τουλάχιστον 100 MB στο <filename>/var</filename>.
ko: 이 점을 기억해 두십시오. 위의 용량은 사용자의 파일, 메일, 데이터 따위의 기타 자료들을 포함한 게 아닙니다. 자기만의 파일과 데이터에 필요한 공간을 생각할 때는 항상 넉넉하게 하는 게 좋습니다. 특히, <filename>/var</filename> 파티션에는 여러 가지 데비안의 상태 정보와 로그 파일같은 일반적인 데이터들이 들어 있습니다. <command>dpkg</command> 파일들은 (설치 꾸러미에 대한 정보를 합쳐서) 쉽게 20MB를 차지합니다. 또, <command>apt-get</command>은 설치하기 전에 내려 받은 꾸러미를 여기에 저장합니다. 보통 <filename>/var</filename>에 최소 100MB를 확보해 놓아야 합니다.
pt: Lembre-se de que estes tamanhos não incluem todos os outros conteúdos que podem ser normalmente encontrados, tais como ficheiros dos utilizadores, mail, e dados. É sempre melhor ser generoso ao considerar o espaço para os seus próprios ficheiros e dados. Notavelmente, a partição <filename>/var</filename> contém muita informação de estado específica de Debian além do seu conteúdo usual como "logs". Os ficheiros do <command>dpkg</command> (Com informação sobre todos os pacotes instalados) pode facilmente ocupar 20MB. Também, o <command>apt-get</command> põe na <filename>/var</filename> os pacotes a que é feito o download, antes de serem instalados. Normalmente deverá alocar pelo menos 100MB para a partição <filename>/var</filename>.
ru: Не забудьте, что данные размеры не включают файлы, которые обычно лежат на машине: файлы пользователя, почта и данные. Всегда нужно быть более щедрым, когда подсчитываешь место для своих файлов и данных. В частности, раздел <filename>/var</filename> содержит много специфичной для Debian информации, а также обычные данные типа журнальных файлов. Файлы <command>dpkg</command> (с информацией о всех установленных пакетах) могут легко занять 20МБ. <command>apt-get</command> также помещает сюда загруженные файлы перед их установкой. Обычно, требуется выделить по крайней мере 100МБ для <filename>/var</filename>.
zh_cn: 要提醒您的是上面说的空间大小并没有把其它任何资料数据包含在内。这通常包含用户的文件、信件或者用户的数据。一般来说，最好在为您自己的文件和数据分配空间时，规划得宽裕一些。尤其是 <filename>/var</filename> 分区里装有许多 Debian 的特定状态信息和类似日志文件这样普通内容。<command>dpkg</command>所用的文件(含有所有已安装软件包的信息)很容易就会消耗掉 20MB。另外，<command>apt-get</command> 会在安装前将下载的软件包放在这里。您应当最少分配 100MB 的空间给 <filename>/var</filename>。
zh_tw: 要提醒您的是上面所說的空間大小沒有把其它任何資料數據包含在內。這通常包含使用者的文件、信件或者使用者的資料。一般來說，最好在為您自己的檔案和資料分配空間時，規劃得寬裕一些。尤其是 <filename>/var</filename> 分割區裡裝有許多 Debian 的特定狀態資料和類似日誌檔案這樣普通內容。<command>dpkg</command> 所用的文件 (含有所有已安裝軟體套件的資料) 很容易就會消耗掉 20MB。另外，<command>apt-get</command> 會在安裝前將下載的軟體套件放在這裡。您應當最少分配 100MB 的空間給 <filename>/var</filename>。

source: Pre-Partitioning for Multi-Boot Systems
el: Προκατάτμηση για Συστήματα με εκκίνηση πολλαπλών λειτουργικών
ko: 멀티 부팅 시스템에서 미리 파티션하기
pt: Pré-Particionamento para sistemas Multi-Boot
ru: Переразметка для мульти-загрузочных систем
zh_cn: 为多重启动系统事先分区
zh_tw: 為多重開機系統事先分割磁碟

source: Partitioning your disk simply refers to the act of breaking up your disk into sections. Each section is then independent of the others. It's roughly equivalent to putting up walls inside a house; if you add furniture to one room it doesn't affect any other room.
el: Η κατάτμηση του δίσκου αναφέρεται απλά στην πράξη του χωρισμού του δίσκου σας σε τμήματα. Κάθε τμήμα γίνεται έτσι ανεξάρτητο από τα άλλα. Είναι χονδρικά ισοδύναμο με την τοποθέτηση τοίχων εσωτερικά σε ένα σπίτι. Αν προσθέσετε έπιπλα σε ένα δωμάτιο αυτό δεν θα επηρρεάσει κανένα από τα υπόλοιπα δωμάτια.
ko: 디스크를 파티션은 디스크를 여러 개의 조각으로 나누는 작업을 말합니다. 각 조각들은 다른 조각과 독립적입니다. 비유 하자면 집에 벽을 놓는 것과 비슷합니다. 어떤 방에 가구를 놓는다고 해서 다른 방에 영향을 끼치지 않습니다.
pt: Particionar o seu disco rígido refere-se simplesmente ao acto de dividir o seu disco em secções. Cada secção é então independente das outras. É de certa forma equivalente a pôr paredes dentro de uma casa; se colocar mobília num quarto não afecta qualquer outro quarto.
ru: Разметка диска &mdash; это просто операция деления диска на секции. Каждая выделенная секция не зависит от других. Это, грубо говоря, как построить стены внутри дома; если вы добавите в одну комнату мебель, то это никак не повлияет на другие комнаты.
zh_cn: 为您的硬盘分区仅仅指的是将您的硬盘空间切分成几块。分区之后，每一块都是独立于其余部分的单独空间。这和在一个大房子里砌几堵墙有几分相似，如果您在其中一间房间里安置家具，那么这不会对其它房间有任何影响。
zh_tw: 分割您的硬碟指的僅是將您的硬碟空間切分成幾塊。分割之後，每一塊都是獨立於其餘部分的單獨空間。這和在一個大房幾里砌堵牆有幾分相似 如果您在其中一間房間裡安置傢俱，不會對其它房間有任何影響。

source: Whenever this section talks about <quote>disks</quote> you should translate this into a DASD or VM minidisk in the &arch-title; world. Also a machine means an LPAR or VM guest in this case.
el: Κάθε φορά που η ενότητα αυτή μιλά για <quote>δίσκους</quote> θα πρέπει αυτό να μεταφράζεται σε ένα DASD ή σε VM minidisk στον κόσμο της αρχιτεκτονικής &arch-title; Επίσης "μηχάνημα" στην περίπτωση αυτή σημαίνει ένα LPAR ή ένα φιλοξενούμενο σύστημα VM.
ko: 여기서 <quote>디스크</quote>에 관해 이야기할 때에는, &arch-title;에 있는 DASD나 VM 미니디스크를 말한다고 해석해야 합니다. 또 이 경우 기계라고 할 때는 LPAR이나 VM guest를 말합니다.
pt: Quando esta secção falar sobre <quote>discos</quote> você deve traduzir isto em DASD ou minidisk VM no mundo de &arch-title;. Também neste caso uma máquina significa LPAR ou VM guest.
ru: Всякий раз, когда в этом разделе говорится <quote>диск</quote>, вы должны понимать это как DASD или VM минидиск в мире &arch-title;. Здесь же, машина означает LPAR или гостевую VM.
zh_cn: 本节中所有提到<quote>硬盘</quote>的地方，您应当把它理解为 &arch-title; 世界中的 DASD 或者 VM minidisk。同时，在这里，一台机器意指的是 LPAR 或者客户虚拟机。
zh_tw: 本節中所有提到<quote>硬碟</quote>的地方，您應當把它解讀為為 &arch-title; 世界中的 DASD 或者 VM minidisk。同時，在這裡，一台機器意指的是 LPAR 或者是 VM 訪客。

source: If you already have an operating system on your system <phrase arch="i386"> (Windows 9x, Windows NT/2000/XP, OS/2, MacOS, Solaris, FreeBSD, &hellip;) </phrase> <phrase arch="alpha"> (Tru64 (Digital UNIX), OpenVMS, Windows NT, FreeBSD, &hellip;) </phrase> <phrase arch="s390"> (VM, z/OS, OS/390, &hellip;) </phrase> <phrase arch="m68k"> (Amiga OS, Atari TOS, Mac OS, &hellip;) </phrase> and want to stick Linux on the same disk, you will need to repartition the disk. Debian requires its own hard disk partitions. It cannot be installed on Windows or MacOS partitions. It may be able to share some partitions with other Linux systems, but that's not covered here. At the very least you will need a dedicated partition for the Debian root.
el: Αν έχετε ήδη ένα λειτουργικό σύστημα στο μηχάνημα <phrase arch="i386"> (Windows 9x, Windows NT/2000/XP, OS/2, MacOS, Solaris, FreeBSD, &hellip;) </phrase> <phrase arch="alpha"> (Tru64 (Digital UNIX), OpenVMS, Windows NT, FreeBSD, &hellip;) </phrase> <phrase arch="s390"> (VM, z/OS, OS/390, &hellip;) </phrase> <phrase arch="m68k"> (Amiga OS, Atari TOS, Mac OS, &hellip;) </phrase>και θέλετε να "κολλήσετε" το Linux στον ίδιο δίσκο θα πρέπει να επανατμήσετε το δίσκο. Το Debian απαιτεί τα δικά του τμήματα δίσκου. Δεν μπορεί να εγκατασταθεί σε τμήματα δίσκου των Windows ή του MacOS. Ίσως να μπορεί να μοιραστεί κάποια τμήματα με άλλα συστήματα Linux αλλά κάτι τέτοιο δεν καλύπτεται εδώ. Στην ελάχιστη περίπτωση θα χρειαστείτε ένα τμήμα δίσκου αφιερωμένη ειδικά στο ριζικό σύστημα του Debian.
ko: 시스템에 이미 다른 운영 체제가 들어 있고 <phrase arch="i386"> (Windows 9x, Windows NT/2000/XP, OS/2, MacOS, Solaris, FreeBSD, &hellip;) </phrase> <phrase arch="alpha"> (Tru64 (Digital UNIX), OpenVMS, Windows NT, FreeBSD, &hellip;) </phrase> <phrase arch="s390"> (VM, z/OS, OS/390, &hellip;) </phrase> <phrase arch="m68k"> (Amiga OS, Atari TOS, Mac OS, &hellip;) </phrase> 같은 디스크에 리눅스도 설치하려는 경우에는 디스크를 다시 파티션해야 합니다. 데비안은 데비안만의 디스크 파티션이 따로 있어야 합니다. 데비안은 Windwos나 MacOS 파티션에 설치할 수 없습니다. 다른 리눅스 시스템과는 일부 파티션을 공유할 수도 있지만, 여기서는 그 방법에 대해 다루지 않습니다. 최소한 데비안 루트에 사용할 전용 파티션이 하나 있어야 합니다.
pt: Se você já tem um sistema operativo no seu sistema <phrase arch="i386"> (Windows 9x, Windows NT/2000/XP, OS/2, MacOS, Solaris, FreeBSD, &hellip;) </phrase> <phrase arch="alpha"> (Tru64 (Digital UNIX), OpenVMS, Windows NT, FreeBSD, &hellip;) </phrase> <phrase arch="s390"> (VM, z/OS, OS/390, &hellip;) </phrase> <phrase arch="m68k"> (Amiga OS, Atari TOS, Mac OS, &hellip;) </phrase> e quiser meter Linux no mesmo disco, vai necessitar de reparticionar o disco. Debian necessita das suas próprias partições no disco rígido. Não pode ser instalado em partições Windows ou MacOS. Pode ser possível partilhar algumas partições com outros sistemas Linux, mas isso não é coberto aqui. No mínimo necessita de uma partição dedicada para a raiz de Debian.
ru: Если у вас уже установлена операционная система на машине <phrase arch="i386"> (Windows 9x, Windows NT/2000/XP, OS/2, MacOS, Solaris, FreeBSD, &hellip;) </phrase> <phrase arch="alpha"> (Tru64 (Digital UNIX), OpenVMS, Windows NT, FreeBSD, &hellip;) </phrase> <phrase arch="s390"> (VM, z/OS, OS/390, &hellip;) </phrase> <phrase arch="m68k"> (Amiga OS, Atari TOS, Mac OS, &hellip;) </phrase> и вы хотите добавить Linux на тот же диск, то вам нужно его переразметить. Для Debian нужно создать отдельные разделы на жёстком диске. Он не может быть установлен на разделы Windows или MacOS. Он может совместно использовать некоторые разделы с другими системами Linux, но в этом руководстве это не описывается. Как минимум, вам нужно выделить место под корневой раздел Debian.
zh_cn: 如果您已经在您的机器中安装有操作系统 <phrase arch="i386"> (Windows 9x, Windows NT/2000/XP, OS/2, MacOS, Solaris, FreeBSD, &hellip;) </phrase> <phrase arch="alpha"> (Tru64 (Digital UNIX), OpenVMS, Windows NT, FreeBSD, &hellip;) </phrase> <phrase arch="s390"> (VM, z/OS, OS/390, &hellip;) </phrase> <phrase arch="m68k"> (Amiga OS, Atari TOS, Mac OS, &hellip;) </phrase> 同时也希望把 Linux 装在同一块硬盘上，那么您就必须重新对硬盘分区。Debian 需要它自己专用 的硬盘分区。它不能被安装在 Windows 或者 MacOS 的分区上。它可以与其它 Linux 系统共享 一些分区，但是我们在这里不会对此进行说明。最起码，您要为 Debian 的根目录准备一个专用的 分区。
zh_tw: 如果您已經在您的機器中安裝作業系統 <phrase arch="i386"> (Windows 9x, Windows NT/2000/XP, OS/2, MacOS, Solaris, FreeBSD, &hellip;) </phrase> <phrase arch="alpha"> (Tru64 (Digital UNIX), OpenVMS, Windows NT, FreeBSD, &hellip;) </phrase> <phrase arch="s390"> (VM, z/OS, OS/390, &hellip;) </phrase> <phrase arch="m68k"> (Amiga OS, Atari TOS, Mac OS, &hellip;) </phrase> ，同時也希望把 Linux 裝在同一顆硬碟上，那麼您就必須重新對硬碟進行分割。Debian 需要它自己專用的硬碟分割區。它不能被安裝在 Windows 或者 MacOS 的分割區上。它可以與其它 Linux 系統共享一些分割區，但是我們在這裡不會對此進行說明。最起碼，您要為 Debian 的根目錄準備一個專用的分割區。

source: You can find information about your current partition setup by using a partitioning tool for your current operating system<phrase arch="i386">, such as fdisk or PartitionMagic</phrase><phrase arch="powerpc">, such as Drive Setup, HD Toolkit, or MacTools</phrase><phrase arch="m68k">, such as HD SC Setup, HDToolBox, or SCSITool</phrase><phrase arch="s390">, such as the VM diskmap</phrase>. Partitioning tools always provide a way to show existing partitions without making changes.
el: Μπορείτε να βρείτε πληροφορίες σχετικά με την υπάρχουσα διαμόρφωση των τμημάτων του δίσκου σας χρησιμοποιώντας ένα εργαλείο διαμέρισης για το υπάρχον λειτουργικό σας σύστημα <phrase arch="i386">, όπως για παράδειγμα το fdisk ή το PartitionMagic</phrase><phrase arch="powerpc">, όπως το Drive Setup, το HD Toolkit, ή το MacTools</phrase><phrase arch="m68k">, όπως το HD SC Setup, το HDToolBox, ή το SCSITool</phrase><phrase arch="s390">, όπως το VM diskmap</phrase>. Τα εργαλείο διαμέρισης παρέχουν πάντα έναν τρόπο να δείτε τις υπάρχουσες κατατμήσεις χωρίς να κάνετε κάποιες αλλαγές.
ko: 현재 파티션 상태는<phrase arch="i386"> fdisk나 PartitionMagic같은</phrase><phrase arch="powerpc"> Drive Setup이나 HD Toolkit이나 MacTools같은</phrase><phrase arch="m68k"> HD SC Setup이나 HDToolBox나 SCSITool같은</phrase><phrase arch="s390"> VM diskmap같은</phrase> 현재 운영 체제의 파티션 도구를 이용해 알아볼 수 있습니다. 모든 파티션 도구는 파티션을 바꾸지 않고도 현재 파티션을 보기만 할 수 있습니다.
pt: Você pode encontrar informação acerca da sua configuração actual de partições utilizando um utilitário de particionamento para o seu actual sistema operativo, <phrase arch="i386"> tal como o fdisk ou o PartitionMagic</phrase><phrase arch="powerpc">, tal como o Drive Setup, HD Toolkit, ou MacTools</phrase><phrase arch="m68k">, tal como HD SC Setup, HDToolBox, ou SCSITool</phrase><phrase arch="s390">, tal como o VM diskmap</phrase>. As ferramentas de particionamento têm sempre um meio de mostrar as partições sem efectuar alterações.
ru: Вы можете найти информацию об имеющихся разделах с помощью инструментов разметки из имеющейся операционной системы<phrase arch="i386">, например fdisk или PartitionMagic</phrase><phrase arch="powerpc">, например Drive Setup, HD Toolkit или MacTools</phrase><phrase arch="m68k">, например HD SC Setup, HDToolBox или SCSITool</phrase><phrase arch="s390">, например VM diskmap</phrase>. Любая утилита разметки умеет показывать существующие разделы без их изменения.
zh_cn: 您可以通过当前的操作系统中的分区工具软件来获知您现在的分区状况<phrase arch="i386">，如 fdisk 和 PartitionMagic</phrase><phrase arch="powerpc">，如 Drive Setup、HD Toolkit 和 MacTools</phrase><phrase arch="m68k">，如 HD SC Setup、HDToolBox 和 SCSITool</phrase><phrase arch="s390">，如 VM diskmap</phrase>分区工具软件总会提供一种办法让您查看现有的分区情况，而不作任何改动。
zh_tw: 您可以透過目前作業系統中的分割工具軟體來獲知您現在的分割區狀況<phrase arch="i386">，如 fdisk 和 PartitionMagic</phrase><phrase arch="powerpc">，如 Drive Setup、HD Toolkit 和 MacTools</phrase><phrase arch="m68k">，如 HD SC Setup、HDToolBox 和 SCSITool</phrase><phrase arch="s390">，如 VM diskmap</phrase>分割工具軟體總會提供一種辦法讓您查看現有的分割區情況，而不作任何改動。

source: In general, changing a partition with a file system already on it will destroy any information there. Thus you should always make backups before doing any repartitioning. Using the analogy of the house, you would probably want to move all the furniture out of the way before moving a wall or you risk destroying it.
el: Γενικά η αλλαγή μιας κατάτμησης με ένα υπάρχον σύστημα αρχείων ήδη σε αυτήν, θα καταστρέψει οποιαδήποτε πληροφορία υπάρχει σε αυτήν. Κατά συνέπεια θα πρέπει πάντα να σώζετε τα δεδομένα σας πριν κάνετε οποιαδήποτε επαναδιαμέριση. Χρησιμοποιώντας την αναλογία με ένα σπίτι που είδαμα και πριν, θα θέλατε πιθανότατα να μετακινήσετε όλα τα έπιπλα σας από τη μέση πριν μετακινήσετε οποιονδήποτε τοίχο, διαφορετικά κινδυνεύετε να τα καταστρέψετε.
ko: 이미 파일 시스템이 들어 있는 파티션을 바꾸면 보통 거기에 들어 있는 정보가 모두 망가집니다. 그러므로 파티션 작업을 하기 하기 전에 항상 백업을 만들어야 합니다. 집의 경우에 비유하자면, 벽을 옮기기 전에 모든 가구를 다른 곳에 옮겨 놓아야 가구가 망가지지 않을 겁니다.
pt: Regra geral, alterar uma partição já com um sistema de ficheiros nela irá destruir essa informação. Por isso deve sempre salvaguardar os seus dados antes de efectuar qualquer reparticionamento. Utilizando a analogia da casa, você provavelmente quer mover toda a mobília para fora do caminho antes de mudar uma parede, ou arrisca-se a destruí-la.
ru: Изменение раздела с уже имеющейся файловой системой уничтожит всю информацию на нём. То есть вы всегда должны сделать резервную копию всей информации перед переразметкой. Используя аналогию с домом, вы вероятно захотите вынести всю мебель перед переносом стен или же вы рискуете попортить её.
zh_cn: 通常情况下，改动一个已经建立文件系统的分区，会导致其中的数据信息遭到损毁。因而，您应当在重新分区之前总是先做一下备份。继续拿房子作比喻，在移动墙壁时，您最好在把挡路的家具都移开，否则就要冒家具被毁坏的危险。
zh_tw: 在一般情況下，改動一個已經建立檔案系統的分割區，會導致其中的資料遭到損毀。因而，您每次都應當在重新分割之前先做好備份。繼續拿房幾作比喻，在移動牆壁時，您最好在把擋路的傢俱都移開，否則就要冒著傢俱被破壞的危險。
