Repository: xobs/debian-installer
Catalog: doc/manual/po/*/preparing.po
Languages: el, ko, pt, ru, zh_cn, zh_tw

source: If your computer has more than one hard disk, you may want to dedicate one of the hard disks completely to Debian. If so, you don't need to partition that disk before booting the installation system; the installer's included partitioning program can handle the job nicely.
el: Αν ο υπολογιστής σας έχει περισσότερους από έναν δίσκους, μπορεί να θελήσετε να αφιερώσετε έναν δίσκο αποκλειστικά στο Debian. Αν αποφασίσετε να κάνετε κάτι τέτοιο τότε δεν χρειάζεται να διαμερίσετε τον δίσκο πριν την εκκίνηση του συστήματος εγκατάστασης. Το πρόγραμμα διαμέρισης που περιλαμβάνει ο εγκαταστάτης μπορεί να το κάνει αυτό πολύ καλά.
ko: 컴퓨터에 하드 디스크가 여러 개 있으면, 어떤 한 하드 디스크 전체에 데비안을 설치할 경우가 있습니다. 그러한 경우에는 설치 시스템을 부팅하기 전에 디스크를 파티션할 필요가 없습니다. 설치 프로그램에 포함된 파티션 프로그램이 파티션 작업을 훌륭하게 처리합니다.
pt: Se o seu computador tem mais de um disco rígido, você pode querer dedicar um dos discos inteiramente a Debian. Se o fizer não necessita de particionar esse disco antes de iniciar o sistema de instalação; o programa de particionamento incluído no instalador pode lidar facilmente com essa tarefa.
ru: Если на вашем компьютере имеется более одного жёсткого диска, вы можете выделить один диск полностью под Debian. Если это так, то вам не нужно размечать диск перед загрузкой системы установки; программа установки содержит утилиту разметки, которая хорошо справляется со своей работой.
zh_cn: 如果您的计算机配有不只一块硬盘，您或许可以考虑把其中一块硬盘专门分配给 Debian 使用。这样的话，您就不用在启动安装系统前再对那块硬盘进行分区了，安装程序自带的分区程序会 漂亮地完成这个任务。
zh_tw: 如果您的電腦配有不只一塊硬碟，您或許可以考慮把其中一塊硬碟專門分配給 Debian 使用。這樣的話，您就不用在開機安裝系統前再對那塊硬碟進行分割區了，安裝程式內建的分割區程式會漂亮地完成這個任務。

source: If your machine has only one hard disk, and you would like to completely replace the current operating system with &debian;, you also can wait to partition as part of the installation process (<xref linkend="partman"/>), after you have booted the installation system. However this only works if you plan to boot the installer system from tapes, CD-ROM or files on a connected machine. Consider: if you boot from files placed on the hard disk, and then partition that same hard disk within the installation system, thus erasing the boot files, you'd better hope the installation is successful the first time around. At the least in this case, you should have some alternate means of reviving your machine like the original system's installation tapes or CDs.
el: Αν το μηχάνημά σας έχει μόνο έναν δίσκο και θα θέλατε να αντικαταστήσετε τελείως το υπάρχον λειτουργικό σύστημά σας με το &debian;, μπορείτε επίσης να περιμένετε να γίνει η διαμέριση σαν μέρος της διαδικασίας εγκατάστασης <xref linkend="partman"/>),μετά την εκκίνηση του συστήματος εγκατάστασης. Όμως αυτό θα δουλέψει μόνο αν σκοπεύετε να εκκινήσετε τον εγκαταστάτη από ταινίες, CD-ROM ή αρχεία σε κάποιο συνδεδεμένο μηχάνημα. Σκεφθείτε: αν εκκινήσετε από αρχεία που βρίσκονται στον σκληρό δίσκο και μετά διαμερίσετε αυτόν τον ίδιο δίσκο όντας στο σύστημα εγκατάστασης, και συνεπώς διαγράφοντας τα αρχεία εκκίνησης, τότε θα πρέπει να ευχηθείτε ότι η εγκατάσταση θα είναι περυχημένη για πρώτη φορά στα χρονικά! Το λιγότερο που πρέπει να εξασφαλίσετε στην περίπτωση αυτή είναι να έχετε διαθέσιμα κάποια εναλλακτικά μέσα αναζωογόνησης του μηχανήματός σας.όπως για παράδειγμα τις ταινίες ή CD του αρχικού λειτουργικού συστήματος.
ko: 컴퓨터에 하드 디스크가 한 개 있고, 지금 운영 체제를 &debian;으로 완전히 덮어 쓰려고 한다면, 설치 시스템을 부팅한 다음에 설치하는 과정에서 파티션을 할 수도 있습니다 (<xref linkend="partman"/>). 하지만 설치 시스템을 테이프나 CD-ROM이나 연결되어 있는 다른 기계에서 파일로 부팅할 경우에만 이렇게 할 수 있습니다. 생각해 보면 하드 디스크에 부팅 파일을 넣고 같은 그 하드 디스크를 파티션해 버린다면, 부팅 파일들이 지워질 수밖에 없고, 그것보다는 첫 단계에서 설치를 성공적으로 하는 편이 더 낫습니다. 최소한 이러한 경우에는, 원래 운영체제의 설치 테이프나 CD같은 걸로 기계를 복구할 방법을 가지고 있는 게 좋습니다.
pt: Se a sua máquina tem apenas um disco rígido, e se você desejar substituir completamente o sistema operativo actual por &debian;, pode também esperar para particionar como parte do processo de instalação (<xref linkend="partman"/>), após ter arrancado com o sistema de instalação. No entanto isto só funciona se planear iniciar o instalador a partir de tapes, CD-ROM ou ficheiros numa máquina ligada. Considere: Se iniciar a partir de ficheiros no disco rígido, e se depois particionar esse mesmo disco dentro do sistema de instalação, e apagar os ficheiros para arranque, é melhor esperar que a instalação tenha sucesso à primeira vez. Neste caso, no mínimo, você deve ter meios alternativos de recuperar a sua máquina tal como os CDs ou tapes originais de instalação.
ru: Если ваша машина содержит только один жёсткий диск и вы хотите заменить установленную операционную систему на &debian;, то также можете произвести разметку в процессе установки (<xref linkend="partman"/>) после загрузки системы установки. Однако, это сработает только если вы планируете загружать программу установки с лент, CD-ROM или с удалённой машины. Учтите: если вы загружаетесь с раздела жёсткого диска и затем разметите этот жёсткий диск во время установки системы, то это удалит загрузочные файлы, и будем надеяться, что установка пройдёт с первого раза. Для этого случая вы должны иметь альтернативное средство оживить машину, например с оригинальных системных установочных лент или CD.
zh_cn: 若是您的机器只有一块硬盘，而且您愿意把原来的操作系统全盘替换成 &debian;，那么您可以在启动安装系统后，待到安装时再进行分区(<xref linkend="partman"/>)。但是，只有当您使用存储于磁带、CD-ROM 或者联网的机器上的安装系统，并从它们启动安装程序时，上面的话才适用于您的情形。试想一下：假如您用放在硬盘上的文件启动，再在安装系统中对同一块 硬盘进行分区，这就会擦除那些启动文件，这时恐怕您只能祈求上苍保佑第一次就安装成功吧。在这种 情况下，若要让您的机器恢复正常，至少您还可以有几个办法可选，比如原先系统的安装磁带或 CD。
zh_tw: 若是您的機器只有一顆硬碟，而且您願意把原來的作業系統全部替換成 &debian;，那麼您可以在開機安裝系統後，等待安裝時再進行分割 (<xref linkend="partman"/>)。 但是，只有當您使用儲存於磁帶、光碟機或者網際網路上的機器的安裝系統，並從它們開機安裝程式時，前述才適用於您的情形。試想一下：假如您用放在硬碟上的檔案開機，再在安裝系統中對同一顆硬碟進行分割，這會清除那些開機檔案，這時您恐怕只能祈求上蒼保佑第一次就安裝成功。在這種情況下，若要讓您的機器恢復正常，至少您還可以有幾個辦法可選，例如原先系統的安裝磁帶或光碟。

source: If your machine already has multiple partitions, and enough space can be provided by deleting and replacing one or more of them, then you too can wait and use the Debian installer's partitioning program. You should still read through the material below, because there may be special circumstances like the order of the existing partitions within the partition map, that force you to partition before installing anyway.
el: Αν το μηχάνημά σας έχει ήδη αρκετές κατατμήσεις και μπορεί να δημιουργηθεί αρκετός χώρος διαγράφοντας ή αντικαθιστώντας μια ή περισσότερες από αυτές, τότε μπορείτε επίσης να περιμένετε να γίνει η διαμέριση χρησιμοποιώντας το πρόγραμμα διαμέρισης του εγκαταστάτη. Παρόλα αυτά συνεχίστε το διάβασμα στις παρακάτω ενότητες γιατί μπορεί σαν αποτέλεσμα κάποιων ειδικών περιστάσεων όπως η διάταξη των υπαρχουσών κατατμήσεων μέσα στον πίνακα διαμέρισης, να σας υποχρεώσουν να κάνετε έτσι κι αλλιώς τη διαμέριση πριν την εγκατάσταση.
ko: 기계에 파티션이 여러 개 있다면, 그리고 파티션을 지워서 충분한 공간이 나온다면 기다렸다가 데비안 설치 프로그램의 파티션 프로그램을 사용할 수 있습니다. 이 경우에도 아래의 내용을 읽어야 특별한 상황에 대처할 수 있습니다. 예를 들어 파티션에서 기존 파티션의 순서때문에 설치 전에 파티션해야 할 수도 있습니다.
pt: Se a sua máquina já tem múltiplas partições, e pode ser disponibilizado espaço livre suficiente apagando e substituindo uma ou mais dessas, desse modo pode também esperar e utilizar o programa de particionamento do instalador de Debian. Você deve na mesma continuar a ler o material abaixo, porque podem ocorrer circunstâncias especiais tal como a ordem das partições existentes dentro do mapa de partições, que o obriguem a particionar antes de instalar.
ru: Если на машине уже есть несколько разделов, а достаточное место может быть получено удалением или замещением одного или двух из них, то вы также можете отложить разметку до процедуры установки Debian. Тем не менее, вы всё равно должны дочитать этот материал до конца, так как могут встретиться необычные комбинации, типа соблюдения порядка существующих разделов в таблице разделов, что всё равно заставит вас переразмечать диск до запуска установки.
zh_cn: 倘若您的机器已经有多个分区，并且通过删除或替换它们中的一个或多个就能为 安装提供足够的空间，那么您一样也可以把分区操作延后，到安装时再使用 Debian 安装程序自带的分区工具。不过，您还是应当继续读完下面的文档，因为可能会存在一些特殊的情形。比如，分区表中现有分区的顺序问题，这也许会令您不得不在安装前先分好区。
zh_tw: 倘若您的機器已經有多個分割區，並且透過刪除或替換它們其中的一個或多個就能為安裝程式提供足夠的空間，那麼您一樣也可以把分割區操作延後，到安裝時再使用 Debian 安裝程式內建的分割工具。不過，您還是應該繼續讀完下面的文件，因為可能會有些特殊情形。例如，分割表中現有分割區的順序問題，這也許會令您不得不在安裝前先切割好分割區。

source: If your machine has a FAT or NTFS filesystem, as used by DOS and Windows, you can wait and use Debian installer's partitioning program to resize the filesystem.
el: Αν το μηχάνημά σας έχει ένα σύστημα αρχείων FAT που χρησιμοποιείται από το DOS ή Windows, μπορείτε να περιμένετε και να χρησιμοποιήσετε το πρόγραμμα κατάτμησης του εγκαταστάτη του Debian για να αλλάξετε το μέγεθος του συστήματος αρχείων.
ko: 기계에 DOS나 Windows에서 사용하는 FAT나 NTFS 파일 시스템이 있으면, 데비안 설치 프로그램의 파티션 프로그램을 이용해서 파일시스템 크기를 조정할 수 있습니다.
pt: Se a sua máquina tem um sistema de ficheiros FAT ou NTFS, tal como os utilizados pelo DOS e pelo Windows, você pode esperar e utilizar o programa de particionamento do instalador de Debian para redimensionar o sistema de ficheiros.
ru: Если ваша машина содержит файловую систему FAT или NTFS, используемую DOS и Windows, то вы можете подождать и использовать утилиту разметки из программы установки Debian для изменения размера файловой системы.
zh_cn: 如果您的计算机上有 FAT 或 NTFS 文件系统，它被 DOS 和 Windows 使用，您可以等到用 Debian 安装程序中的分区工具来重新调整文件系统的大小。
zh_tw: 如果您的電腦上有被 DOS 和 Windows 使用的 FAT 或 NTFS 檔案系統，您可以等到用 Debian 安裝程式中的分割工具來重新調整檔案系統的大小。

source: If none of the above apply, you'll need to partition your hard disk before starting the installation to create partition-able space for Debian. If some of the partitions will be owned by other operating systems, you should create those partitions using native operating system partitioning programs. We recommend that you do <emphasis>not</emphasis> attempt to create partitions for &debian; using another operating system's tools. Instead, you should just create the native operating system's partitions you will want to retain.
el: Αν τίποτα από τα παραπάνω δεν εφαρμόζονται στην περίπτωσή σας, θα χρειαστεί να διαμερίσετε το δίσκο σας πριν την έναρξη της εγκατάστασης ώστε να δημιουργήσετε τον κατάλληλα διαμερίσιμο χώρο για το Debian. Αν κάποιες καταμήσεις θα ανήκουν σε άλλα λειτουργικά συστήματα τότε θα ήταν καλίτερο να δημιουργήσετε αυτές τις κατατμήσεις με κάποια προγράμματα διαμέρισης από τα ίδια τα λειτουργικά αυτά. Συνιστούμε έντονα να <emphasis>μην</emphasis> προσπαθήσετε να φτιάξετε κάποιες κατατμήσεις για το &debian; χρησιμοποιώντας εργαλεία κάποιου άλλου λειτουργικού συστήματος. Αντίθετα θα πρέπει με αυτά να δημιουργήσετε μόνο τις κατατμήσεις για το αρχικό λειτουργικό σύστημα που θέλετε να διατηρήσετε.
ko: 위의 경우 중 아무것도 아니라면, 데비안에 파티션 가능한 공간을 만들기 위해 설치 전에 파티션을 해야 합니다. 다른 운영체제가 들어 있는 파티션이 들어 있으면, 원래 운영 체제 프로그램의 파티션 프로그램을 이용해 파티션해야 합니다. 다른 운영 체제의 도구로 &debian;의 파티션을 만들지 <emphasis>않기를</emphasis> 권장합니다. 대신에, 계속 유지하려는 원래 운영 체제의 파티션만 만들어야 합니다.
pt: Se não for aplicável nenhum dos acima, você vai necessitar de particionar o seu disco rígido antes de começar a instalação para criar espaço particionável para Debian. Se algumas das partições pertencerem a outros sistemas operativos, você deve criar essas partições utilizando os programas nativos desses sistemas operativos. Nós recomendamos que você <emphasis>NÃO</emphasis> tente criar partições para &debian; utilizando utilitários de outro sistema operativo. Em vez disso, você deve apenas criar as partições do sistema operativo nativo com que deseja ficar.
ru: Если ни один из описанных вариантов не подошёл, то вам нужно разметить диск перед запуском установки, чтобы выделить место под разделы Debian. Если некоторые разделы должны принадлежать другим операционным системам, то вы должны создать эти разделы с помощью программ разметки из этих операционных систем. Мы рекомендуем <emphasis>не</emphasis> пытаться создать разделы &debian; с помощью утилит других операционных систем. Вместо этого, вы должны только создать разделы для родной операционной системы, которую хотите сохранить.
zh_cn: 如果您的情况不属于上面任何一种，那么您需要在开始安装之前，事先为 Debian 腾出可用于 分区的空间。要是有分区是为其它操作系统准备的，您最好用该操作系统自己的分区软件来新建 这些分区。我们建议您 <emphasis>不要</emphasis> 用其它操作系统里的工具为 Debian 创建 Linux 分区。也就是说，您应当仅仅创建要保留的操作系统自身的分区。
zh_tw: 如果您的情況不屬於上面任何一種，那麼您需要在開始安裝之前，事先為 Debian 騰出可用於分割區的空間。要是有分割區是為其它作業系統準備的，您最好用該作業系統自己的分割軟體來建立這些分割區。我們建議您<emphasis>不要</emphasis>用其它作業系統裡的工具為 Debian 建立 Linux 分割區。也就是說，您應當僅建立要保留的作業系統自身的分割區。

source: If you are going to install more than one operating system on the same machine, you should install all other system(s) before proceeding with Linux installation. Windows and other OS installations may destroy your ability to start Linux, or encourage you to reformat non-native partitions.
el: Αν σκοπεύετε να εγκαταστήσετε περισσότερα από ένα λειτουργικά συστήματα στο ίδιο μηχάνημα. θα πρέπει να εγκαταστήσετε όλα τα άλλα λειτουργικά πριν προχωρήσετε με την εγκατάσταση του Linux. Η εγκατάσταση των Windows ή άλλων λειτουργικών μπορεί να καταστρέψουν τη δυνατότητα να ξεκινήσετε το Linux ή να σας ενθαρρύνουν να επαναδιαμορφώσετε κάποιες μη-φυσικές κατατμήσεις.
ko: 같은 기계에 여러 개의 운영 체제를 설치하려는 경우, 리눅스를 설치하기 전에 다른 운영체제를 먼저 설치해야 합니다. Windows 및 다른 운영 체제를 설치하면 리눅스를 시작하지 못하게 될 수도 있고, 설치 과정에서 네이티브가 아닌 파티션을 다시 포맷하라고 할 수도 있습니다.
pt: Se vai instalar mais do que um sistema operativo na mesma máquina, Você deve instalar todos os outros sistemas operativos antes de proceder com a instalação de Linux. As instalações de Windows e de outros SO podem tirar a possibilidade de iniciar Linux, ou encoraja-lo a reformatar as partições não-nativas.
ru: Если вы хотите устанавить более одной операционной системы на одну машину, то вы должны установить все операционные системы перед установкой Linux. Windows и другие ОС могут уничтожить возможность запуска Linux или посоветовать вам переформатировать все неизвестные для них разделы.
zh_cn: 倘若您打算在同一台机器上安装多个操作系统的话，您应当在安装 Linux 之前，先把所有其它 系统都装好。Windows 和其它操作系统的安装过程可能会让您无法启动 Linux，也可能会怂恿您重新格式化不属于它们自己的分区。
zh_tw: 倘若您打算在同一台機器上安裝多個作業系統，您應當在安裝 Linux 之前，先把所有其它系統都裝好。Windows 和其它作業系統的安裝過程可能會讓您無法開機 Linux，也可能會慫恿您重新格式化不屬於它們自己的分割區。

source: You can recover from these actions or avoid them, but installing the native system first saves you trouble.
el: Μπορείτε να επανέλθετε από τέτοιες ενέργειες ή να τις αποφύγετε, αλλά η εγκατάσταση πριν από ο,τιδήποτε άλλο του αρχικού λειτουργικού σας γλιτώνει από πολλά προβλήματα.
ko: 이런 동작들은 복구할 수도 있고, 피할 수 있습니다. 하지만 네이티브 시스템을 먼저 설치하면 이런 문제가 없습니다.
pt: Você pode recuperar destas acções ou evita-las, mas instalar primeiro o sistema operativo nativo poupa-lhe trabalho.
ru: Вы можете устранить последствия таких действий или избежать их, но установка родной системы в первую очередь оградит вас от подобных проблем.
zh_cn: 尽管您可以在这些操作之后再恢复回来，也可以避免它们，但是首先安装原有的系统就能够 帮您免除这些烦恼。
zh_tw: 儘管您可以在這些操作之後再恢復回來，也可以避免它們，但是首先安裝本地系統就能夠幫您免除這些煩惱。

source: In order for OpenFirmware to automatically boot &debian; the Linux partitions should appear before all other partitions on the disk, especially MacOS boot partitions. This should be kept in mind when pre-partitioning; you should create a Linux placeholder partition to come <emphasis>before</emphasis> the other bootable partitions on the disk. (The small partitions dedicated to Apple disk drivers are not bootable.) You can delete the placeholder with the Linux partition tools later during the actual install, and replace it with Linux partitions.
el: Για να μπορεί το OpenFirmware να ξεκινά αυτόματα το &debian; οι κατατμήσεις του Linux θα πρέπει να εμφανίζονται πριν από οποιεσδήποτε άλλες κατατμήσεις στον δίσκο, ειδικότερα κατατνήσεις εκκίνησης του MacOS. Συγκρατείστε αυτό το στοιχείο πριν κάνετε την προ-διαμέριση: θα πρέπει να δημιουργήσετε μια κατάτμηση "υποδοχής" του Linux που να βρίσκεται <emphasis>πριν</emphasis> από τις άλλες εκκινήσιμες κατατμήσεις στο δίσκο (οι μικρές κατατμήσεις που είναι αφιερωμένες στους οδηγούς δίσκους της Apple δεν είναι εκκινήσιμες). Μπορείτε να σβήσετε αυτή την αρχική κατάτμηση για το Linux με τα εργαλεία διαμέρισης του Linux αργότερα στη διάρκεια της πραγματικής εγκατάστασης και να την αντικαταστήσετε με κατατμήσεις Linux.
ko: OpenFirmware에서 &debian;을 자동으로 부팅하도록 하려면, 리눅스 파티션이 해당 디스크의 다른 파티션보다, 특히 MacOS 부팅 파티션보다 앞에 있어야 합니다. 미리 파티션할 때 다음을 염두에 둬야 합니다. 디스크의 다른 부팅 가능 파티션보다 앞 쪽 위치에 리눅스 파티션이 들어갈 파티션을 만드십시오. (Apple 디스크 드라이버 전용 작은 파티션은 부팅 가능하지 않습니다.) 실제 설치할 때 리눅스 파티션 도구를 이용해 그 위치에 리눅스 파티션을 만들 수 있습니다.
pt: De modo que o OpenFirmware possa iniciar automaticamente &debian; as partições de Linux devem aparecer antes das outras partições no disco, especialmente as partições MacOS. Deve ter isto em mente antes do pré-particionamento; Você deve criar uma partição para marcar o espaço de Linux que fique <emphasis>antes</emphasis> das outras partições de arranque no disco. (As pequenas partições dedicadas aos discos de drivers Apple não são de arranque.) Depois você pode apagar partição que marca o espaço com os utilitários de partições de Linux durante a instalação, e substituí-la por partições de Linux.
ru: Чтобы из OpenFirmware автоматически загружался &debian; Linux разделы должны стоять перед остальными разделами на диске, особенно перед загрузочным разделом MacOS. Это нужно помнить при переразметке; вы должны создать раздел-пустышку под Linux <emphasis>перед</emphasis> другими загрузочными разделами на диске. (Маленькие разделы, выделенные длядисковых драйверов Apple не загружаемые.) Вы можете удалить раздел-пустышку с помощью утилит разметки Linux позже во время установки, и заменить его на раздел Linux.
zh_cn: 为了能让 OpemFirmware 自动启动 &debian; Linux 分区必须被安置在其它分区之前，特别是 MacOS 的启动分区。在事先分区时，这一点您必须牢记在心。即，您必须在其它 可引导分区 <emphasis>之前</emphasis> 为 Linux 预留一个分区。(专门留给 Apple 的硬盘驱动程序的那些小分区并不是可引导的。) 您可以在真正安装时，用 Linux 的分区工具来删除当初预留的分区，再用 Linux 的分区取而代之。
zh_tw: 為了能讓 OpemFirmware 自動開機，&debian; Linux 分割區必須被安置在其它分割區之前，特別是 MacOS 的開機分割區。在分割之前時，這一點您必須牢記在心。也就是說，您必須在其它可開機分割區<emphasis>之前</emphasis>為 Linux 預留一個分割區。(專門留給 Apple 的硬碟驅動程式的那些小分割區並不是可開機的。) 您可以在真正安裝時，用 Linux 的分割區工具來刪除當初預留的分割區，再用 Linux 的分割區取而代之。

source: If you currently have one hard disk with one partition (a common setup for desktop computers), and you want to multi-boot the native operating system and Debian, you will need to:
el: Αν έχετε αυτή τη στιγμή έναν σκληρό δίσκο με μια κατάτμηση (μια συνηθισμένη περίπτωση για υπολογιστές γραφείου) και θέλετε να έχετε πολλαπλή εκκίνηση με το αρχικό λειτουργικό σύστημα και το Debian, θα πρέπει να:
ko: 파티션이 한 개인 하드 디스크가 한 개 있고 (일반적인 데스크탑 컴퓨터), 원래 운영 체제와 데비안을 멀티 부팅하는 경우, 다음과 같이 해야 합니다:
pt: Se actualmente tem um disco rígido com uma partição (uma configuração usual para computadores desktop), e deseja ter multi-boot entre o sistema operativo nativo e Debian, você necessita de:
ru: Если сейчас у вас один диск с одним разделом (обычное дело для настольных компьютеров) и вы хотите запускать родную систему и Debian, то вам нужно:
zh_cn: 如果您现在有一块硬盘，这块硬盘上仅有一个分区(这是桌面电脑的通常设置)，同时您希望 能多重启动原有的操作系统和 Debian，那么您就需要：
zh_tw: 如果您現在有一塊硬碟，這塊硬碟上僅有一個分割區 (這是桌面電腦的常見設定)，同時您希望能多重開機原有的作業系統和 Debian，那麼您就需要：

source: Back up everything on the computer.
el: Κάνετε αντίγραφα ασφαλείας για ο,τιδήποτε υπάρχει στον υπολογιστή σας.
ko: 컴퓨터에 들어 있는 것을 전부 백업하십시오.
pt: Salvaguardar tudo no computador.
ru: Сделать резервную копию всех файлов компьютера.
zh_cn: 备份计算机里所有的数据。
zh_tw: 備份電腦裡所有的資料。

source: Boot from the native operating system installer media such as CD-ROM or tapes. <phrase arch="powerpc">When booting from a MacOS CD, hold the <keycap>c</keycap> key while booting to force the CD to become the active MacOS system.</phrase>
el: Εκκινήστε με τα μέσα εγκατάστασης του αρχικού λειτουργικού συστήματος, πχ. CD-ROM ή ταινίες. <phrase arch="powerpc">Όταν ξεκινάτε από ένα MacOS CD, κρατήστε πιεσμένο το πλήκτρο <keycap>c</keycap> κατά την εκκίνηση για να εξαναγκάσετε το CD να γίνει το ενεργό MacOS σύστημα.</phrase>
ko: CD-ROM이나 테이프같은 원래 운영 체제의 설치 미디어에서 부팅하십시오. <phrase arch="powerpc">MacOS CD에서 부팅할 때, CD에서 MacOS 시스템을 시작하려면 부팅하는 동안 <keycap>c</keycap> 키를 누르고 있으십시오.</phrase>
pt: Iniciar a partir do meio do instalador do sistema operativo nativo tal como CD-ROM ou tapes. <phrase arch="powerpc">Quando inicia a partir de um CD de MacOS, mantenha a tecla <keycap>c</keycap> premida durante o arranque para forçar que o CD se torne o sistema activo de MacOS.</phrase>
ru: Загрузить программу установки родной операционной системы с CD-ROM или лент.<phrase arch="powerpc">При загрузке с MacOS CD, держите клавишу<keycap>c</keycap>, пока не начнётся загрузка с CD, а не система MacOS.</phrase>
zh_cn: 从原有操作系统的安装介质(如 CD-ROM 和 磁带)启动。<phrase arch="powerpc">当从 MacOS CD 启动时，按住 <keycap>c</keycap> 键不放，这样就能启用 CD 作为当前的 MacOS 系统。</phrase>
zh_tw: 從原有作業系統的安裝媒介(如光碟和磁帶)開機。<phrase arch="powerpc">當從 MacOS CD 開機時，按住 <keycap>c</keycap> 鍵不放，這樣就能以光碟開機作為目前的 MacOS 系統。</phrase>

source: Use the native partitioning tools to create native system partition(s). Leave either a place holder partition or free space for &debian;.
el: Χρησιμοποιήστε εργαλεία του ίδιου του αρχικού λειτουργικού για να δημιουργήσετε κατατμήσεις για αυτό. Αφήστε είτε έναν χώρο "υποδοχής" ή απλά ελεύθερο χώρο για το &debian;.
ko: 네이티브 파티션 도구로 네이티브 시스템 파티션을 만드십시오. &debian;으로 사용할 위치에 파티션을 만들거나 빈 공간을 만들어 놓으십시오.
pt: Utilizar as ferramentas de particionamento nativas para criar partições para o sistema nativo. Deixe uma partição para marcar o espaço ou espaço livre para &debian;.
ru: С помощью родных утилит разметки создать родной системный раздел(ы). Оставить или раздел-пустышку или свободное место для &debian;.
zh_cn: 使用原有系统里的分区工具来新建属于原来系统的分区。为 &debian; 或者预留一个分区，或者腾出一块空闲空间。
zh_tw: 使用原有系統裡的分割區工具來建立屬於原來系統的分割區。為 &debian; 預留一個分割區，或者騰出一塊空間。

source: Install the native operating system on its new partition.
el: Εγκαταστήσετε το προτιμητέο λειτουργικό σύστημα στο καινούριο τμήμα δίσκου που του αντιστοιχεί.
ko: 새 파티션에 원래 운영 체제를 설치하십시오.
pt: Instalar o sistema operativo nativo na sua nova partição.
ru: Установить родную операционную систему в её новый раздел.
zh_cn: 把原有的操作系统安装到属于它的新分区上。
zh_tw: 把原有作業系統安裝到屬於它的新分割區上。

source: Boot back into the native system to verify everything's OK, and to download the Debian installer boot files.
el: Επανεκκινήστε στο παλιό σας λειτουργικό για να ελέγξετε ότι όλα είναι ενταξει και για να κατεβάσετε τα αρχεία εκκίνησης του Debian installer.
ko: 네이티브 시스템으로 돌아가서 제대로 되었는지 확인하고, 데비안 설치 프로그램의 부팅 파일들을 내려 받으십시오.
pt: Arrancar de novo para o sistema nativo para verificar que está tudo OK, e fazer o download dos ficheiros de arranque do instalador de Debian.
ru: Загрузиться в родную операционную систему и проверить, что всё хорошо, и загрузить файлы программы установки Debian.
zh_cn: 启动到原有的操作系统，以确保一切正常，再下载 Debian 安装程序的启动文件。
zh_tw: 開機到原有作業系統，以確保一切正常，再下載 Debian 安裝程式的開機檔案。

source: Boot the Debian installer to continue installing Debian.
el: Ξεκινήστε τον εγκαταστάτη του Debian για να συνεχίσετε την εγκατάσταση του Debian.
ko: 데비안 설치 프로그램으로 부팅해 데비안 설치를 계속하십시오.
pt: Arrancar com o instalador de Debian para continuar a instalação de Debian.
ru: Загрузить программу установки Debian, чтобы продолжить установку Debian.
zh_cn: 启动 Debian 安装程序，并继续安装 Debian。
zh_tw: 啟動 Debian 安裝程式，並繼續安裝 Debian。

source: Partitioning in Tru64 UNIX
el: Κατάτμηση σε Tru64 UNIX
ko: Tru64 UNIX에서 파티션하기
pt: Particionamento em Tru64 UNIX
ru: Разметка в Tru64 UNIX
zh_cn: Tru64 UNIX 下分区
zh_tw: Tru64 UNIX 下的分割
