Repository: xobs/debian-installer
Catalog: doc/manual/po/*/random-bits.po
Languages: pt, zh_cn

source: If you have a &releasename; &debian; CD mounted at <filename>/cdrom</filename>, you could substitute a file URL instead of the http URL: <userinput>file:/cdrom/debian/</userinput>
pt: Se você tem o CD &debian; &releasename; montado em <filename>/cdrom</filename>, você pode substituir um URL de ficheiro em vez do URL http: <userinput>file:/cdrom/debian/</userinput>
zh_cn: 如果您已经把一张 &releasename; 版本的 &debian; CD 挂载在了 <filename>/cdrom</filename> 那么也可以把 http URL 替换成 file URL，即：<userinput>file:/cdrom/debian/</userinput>

source: Substitute one of the following for <replaceable>ARCH</replaceable> in the <command>debootstrap</command> command: <userinput>alpha</userinput>, <userinput>arm</userinput>, <userinput>hppa</userinput>, <userinput>i386</userinput>, <userinput>ia64</userinput>, <userinput>m68k</userinput>, <userinput>mips</userinput>, <userinput>mipsel</userinput>, <userinput>powerpc</userinput>, <userinput>s390</userinput>, or <userinput>sparc</userinput>.
pt: Substitua um dos seguintes por <replaceable>ARCH</replaceable> em <command>debootstrap</command> command: <userinput>alpha</userinput>, <userinput>arm</userinput>, <userinput>hppa</userinput>, <userinput>i386</userinput>, <userinput>ia64</userinput>, <userinput>m68k</userinput>, <userinput>mips</userinput>, <userinput>mipsel</userinput>, <userinput>powerpc</userinput>, <userinput>s390</userinput>, ou <userinput>sparc</userinput>.
zh_cn: 请将下列架构中的一个替换 <replaceable>ARCH</replaceable> 于 <command>debootstrap</command> 命令中： <userinput>alpha</userinput>, <userinput>arm</userinput>, <userinput>hppa</userinput>, <userinput>i386</userinput>, <userinput>ia64</userinput>, <userinput>m68k</userinput>, <userinput>mips</userinput>, <userinput>mipsel</userinput>, <userinput>powerpc</userinput>, <userinput>s390</userinput>，或 <userinput>sparc</userinput>。

source: Configure The Base System
pt: Configurar o Sistema Base
zh_cn: 基系统的配置

source: Now you've got a real Debian system, though rather lean, on disk. <command>Chroot</command> into it:
pt: Agora que você tem um verdadeiro sistema Debian, embora pouco limpo, no disco. Faça nele o <command>Chroot</command>:
zh_cn: 现在您在硬盘上已经装上了一套真正的 Debian 操作系统，尽管它还很瘦小。<command>Chroot</command> 用来进入该系统：

source: Mount Partitions
pt: Partições a Montar
zh_cn: 分区的挂载

source: Configure Keyboard
pt: Configurar o Teclado
zh_cn: 键盘的配置

source: To configure your keyboard:
pt: Para configurar o seu teclado:
zh_cn: 若要配置您的键盘，请：

source: Configure Networking
pt: Configurar a Rede
zh_cn: 网络的配置

source: To configure networking, edit <filename>/etc/network/interfaces</filename>, <filename>/etc/resolv.conf</filename>, and <filename>/etc/hostname</filename>. <informalexample><screen> # editor /etc/network/interfaces </screen></informalexample> Here are some simple examples from <filename>/usr/share/doc/ifupdown/examples</filename>: <informalexample><screen> ###################################################################### # /etc/network/interfaces -- configuration file for ifup(8), ifdown(8) # See the interfaces(5) manpage for information on what options are # available. ###################################################################### # We always want the loopback interface. # auto lo iface lo inet loopback # To use dhcp: # # auto eth0 # iface eth0 inet dhcp # An example static IP setup: (broadcast and gateway are optional) # # auto eth0 # iface eth0 inet static # address 192.168.0.42 # network 192.168.0.0 # netmask 255.255.255.0 # broadcast 192.168.0.255 # gateway 192.168.0.1 </screen></informalexample> Enter your nameserver(s) and search directives in <filename>/etc/resolv.conf</filename>: <informalexample><screen> # editor /etc/resolv.conf </screen></informalexample> A simple <filename>/etc/resolv.conf</filename>: <informalexample><screen> search hqdom.local\000 nameserver 10.1.1.36 nameserver 192.168.9.100 </screen></informalexample> Enter your system's host name (2 to 63 characters): <informalexample><screen> # echo DebianHostName &gt; /etc/hostname </screen></informalexample> If you have multiple network cards, you should arrange the names of driver modules in the <filename>/etc/modules</filename> file into the desired order. Then during boot, each card will be associated with the interface name (eth0, eth1, etc.) that you expect.
pt: Para configurar a rede, edite <filename>/etc/network/interfaces</filename>, <filename>/etc/resolv.conf</filename>, e <filename>/etc/hostname</filename>. <informalexample><screen> # editor /etc/network/interfaces </screen></informalexample> Aqui estão alguns exemplos simples de <filename>/usr/share/doc/ifupdown/examples</filename>: <informalexample><screen> ###################################################################### # /etc/network/interfaces -- ficheiro de configuração para ifup(8), ifdown(8) # Veja a manpage interfaces(5) manpage para informação acerca de quais # opções estão disponíveis. ###################################################################### # Nós queremos sempre o interface loopback. # auto lo iface lo inet loopback # Para utilizar dhcp: # # auto eth0 # iface eth0 inet dhcp # Exemplo de uma configuração com IP estático: (broadcast e gateway são opcionais) # # auto eth0 # iface eth0 inet static # address 192.168.0.42 # network 192.168.0.0 # netmask 255.255.255.0 # broadcast 192.168.0.255 # gateway 192.168.0.1 </screen></informalexample> Introduza o(s) servidor(es) de nomes e directivas de procura em <filename>/etc/resolv.conf</filename>: <informalexample><screen> # editor /etc/resolv.conf </screen></informalexample> Um simples <filename>/etc/resolv.conf</filename>: <informalexample><screen> search hqdom.local\000 nameserver 10.1.1.36 nameserver 192.168.9.100 </screen></informalexample> Escreva o hostname do seu sistema (2 a 63 caracteres): <informalexample><screen> # echo DebianHostName &gt; /etc/hostname </screen></informalexample> Se você tem várias placas de rede, você deve ordenar os nomes dos drivers dos módulos no ficheiro <filename>/etc/modules</filename> com a ordem desejada. Depois, durante o arranque cada placa será associada com um nome de interface (eth0, eth1, etc.) que você espera.
zh_cn: 要配置网络，请修改 <filename>/etc/network/interfaces</filename>, <filename>/etc/resolv.conf</filename> 和 <filename>/etc/hostname</filename>。<informalexample><screen> # editor /etc/network/interfaces </screen></informalexample> 这里有些简单的例子，来自 <filename>/usr/share/doc/ifupdown/examples</filename>: <informalexample><screen> ###################################################################### # /etc/network/interfaces -- configuration file for ifup(8), ifdown(8) # See the interfaces(5) manpage for information on what options are # available. ###################################################################### # We always want the loopback interface. # auto lo iface lo inet loopback # To use dhcp: # # auto eth0 # iface eth0 inet dhcp # An example static IP setup: (broadcast and gateway are optional) # # auto eth0 # iface eth0 inet static # address 192.168.0.42 # network 192.168.0.0 # netmask 255.255.255.0 # broadcast 192.168.0.255 # gateway 192.168.0.1 </screen></informalexample> 填入您的 nameserver(s) 和搜索指令到 <filename>/etc/resolv.conf</filename>: <informalexample><screen> # editor /etc/resolv.conf </screen></informalexample> 这里有个简单的 <filename>/etc/resolv.conf</filename>: <informalexample><screen> search hqdom.local\000 nameserver 10.1.1.36 nameserver 192.168.9.100 </screen></informalexample> 输入您的系统的主机名 (2 到 63 个字符): <informalexample><screen> # echo DebianHostName &gt; /etc/hostname </screen></informalexample> 如果您有多块网卡，在您修改 <filename>/etc/modules</filename> 文件时，一定要按照期望的顺序排列驱动模块的名字。这样的话，在系统启动时，每块网卡就能获得您所预期的 interface 名称了 (eth0、eth1 等等)。

source: Configure Timezone, Users, and APT
pt: Configurar Fuso Horário, Utilizadores, e APT
zh_cn: 时区、用户和 APT 的配置

source: Set your timezone, add a normal user, and choose your <command>apt</command> sources by running
pt: Defina o seu fuso horário, crie um utilizador normal, e escolha as as suas fontes para o <command>apt</command> executando
zh_cn: 设置您的时区，添加一个普通用户，再运行下面的指令选择您的 <command>apt</command> 源

source: Configure Locales
pt: Configurar Locales
zh_cn: locales 的设置

source: To configure your locale settings to use a language other than English, install the locales support package and configure it: <informalexample><screen> # apt-get install locales # dpkg-reconfigure locales </screen></informalexample> NOTE: Apt must be configured before, ie. during the base-config phase. Before using locales with character sets other than ASCII or latin1, please consult the appropriate localization HOWTO.
pt: Para configurar as suas definições de locale para utilizar outro idioma que não o Inglês, instale o pacote de suporte de locale e configure-o: <informalexample><screen> # apt-get install locales # dpkg-reconfigure locales </screen></informalexample> NOTA: O apt tem de ser configurado antes, ie. durante a fase do base-config. Antes de utilizar locales com conjuntos de caracteres que não sejam ASCII ou latin1, por favor consulte o HOWTO de localização apropriado.
zh_cn: 要配置您的 locale 设定，以便使用英语以外的其它语言，就需要安装 提供 locales 支持的软件包，同时配置之： <informalexample><screen> # apt-get install locales # dpkg-reconfigure locales </screen></informalexample> 注意：在此之前必须配置好 apt，即在 base-config 阶段就配置好它。在使用非 ASCII 或 latin1 的字符集的 locale 之前，请先参阅相应的本地化指南(localisation HOWTO)。

source: Install a Kernel
pt: Instalar um Kernel
zh_cn: 内核的安装

source: If you intend to boot this system, you probably want a Linux kernel and a boot loader. Identify available pre-packaged kernels with <informalexample><screen> # apt-cache search kernel-image </screen></informalexample> Then install your choice using its package name.
pt: Se você pretende iniciar este sistema, você provavelmente quer um kernel Linux e um gestor de arranque. Identifique os kernels pré-empacotados disponíveis com <informalexample><screen> # apt-cache search kernel-image </screen></informalexample> E depois instale a sua escolhe utilizando o nome do pacote.
zh_cn: 您若想启动这个系统，您很可能还需要一个 Linux 内核和一个 boot loader。可以用下面指令找到那些目前可用的被打好包的内核 <informalexample><screen> # apt-cache search kernel-image </screen></informalexample> 接下来把您所选中的内核的软件包名作为命令行的参数来安装它。

source: Set up the Boot Loader
pt: Configurar o Boot Loader
zh_cn: Boot Loader 的设置

source: To make your &debian; system bootable, set up your boot loader to load the installed kernel with your new root partition. Note that debootstrap does not install a boot loader, though you can use apt-get inside your Debian chroot to do so.
pt: Para tornar o seu sistema &debian; iniciável, prepare o gestor de arranque para carregar o kernel com a sua nova partição raiz. Note que o debootstrap não instala um gestor de arranque, embora possa utilizar a apt-get dentro do seu chroot Debian para o fazer.
zh_cn: 要让您的 &debian; 系统能够启动，还要设置您的 boot loader，好让它能加载已安装的内核并用上新的根分区。注意 debootstrap 不会安装 boot loader，因此您要在 Debian 的 chroot 中使用 apt-get 完成。

source: Check <userinput>info grub</userinput> or <userinput>man lilo.conf</userinput> for instructions on setting up the bootloader. If you are keeping the system you used to install Debian, just add an entry for the Debian install to your existing grub <filename>menu.lst</filename> or <filename>lilo.conf</filename>. For <filename>lilo.conf</filename>, you could also copy it to the new system and edit it there. After you are done editing, call lilo (remember it will use <filename>lilo.conf</filename> relative to the system you call it from).
pt: Veja <userinput>info grub</userinput> ou <userinput>man lilo.conf</userinput> para instruções acerca de como configurar o gestor de arranque. Se está a manter o sistema que utilizou para instalar Debian, apenas adicione uma entrada para a instalação Debian ao seu grub existente <filename>lilo.conf</filename> ou <filename>lilo.conf</filename>, pode também copia-lo para o novo sistema e edita-lo lá. Após acabar de editar, chame o lilo (lembre-se que vai utilizar <filename>lilo.conf</filename> relativo ao sistema de onde o chama).
zh_cn: 通过查阅 <userinput>info grub</userinput> 或 <userinput>man lilo.conf</userinput> 可以得到一些有关设置 bootloader 的提示。如果您希望保留用来安装 Debian 的那个系统，那么就在现有的 grub <filename>menu.lst</filename> 或 <filename>lilo.conf</filename> 里为 Debian 系统的安装添加一条配置就可以了。对于 <filename>lilo.conf</filename>您也可以把这个文件拷贝到新的系统里，然后在新的系统里编辑它。当您修改好配置，运行 lilo (请记住，您在哪个系统里运行 lilo，它就会用哪个系统里的 <filename>lilo.conf</filename> )。

source: Here is a basic <filename>/etc/lilo.conf</filename> as an example:
pt: Aqui está um <filename>/etc/lilo.conf</filename> simples como exemplo:
zh_cn: 下面有一个简单的<filename>/etc/lilo.conf</filename> 作为例子：

source: Check <userinput>man yaboot.conf</userinput> for instructions on setting up the bootloader. If you are keeping the system you used to install Debian, just add an entry for the Debian install to your existing <filename>yaboot.conf</filename>. You could also copy it to the new system and edit it there. After you are done editing, call ybin (remember it will use <filename>yaboot.conf</filename> relative to the system you call it from).
pt: Veja <userinput>man yaboot.conf</userinput> para instruções acerca de como preparar o bootloader. Se está a manter o sistema que utilizou para instalar, adicione apenas uma entrada para a instalação Debian ao seu <filename>yaboot.conf</filename>. Você pode também copia-lo para o seu novo sistema e edita-lo lá. Quando acabar de o editar, chame ybin (lembre-se que vai utilizar <filename>yaboot.conf</filename> relativo ao sistema de onde você o chamar).
zh_cn: 通过查阅 <userinput>man yaboot.conf</userinput> 可以得到一些有关设置 bootloader 的提示。如果您希望继续保留用来安装 Debian 的那个系统，那么在 <filename>yaboot.conf</filename> 里为 Debian 系统的安装添加一条配置就可以了。您也可以把这个文件拷贝到新的系统里，然后在新的系统里编辑它。当您修改完毕配置，运行 ybin (请记住，您在哪个系统里运行 <filename>yaboot.conf</filename> )。

source: Here is a basic <filename>/etc/yaboot.conf</filename> as an example: <informalexample><screen> boot=/dev/hda2 device=hd: partition=6 root=/dev/hda6 magicboot=/usr/lib/yaboot/ofboot timeout=50 image=/vmlinux label=Debian </screen></informalexample> On some machines, you may need to use <userinput>ide0:</userinput> instead of <userinput>hd:</userinput>.
pt: Aqui está um exemplo básico de <filename>/etc/yaboot.conf</filename>: <informalexample><screen> boot=/dev/hda2 device=hd: partition=6 root=/dev/hda6 magicboot=/usr/lib/yaboot/ofboot timeout=50 image=/vmlinux label=Debian </screen></informalexample> Em algumas máquinas, pode precisar de utilizar <userinput>ide0:</userinput> em vez de <userinput>hd:</userinput>.
zh_cn: 下面有一个简单的<filename>/etc/yaboot.conf</filename> 作为例子： <informalexample><screen> boot=/dev/hda2 device=hd: partition=6 root=/dev/hda6 magicboot=/usr/lib/yaboot/ofboot timeout=50 image=/vmlinux label=Debian </screen></informalexample> 在有的电脑上，您或许应该把 <userinput>ide0:</userinput> 换成 <userinput>hd:</userinput>。

source: Installing &debian; over Parallel Line IP (PLIP)
pt: Instalar &debian; a partir de uma linha IP Paralela (PLIP)
zh_cn: 通过 Parallel Line IP (PLIP) 来安装 &debian;

source: This section explains how to install &debian; on a computer without Ethernet card, but with just a remote gateway computer attached via a Null-Modem cable (also called Null-Printer cable). The gateway computer should be connected to a network that has a Debian mirror on it (e.g. to the Internet).
pt: Esta secção explica como instalar &debian; num computador sem placa Ethernet, mas sim com apenas uma gateway remota ligada através de um cabo Null-modem (também chamado cabo Null-printer). O computador gateway deve estar ligado a uma rede que tenha um mirror Debian (p.e. à Internet).
zh_cn: 本节将说明在没有以太网卡的情况下，如何通过一条 Null-Modem 线(也称为 Null-Printer 线)，连接到远端网关计算机来安装 &debian;。充当网关的计算机应该连接到具有 Debian 镜像的网络(例如，互联网)。

source: In the example in this appendix we will set up a PLIP connection using a gateway connected to the Internet over a dial-up connection (ppp0). We will use IP addresses 192.168.0.1 and 192.168.0.2 for the PLIP interfaces on the target system and the source system respectively (these addresses should be unused within your network address space).
pt: No exemplo deste apêndice vamos configurar uma ligação PLIP utilizando uma gateway ligada à Internet através de uma ligação dial-up (ppp0). Nós iremos utilizar os endereços IP 192.168.0.1 e 192.168.0.2 para os interfaces PLIP respectivamente nos sistemas alvo e fonte (estes endereços devem estar livres dentro do seu espaço de endereçamento de rede).
zh_cn: 本附录里面的例子中，我们将建立一个 PLIP 连接，使用的网关通过拨号连接(ppp0)到互联网。我们还分别为目标和源系统的 PLIP 接口使用 192.168.0.1 和 192.168.0.2 IP 地址(这些地址在您的网络地址空间里面未被占用)。

source: The PLIP connection set up during the installation will also be available after the reboot into the installed system (see <xref linkend="boot-new"/>).
pt: A configuração da ligação PLIP durante a instalação também estará disponível após reiniciar para o sistema instalado (veja <xref linkend="boot-new"/>).
zh_cn: 在安装时建立的 PLIP 连接，重新启动后在新安装的系统里面仍然可用(参阅 <xref linkend="boot-new"/>)。

source: Before you start, you will need to check the BIOS configuration (IO base address and IRQ) for the parallel ports of both the source and target systems. The most common values are <literal>io=0x378</literal>, <literal>irq=7</literal>.
pt: Antes de começar, você precisa verificar a configuração da BIOS (endereço base IO e IRQ) para as portas paralelas de ambos os sistemas fonte e alvo. Os valores mais comuns são <literal>io=0x378</literal>, <literal>irq=7</literal>.
zh_cn: 开始前，您需要检查一下源与目标系统并口的 BIOS 设置(IO 基地址和 IRQ)。常用的值为 <literal>io=0x378</literal>，<literal>irq=7</literal>。

source: Requirements
pt: Requisitos
zh_cn: 需求

source: A target computer, called <emphasis>target</emphasis>, where Debian will be installed.
pt: Um computador alvo, chamado <emphasis>target</emphasis>, onde será instalado Debian.
zh_cn: 目标计算机，称为 <emphasis>target</emphasis>，将安装 Debian 在上面。

source: System installation media; see <xref linkend="installation-media"/>.
pt: Media de instalação do sistema; veja <xref linkend="installation-media"/>.
zh_cn: 系统安装介质；参阅 <xref linkend="installation-media"/>。

source: Another computer connected to the Internet, called <emphasis>source</emphasis>, that will function as the gateway.
pt: Outro computador ligado à Internet, chamado <emphasis>source</emphasis>, que irá funcionar como gateway.
zh_cn: 另外一台连接到互联网的计算机，称为 <emphasis>source</emphasis>，功能是网关。

source: A DB-25 Null-Modem cable. See the <ulink url="&url-plip-install-howto;">PLIP-Install-HOWTO</ulink> for more information on this cable and instructions how to make your own.
pt: Um cabo Null-Modem DB-25. Para mais informações acerca deste cabo e instruções de como fazer o seu veja o <ulink url="&url-plip-install-howto;">PLIP-Install-HOWTO</ulink>.
zh_cn: 一条 DB-25 Null-Modem 线。参阅 <ulink url="&url-plip-install-howto;">PLIP-Install-HOWTO</ulink> 了解这种线的更多信息，以及如何自己制作。

source: Setting up source
pt: Configurando a fonte
zh_cn: 建立源

source: The following shell script is a simple example of how to configure the source computer as a gateway to the Internet using ppp0.
pt: A seguinte shell script é um simples exemplo de como configurar o computador fonte como uma gateway para a Internet utilizando ppp0.
zh_cn: 下面的脚本是一个简单例子，说明如何配置使用 ppp0 连接到互联网的充当网关的源计算机。

source: #!/bin/sh # We remove running modules from kernel to avoid conflicts and to # reconfigure them manually. modprobe -r lp parport_pc modprobe parport_pc io=<replaceable>0x378</replaceable> irq=<replaceable>7</replaceable> modprobe plip # Configure the plip interface (plip0 for me, see dmesg | grep plip) ifconfig <replaceable>plip0 192.168.0.2</replaceable> pointopoint <replaceable>192.168.0.1</replaceable> netmask 255.255.255.255 up # Configure gateway modprobe iptable_nat iptables -t nat -A POSTROUTING -o <replaceable>ppp0</replaceable> -j MASQUERADE echo 1 > /proc/sys/net/ipv4/ip_forward
pt: #!/bin/sh # Nós removemos do kernel módulos em execução para evitar conflitos e # para os reconfigurar manualmente. modprobe -r lp parport_pc modprobe parport_pc io=<replaceable>0x378</replaceable> irq=<replaceable>7</replaceable> modprobe plip # Configurar o interface plip (plip0 para mim, veja dmesg | grep plip) ifconfig <replaceable>plip0 192.168.0.2</replaceable> pointopoint <replaceable>192.168.0.1</replaceable> netmask 255.255.255.255 up #Configurar a gateway modprobe iptable_nat iptables -t nat -A POSTROUTING -o <replaceable>ppp0</replaceable> -j MASQUERADE echo 1 > /proc/sys/net/ipv4/ip_forward

source: Installing target
pt: Instalar o alvo
zh_cn: 安装目标

source: Boot the installation media. The installation needs to be run in expert mode; enter <userinput>expert</userinput> at the boot prompt. Below are the answers that should be given during various stages of the installation.
pt: Inicie a partir da media de instalação. A instalação tem de ser corrida em modo avançado; introduza <userinput>expert</userinput> na prompt de aranque. Abaixo estão as respostas que devem ser dadas durante as várias etapas da instalação.
zh_cn: 用安装介质启动。安装需要使用专家模式; 在启动提示符下输入<userinput>expert</userinput>。下面是安装过程中不同阶段的应答。

source: Load installer components
pt: Carregar componentes do instalador
zh_cn: 加载安装组件

source: Select the <userinput>plip-modules</userinput> option from the list; this will make the PLIP drivers available to the installation system.
pt: Escolha a opção <userinput>plip-modules</userinput> na lista; isto irá disponibilizar os drivers PLIP para o sistema de instalação.
zh_cn: 从列表里面选择 <userinput>plip-modules</userinput> 选项; 它使安装系统可以使用 PLIP 驱动。

source: Detect network hardware
pt: Detectar hardware de rede
zh_cn: 侦测网络硬件

source: If target <emphasis>does</emphasis> have a network card, a list of driver modules for detected cards will be shown. If you want to force &d-i; to use plip instead, you have to deselect all listed driver modules. Obviously, if target doesn't have a network card, the installer will not show this list.
pt: Se o alvo <emphasis>tiver</emphasis> uma placa de rede, será mostrada uma lista de módulos das placas detectadas. Se quizer forçar o &d-i; a utilizar em vez disso plip, tem de retirar a seleccão de todos os drivers de módulos listados. Obviamente, se o alvo não tiver placa de rede, o instalador não irá mostrar esta lista.
zh_cn: 如果目标系统<emphasis>具有</emphasis>网卡，将显示侦测到的网卡的驱动模块列表。如果您希望强制 &d-i; 使用 plip，您应该排斥所有列出的驱动模块。显然，如果目标系统没有网卡，安装程序不会显示该列表。

source: Prompt for module parameters: Yes
pt: Pergunta para os parâmetros de módulos: Sim
zh_cn: 提示模块参数: Yes

source: Because no network card was detected/selected earlier, the installer will ask you to select a network driver module from a list. Select the <userinput>plip</userinput> module.
pt: Como não foi detectada/seleccionada nenhuma placa de rede anteriormente, o instalador irá pedir-lhe para seleccionar um módulo de driver de rede a partir de uma lista. Escolha o módulo <userinput>plip</userinput>.
zh_cn: 因为前面没有网卡侦测/选择，安装程序将要求您从列表中选择网络驱动模块。选择 <userinput>plip</userinput> 模块。

source: Additional parameters for module parport_pc: <userinput><replaceable>io=0x378 irq=7</replaceable></userinput>
pt: Parâmetros adicionais para o módulo parport_pc: <userinput><replaceable>io=0x378 irq=7</replaceable></userinput>

source: Additional parameters for module plip: leave empty
pt: Parâmetros adicionais para o módulo plip: deixe vazio
zh_cn: Additional parameters for module plip: 保持空白

source: Configure the network
pt: Configurar a rede
zh_cn: 配置网络

source: Auto-configure network with DHCP: No
pt: Auto-configurar a rede com DHCP: Não

source: IP address: <userinput><replaceable>192.168.0.1</replaceable></userinput>
pt: Endereço IP: <userinput><replaceable>192.168.0.1</replaceable></userinput>

source: Point-to-point address: <userinput><replaceable>192.168.0.2</replaceable></userinput>
pt: Endereço ponto-a-ponto: <userinput><replaceable>192.168.0.2</replaceable></userinput>
