Repository: xobs/debian-installer
Catalog: doc/manual/po/*/random-bits.po
Languages: pt, zh_cn

source: Linux Devices
pt: Dispositivos em Linux
zh_cn: Linux 里的设备

source: In Linux you have various special files in <filename>/dev</filename>. These files are called device files. In the Unix world accessing hardware is different. There you have a special file which actually runs a driver which in turn accesses the hardware. The device file is an interface to the actual system component. Files under <filename>/dev</filename> also behave differently than ordinary files. Below are the most important device files listed.
pt: Em Linux você tem vários ficheiros especiais em <filename>/dev</filename>. Este ficheiros são chamados ficheiros de dispositivos. No mundo Unix aceder a hardware é diferente. Lá você tem um ficheiro especial que na realidade corre um controlador que por sua vez acede ao hardware. O ficheiro de dispositivo é um interface para o verdadeiro componente do sistema. Os ficheiros sob <filename>/dev</filename> também se comportam de forma diferente dos ficheiros vulgares. Abaixo estão listados os ficheiros de dispositivos mais importantes.
zh_cn: 在 Linux 里，您会在 <filename>/dev</filename> 发现许多很特别的文件。这些文件被称为设备文件。在 Unix 世界里，访问硬件的方式有些不一样。这些特别的文件的背后其实运行着驱动程序，而正是驱动程序控制着硬件。设备文件就是访问真实的系统部件的接口。<filename>/dev</filename> 目录下的文件的各种特性也和普通文件大相径庭。下面列举了最重要的一些设备文件。

source: First Floppy Drive
pt: Primeira Drive de Disquete
zh_cn: 第一个软驱

source: Second Floppy Drive
pt: segunda Drive de Disquete
zh_cn: 第二个软驱

source: IDE Hard disk / CD-ROM on the first IDE port (Master)
pt: Disco Rígido IDE / CD-ROM no primeiro canal IDE (Master)
zh_cn: 在第一个 IDE 口(Master)的 IDE 硬盘/光驱

source: IDE Hard disk / CD-ROM on the first IDE port (Slave)
pt: Disco Rígido IDE / CD-ROM no primeiro canal IDE (Slave)
zh_cn: 在第一个 IDE 口(Slave)的 IDE 硬盘/光驱

source: IDE Hard disk / CD-ROM on the second IDE port (Master)
pt: Disco Rígido IDE / CD-ROM no segundo canal IDE (Master)
zh_cn: 在第二个 IDE 口(Master)的 IDE 硬盘/光驱

source: IDE Hard disk / CD-ROM on the second IDE port (Slave)
pt: Disco Rígido IDE /CD-ROM no segundo canal IDE (Slave)
zh_cn: 在第二个 IDE 口(Slave)的 IDE 硬盘/光驱

source: First partition of the first IDE hard disk
pt: Primeira partição do primeiro disco rígido IDE
zh_cn: 在第一块 IDE 硬盘上的第一个分区

source: Fifteenth partition of the fourth IDE hard disk
pt: Décima-quinta partição do quarto disco rígido IDE
zh_cn: 在第四块 IDE 硬盘上的第十五个分区

source: SCSI Hard disk with lowest SCSI ID (e.g. 0)
pt: Disco Rígido SCSI com o SCSI ID mais baixo (e.g. 0)
zh_cn: SCSI ID (比如 0)最小的 SCSI 硬盘

source: SCSI Hard disk with next higher SCSI ID (e.g. 1)
pt: Disco Rígido SCSI com o próximo SCSI ID mais alto (e.g. 1)
zh_cn: 下一个 SCSI ID (比如 1)的 SCSI 硬盘

source: SCSI Hard disk with next higher SCSI ID (e.g. 2)
pt: Disco Rígido SCSI com o próximo SCSI ID mais alto (e.g. 2)
zh_cn: 下一个 SCSI ID (比如 2)的 SCSI 硬盘

source: First partition of the first SCSI hard disk
pt: Primeira partição do primeiro disco rígido SCSI
zh_cn: 在第一块 SCSI 硬盘上的第一个分区

source: Tenth partition of the fourth SCSI hard disk
pt: Décima partição do quarto disco rígido SCSI
zh_cn: 在第四块 SCSI 硬盘上的第十个分区

source: SCSI CD-ROM with the lowest SCSI ID
pt: CD-ROM SCSI com o SCSI ID mais baixo
zh_cn: SCSI ID 最小的 SCSI 光驱

source: SCSI CD-ROM with the next higher SCSI ID
pt: CD-ROM SCSI com o próximo SCSI ID mais alto
zh_cn: 下一个 SCSI ID 的 SCSI 光驱

source: Serial port 0, COM1 under MS-DOS
pt: Porto Série 0, COM1 em MS-DOS
zh_cn: 串口 0，即 MS-DOS 下的 COM1

source: Serial port 1, COM2 under MS-DOS
pt: Porta série 2, COM2 em MS-DOS
zh_cn: 串口 1，即 MS-DOS 下的 COM2

source: PS/2 mouse device
pt: Dispositivo de rato PS/2
zh_cn: PS/2 鼠标设备

source: Pseudo device, repeater data from GPM (mouse) daemon
pt: Pseudo dispositivo, daemon repetidor de informação do GPM (rato)
zh_cn: 伪设备，中转从GPM(鼠标)服务传来的数据

source: Symbolic link to the CD-ROM drive
pt: Link simbólico para a drive de CD-ROM
zh_cn: 指向光驱的符号链接

source: Symbolic link to the mouse device file
pt: Link simbólico para o ficheiros de dispositivo mouse
zh_cn: 指向鼠标设备文件的符号链接

source: Everything pointed to this device will disappear
pt: Tudo o que for enviado para este dispositivo irá desaparecer
zh_cn: 所有指向该设备的东西都会消失

source: One can endlessly read zeros out of this device
pt: É possível ler infinitamente zeros a partir deste dispositivo
zh_cn: 可以从该设备永无休止地读出零

source: Setting Up Your Mouse
pt: Preparando o Seu Rato
zh_cn: 设定您的鼠标

source: The mouse can be used in both the Linux console (with gpm) and the X window environment. The two uses can be made compatible if the gpm repeater is used to allow the signal to flow to the X server as shown: <informalexample><screen> mouse =&gt; /dev/psaux =&gt; gpm =&gt; /dev/gpmdata -&gt; /dev/mouse =&gt; X /dev/ttyS0 (repeater) (symlink) /dev/ttyS1 </screen></informalexample> Set the repeater protocol to be raw (in <filename>/etc/gpm.conf</filename>) while setting X to the original mouse protocol in <filename>/etc/X11/XF86Config</filename> or <filename>/etc/X11/XF86Config-4</filename>.
pt: O rato pode ser utilizado quer na consola Linux (com gpm) quer no ambiente de janelas do X. Os dois usos podem ser compatíveis se o repetidor gpm for utilizado para permitir ao sinal fluir para o servidor X como é mostrado: <informalexample><screen> mouse =&gt; /dev/psaux =&gt; gpm =&gt; /dev/gpmdata -&gt; /dev/mouse =&gt; X /dev/ttyS0 (repeater) (symlink) /dev/ttyS1 </screen></informalexample> Defina o protocolo de repetição para ser raw (em <filename>/etc/gpm.conf</filename> enquanto que no X defina o protocolo original mouse em <filename>/etc/X11/XF86Config</filename> ou <filename>/etc/X11/XF86Config-4</filename>.
zh_cn: 无论在 Linux 的控制台(console)里(通过 gpm)，还是在 X 窗口环境之中，您都可以使用鼠标。这两种用法是可以兼容的，只要设置 gpm 转发器，令其让信号流往 X 服务器： <informalexample><screen> mouse =&gt; /dev/psaux =&gt; gpm =&gt; /dev/gpmdata -&gt; /dev/mouse =&gt; X /dev/ttyS0 (repeater) (symlink) /dev/ttyS1 </screen></informalexample> 把转发器的协议设为直接(raw)模式(在 <filename>/etc/gpm.conf</filename> 里)，同时在 <filename>/etc/X11/XF86Config</filename> 或者 <filename>/etc/X11/XF86Config-4</filename> 里设置一下，让 X 使用原始的鼠标协议。

source: This approach to use gpm even in X has advantages when the mouse is unplugged inadvertently. Simply restarting gpm with <informalexample><screen> # /etc/init.d/gpm restart </screen></informalexample> will re-connect the mouse in software without restarting X.
pt: Esta aproximação para utilizar o gpm também no X tem vantagens quando o rato é inadvertidamente desligado. Simplesmente re-iniciar o gpm com <informalexample><screen> # /etc/init.d/gpm restart </screen></informalexample> irá re-ligar o rato ao software sem re-iniciar o X.
zh_cn: 用这种方法使用 gpm 的话，就算在 X 里也有其优势。如果不小心把鼠标拔下来后，只要像这样重新启动 gpm 就可以了： <informalexample><screen> # /etc/init.d/gpm restart </screen></informalexample> 如此就可以在软件层面上重新连接鼠标，而不用重启 X 了。

source: If gpm is disabled or not installed with some reason, make sure to set X to read directly from the mouse device such as /dev/psaux. For details, refer to the 3-Button Mouse mini-Howto at <filename>/usr/share/doc/HOWTO/en-txt/mini/3-Button-Mouse.gz</filename>, <userinput>man gpm</userinput>, <filename>/usr/share/doc/gpm/FAQ.gz</filename>, and <ulink url="&url-xfree86;current/mouse.html">README.mouse</ulink>.
pt: Se o gpm estiver desligado ou não instalado por alguma razão, assegure-se de colocar o X a ler directamente a partir do dispositivo de rato como o /dev/psaux. Para detalhes, veja o mini-Howto Rato de 3-Botões em <filename>/usr/share/doc/HOWTO/en-txt/3-Button-Mouse.gz</filename>, <userinput>man gpm</userinput>. <filename>/usr/share/doc/gpm/FAQ.gz</filename>, e <ulink url="&url-xfree86;current/mouse.html">README.mouse</ulink>.
zh_cn: 如果您禁用了 gpm，或者因为某些原因没有安装它，请确保设置里是让 X 从鼠标设备(比如 /dev/psaux) 直接读取数据的。欲知详情，请参阅三键鼠标的迷您指南，即 <filename>/usr/share/doc/HOWTO/en-txt/mini/3-Button-Mouse.gz</filename>、<userinput>man gpm</userinput>、<filename>/usr/share/doc/gpm/FAQ.gz</filename> 以及 <ulink url="&url-xfree86;current/mouse.html">README.mouse</ulink> 里设置一下，让 X 使用原始的鼠标协议。

source: For PowerPC, in <filename>/etc/X11/XF86Config</filename> or <filename>/etc/X11/XF86Config-4</filename>, set the mouse device to <userinput>"/dev/input/mice"</userinput>.
pt: Para PowerPC, em <filename>/etc/X11/XF86Config</filename> ou <filename>/etc/X11/XF86Config-4</filename>, defina o dispositivo de rato para <userinput>"/dev/input/mice"</userinput>.
zh_cn: 对 PowerPC 来说，需要在<filename>/etc/X11/XF86Config</filename>或者 <filename>/etc/X11/XF86Config-4</filename> 设置鼠标设备里或者 <userinput>"/dev/input/mice"</userinput>。

source: Modern kernels give you the capability to emulate a three-button mouse when your mouse only has one button. Just add the following lines to <filename>/etc/sysctl.conf</filename> file.
pt: Os kernel modernos dão-lhe a capacidade de emular um rato de três botões mesmo que o seu rato tenha apenas um botão. Apenas junte as seguintes linhas ao ficheiro <filename>/etc/sysctl.conf</filename>.
zh_cn: 当您的鼠标只有一个按键的时候，流行的内核具有模拟三健鼠标的能力。只需将下面行加入 <filename>/etc/sysctl.conf</filename> 文件。

source: # 3-button mouse emulation # turn on emulation /dev/mac_hid/mouse_button_emulation = 1 # Send middle mouse button signal with the F11 key /dev/mac_hid/mouse_button2_keycode = 87 # Send right mouse button signal with the F12 key /dev/mac_hid/mouse_button3_keycode = 88 # For different keys, use showkey to tell you what the code is.
pt: # emulação de rato de 3-botões # ligar a emulação /dev/mac_hid/mouse_button_emulation = 1 # Enviar o sinal de botão do meio com a tecla F11 /dev/mac_hid/mouse_button2_keycode = 87 # Enviar o sinal do botão direito do rato com a tecla F12 /dev/mac_hid/mouse_button3_keycode = 88 # Para teclas diferentes, utilize showkey para lhe dizer qual é o código.

source: Disk Space Needed for Tasks
pt: Espaço em Disco Necessário para Tarefas
zh_cn: 各软件集所需的磁盘空间

source: The base installation for i386 using the default 2.4 kernel, including all standard packages, requires 573MB of disk space.
pt: A instalação base do sarge para i386, utilizando o kernel 2.4 por omissão, incluindo todos os pacotes standard, necessita de 573MB de espaço em disco.
zh_cn: 在 i386 架构上，基本的安装默认使用 2.4 内核，需要 573MB 的磁盘空间，这里面包含了所有的标准软件包。

source: The following table lists sizes reported by aptitude for the tasks listed in tasksel. Note that some tasks have overlapping constituents, so the total installed size for two tasks together may be less than the total obtained by adding up the numbers.
pt: A tabela seguinte lista os tamanhos reportados pelo aptitude para as tarefas listadas com o tasksel. Note que algumas tarefas têm constituintes que se sobrepõem, por isso o total do tamanho instalado de duas tarefas pode ser menor que o total obtido somando os números.
zh_cn: 下面的表格一一列出了 tasksel 中每个软件集所需的磁盘空间大小。该报表是使用 aptitude 生成的。请注意，有些软件集之间会有相重叠的部分，所以两个软件集一同安装后所占的空间，可能会小于这两个软件集分别安装所占的空间。

source: Note that you will need to add the sizes listed in the table to the size of the base installation when determining the size of partitions. Most of the size listed as <quote>Installed size</quote> will end up in <filename>/usr</filename>; the size listed as <quote>Download size</quote> is (temporarily) required in <filename>/var</filename>.
pt: Note que você vai necessitar de somar os tamanhos listados na tabela ao tamanho da instalação base do sarge quando determinar o tamanho das partições. A maioria dos tamanhos listados como <quote>Tamanho Instalado</quote> irá acabar em <filename>/usr</filename>; o tamanho listado como <quote>Tamanho do download</quote> é necessário (temporariamente) em <filename>/var</filename>.
zh_cn: 注意您需要将表格中列出的尺寸加上基本安装尺寸以决定分区的大小。多数列出的尺寸如<quote>安装尺寸</quote>将用在 <filename>/usr</filename>；列在<quote>下载尺寸</quote>是(临时地)用在 <filename>/var</filename>。

source: Task
pt: Tarefa
zh_cn: 任务

source: Installed size (MB)
pt: Espaço instalado (MB)
zh_cn: 安装尺寸 (MB)

source: Download size (MB)
pt: Tamanho do download (MB)
zh_cn: 下载尺寸 (MB)

source: Space needed to install (MB)
pt: Espaço necessário para instalar (MB)
zh_cn: 用于安装所需空间 (MB)

source: Web server
pt: Servidor Web
zh_cn: Web 服务器

source: Print server
pt: Servidor de Impressão
zh_cn: 打印服务器

source: DNS server
pt: Servidor de DNS
zh_cn: DNS 服务器

source: File server
pt: Servidor de Ficheiros
zh_cn: 文件服务器

source: Mail server
pt: Servidor de Mail
zh_cn: 邮件服务器

source: SQL database
pt: Base de Dados SQL
zh_cn: SQL 数据库

source: The <emphasis>Desktop</emphasis> task will install both the Gnome and KDE desktop environments.
pt: A tarefa <emphasis>Desktop</emphasis> irá instalar ambos os ambientes de desktop GNOME e KDE.
zh_cn: <emphasis>桌面</emphasis> 任务将同时安装 Gnome 和 KDE 桌面环境。

source: If you install in a language other than English, <command>tasksel</command> may automatically install a <firstterm>localization task</firstterm>, if one is available for your language. Space requirements differ per language; you should allow up to 200MB in total for download and installation.
pt: Se vai instalar noutro idioma que não o Inglês, o <command>tasksel</command> pode instalar automaticamente uma <firstterm>tarefa de localização</firstterm>, se estiver alguma disponível para o seu idioma. As necessidades de espaço diferem por idioma; você deve permitir até um total de 200MB para download e instalação.
zh_cn: 如果安装英文之外的其他语言，<command>tasksel</command> 在语言有对应 locale 时，可以自动安装 <firstterm>localization task</firstterm>。每种语言需要的空间不同；您应该给 200MB 以上的空间用于下载和安装。

source: Installing &debian; from a Unix/Linux System
pt: Instalar &debian; a partir de um sistema Unix/Linux
zh_cn: 通过 Unix/Linux 系统来安装 &debian;

source: This section explains how to install &debian; from an existing Unix or Linux system, without using the menu-driven installer as explained in the rest of the manual. This <quote>cross-install</quote> HOWTO has been requested by users switching to &debian; from Red Hat, Mandrake, and SUSE. In this section some familiarity with entering *nix commands and navigating the file system is assumed. In this section, <prompt>$</prompt> symbolizes a command to be entered in the user's current system, while <prompt>#</prompt> refers to a command entered in the Debian chroot.
pt: Esta secção explica como instalar &debian; a partir de um sistema Unix ou Linux existente, sem utilizar o instalador guiado pelo menu como é explicado no resto do manual. Este <quote>cross-install</quote> HOWTO foi pedido por utilizadores que mudam para &debian; a partir de Red Hat, Mandrake e SUSE. Nesta secção é assumida alguma familiaridade em introduzir comandos *nix e navegar através do sistema de ficheiros. Nesta secção, <prompt>$</prompt> simboliza um comando a ser escrito pelo utilizador do sistema actual, e <prompt>#</prompt> refere-se a comandos introduzidos no chroot Debian.
zh_cn: 本节说明了如何通过现有的 Unix 或 Linux 系统来安装 &debian;，而非使用本手册后面要谈到的由菜单驱动的安装软件。这篇<quote>交叉安装(cross-install)</quote> HOWTO 是应用户的要求而撰写的。他们原来是 Redhat、Mandrake 和 SUSE 的用户，现转而使用 &debian;。在本节中，我们假设您对于输入 *nix 命令以及在文件系统中穿梭移动并不生疏。同时，在本节中，<prompt>$</prompt> 标志着这个命令是在用户当前使用的系统中输入的，而 <prompt>#</prompt> 则表示这个命令是在 Debian chroot 环境中输入的。

source: Once you've got the new Debian system configured to your preference, you can migrate your existing user data (if any) to it, and keep on rolling. This is therefore a <quote>zero downtime</quote> &debian; install. It's also a clever way for dealing with hardware that otherwise doesn't play friendly with various boot or installation media.
pt: Assim que tiver o novo sistema Debian configurado de acordo com as suas preferências, você pode migrar os dados existentes dos utilizadores (se os tiver) para lá, e continuar a rolar. Isto é portanto uma instalação &debian; com <quote>zero paragens</quote>. É também uma maneira inteligente de lidar com hardware que de outro modo não se dá bem com os vários media ou tipos de arranque.
zh_cn: 您一旦根据自己的要求配置好了新的 Debian 系统，就可以将您的原来系统中的用户数据(如果有的话)悉数迁移到 Debian 里去。然后就能继续爽了。一言以蔽之，这是一次<quote>不停机</quote>的 &debian; 安装。同时，这也是处理那些因为硬件原因不能通过任何引导或者安装介质完成安装的权宜之计。

source: Getting Started
pt: Começar
zh_cn: 准备运动

source: With your current *nix partitioning tools, repartition the hard drive as needed, creating at least one filesystem plus swap. You need at least 150MB of space available for a console only install, or at least 300MB if you plan to install X.
pt: Com os seus actuais utilitários de particionamento *nix, reparticione o disco rígido conforme necessário, criando pelo menos um sistema de ficheiros e swap. Você necessita pelo menos de 150 MB de espaço disponível para instalação de apenas consola, ou pelo menos 300MB se planeia instalar o X.
zh_cn: 根据需要，用已经安装的 *nix 的分区工具重新分区，要划分出至少一个文件系统外加交换分区。您如果只用控制台(console)的话，至少要准备 150MB 空间，倘若想要装 X，就需要至少 300MB 的空间了。

source: To create file systems on your partitions. For example, to create an ext3 file system on partition <filename>/dev/hda6</filename> (that's our example root partition): <informalexample><screen> # mke2fs -j /dev/hda6 </screen></informalexample> To create an ext2 file system instead, omit <userinput>-j</userinput>.
pt: Para criar os sistemas de ficheiros nas suas partições. Por exemplo, para criar um sistema de ficheiros ext3 na partição <filename>/dev/hda6</filename> (é a nossa partição raiz no nosso exemplo): <informalexample><screen> # mke2fs -j /dev/hda6 </screen></informalexample> Em vez disso para criar um sistema de ficheiros ext2, omita <userinput>-j</userinput>.
zh_cn: 这里谈一下如何在您的分区上创建文件系统。举例来说，如果要在 <filename>/dev/hda6</filename> 分区(以后的例子中，将把它作为 root 分区) 建立一个 ext3 格式的文件系统，就像这样： <informalexample><screen> # mke2fs -j /dev/hda6 </screen></informalexample> 如果想建立的是 ext2 格式的文件系统，就要去掉 <userinput>-j</userinput>。

source: Initialize and activate swap (substitute the partition number for your intended Debian swap partition): <informalexample><screen> # mkswap /dev/hda5 # sync; sync; sync # swapon /dev/hda5 </screen></informalexample> Mount one partition as <filename>/mnt/debinst</filename> (the installation point, to be the root (<filename>/</filename>) filesystem on your new system). The mount point name is strictly arbitrary, it is referenced later below.
pt: Inicializar e activar a partição swap (substitua o número da partição pelo que deseja na sua partição swap Debian): <informalexample><screen> # mkswap /dev/hda5 # sync; sync; sync # swapon /dev/hda5 </screen></informalexample> Monte uma partição como <filename>/mnt/debinst</filename> (o ponto de instalação, para ser o sistema de ficheiros raiz (<filename>/</filename>) no seu novo sistema). O nome do ponto de montagem é completamente arbitrário, é referenciado depois mais abaixo.
zh_cn: 初始化并激活交换分区(请把分区编号替换成您希望用作交换分区的分区编号): <informalexample><screen> # mkswap /dev/hda5 # sync; sync; sync # swapon /dev/hda5 </screen></informalexample> 把一个分区挂载(mount)到 <filename>/mnt/debinst</filename>(这是安装的位置，将来作为您新系统的根(<filename>/</filename>)文件系统)。挂载点的名称是任意的，后面的步骤将会用到它。

source: Install <command>debootstrap</command>
pt: Instalar <command>debootstrap</command>
zh_cn: 安装 <command>debootstrap</command>

source: The tool that the Debian installer uses, which is recognized as the official way to install a Debian base system, is <command>debootstrap</command>. It uses <command>wget</command> and <command>ar</command>, but otherwise depends only on <classname>/bin/sh</classname>. Install <command>wget</command> and <command>ar</command> if they aren't already on your current system, then download and install <command>debootstrap</command>.
pt: O utilitário que o instalador Debian utiliza, que é reconhecido como a forma oficial de instalar um sistema base Debian, é o <command>debootstrap</command>. Este utiliza o <command>wget</command> e <command>ar</command>, mas de outra forma depende apenas de <classname>/bin/sh</classname>. Instale os <command>wget</command> e <command>ar</command> se não estão já no seu sistema actual, depois faça o download e instale o <command>debootstrap</command>.
zh_cn: Debian 安装程序调用的软件，同时也为官方所采用，被用来安装基系统的工具是 <command>debootstrap</command>。它调用了 <command>wget</command> 和 <command>ar</command>，否则就仅仅依赖 <classname>/bin/sh</classname>。安装 <command>wget</command> 和 <command>ar</command> 如果您的系统里没有，然后再下载并安装 <command>debootstrap</command>。

source: If you have an rpm-based system, you can use alien to convert the .deb into .rpm, or download an rpm-ized version at <ulink url="http://people.debian.org/~blade/install/debootstrap"></ulink>
pt: Se você tem um sistema baseado em rpm, você pode utilizar o alien para converter o .deb em .rpm, ou fazer o download de uma versão rpm em <ulink url="http://people.debian.org/~blade/install/debootstrap"></ulink>
zh_cn: 如果您用的是基于 rpm 的系统，那么可以用 alien 将 .deb 文件转换成为 .rpm 文件，或者下载已被打包成 rpm 包的版本，它位于 <ulink url="http://people.debian.org/~blade/install/debootstrap"></ulink>

source: Or, you can use the following procedure to install it manually. Make a work folder for extracting the .deb into: <informalexample><screen> # mkdir work # cd work </screen></informalexample> The <command>debootstrap</command> binary is located in the Debian archive (be sure to select the proper file for your architecture). Download the <command>debootstrap</command> .deb from the <ulink url="http://ftp.debian.org/debian/pool/main/d/debootstrap/"> pool</ulink>, copy the package to the work folder, and extract the binary files from it. You will need to have root privileges to install the binaries.
pt: Ou, pode utilizar o seguinte procedimento para instala-lo manualmente. Crie um directório de trabalho para extrair lá o .deb: <informalexample><screen> # mkdir work # cd work </screen></informalexample> O binário <command>debootstrap</command> esta localizado no arquivo Debian (assegure-se que escolhe o ficheiro adequado para a sua arquitectura). Faça o download do .deb <command>debootstrap</command> a partir do <ulink url="http://ftp.debian.org/debian/pool/main/d/debootstrap/"> pool</ulink>, copie o pacote para o directório de trabalho, e extraia dele os ficheiros binários. Você vai necessitar de privilégios de root para instalar os binários.
zh_cn: 或者您也可以通过下面的步骤手动安装它。先新建一个工作目录，它被用来安放解压缩后的 .deb 文件： <informalexample><screen> # mkdir work # cd work </screen></informalexample> <command>debootstrap</command> 的二进制文件被打包在 Debian 的归档文件中(请确保选择了与您架构相对应的文件)。下载 <command>debootstrap</command> .deb 它位于 <ulink url="http://ftp.debian.org/debian/pool/main/d/debootstrap/"> pool</ulink>，把它拷贝到工作目录，并从该文件解压缩出这些二进制文件。要把二进制文件安装到系统中，您必须要拥有 root 的权限。

source: # ar -x debootstrap_0.X.X_arch.deb # cd / # zcat /full-path-to-work/work/data.tar.gz | tar xv
pt: # tar -x debootstrap_0.X.X_arch.deb # cd / # zcat /full-path-to-work/work/data.tar.gz | tar xv

source: Run <command>debootstrap</command>
pt: Corra <command>debootstrap</command>
zh_cn: 运行 <command>debootstrap</command>

source: <command>debootstrap</command> can download the needed files directly from the archive when you run it. You can substitute any Debian archive mirror for <userinput>http.us.debian.org/debian</userinput> in the command example below, preferably a mirror close to you network-wise. Mirrors are listed at <ulink url="http://www.debian.org/misc/README.mirrors"></ulink>.
pt: O <command>debootstrap</command> pode fazer o download dos ficheiros necessários directamente do arquivo quando o executar. Você pode substituir qualquer mirror de arquivo por <userinput>http.us.debian.org/debian</userinput> no exemplo do comando abaixo, de preferência um mirror perto da sua rede. Os mirrors estão listados em <ulink url="http://www.debian.org/misc/README.mirrors"></ulink>.
zh_cn: <command>debootstrap</command> 执行后，它会自己从归档文件库直接下载所需的文件。您可以把下面的命令行例子中的 <userinput>http.us.debian.org/debian</userinput> 替换成任何一个 Debian 归档文件库的镜像。选择镜像时，可以根据您的网络情况选择较近的一个。镜像的列表在 <ulink url="http://www.debian.org/misc/README.mirrors"></ulink>。
