Repository: xobs/debian-installer
Catalog: doc/manual/po/*/random-bits.po
Languages: pt, zh_cn

source: Name server addresses: you can enter the same addresses used on source (see <filename>/etc/resolv.conf</filename>)
pt: Endereços de servidor de nomes: você pode introduzir os mesmos endereços utilizados na fonte (veja <filename>/etc/resolv.conf</filename>)
zh_cn: Name server addresses: 您可以使用与源计算机相同的地址 (参阅 <filename>/etc/resolv.conf</filename>)

source: Desktop
zh_cn: 桌面

source: # /usr/sbin/debootstrap --arch ARCH &releasename; \ /mnt/debinst http://http.us.debian.org/debian
zh_cn: # /usr/sbin/debootstrap --arch ARCH &releasename; \\n /mnt/debinst http://http.us.debian.org/debian
