Repository: xobs/debian-installer
Catalog: doc/manual/po/*/random-bits.po
Languages: pt, zh_cn

source: Random Bits
pt: Miscelânea
zh_cn: 其他

source: Preconfiguration File Example
pt: Exemplo de Ficheiro de Pré-configuração
zh_cn: 预设置文件实例

source: This is a complete working example of a preconfiguration file for an automated install. Its use is explained in <xref linkend="automatic-install"/>. You may want to uncomment some of the lines before using the file.
pt: Este é um exemplo completo e funcional de um ficheiro de pré-configuração para uma instalação automatizada. A sua utilização é explicada em <xref linkend="automatic-install"/>. Você poderá querer descomentar algumas das linhas antes de utilizar o ficheiro.
zh_cn: 这是一个完整的用于自动安装的预设置文件的实例。使用的说明在 <xref linkend="automatic-install"/>。您可以在使用该文件前去除某些行前面的注释。

source: In order to be able to properly present this example in the manual, we've had to split some lines. This is indicated by the use of the line-continuation-character <quote>\</quote> and extra indentation in the next line. In a real preconfiguration file, these split lines have to be joined into <emphasis>one single line</emphasis>. If you do not, preconfiguration will fail with unpredictable results.
pt: De modo a ser possível apresentar correctamente este exemplo no manual, tivemos de dividir algumas linhas. Isto é indicado pela utilização do carácter de continuação de linha <quote>\</quote> e identação extra na linha seguinte. Num ficheiro de pré-configuração verdadeiro, estas linhas separadas têm de ser unidas <emphasis>numa única linha</emphasis>. Se não o fizer, a pré-configuração irá falhar com resultados imprevisíveis.
zh_cn: 为了能在手册中正确显示这个例子，我们不得不分割一些行。通过使用行连接符 <quote>\</quote> 和下一行的缩进标明。在实际的预置文件中，这些分割的行必须合并成 <emphasis>单独的一行</emphasis>。如果您没有这样做，预设置文件会造成不可预估的失败。

source: A <quote>clean</quote> example file is available from &urlset-example-preseed;.
pt: Um ficheiro de exemplo <quote>limpo</quote> está disponível a partir de &urlset-example-preseed;.
zh_cn: <quote>clean</quote> 例子文件位于 &urlset-example-preseed;。

source: The example file is also available from &urlset-example-preseed;.
pt: O ficheiro de exemplo também está disponível a partir de &urlset-example-preseed;.
zh_cn: 例子文件还可以从 &urlset-example-preseed; 获得。
