Repository: xobs/debian-installer
Catalog: doc/manual/po/*/using-d-i.po
Languages: ru, zh_tw

source: Using the Debian Installer
ru: Использование программы установки Debian
zh_tw: 使用 Debian 安裝程式

source: How the Installer Works
ru: Как работает программа установки
zh_tw: 安裝程式如何運作

source: The Debian Installer consists of a number of special-purpose components to perform each installation task. Each component performs its task, asking the user questions as necessary to do its job. The questions themselves are given priorities, and the priority of questions to be asked is set when the installer is started.
ru: Программа установки Debian состоит из нескольких специализированных компонентов, предназначенных для выполнения определённых задач установки. Каждый компонент выполняет свою задачу, задавая пользователю вопросы, если это необходимо для выполнения работы. Каждому вопросу назначен приоритет, и можно задать приоритет задаваемых вопросов при старте программы установки.
zh_tw: Debian 安裝程式由一些特定功能的元件組成，它們完成各自的安裝任務。每一元件執行任務時，會詢問一些任務相關的問題。每個任務又有各自的優先級，可以在安裝程式開始時設定優先級以決定哪些問題會被問到。

source: When a default installation is performed, only essential (high priority) questions will be asked. This results in a highly automated installation process with little user interaction. Components are automatically run in sequence; which components are run depends mainly on the installation method you use and on your hardware. The installer will use default values for questions that are not asked.
ru: Когда выполняется установка по умолчанию, задаются только самые важные (высокоприоритетные) вопросы. Результатом будет полностью автоматизированный процесс установки с небольшим вмешательством пользователя. Компоненты автоматически запускаются в определённой последовательсти; какой компонент будет запущен, зависит в основном от выбранного метода установки и от имеющегося оборудования. Программа установки будет использовать значения по умолчанию для вопросов, которые не задавались.
zh_tw: 執行預設安裝時，只有必要的 (高優先級) 的問題會被問到。使得安裝過程可以高度自動化，幾乎不需使用者干預。元件按次序執行﹔至於哪些元件會執行，取決於您使用的安裝方法，以及您的硬體。對於沒有詢問的問題，安裝程式將採用預設值。

source: If there is a problem, the user will see an error screen, and the installer menu may be shown in order to select some alternative action. If there are no problems, the user will never see the installer menu, but will simply answer questions for each component in turn. Serious error notifications are set to priority <quote>critical</quote> so the user will always be notified.
ru: При возникновении проблемы, пользователь увидит экран с ошибкой и, возможно, меню программы установки предложит выбрать какое-нибудь альтернативное действие. Если же проблем нет, пользователь никогда не увидит меню программы установки, а просто будет отвечать на вопросы каждого компонента. Извещениям о серьезных ошибках установлен приоритет <quote>критический</quote>, так что пользователь всегда будет оповещён.
zh_tw: 如何遇到麻煩，使用者會看到錯誤畫面，並且顯示安裝選單供選擇其它替代操作。如果沒有問題，使用者將不會碰到安裝選單，只需依此回答每個元件的提問。嚴重錯誤提示的優先級為 <quote>critical</quote>，因此使用者總會注意到。

source: Some of the defaults that the installer uses can be influenced by passing boot arguments when &d-i; is started. If, for example, you wish to force static network configuration (DHCP is used by default if available), you could add the boot parameter <userinput>netcfg/disable_dhcp=true</userinput>. See <xref linkend="installer-args"/> for available options.
ru: Некоторые параметры по умолчанию, используемые программой установки, можно изменить передав как значения параметров загрузки при старте &d-i;. Если, например, вы хотите настраивать сеть вручную (по умолчанию используется DHCP, если получится), то можете добавить параметр загрузки <userinput>netcfg/disable_dhcp=true</userinput>. Возможные параметры можно посмотреть в <xref linkend="installer-args"/>.
zh_tw: 如果在 &d-i; 開始的時候，加上一些啟動參數，它將會影響安裝程式使用的預設值。例如，假設您希望指定靜態網路連接配置 (如果存在 DHCP，將會被採用)，您可以為啟動參數加上 <userinput>netcfg/disable_dhcp=true</userinput>。請參閱 <xref linkend="installer-args"/> 以瞭解有效的選項。

source: Power users may be more comfortable with a menu-driven interface, where each step is controlled by the user rather than the installer performing each step automatically in sequence. To use the installer in a manual, menu-driven way, add the boot argument <userinput>debconf/priority=medium</userinput>.
ru: Опытным пользователям, возможно, будет более удобен интерфейс управления через меню, где каждый шаг контролируется пользователем, вместо автоматического выполнения каждого шага последовательности программой установки. Для использования программы установки в ручном режиме управляемом через меню, добавьте параметр загрузки <userinput>debconf/priority=medium</userinput>.
zh_tw: 熟練的使用者也許更習慣以選單進行，安裝中的每一步都可以被使用者控制，而不是讓安裝程式自動依此執行。要使用選單驅動的手動安裝方式，添加啟動參數選項 <userinput>debconf/priority=medium</userinput>。

source: If your hardware requires you to pass options to kernel modules as they are installed, you will need to start the installer in <quote>expert</quote> mode. This can be done by either using the <command>expert</command> command to start the installer or by adding the boot argument <userinput>debconf/priority=low</userinput>. Expert mode gives you full control over &d-i;.
ru: Если ваше оборудование требует передачи параметров модулям ядра при их установке, нужно запустить программу установки в режиме <quote>эксперта</quote>. Это можно сделать либо введя команду <command>expert</command> для запуска программы установки, либо передав параметр загрузки <userinput>debconf/priority=low</userinput>. Режим эксперта дает вам полный контроль над &d-i;.
zh_tw: 如果您的硬體要求提供核心模組的設定選項才能安裝，您就需要使用 <quote>expert</quote> 模式啟動安裝程式。可以透過使用 <command>expert</command> 指令或者添加 <userinput>debconf/priority=low</userinput> 啟動參數。專家模式賦予您對 &d-i; 完全的控制力。

source: The normal installer display is character-based (as opposed to the now more familiar graphical interface). The mouse is not operational in this environment. Here are the keys you can use to navigate within the various dialogs. The <keycap>Tab</keycap> or <keycap>right</keycap> arrow keys move <quote>forward</quote>, and the <keycombo> <keycap>Shift</keycap> <keycap>Tab</keycap> </keycombo> or <keycap>left</keycap> arrow keys move <quote>backward</quote> between displayed buttons and selections. The <keycap>up</keycap> and <keycap>down</keycap> arrow select different items within a scrollable list, and also scroll the list itself. In addition, in long lists, you can type a letter to cause the list to scroll directly to the section with items starting with the letter you typed and use <keycap>Pg-Up</keycap> and <keycap>Pg-Down</keycap> to scroll the list in sections. The <keycap>space bar</keycap> selects an item such as a checkbox. Use &enterkey; to activate choices.
ru: Нормальный вид программы установки &mdash; текстовый (в отличие от более распространённых теперь графических интерфейсов). Мышь здесь не работает. Вот кнопки, с помощью которых вы можете перемещаться внутри различных диалогов. Клавиша <keycap>Tab</keycap> или <keycap>правая</keycap> стрелка перемещают указатель <quote>вперед</quote>, а <keycombo> <keycap>Shift</keycap> <keycap>Tab</keycap> </keycombo> или <keycap>левая</keycap> стрелка &mdash; <quote>назад</quote> по отображаемым кнопкам или полям. Клавиши стрелок <keycap>вверх</keycap> и <keycap>вниз</keycap> выбирают различные пункты в прокручиваемом списке, а также прокручивают сам список. Также, в длинных списках вы можете нажать на клавишу с буквой, чтобы список прокрутился прямо к пункту секции, начинающимся на эту букву, а также использовать клавиши <keycap>Pg-Up</keycap> и <keycap>Pg-Down</keycap> для прокручивания списка в секциях. Клавиша <keycap>Пробел</keycap> служит для выбора пунктов типа <quote>флажок</quote>. Используйте клавишу &enterkey; для активации выбора.
zh_tw: 正常的安裝程式是基於文字界面的 (相對於常見的圖形界面)。在此環境下，不能使用滑鼠。這些是操作各種對話框使用的按鍵。<keycap>Tab</keycap> 或 <keycap>右</keycap> 箭頭鍵向<quote>前</quote>移動，<keycombo> <keycap>Shift</keycap> <keycap>Tab</keycap> </keycombo> 或 <keycap>左</keycap> 方向鍵，它們用於按鈕和選擇之間向<quote>後</quote>移動。<keycap>上</keycap> 與 <keycap>下</keycap> 箭頭鍵用於選擇可以捲動的列表，也能捲動列表本身。另外，對於長的列表，您可以按下一個字母，讓列表直接移動到該字母開頭的列表項，使用 <keycap>Pg-Up</keycap> 和 <keycap>Pg-Down</keycap> 切換列表的不同頁。<keycap>空格鍵</keycap>選擇複選框的選項。用 &enterkey; 啟用選擇。

source: S/390 does not support virtual consoles. You may open a second and third ssh session to view the logs described below.
ru: S/390 не поддерживает виртуальные консоли. Вы можете открыть вторую или третью ssh-сессию для просмотра журнальных файлов, описанных ниже.
zh_tw: S/390 不支援虛擬控制台。您可以打開第二或第三個 ssh 連線查看上述的 log。

source: Error messages are redirected to the third console. You can access this console by pressing <keycombo><keycap>Left Alt</keycap><keycap>F3</keycap></keycombo> (hold the left <keycap>Alt</keycap> key while pressing the <keycap>F3</keycap> function key); get back to the main installer process with <keycombo><keycap>Left Alt</keycap><keycap>F1</keycap></keycombo>.
ru: Сообщения об ошибках выводятся на третьей консоли. Вы можете получить доступ к этой консоли, нажав <keycombo><keycap>Левый Alt</keycap><keycap>F3</keycap></keycombo> (удерживайте клавишу <keycap>Alt</keycap> нажатой во время нажатия функциональной клавиши <keycap>F3</keycap>); вернуться к основному процессу установки через <keycombo><keycap>Левый Alt</keycap><keycap>F1</keycap></keycombo>.
zh_tw: 錯誤資訊被重導向到第三個控制台。您可以按下 <keycombo><keycap>左 Alt</keycap><keycap>F3</keycap></keycombo> (按住左 <keycap>Alt</keycap> 鍵同時按下 <keycap>F3</keycap> 功能鍵) 以存取該控制台﹔返回主安裝進程使用 <keycombo><keycap>左 Alt</keycap><keycap>F1</keycap></keycombo>。

source: These messages can also be found in <filename>/var/log/messages</filename>. After installation, this log is copied to <filename>/var/log/debian-installer/messages</filename> on your new system. Other installation messages may be found in <filename>/var/log/</filename> during the installation, and <filename>/var/log/debian-installer/</filename> after the computer has been booted into the installed system.
ru: Также эти сообщения можно найти в файле <filename>/var/log/messages</filename>. После установки этот файл копируется в файл <filename>/var/log/debian-installer/messages</filename> на новой системе. Остальные сообщения об установке можно найти в каталоге <filename>/var/log/</filename> во время установки и в файле <filename>/var/log/debian-installer/</filename> после того, как компьютер перезагрузится в установленную систему.
zh_tw: 這些資訊還可以在 <filename>/var/log/messages</filename> 裡找到。完成安裝之後，該 log 會被複製到 <filename>/var/log/debian-installer/messages</filename> 您的新系統中。其它的安裝資訊安裝時可以在 <filename>/var/log/</filename> 找到。<filename>/var/log/debian-installer/</filename> 是系統重新啟動後的記錄地方。

source: Components Introduction
ru: Описание компонентов
zh_tw: 元件介紹

source: Here is a list of installer components with a brief description of each component's purpose. Details you might need to know about using a particular component are in <xref linkend="module-details"/>.
ru: Ниже представлен список компонентов программы установки с кратким описанием назначения каждого компонента. Детали об использовании каждого компонента можно найти в <xref linkend="module-details"/>.
zh_tw: 下面列出安裝程式使用的元件，和各個元件目的的簡要說明。如果您需要瞭解各元件詳細的資訊，請參閱 <xref linkend="module-details"/>。

source: Shows the list of components to the user during installer operation, and starts a component when it is selected. Main-menu's questions are set to priority medium, so if your priority is set to high or critical (high is the default), you will not see the menu. On the other hand, if there is an error which requires your intervention, the question priority may be downgraded temporarily to allow you to resolve the problem, and in that case the menu may appear.
ru: Показывает список компонентов пользователю во время работы программы установки и запускает компонент, когда он выбран. Вопросам main-menu установлен средний (medium) приоритет, так что если вы изменили приоритет на высокий или критический(по умолчанию высокий), вы не увидите меню. С другой стороны, если возникает ошибка, которая требует вмешательства пользователя, приоритет вопросов может быть временно понижен, чтобы позволить решить проблему, и в этом случае меню может появиться.
zh_tw: 在安裝進行中，顯示元件列表，並執行選中的元件。主選單的優先級設為中，如果您的優先級設為高或緊急 (預設為高)，您不會看到該選單。另一方面，假如出現問題需要您決定，詢問的優先級會臨時調低，讓您解決該問題，選單可能在這種情況下出現。

source: You can get to the main menu by selecting the <quote>Back</quote> button repeatedly to back all the way out of the currently running component.
ru: Вы можете добраться до главного меню, многократно нажав кнопку <quote>Назад </quote>, чтобы пройти весь путь обратно от выполняемого в данный момент компонента.
zh_tw: 您可以透過不斷地按<quote>返回</quote>按鈕，從目前執行的元件回到主選單。

source: Shows a list of languages and language variants. The installer will display messages in the chosen language, unless the translation for that language is not complete. When a translation is not complete, English messages are shown.
ru: Показывает список языков и варианты языка. Программа установки будет отображать сообщения на выбранном языке, если есть перевод на этот язык. Если перевода сообщения нет, то будет показано сообщение на английском языке.
zh_tw: 顯示語言與方言的列表。除非選中的語言沒有被翻譯，安裝程式將以您選擇的語言顯示資訊。對於沒有翻譯的語言，將顯示英文資訊。

source: Shows a list of countries. The user may choose the country he lives in.
ru: Показывает список стран. Пользователь может выбрать страну в которой живет.
zh_tw: 顯示國家列表。使用者可以選擇自己生活的國家。

source: Allows the user to select localization options for the installation and the installed system: language, country and locales. The installer will display messages in the selected language, unless the translation for that language is not complete in which case some messages may be shown in English.
ru: Позволяет пользователю указать параметры локализации процесса установки и устанавливаемой системы: язык, страну и локали. Программа установки будет отображать сообщения на выбранном языке, если есть перевод на этот язык. Если перевода сообщения нет, то будет показано сообщение на английском языке.
zh_tw: 讓使用者選擇安裝過程以及安裝好的系統所使用的語言、國家和地區選項。除非選取的語言沒有被翻譯，安裝程式將以您選擇的語言顯示資訊。對於沒有翻譯的部分，將以英文顯示。

source: Shows a list of keyboards, from which the user chooses the model which matches his own.
ru: Показывает список клавиатур, из которого пользователь может выбрать подходящую модель.
zh_tw: 顯示鍵盤列表，使用者在其中選擇與自己鍵盤相合的模式。

source: Automatically detects most of the system's hardware, including network cards, disk drives, and PCMCIA.
ru: Автоматически определяет большую часть аппаратуры системы, включая сетевые карты, приводы дисков и PCMCIA.
zh_tw: 自動識別大多數系統硬體，包括網卡、硬碟和 PCMCIA。

source: Looks for and mounts a Debian installation CD.
ru: Ищет и монтирует компакт-диск с программой установки Debian.
zh_tw: 尋找並掛載 Debian 安裝光碟。

source: Configures the computer's network connections so it can communicate over the internet.
ru: Настраивает сетевые подключения компьютера, чтобы он мог получить доступ к Интернет.
zh_tw: 設定電腦網路連線，使它能連上網際網路。

source: Looks for ISO file systems, which may be on a CD-ROM or on the hard drive.
ru: Ищет файловые системы ISO в приводе CD-ROM или на жёстком диске.
zh_tw: 尋找 ISO 檔案系統，它可能存在於 CD-ROM 或者硬碟上。

source: Presents a list of Debian archive mirrors. The user may choose the source of his installation packages.
ru: Предоставляет список серверов-зеркал Debian. Пользователь может выбрать источник, из которого будут устанавливаться пакеты.
zh_tw: 列出 Debian 軟體套件鏡像。使用者可以選擇從哪裡安裝軟體套件。

source: Checks integrity of a CD-ROM. This way the user may assure him/herself that the installation CD-ROM was not corrupted.
ru: Проверяет целостность данных на компакт-диске. Таким образом пользователь может убедиться, что установочный компакт-диск не повреждён.
zh_tw: 檢驗光碟片。這種方法確保使用者使用的安裝光碟沒有損壞。

source: Lowmem tries to detect systems with low memory and then does various tricks to remove unnecessary parts of &d-i; from the memory (at the cost of some features).
ru: Пытается распознать системы с малым объёмом памяти и затем выполняет различные действия, чтобы удалить ненужные части &d-i; из памяти (ценой потери некоторых возможностей).
zh_tw: 它會檢測小記憶體容量的系統，並採用一些技巧從記憶體中刪除 &d-i; 不需要的部分 (代價是喪失一些功能)。

source: Anna's Not Nearly APT. Installs packages which have been retrieved from the chosen mirror or CD.
ru: Anna Не Настоящий APT. Устанавливает пакеты, которые были получены с выбранного сервера-зеркала или компакт-диска.
zh_tw: Anna's Not Nearly APT。從選擇的鏡像站或 CD 取得安裝軟體套件。

source: Allows the user to partition disks attached to the system, create file systems on the selected partitions, and attach them to the mountpoints. Included are also interesting features like a fully automatic mode or LVM support. This is the preferred partitioning tool in Debian.
ru: Позволяет пользователю разметить подключённые к системе диски, создать файловые системы на выбранных разделах и назначить им точки монтирования. Также обладает интересными возможностями, например может работать в полностью автоматическом режиме и поддерживает LVM. Это предпочтительная утилита для работы с разделами в Debian.
zh_tw: 讓使用者為系統安排磁碟分割區，建立檔案系統，並分配掛載點。它包括一些有趣的功能，如自動模式或 LVM 支援。在 Debian 裡這是建議的分割工具。

source: Automatically partitions an entire disk according to preset user preferences.
ru: Автоматически создаёт разделы на всём диске, согласно заданным пользователем установкам.
zh_tw: 根據使用者預設，自動為整個硬碟分割。

source: Allows the user to partition disks attached to the system. A partitioning program appropriate to your computer's architecture is chosen.
ru: Позволяет пользователю разметить диски, подключённые к системе. Программа разметки будет соответствовать архитектуре вашего компьютера.
zh_tw: 允許使用者為系統安排磁碟分割區。根據使用者電腦的架構選擇合適的分割工具。

source: Displays a list of partitions, and creates file systems on the selected partitions according to user instructions.
ru: Отображает список разделов и создаёт файловые системы на выбранных разделах, согласно пользовательским указаниям.
zh_tw: 顯示分割區列表，按照使用者指令為選擇的分割區建立檔案系統。

source: Helps the user with the configuration of the <firstterm>LVM</firstterm> (Logical Volume Manager).
ru: Помогает пользователю с настройкой <firstterm>LVM</firstterm> (менеджера логических томов).
zh_tw: 幫助使用者配置 <firstterm>LVM</firstterm> (Logical Volume Manager)。

source: Allows the user to setup Software <firstterm>RAID</firstterm> (Redundant Array of Inexpensive Disks). This Software RAID is usually superior to the cheap IDE (pseudo hardware) RAID controllers found on newer motherboards.
ru: Позволяет пользователю установить программный <firstterm>RAID</firstterm> (Redundant Array of Inexpensive Disks). Программный RAID обычно лучше, чем дешёвые IDE (псевдо-аппаратные) RAID-контроллеры в новых материнских платах.
zh_tw: 讓使用者設置軟體 <firstterm>磁碟陣列</firstterm>(Redundant Array of Inexpensive Disks)。Software RAID 通常比新主機板提供的廉價 IDE (虛擬硬體) RAID 控制器的高級。

source: Installs the most basic set of packages which would allow the computer to operate under Linux when rebooted.
ru: Устанавливает самый минимальный набор пакетов, который позволит компьютеру работать под Linux после перезагрузки.
zh_tw: 安裝一些基本的套件，讓電腦重起後能在 Linux 下運行。

source: Detects currently installed operating systems on the computer and passes this information to the bootloader-installer, which may offer you an ability to add discovered operating systems to the bootloader's start menu. This way the user could easily choose at the boot time which operating system to start.
ru: Определяет уже установленные на компьютере операционные системы и передаёт эту информацию в bootloader-installer, который может предложить вам добавить найденные операционные системы в стартовое меню системного загрузчика. Таким образом пользователь может легко выбрать операционную систему для запуска в момент загрузки.
zh_tw: 偵測目前電腦上安裝的作業系統，將資訊傳遞給 bootloader-installer，使它能將偵測到的作業系統添加到 bootloader 的啟動選單裡面。方便使用者選擇啟動哪個操作系統。

source: Installs a boot loader program on the hard disk, which is necessary for the computer to start up using Linux without using a floppy or CD-ROM. Many boot loaders allow the user to choose an alternate operating system each time the computer boots.
ru: Устанавливает на жёсткий диск программу системный загрузчик, которая необходима для того, чтобы компьютер заработал под Linux без использования дискеты или компакт-диска. Многие системные загрузчики позволяют пользователю выбрать загрузку альтернативной операционной системы при старте компьютера.
zh_tw: 在硬碟上安裝啟動開機程式，這是必須的一步，使得電腦不必依靠軟碟和 CD-ROM 啟動。許多開機程式都允許使用者在啟動的時候選擇使用哪個作業系統。

source: Provides dialogs for setting up the base system packages according to user preferences. This is normally done after rebooting the computer; it is the <quote>first run</quote> of the new Debian system.
ru: Помогает пользователю настроить базовые системные пакеты. Обычно это происходит после перезагрузки компьютера; это <quote>первый запуск</quote> новой системы Debian.
zh_tw: 根據使用者喜好提供設定系統軟體套件的對話框。它通常在新 Debian 系統<quote>首次運行</quote>時工作。

source: Allows the user to execute a shell from the menu, or in the second console.
ru: Позволяет пользователю вызвать интерпретатор командной строки из меню или на второй консоли.
zh_tw: 讓使用者能從選單或者第二控制台執行介殼。

source: Provides a way for the user to record information on a floppy disk<phrase condition="etch">, network, hard disk, or other media</phrase> when trouble is encountered, in order to accurately report installer software problems to Debian developers later.
ru: Предоставляет пользователю возможность записать информацию на дискету<phrase condition="etch">, через сеть, на жёсткий диск или другой носитель</phrase> в случае возникновения проблем, чтобы позже отправить разработчикам Debian точный отчёт о проблеме программы установки.
zh_tw: 當使用者遇到麻煩時，提供記錄資訊到軟碟的方法，用於以後向 Debian 開發人員精確報告安裝程式的問題。

source: Using Individual Components
ru: Применение отдельных компонентов
zh_tw: 使用單獨的元件

source: In this section we will describe each installer component in detail. The components have been grouped into stages that should be recognizable for users. They are presented in the order they appear during the install. Note that not all modules will be used for every installation; which modules are actually used depends on the installation method you use and on your hardware.
ru: В этом разделе мы подробно опишем каждую компоненту программы установки. Компоненты собраны в понятные пользователю группы и расположены в порядке использования во время установки. Обратите внимание, что в зависимости от метода установки и вашей аппаратуры некоторые модули могут не использоваться.
zh_tw: 本節將會描述各個安裝元件的詳細資訊。各元件按使用者可以識別的階段分組。它們在安裝過程中按次序顯示出來。注意，每次安裝並不會使用所有的模組﹔至於使用哪些模組，取決於您的安裝方法和您的硬體。

source: Setting up Debian Installer and Hardware Configuration
ru: Настройка программы установки Debian и оборудования
zh_tw: 啟動 Debian 安裝程式與配置硬體
