Repository: xobs/debian-installer
Catalog: doc/manual/po/*/using-d-i.po
Languages: ru, zh_tw

source: The EFI partition is a FAT filesystem format partition on one of the hard disks of the system, usually the same disk that contains the <emphasis>root</emphasis> filesystem. It is normally not mounted on a running system as it is only needed by the <quote>EFI Boot Manager</quote> to load the system and the installer part of the <command>elilo</command> writes to the filesystem directly. The <command>/usr/sbin/elilo</command> utility writes the following files into the <filename>efi/debian</filename> directory of the EFI partition during the installation. Note that the <quote>EFI Boot Manager</quote> would find these files using the path <filename>fs<replaceable>n</replaceable>:\efi\debian</filename>. There may be other files in this filesystem as well over time as the system is updated or re-configured.
ru: Раздел EFI &mdash; это раздел с файловой системой FAT на одном из жёстких дисков системы, обычно на том же диске, который содержит файловую систему <emphasis>root</emphasis>. Обычно, он не монтируется в работающую систему, а используется только <quote>менеджером загрузки EFI</quote> для загрузки системы, и частью программы установки <command>elilo</command>, которая производит запись в файловую систему напрямую. Утилита <command>/usr/sbin/elilo</command> записывает следующие файлы в каталог <filename>efi/debian</filename> на EFI раздел во время установки. Заметим, что <quote>менеджер загрузки EFI</quote> будет искать эти файлы согласно пути <filename>fs<replaceable>n</replaceable>:\efi\debian</filename>. В файловой системе могут находиться другие файлы на время обновления или настройки системы.
zh_tw: EFI 分割區是系統的某一個硬碟分割區，其格式為 FAT 。通常這個硬碟也包含了 <emphasis>root</emphasis> 檔案系統。一般來說，它不會掛載於一個執行中的系統上，而只被 <quote>EFI Boot Manager</quote> 用於載入系統和安裝 <command>elilo</command> 時直接寫入檔案系統。<command>/usr/sbin/elilo</command> 工具程式在安裝時將下列檔案寫入 EFI 分割區的 <filename>efi/debian</filename> 目錄。注意 <quote>EFI Boot Manager</quote> 會找到這些檔案，路徑是 <filename>fs<replaceable>n</replaceable>:\efi\debian</filename>。經過一段時間，系統更新或重新設定，檔案系統中也許會有其他檔案。

source: This is the configuration file read by the boot loader when it starts. It is a copy of the <filename>/etc/elilo.conf</filename> with the filenames re-written to refer to files in the EFI partition.
ru: Данный конфигурационный файл читается системным загрузчиком при запуске. Это копия <filename>/etc/elilo.conf</filename> с изменёнными путями, указывающими на файлы в EFI разделе.
zh_tw: 這是啟動時 boot loader 讀取的設定檔。它是 <filename>/etc/elilo.conf</filename> 以同檔名複製到 EFI 分割區的檔案。

source: This is the boot loader program that the <quote>EFI Boot Manager</quote> runs to boot the system. It is the program behind the <guimenuitem>Debian GNU/Linux</guimenuitem> menu item of the <quote>EFI Boot Manager</quote> command menu.
ru: Это файл программы системного загрузчика, который <quote>менеджер загрузки EFI</quote> стартует для запуска системы. Эта программа также скрывается за элементом меню <guimenuitem>Debian GNU/Linux</guimenuitem> в меню команд <quote>менеджер загрузки EFI</quote>.
zh_tw: 此檔案用於啟動系統的 <quote>EFI Boot Manager</quote> boot loader 程式。也是 <guimenuitem>Debian GNU/Linux</guimenuitem> 選單項背後的程式，位於 <quote>EFI Boot Manager</quote> 指令選單。

source: This is the initial root filesystem used to boot the kernel. It is a copy of the file referenced in the <filename>/etc/elilo.conf</filename>. In a standard Debian installation it would be the file in <filename>/boot</filename> pointed to by the symbolic link <filename>/initrd.img</filename>.
ru: Это файл начальной корневой файловой системы(initial root filesystem), используемой для загрузки ядра. Это копия файла, на который есть ссылка из <filename>/etc/elilo.conf</filename>. В стандартной установке Debian этот файл находится в <filename>/boot</filename>, и на него указывает символическая ссылка <filename>/initrd.img</filename>.
zh_tw: 這是用於啟動核心最初的檔案系統。它是引用 <filename>/etc/elilo.conf</filename> 的複製檔案。在標準的 Debian 安裝程式程式中他是 <filename>/boot</filename> 符號鏈結 <filename>/initrd.img</filename> 指向的檔案。

source: This is a small text file warning you that the contents of the directory are managed by the <command>elilo</command> and that any local changes would be lost at the next time <filename>/usr/sbin/elilo</filename> is run.
ru: Это маленький текстовый файл, предупреждающий, что содержимое каталога управляется из <command>elilo</command> и что любые локальные изменения будут уничтожены при следующем запуске <filename>/usr/sbin/elilo</filename>.
zh_tw: 這個文字檔用於警告您那些由 <command>elilo</command> 管理的目錄中的內容，任何本地修改在下次 <filename>/usr/sbin/elilo</filename> 執行時將丟失。

source: This is the compressed kernel itself. It is a copy of the file referenced in the <filename>/etc/elilo.conf</filename>. In a standard Debian installation it would be the file in <filename>/boot</filename> pointed to by the symbolic link <filename>/vmlinuz</filename>.
ru: Это файл с сжатым ядром. Это копия файла, на который естьссылка в <filename>/etc/elilo.conf</filename>. В стандартной установке Debian этот файл находится в <filename>/boot</filename>, и на него указывает символическая ссылка <filename>/vmlinuz</filename>.
zh_tw: 此為壓縮核心。它是引用 <filename>/etc/elilo.conf</filename> 的複製檔案。在標準的 Debian 安裝程式程式中他是 <filename>/boot</filename> 符號鏈結 <filename>/vmlinuz</filename> 指向的檔案。

source: <command>arcboot</command>-installer
ru: Системный загрузчик <command>arcboot</command>

source: The boot loader on SGI Indys is <command>arcboot</command>. It has to be installed on the same hard disk as the kernel (this is done automatically by the installer). Arcboot supports different configurations which are set up in <filename>/etc/arcboot.conf</filename>. Each configuration has a unique name, the default setup as created by the installer is <quote>linux</quote>. After arcboot has been installed, the system can be booted from hard disk by setting some firmware environment variables entering <informalexample><screen> <userinput> setenv SystemPartition scsi(<replaceable>scsi</replaceable>)disk(<replaceable>disk</replaceable>)rdisk(0)partition(0)</userinput> <userinput> setenv OSLoadPartition scsi(<replaceable>scsi</replaceable>)disk(<replaceable>disk</replaceable>)rdisk(0)partition(<replaceable>partnr</replaceable>)</userinput> <userinput> setenv OSLoader arcboot</userinput> <userinput> setenv OSLoadFilename <replaceable>config</replaceable></userinput> <userinput> setenv AutoLoad yes</userinput> </screen></informalexample> on the firmware prompt, and then typing <command>boot</command>.
ru: Системный загрузчик на SGI Indys называется <command>arcboot</command>. Он будет установлен на тот же жёсткий диск что и ядро (выполняется программой установки автоматически). Arcboot имеет несколько конфигураций, которые хранятся в файле <filename>/etc/arcboot.conf</filename>. Каждая конфигурация имеет уникальное имя, та что создаётся программой установки называется <quote>linux</quote>. После установки arcboot система может загружаться с жёсткого диска, если установить несколько переменных микропрограммы, введя <informalexample><screen> <userinput> setenv SystemPartition scsi(<replaceable>scsi</replaceable>)disk(<replaceable>disk</replaceable>)rdisk(0)partition(0)</userinput> <userinput> setenv OSLoadPartition scsi(<replaceable>scsi</replaceable>)disk(<replaceable>disk</replaceable>)rdisk(0)partition(<replaceable>partnr</replaceable>)</userinput> <userinput> setenv OSLoader arcboot</userinput> <userinput> setenv OSLoadFilename <replaceable>config</replaceable></userinput> <userinput> setenv AutoLoad yes</userinput> </screen></informalexample> в приглашении микропрограммы и затем ввести <command>boot</command>.
zh_tw: SGI Indys 上的 boot loader 是 <command>arcboot</command>。它必須被安裝到與核心相同的磁碟上 (安裝程式自動完成)。Arcboot 可以支援不同的設定，它們的設定檔在 <filename>/etc/arcboot.conf</filename>。每套設定有各自的名稱，安裝程式建立的預設設定值為 <quote>linux</quote>。Acrboot 安裝之後，在韌體提示符號下設定一些韌體環境變數即可從硬碟開機。 <informalexample><screen> <userinput> setenv SystemPartition scsi(<replaceable>scsi</replaceable>)disk(<replaceable>disk</replaceable>)rdisk(0)partition(0)</userinput> <userinput> setenv OSLoadPartition scsi(<replaceable>scsi</replaceable>)disk(<replaceable>disk</replaceable>)rdisk(0)partition(<replaceable>partnr</replaceable>)</userinput> <userinput> setenv OSLoader arcboot</userinput> <userinput> setenv OSLoadFilename <replaceable>config</replaceable></userinput> <userinput> setenv AutoLoad yes</userinput> </screen></informalexample> ，然後鍵入 <command>boot</command>。

source: is the SCSI bus to be booted from, this is <userinput>0</userinput> for the onboard controllers
ru: это шина SCSI, с которой будет производиться загрузка, равно <userinput>0</userinput> для встроенных контроллеров
zh_tw: 是啟動的 SCSI 匯流排， <userinput>0</userinput> 為主機板內建控制器

source: is the SCSI ID of the hard disk on which <command>arcboot</command> is installed
ru: это SCSI ID жёсткого диска, на котором установлен <command>arcboot</command>
zh_tw: 是硬碟的 SCSI ID，<command>arcboot</command> 安裝在其上

source: is the number of the partition on which <filename>/etc/arcboot.conf</filename> resides
ru: это номер раздела, на котором хранится <filename>/etc/arcboot.conf</filename>
zh_tw: <filename>/etc/arcboot.conf</filename> 所處分割區編號。

source: is the name of the configuration entry in <filename>/etc/arcboot.conf</filename>, which is <quote>linux</quote> by default.
ru: это имя конфигурации в <filename>/etc/arcboot.conf</filename>, по умолчанию <quote>linux</quote>.
zh_tw: <filename>/etc/arcboot.conf</filename> 裡的設定組態名稱，預設值為 <quote>linux</quote> 。

source: <command>delo</command>-installer
ru: Системный загрузчик <command>delo</command>

source: The boot loader on DECstations is <command>DELO</command>. It has to be installed on the same hard disk as the kernel (this is done automatically by the installer). DELO supports different configurations which are set up in <filename>/etc/delo.conf</filename>. Each configuration has a unique name, the default setup as created by the installer is <quote>linux</quote>. After DELO has been installed, the system can be booted from hard disk by entering <informalexample><screen> <userinput>boot <replaceable>#</replaceable>/rz<replaceable>id</replaceable> <replaceable>partnr</replaceable>/<replaceable>name</replaceable></userinput> </screen></informalexample> on the firmware prompt.
ru: Системный загрузчик для DECstation называется <command>DELO</command>. Он будет установлен на тот же жёсткий диск что и ядро (выполняется программой установки автоматически). DELO имеет несколько конфигураций, которые хранятся в файле <filename>/etc/delo.conf</filename>. Каждая конфигурация имеет уникальное имя, та что создаётся программой установки называется <quote>linux</quote>. После установки DELO, система может загружаться с жёсткого диска, если набрать <informalexample><screen> <userinput>boot <replaceable>#</replaceable>/rz<replaceable>id</replaceable> <replaceable>partnr</replaceable>/<replaceable>name</replaceable></userinput> </screen></informalexample> в приглашении микропрограммы.
zh_tw: DECstations 使用的 boot loader 是 <command>DELO</command>。它必須被安裝到與核心相同的磁碟上 (安裝程式自動完成)。DELO 可以支援不同的設定，它們的設定儲存在<filename>/etc/delo.conf</filename>。每套設定都有各自的名稱，安裝程式建立的預設設定為 <quote>linux</quote>。DELO 安裝之後，在韌體提示符號下設定一些韌體環境變數即可從硬碟開機。 <informalexample><screen> <userinput>boot <replaceable>#</replaceable>/rz<replaceable>id</replaceable> <replaceable>partnr</replaceable>/<replaceable>name</replaceable></userinput> </screen></informalexample> 。

source: is the TurboChannel device to be booted from, on most DECstations this is <userinput>3</userinput> for the onboard controllers
ru: это устройство TurboChannel, с которого будет выполняться загрузка, для большинства DECstations имеет значение <userinput>3</userinput> для встроенных контроллеров
zh_tw: 是用來開機的 TurboChannel 設備，在 DEC 工作站上的主機板內建控制器是 <userinput>3</userinput>

source: is the SCSI ID of the hard disk on which <command>DELO</command> is installed
ru: это SCSI ID жёсткого диска, на котором установлен <command>DELO</command>
zh_tw: <command>DELO</command> 所處的硬碟的 SCSI ID。

source: is the number of the partition on which <filename>/etc/delo.conf</filename> resides
ru: это номер раздела, на котором хранится <filename>/etc/delo.conf</filename>
zh_tw: <filename>/etc/delo.conf</filename> 所處的分割區號。

source: is the name of the configuration entry in <filename>/etc/delo.conf</filename>, which is <quote>linux</quote> by default.
ru: это имя конфигурации в <filename>/etc/delo.conf</filename>, по умолчанию <quote>linux</quote>.
zh_tw: <filename>/etc/delo.conf</filename> 裡的設定組態名稱，預設為 <quote>linux</quote>

source: In case <filename>/etc/delo.conf</filename> is on the first partition on the disk and the default configuration shall be booted, it is sufficient to use
ru: Если <filename>/etc/delo.conf</filename> хранится на первом разделе диска и должна быть загружена конфигурация по умолчанию, то достаточно набрать
zh_tw: 儘管 <filename>/etc/delo.conf</filename> 位於硬碟的第一個分割區，並且應該使用預設的開機設定，但也可以用

source: Install <command>Yaboot</command> on a Hard Disk
ru: Установка системного загрузчика <command>Yaboot</command> на жёсткий диск
zh_tw: 安裝 <command>Yaboot</command> 至硬碟

source: Newer (mid 1998 and on) PowerMacs use <command>yaboot</command> as their boot loader. The installer will set up <command>yaboot</command> automatically, so all you need is a small 820k partition named <quote>bootstrap</quote> with type <emphasis>Apple_Bootstrap</emphasis> created back in the partitioning component. If this step completes successfully then your disk should now be bootable and OpenFirmware will be set to boot &debian;.
ru: Новые (с середины 1998 и новее) PowerMacs используют <command>yaboot</command> в качестве своих системных загрузчиков. Программа установки настроит <command>yaboot</command> автоматически, поэтому всё, что вам нужно это маленький 820k раздел с именем <quote>bootstrap</quote> и типом <emphasis>Apple_Bootstrap</emphasis>, созданный ранее компонентой разбивки. Если этот шаг завершился удачно, то ваш диск должен стать загрузочным и OpenFirmware установлена на загрузку &debian;.
zh_tw: 新的 (1998 年以後)的 PowerMacs 使用 <command>yaboot</command> 作為它們的 boot loader。安裝程式會自動設定 <command>yaboot</command>，您只需一個 820k 的小分割區，命名為 <quote>bootstrap</quote>，類型為 <emphasis>Apple_Bootstrap</emphasis> 這由分割區元件建立。如果這步完全成功，硬碟就可以啟動，OpenFireware 將設為啟動 &debian;。

source: Install <command>Quik</command> on a Hard Disk
ru: Установка системного загрузчика <command>Quik</command> на жёсткий диск
zh_tw: 安裝 <command>Quik</command> 至硬碟

source: The boot loader for OldWorld Power Macintosh machines is <command>quik</command>. You can also use it on CHRP. The installer will attempt to set up <command>quik</command> automatically. The setup has been known to work on 7200, 7300, and 7600 Powermacs, and on some Power Computing clones.
ru: Системный загрузчик для машин OldWorld Power Macintosh называется <command>quik</command>. Также, вы можете использовать его на CHRP. Программа установки попытается настроить <command>quik</command> автоматически. Известно, что это сработает на 7200, 7300 и 7600 Powermacs и на некоторых клонах Power Computing.
zh_tw: <command>quik</command> 是 OldWorld Power Macintosh 機器的 boot loader。您可以將它用於 CHRP。安裝程式會自動設定 <command>quik</command>。該設定目前可以在 7200，7300 和 7600 Powermacs，以及一些 Power Computing 複製機型上正常運作。

source: <command>zipl</command>-installer
ru: Установка системного загрузчика <command>zipl</command>

source: The boot loader on &arch-title; is <quote>zipl</quote>. <command>ZIPL</command> is similar in configuration and usage to <command>LILO</command>, with a few exceptions. Please take a look at <quote>LINUX for &arch-title; Device Drivers and Installation Commands</quote> from IBM's developerWorks web site if you want to know more about <command>ZIPL</command>.
ru: Системный загрузчик для &arch-title; называется <quote>zipl</quote>. <command>ZIPL</command> по настройке и использованию, за некоторыми исключениями, похож на <command>LILO</command>. Посмотрите <quote>Драйверы устройств и команды установки LINUX на &arch-title;</quote> на вебсайте IBM developerWorks, если хотите узнать больше о <command>ZIPL</command>.
zh_tw: &arch-title; 上的 boot loader 是 <quote>zipl</quote>。 <command>ZIPL</command> 的設定和用法類似於 <command>LILO</command>，只有少許不同。如果您想了解更多，請參考 <quote>LINUX for &arch-title; Device Drivers and Installation Commands</quote>，它位於 IBM 的 developerWorks 網站 <command>ZIPL</command>。

source: Install the <command>SILO</command> Boot Loader on a Hard Disk
ru: Установка системного загрузчика <command>SILO</command> на жёсткий диск
zh_tw: 安裝 <command>SILO</command> Boot Loader 到硬碟

source: The standard &architecture; boot loader is called <quote>silo</quote>. It is documented in <filename>/usr/share/doc/silo/</filename>. <command>SILO</command> is similar in configuration and usage to <command>LILO</command>, with a few exceptions. First of all, <command>SILO</command> allows you to boot any kernel image on your drive, even if it is not listed in <filename>/etc/silo.conf</filename>. This is because <command>SILO</command> can actually read Linux partitions. Also, <filename>/etc/silo.conf</filename> is read at boot time, so there is no need to rerun <command>silo</command> after installing a new kernel like you would with <command>LILO</command>. <command>SILO</command> can also read UFS partitions, which means it can boot SunOS/Solaris partitions as well. This is useful if you want to install GNU/Linux alongside an existing SunOS/Solaris install.
ru: Стандартный системный загрузчик для &architecture; называется <quote>silo</quote>. Его документация лежит в каталоге <filename>/usr/share/doc/silo/</filename>. <command>SILO</command> по настройке и использованию, за некоторыми исключениями, похож на <command>LILO</command>. Прежде всего, <command>SILO</command> позволяет вам загружать любой образ ядра с диска, даже если его не в <filename>/etc/silo.conf</filename>. То есть <command>SILO</command> умеет работать с разделами Linux. Также, <filename>/etc/silo.conf</filename> читается во время загрузки машины и поэтому не нужно перезапускать <command>silo</command> после установки нового ядра, в отличии от <command>LILO</command>. <command>SILO</command> может также читать с разделов UFS, то есть он может загружать разделы SunOS/Solaris. Это полезно, если вы хотите установить GNU/Linux рядом с существующим SunOS/Solaris.
zh_tw: &architecture; 上標準的 boot loader 稱為 <quote>silo</quote>。它的檔案位於 <filename>/usr/share/doc/silo/</filename>。<command>SILO</command> 的設定和用法類似於 <command>LILO</command>，只有少許不同。首先，即使不存在於 <filename>/etc/silo.conf</filename> 設定檔案之中，<command>SILO</command> 也允許您從磁碟上啟動核心映像。這是因為 <command>SILO</command> 可以真正地讀取 Linux 分割區。當然，<filename>/etc/silo.conf</filename> 是在啟動時讀取，也就不需要像使用 <command>LILO</command> 一樣在安裝新核心之後再執行 <command>silo</command>。<command>SILO</command> 也可以讀取 UFS 分割區，也就是說它可以從 SunOS/Solaris 分割區啟動。這對於安裝 GNU/Linux 到一個已經存在 SunOS/Solaris 的系統很有用。

source: Continue Without Boot Loader
ru: Продолжение без системного загрузчика
zh_tw: 不使用 boot-loader 繼續進行

source: This option can be used to complete the installation even when no boot loader is to be installed, either because the arch/subarch doesn't provide one, or because none is desired (e.g. you will use existing boot loader). <phrase arch="m68k">This option is especially useful for Macintosh, Atari, and Amiga systems, where the original operating system must be maintained on the box and used to boot GNU/Linux.</phrase>
ru: Эта опция может быть использована для завершения установки без установки системного загрузчика, если для этой архитектуры/субархитектуры его не существует или потому что, он вам не нужен (например, чтобы использовать существующий системный загрузчик). <phrase arch="m68k">Эта опция особенно полезна для машин Macintosh, Atari и Amiga, где родная операционная система должна управлять компьютером и использоваться для загрузки GNU/Linux.</phrase>
zh_tw: 該選項用於完成安裝而不安裝 boot-loader，這種情況可能是硬體架構/子架構不支援，或是因為不想要 (例如，您想使用已經存在的 boot-loader)。<phrase arch="m68k">這個選項對 Macintosh，Atari 和 Amiga 系統特別有用，因為它們本來的作業系統必須存在於機器上，以用於啟動 GNU/Linux。</phrase>

source: If you plan to manually configure your bootloader, you should check the name of the installed kernel in <filename>/target/boot</filename>. You should also check that directory for the presence of an <firstterm>initrd</firstterm>; if one is present, you will probably have to instruct your bootloader to use it. Other information you will need are the disk and partition you selected for your <filename>/</filename> filesystem and, if you chose to install <filename>/boot</filename> on a separate partition, also your <filename>/boot</filename> filesystem.
ru: Если вы планируете настройку системного загрузчика вручную, то должны узнать имя файла устанавливаемого ядра, которое лежит в каталоге <filename>/target/boot</filename>. Также, проверьте существование каталога <firstterm>initrd</firstterm>; если он есть, то вероятно нужно указать это в системном загрузчике, чтобы он использовал его. Ещё вам потребуется знать диск и раздел, который выбран в качестве <filename>/</filename> файловой системы и, если вы выбрали установку с отдельным разделом <filename>/boot</filename>, то также и раздел файловой системы с <filename>/boot</filename>.
zh_tw: 如果您打算手動設定 boot-loader，您需要檢查安裝在 <filename>/target/boot</filename>的核心名稱。您還需要檢查 <firstterm>initrd</firstterm> 存在的目錄﹔如果存在，也許需要指定 bootloader 使用它。其相關資訊包括為 <filename>/</filename> 檔案系統選擇磁碟和分割區，並且，如果您打算安裝 <filename>/boot</filename> 到一個獨立的分割區，還需要 <filename>/boot</filename> 檔案系統。

source: Finishing the First Stage
ru: Завершение первой стадии
zh_tw: 完成第一階段

source: These are the last bits to do before rebooting to your new Debian. It mostly consists of tidying up after the &d-i;.
ru: Перед первой загрузкой в только что установленный Debian, нужно ещё выполнить пару действий. В основном, это уборка за &d-i;.
zh_tw: 在啟動新 Debian 之前還有一些最後工作，主要是 &d-i; 之後的整理。

source: Finish the Installation and Reboot
ru: Завершение установки и перезагрузка
zh_tw: 完成安裝並重開機

source: This is the last step in the initial Debian installation process. You will be prompted to remove the boot media (CD, floppy, etc) that you used to boot the installer. The installer will do any last minute tasks, and then reboot into your new Debian system.
ru: Это последний шаг первой стадии процесса установки Debian. Вам предложат вынуть загрузочный носитель (CD, дискету, другой), который использовался для загрузки программы установки. Программа установки выполнит завершающие действия, а затем перезагрузит машину в новую систему Debian.
zh_tw: 這是安裝 Debian 程序的最後一步。您會被提醒取出用於啟動安裝程式的媒介 (CD，軟碟等)。安裝程式將完成最後的工作，然後啟動您的新 Debian 系統。

source: Select the <guimenuitem>Finish the installation</guimenuitem> menu item which will halt the system because rebooting is not supported on &arch-title; in this case. You then need to IPL GNU/Linux from the DASD which you selected for the root filesystem during the first steps of the installation.
ru: Выберите в меню <guimenuitem>Завершить установку</guimenuitem>, чтобы остановить систему, так как перезагрузка не поддерживается на &arch-title; в данном случае. Затем, вам нужен IPL GNU/Linux из DASD, который вы выбрали в качестве корневой файловой системы в самом начале установки.
zh_tw: 選擇 <guimenuitem>結束安裝作業</guimenuitem> 選單項，它用來關閉系統。因為在這種情況下，重開機不被 &arch-title; 支援。您需要使用來自 DASD 的 IPL GNU/Linux，它在安裝步驟第一步裡被選做根檔案系統。

source: Miscellaneous
ru: Разное
zh_tw: 雜項

source: The components listed in this section are usually not involved in the installation process, but are waiting in the background to help the user in case something goes wrong.
ru: Перечисленные в этом разделе компоненты обычно не используются в процессе установки, но они готовы прийти на помощь пользователю в случае, если что-то пойдёт не так.
zh_tw: 這裡的元件通常不在安裝程序之內，但會背景待命，以幫助使用者遇到麻煩時處理問題。

source: Saving the installation logs
ru: Сохранение протокола установки
zh_tw: 保存安裝記錄
