Repository: xobs/debian-installer
Catalog: doc/manual/po/*/using-d-i.po
Languages: ru, zh_tw

source: As you enter this step, if the system detects that you have more than one network device, you'll be asked to choose which device will be your <emphasis>primary</emphasis> network interface, i.e. the one which you want to use for installation. The other interfaces won't be configured at this time. You may configure additional interfaces after installation is complete; see the <citerefentry> <refentrytitle>interfaces</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> man page.
ru: Если в начале этого шага система обнаруживает, что имеется более одного сетевого устройства, то вас попросят указать, какое устройство будет <emphasis>первичным</emphasis> сетевым интерфейсом, то есть какое устройство будет использовано для установки системы. Другие интерфейсы останутся ненастроенными. Вы сможете настроить дополнительные интерфейсы после завершения установки; смотрите страницу руководства <citerefentry> <refentrytitle>interfaces</refentrytitle> <manvolnum>5</manvolnum> </citerefentry>.
zh_tw: 到了此步驟，如果系統檢測到您有多於網路設備，您將被要求選擇哪個設備是您的<emphasis>主</emphasis>網路介面，例如，您在安裝中要用的那個。其他的網路介面這時不會被設定。您可以在安裝完畢之後去設定額外的介面﹔請參考 <citerefentry> <refentrytitle>interfaces</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> man 頁。

source: By default, &d-i; tries to configure your computer's network automatically via DHCP. If the DHCP probe succeeds, you are done. If the probe fails, it may be caused by many factors ranging from unplugged network cable, to a misconfigured DHCP setup. Or maybe you don't have a DHCP server in your local network at all. For further explanation check the error messages on the third console. In any case, you will be asked if you want to retry, or if you want to perform manual setup. DHCP servers are sometimes really slow in their responses, so if you are sure everything is in place, try again.
ru: По умолчанию, &d-i; пытается настроить сетевой интерфейс вашего компьютера автоматически через DHCP. Если на DHCP запросы получен ответ, настройка завершена. Если ответов не получено, это могло произойти по многим причинам, начиная от неподключённого сетевого кабеля и кончая неправильной настройкой DHCP. Или вы просто не имеете DHCP сервера в локальной сети. Для выяснения причины посмотрите сообщения об ошибках на третьей консоли. В любом случае вас спросят, не хотите ли вы попробовать ещё раз, или хотите выполнить настройку вручную. Иногда DHCP сервера очень медленно отвечают, поэтому если вы уверены, что всё в порядке, попробуйте ещё раз.
zh_tw: 預設情況下，&d-i; 會自動嘗試使用 DHCP 設定您的電腦網路。如果 DHCP 偵測成功，這一步就完成。如果失敗，造成的原因會有多種因素，從沒有接網線到錯誤設定的 DHCP。或者您的區域網路裡面根本就沒有 DHCP 伺服器。查閱第三個控制台上的錯誤訊息以瞭解更多資訊。不管怎樣，您將被要求選擇再試一次或是手動設定。DHCP 伺服器有時候回應很慢，因此，如果您確定都正常，再試一次。

source: The manual network setup in turn asks you a number of questions about your network, notably <computeroutput>IP address</computeroutput>, <computeroutput>Netmask</computeroutput>, <computeroutput>Gateway</computeroutput>, <computeroutput>Name server addresses</computeroutput>, and a <computeroutput>Hostname</computeroutput>. Moreover, if you have a wireless network interface, you will be asked to provide your <computeroutput>Wireless ESSID</computeroutput> and a <computeroutput>WEP key</computeroutput>. Fill in the answers from <xref linkend="needed-info"/>.
ru: При ручной настройке сети вам зададут несколько вопросов о вашей сети, а именно про <computeroutput>IP адрес</computeroutput>, <computeroutput>маску сети</computeroutput>, <computeroutput>шлюз</computeroutput>, <computeroutput>адреса серверов имён</computeroutput> и <computeroutput>имени машины</computeroutput>. Кроме того, если у вас интерфейс беспроводной сети, то вас попросят ввести личный <computeroutput>Wireless ESSID</computeroutput> и <computeroutput>WEP ключ</computeroutput>. Введите ответы из <xref linkend="needed-info"/>.
zh_tw: 手動設定網路會按序詢問一些您網路的問題，值得注意的是 <computeroutput> IP 位址</computeroutput>、<computeroutput>網路遮罩</computeroutput>、<computeroutput>閘道器</computeroutput>、<computeroutput>名稱伺服器位址</computeroutput> 和 <computeroutput>主機名稱</computeroutput>。 此外，如果您有無線網路介面，您會被要求提供您的 <computeroutput>無線 ESSID</computeroutput> 和 <computeroutput>WEP 密鑰</computeroutput>。從 <xref linkend="needed-info"/> 中參考應回答的數值。

source: Some technical details you might, or might not, find handy: the program assumes the network IP address is the bitwise-AND of your system's IP address and your netmask. It will guess the broadcast address is the bitwise OR of your system's IP address with the bitwise negation of the netmask. It will also guess your gateway. If you can't find any of these answers, use the system's guesses &mdash; you can change them once the system has been installed, if necessary, by editing <filename>/etc/network/interfaces</filename>. Alternatively, you can install <classname>etherconf</classname>, which will step you through your network setup.
ru: Некоторые настройки можно легко определить вручную: программа предполагает, что адрес IP сети вычисляется с помощью операции побитового И над IP адресом системы и маской сети. Широковещательный адрес вычисляется с помощью операции побитового ИЛИ над IP адресом системы и инверсной маской сети. Также вычисляется шлюз. Если вы не можете найти какой-нибудь ответ, используйте предлагаемые системой &mdash; если нужно, вы можете изменить их сразу после установки системы, отредактировав <filename>/etc/network/interfaces</filename>. Или же вы можете установить <classname>etherconf</classname>, который поможет вам с настройкой сети.
zh_tw: 您也許會覺得一些技術細節很有用：程式假定網路 IP 位址是與您的系統 IP 位址和網路遮罩取位元交集。它還會猜測廣播位址是您的系統 IP 位址和網路遮罩取反位元交集。它也會猜測您的閘道器。如果您不能回答這些問題，讓系統猜測 &mdash; 您可以在系統安裝完畢之後來修改它們，如果需要，編輯 <filename>/etc/network/interfaces</filename>。另外一種選擇，您可以安裝 <classname>etherconf</classname>，它用來一步步進行網路設定。

source: Partitioning and Mount Point Selection
ru: Разметка разделов и выбор точек монтирования
zh_tw: 分割區與選擇掛載點

source: At this time, after hardware detection has been executed a final time, &d-i; should be at its full strength, customized for the user's needs and ready to do some real work. As the title of this section indicates, the main task of the next few components lies in partitioning your disks, creating filesystems, assigning mountpoints and optionally configuring closely related issues like LVM or RAID devices.
ru: После того как определение оборудования было выполнено в последний раз, &d-i; должен быть во всей своей красе, подстроенный под нужды пользователя и готовый к выполнению кое-какой настоящей работы. Как написано в заголовке раздела, основной задачей нескольких следующих компонентов будет разметка дисков, создание файловых систем, назначение точек монтирования и, возможно, настройка LVM или устройств RAID.
zh_tw: 現在，經過最後的硬體偵測，&d-i; 已經充滿活力，按照使用者需求，準備就緒。正如本節標題指明，接下來元件的主要任務是為您的硬碟分割磁區，建立檔案系統，安排掛載點，並為近似選項進行設定，例如 LVM 或 RAID 設備。

source: Partitioning Your Disks
ru: Разметка дисков
zh_tw: 硬碟的分割區

source: Now it is time to partition your disks. If you are uncomfortable with partitioning, or just want to know more details, see <xref linkend="partitioning"/>.
ru: Теперь настало время разметки дисков. Если вы плохо знакомы с процедурой разметки, или просто хотите знать детали процесса, смотрите <xref linkend="partitioning"/>.
zh_tw: 現在是時候對您的硬碟進行分割了。要是您對分割還有心存疑慮，或者只是想瞭解更多的細節，請參閱 <xref linkend="partitioning"/>。

source: First you will be given the opportunity to automatically partition either an entire drive, or free space on a drive. This is also called <quote>guided</quote> partitioning. If you do not want to autopartition, choose <guimenuitem>Manually edit partition table</guimenuitem> from the menu.
ru: Сначала вам предложат автоматическую разметку или всего диска или только его свободного места. Это так называемая <quote>направляющая</quote> разметка. Если вы не хотите использовать авторазметку, выберите в меню <guimenuitem>Редактирование таблицы разделов вручную</guimenuitem>.
zh_tw: 首先您可以選擇對整塊硬碟或是其上的未使用空間進行自動分割區。這也被稱為 <quote>嚮導式</quote> 分割區。倘若您不願自動分割區，那麼也可以選擇選單中的 <guimenuitem>手動編輯磁碟分割表</guimenuitem> 。

source: If you choose guided partitioning, you will be able to choose from the schemes listed in the table below. All schemes have their pros and cons, some of which are discussed in <xref linkend="partitioning"/>. If you are unsure, choose the first one. Bear in mind, that guided partitioning needs certain minimal amount of free space to operate with. If you don't give it at least about 1GB of space (depends on chosen scheme), guided partitioning will fail.
ru: Если вы выбрали направляющую разметку, то вам предложат выбрать одну из схем, описанных в таблице ниже. Любая схема имеет свои "за" и "против", некоторые обсуждаются в <xref linkend="partitioning"/>. Если вы не знаете что выбрать, выберите первую. Помните, что для работы направляющей разметке требуется минимальное количество свободного места с которым можно работать. Если вы не выделите по крайней мере окого 1ГБ (зависит от выбранной схемы), направляющая разметка завершится неудачно.
zh_tw: 倘若您選擇了嚮導式分割，那麼就要從下表所列的幾個方式中選擇其一。每個方式都各有利弊。在 <xref linkend="partitioning"/> 中對它們中的有這幾個方式的評價。如果您沒有把握，請選擇第一個選項您。有一點要記住，就是使用嚮導式分割區至少需要一定大小的未使用空間才能正常運作。如果您沒有給它 1GB 以上的空間 (大小隨所選的方式而不同)，那麼嚮導式分割區將以失敗告終。

source: Partitioning scheme
ru: Схема разметки
zh_tw: 分割區方式

source: Minimum space
ru: Минимальное пространство
zh_tw: 所需最小空間

source: Created partitions
ru: Создаваемые разделы
zh_tw: 所新建的分割區

source: All files in one partition
ru: Все файлы на одном разделе
zh_tw: 所有檔案在同一分割區

source: 600MB
ru: 600МБ

source: Desktop machine
ru: Настольный компьютер
zh_tw: 桌面電腦

source: 500MB
ru: 500МБ

source: Multi-user workstation
ru: Многопользовательская рабочая станция
zh_tw: 多使用者工作站

source: <entry>1GB</entry>
ru: <entry>1ГБ</entry>

source: If you chose an automatic partitioning for your IA64 system, there will be an additional partition, formatted as a FAT16 bootable filesystem, for the EFI boot loader. There is also an additional menu item in the formatting menu to manually set up a partition as an EFI boot partition.
ru: Если вы выберите автоматическую разметку в системе IA64, то на ней появится дополнительный раздел, отформатированный как загружаемая файловая система FAT16, который используется системным загрузчиком EFI. Также, есть дополнительный пункт в меню форматирования для ручной настройки раздела в качестве загрузочного раздела EFI.
zh_tw: 倘若您為您的 IA64 系統選擇了自動分割區，那就會另外分出來一個分割區。這個分割區專門為 EFI bootloader 格式化成 FAT16 的可開機檔案系統。同時，選單裡也將有另外的一項，可以讓您手動把某個分割區作為 EFI 開機分割區。

source: If you chose an automatic partitioning for your Alpha system, an additional, unformatted partition will be allocated at the beginning of your disk to reserve this space for the aboot boot loader.
ru: Если на Alpha системе вы выбрали автоматическую разметку, то будет создан дополнительный, неформатированный раздел в начале диска, который предназначен для резервирования места для системного загрузчика aboot.
zh_tw: 如果您為 Alpha 系統選擇自動分割區，額外的、未格式化的分割區將分配在磁碟的開始處，作為 aboot boot loader 的保留空間。

source: After selecting a scheme, the next screen will show your new partition table, including information on whether and how partitions will be formatted and where they will be mounted.
ru: После выбора схемы, следующий экран покажет только что созданную таблицу разделов, включая информацию будут ли и как форматироваться разделы и куда они будут смонтированы.
zh_tw: 在選定了分割區方式後的下一個畫面，您會看到關於自己分割區的一張表格，上面標明了分割區是否將被格式化，將以何種方式格式化，以及它們將被掛載到哪裡的相關資訊。

source: The list of partitions might look like this: <informalexample><screen> IDE1 master (hda) - 6.4 GB WDC AC36400L #1 primary 16.4 MB ext2 /boot #2 primary 551.0 MB swap swap #3 primary 5.8 GB ntfs pri/log 8.2 MB FREE SPACE IDE1 slave (hdb) - 80.0 GB ST380021A #1 primary 15.9 MB ext3 #2 primary 996.0 MB fat16 #3 primary 3.9 GB xfs /home #5 logical 6.0 GB ext3 / #6 logical 1.0 GB ext3 /var #7 logical 498.8 MB ext3 #8 logical 551.5 MB swap swap #9 logical 65.8 GB ext2 </screen></informalexample> This example shows two IDE harddrives divided into several partitions; the first disk has some free space. Each partition line consists of the partition number, its type, size, optional flags, file system, and mountpoint (if any).
ru: Список разделов может выглядеть так: <informalexample><screen> IDE1 master (hda) - 6.4 GB WDC AC36400L #1 primary 16.4 MB ext2 /boot #2 primary 551.0 MB swap swap #3 primary 5.8 GB ntfs pri/log 8.2 MB FREE SPACE IDE1 slave (hdb) - 80.0 GB ST380021A #1 primary 15.9 MB ext3 #2 primary 996.0 MB fat16 #3 primary 3.9 GB xfs /home #5 logical 6.0 GB ext3 / #6 logical 1.0 GB ext3 /var #7 logical 498.8 GB ext3 #8 logical 551.5 GB swap swap #9 logical 65.8 GB ext2 </screen></informalexample> Здесь показаны два жёстких диска IDE, разделённых на несколько разделов; на первом диске осталось немного свободного места. Каждая строка раздела содержит номер раздела, тип, размер, необязательные флаги, файловую систему и точку монтирования (если есть).

source: This concludes the guided partitioning. If you are satisfied with the generated partition table, you can choose <guimenuitem>Finish partitioning and write changes to disk</guimenuitem> from the menu to implement the new partition table (as described at the end of this section). If you are not happy, you can choose to <guimenuitem>Undo changes to partitions</guimenuitem>, to run guided partitioning again or modify the proposed changes as described below for manual partitioning.
ru: На этом направляющая разметка завершена. Если вам нравится сгенерированная таблица разделов, то вы можете выбрать <guimenuitem>Закончить разметку и записать изменения на диск</guimenuitem> из меню для создания новой таблицы разделов (как описано в конце этого раздела). Если результат вам не нравится, то можно выбрать <guimenuitem>Отменить изменение разделов</guimenuitem>, запустить направляющую разметку снова или изменить предложенные изменения вручную, как описано ниже.
zh_tw: 接下來，嚮導式分割區就要完成了。如果您對上面產生的分割區資訊表感到滿意，那麼請在選單中選擇<guimenuitem>結束磁碟分割作業並將變更寫入磁碟中</guimenuitem> 一項，這樣，新的分割區表就建立了 (本節節末將會對此進行解釋)。如果您認為分割區設置不合需求，那麼可以選擇<guimenuitem>取消所有對磁碟分割的變更</guimenuitem>，之後就可以再次進行嚮導式分割區，或者按照下面將要介紹的手動分割區的辦法來完成自己所設想的分割規劃。

source: A similar screen to the one shown just above will be displayed if you choose manual partitioning except that your existing partition table will be shown and without the mount points. How to manually setup your partition table and the usage of partitions by your new Debian system will be covered in the remainder of this section.
ru: При ручной разметке появляется похожий экран, за исключением того, что отображается существующая таблица разделов и нет точек монтирования. Далее описано как вручную редактировать таблицу разделов и как использовать эти разделы в Debian.
zh_tw: 如果您選擇了手動分割區的話，它的畫面和上面介紹的嚮導式分割區大體上相同。不同之處在於，畫面上顯示的是您目前的分割區列表，而且其中並沒有掛載點的資訊。關於如何手動設置您的分割區表，以及新安裝的 Debian 系統將如何使用這些分割區，這些內容將會在本節的後面談到。

source: If you select a pristine disk which doesn't have neither partitions nor free space on it, you will be offered to create a new partition table (this is needed so you can create new partitions). After this a new line entitled <quote>FREE SPACE</quote> should appear under the selected disk.
ru: Если вы работаете с чистым диском, на котором нет ни разделов ни свободного места, то вам предложат создать новую таблицу разделов (это необходимо для создания новых разделов). После этого, на выбранном диске должна появиться новая строка <quote>СВОБОДНОЕ ПРОСТРАНСТВО</quote>.
zh_tw: 倘若您選用的是一塊全新的硬碟，它還沒有被分割過，上面也沒有未使用空間。那麼系統會要求您新建一個分割區表 (只有這樣，您才能建立新的分割區)。分割區表建好之後，在被選中的磁碟下會出現一個新行，上面寫著<quote>未使用空間</quote>。

source: If you select some free space, you will be offered to create new partition. You will have to answer a quick series of questions about its size, type (primary or logical), and location (beginning or end of the free space). After this, you will be presented with detailed overview of your new partition. There are options like mountpoint, mount options, bootable flag, or way of usage. If you don't like the preselected defaults, feel free to change them to your liking. E.g. by selecting the option <guimenuitem>Use as:</guimenuitem>, you can choose different filesystem for this partition including the possibility to use the partition for swap, software RAID, LVM, or not use it at all. Other nice feature is the possibility to copy data from existing partition onto this one. When you are satisfied with your new partition, select <guimenuitem>Done setting up the partition</guimenuitem> and you will be thrown back to the <command>partman</command>'s main screen.
ru: Если вы выберите свободное пространство, вам предложат создать новый раздел. Вы должны ответить на несколько коротких вопросов о размере, типе (первичный или логический) и местоположении (в начале или конце свободного пространства). После этого, вам покажут предлагаемые параметры нового раздела. Здесь можно увидеть: точка монтирования, параметры монтирования, флаг загрузки или как он будет использоваться. Если вам не нравятся значения по умолчанию, измените их как хотите. Например, в параметре <guimenuitem>Использовать как:</guimenuitem>, вы можете выбрать тип файловой системы для этого раздела, включая возможность использования раздела в качестве раздела подкачки, программного RAID, LVM или совсем его не использовать. Другим полезным свойством является возможность скопировать данные из существующего раздела на этот. Когда вы настроите новый раздел, выберите <guimenuitem>Закончить с разделом</guimenuitem> и вы вернётесь обратно в главное меню <command>partman</command>.
zh_tw: 如果您選中了某塊未使用空間，那麼就可以在上面新建分割區了。接著需要回答一系列簡短的問題，如分割區大小、類型 (主分割區還是邏輯分割區)、以及分割區的位置 (在未使用空間的開始部分還是在結束部分)。回答完畢後，您會看到一個小結，它詳盡地列出這個新分割區的各種參數和設置，包括掛載點、掛載選項、啟動旗標或者分割區的用途。如果您不喜歡預設值的話，盡可以按照自己的喜好更改它們。例如說，選取 <guimenuitem>用途：</guimenuitem> 選項，然後您可以讓這個分割區改用其他的檔案系統，例如把它用作置換分割區、軟 RAID、LVM，或者根本就放著不用。另外還有個不錯的功能，就是可以把現有分割區的數據拷貝到新分割區上。一旦您對新分割區的設置感到滿意了，就可以選擇 <guimenuitem>分割區設定作業完成</guimenuitem>，然後會自動退回到 <command>partman</command> 的主畫面。

source: If you decide you want to change something about your partition, simply select the partition, which will bring you to the partition configuration menu. Because this is the same screen like when creating a new partition, you can change the same set of options. One thing which might not be very obvious at a first glance is that you can resize the partition by selecting the item displaying the size of the partition. Filesystems known to work are at least fat16, fat32, ext2, ext3 and swap. This menu also allows you to delete a partition.
ru: Если вы решили, что хотите что-то изменить в разделе, просто выберите раздел и попадёте обратно в меню настройки раздела. Так как это тоже самое меню что и для создания раздела, вы можете изменить тот же набор параметров. Одна вещь, которая может показаться неочевидной на первый взгляд: вы можете изменить размер раздела, выбрав элемент, отображающий размер раздела. Это работает, как минимум, на файловых системах fat16, fat32, ext2, ext3 и с разделом подкачки. Также, из этого меню можно удалить раздел.
zh_tw: 若是您希望修改分割區的設置，只要選取該分割區，分割區的設定選單就會出現在您的面前。由於這個畫面和新建分割區時使用的畫面是相同的，所以您可以像以前那樣修改設定選項。有一件事，可能第一眼看不大出來，就是您還可以透過選取分割區大小項目來調整分割區的大小。目前適用的檔案系統至少有 fat16、 fat32、ext2、ext3 和 swap。在這個選單中，您還可以刪除分割區。

source: Be sure to create at least two partitions: one for the <emphasis>root</emphasis> filesystem (which must be mounted as <filename>/</filename>) and one for <emphasis>swap</emphasis>. If you forget to mount the root filesystem, <command>partman</command> won't let you continue until you correct this issue.
ru: Убедитесь, что создали, по крайнем мере, два раздела: один для <emphasis>корневой</emphasis> файловой системы (который должен быть смонтирован как <filename>/</filename>) и один раздел <emphasis>подкачки</emphasis>. Если вы забыли указать точку монтирования корневой файловой системы, <command>partman</command> не разрешит вам продолжить, пока вы не исправите ошибку.
zh_tw: 請確保至少分出兩個分割區：其中一個作為 <emphasis>root</emphasis> 檔案系統 (它必須掛載到 <filename>/</filename>) 另一個用於 <emphasis>swap</emphasis>。若是您忘記了掛載根 (root) 檔案系統的話，<command>partman</command> 會拒絕讓您繼續下面的步驟，直到您改正了這個錯誤。

source: If you forget to select and format an EFI boot partition <command>partman</command> will detect this and will not let you continue until you allocate one.
ru: Если вы забыли выбрать и отформатировать загрузочный EFI раздел, <command>partman</command> обнаружит это и не разрешит вам продолжить, пока вы создадите такой раздел.
zh_tw: 如果您忘記選擇和格式化一個 EFI 啟動分割區 <command>partman</command> 會察覺這一點，不讓您繼續操作，直到您劃分出這樣一個分割區。

source: Capabilities of <command>partman</command> can be extended with installer modules, but are dependent on your system's architecture. So if you can't see all promised goodies, check if you have loaded all required modules (e.g. <filename>partman-ext3</filename>, <filename>partman-xfs</filename>, or <filename>partman-lvm</filename>).
ru: Возможности <command>partman</command> могут быть расширены модулями программы установки, но это зависит от архитектуры компьютера. Поэтому, если вы не найдёте всех обещанных свойств, проверьте, загрузили ли вы все требуемые модули (например, <filename>partman-ext3</filename>, <filename>partman-xfs</filename> или <filename>partman-lvm</filename>).
zh_tw: 由於 <command>partman</command> 的功能是透過安裝本套件的各模組功能以延伸和擴展，但是具體又因您的系統的架構而有所區別。因此，如果您發現安裝的實際情況與我們所言不符，缺少了某些功能特性，那麼請檢查一下，確保已掛載了所有必須的模組 (例如 <filename>partman-ext3</filename>、<filename>partman-xfs</filename> 或者 <filename>partman-lvm</filename>)。

source: After you are satisfied with partitioning, select <guimenuitem>Finish partitioning and write changes to disk</guimenuitem> from the partitioning menu. You will be presented with a summary of changes made to the disks and asked to confirm that the filesystems should be created as requested.
ru: Для завершения работы по разметке, выберите <guimenuitem>Закончить разметку и записать изменения на диск</guimenuitem> из меню разметки. Вам покажут отчёт об изменениях, которые будут произведены на диске и попросят подтвердить, что все представленные файловые системы должны быть созданы.
zh_tw: 對分割區設定感到滿意後，就可以選擇分割區選單中的 <guimenuitem>結束磁碟分割作業並將變更寫入磁碟中</guimenuitem> 一項。在這之後，會出現一個清單，列出即將在硬碟上進行的所有操作。此時，安裝程式會讓您確認是否就照此設定進行分割。

source: Configuring Logical Volume Manager (LVM)
ru: Настройка менеджера логических томов (LVM)
zh_tw: 配置邏輯容量管理(LVM)

source: If you are working with computers at the level of system administrator or <quote>advanced</quote> user, you have surely seen the situation where some disk partition (usually the most important one) was short on space, while some other partition was grossly underused and you had to manage this situation with moving stuff around, symlinking, etc.
ru: Если вы работаете с компьютером на уровне системного администратора или <quote>продвинутого</quote> пользователя, то, определённо, попадали в ситуацию, когда на дисковом разделе (обычно на самом важном) заканчивалось место, а соседний раздел был почти пуст и вы выбирались из этой ситуации переносом данных с одного раздела на другой, созданием символических ссылок и т.д.
zh_tw: 如果您做電腦系統管理員工作或者<quote>進階</quote>使用者，您一定遇過磁碟分區 (經常是最重要的那個) 空間不足，同時其他的分割區卻不能平衡使用，然後您不得不被移動檔案或符號鏈結等方法所困擾。
