Repository: xobs/debian-installer
Catalog: doc/manual/po/*/using-d-i.po
Languages: ru, zh_tw

source: If the installation is successful, the logfiles created during the installation process will be automatically saved to <filename>/var/log/debian-installer/</filename> on your new Debian system.
ru: Если установка прошла успешно, файлы протокола установки, созданные во время процесса установки, будут автоматически записаны в <filename>/var/log/debian-installer/</filename> в новой системе Debian.
zh_tw: 如果安裝成功，安裝過程中建立的記錄檔會被自動儲存到您新的 Debian 系統上的 <filename>/var/log/debian-installer/</filename>。

source: Choosing <guimenuitem>Save debug logs</guimenuitem> from the main menu allows you to save the log files to a floppy disk<phrase condition="etch">, network, hard disk, or other media</phrase>. This can be useful if you encounter fatal problems during the installation and wish to study the logs on another system or attach them to an installation report.
ru: Выбор <guimenuitem>Сохранить файлы журнала с отладочной информацией</guimenuitem> из главного меню позволяет записать файлы протокола на дискету<phrase condition="etch">, через сеть, на жёсткий диск или другой носитель</phrase>. Это может быть полезно, если вы обнаружили неустранимую проблему при установке и хотите изучить протокол на другой системе или послать его вместе с отчётом об ошибке.
zh_tw: 從主選單上選擇<guimenuitem>儲存儲存 debug logs</guimenuitem>允許您將記錄檔保存到軟碟上。這用於安裝過程中遭遇嚴重錯誤的時，您想在其它系統上研究記錄，或者用於報告的附件。

source: Using the Shell and Viewing the Logs
ru: Использование командной строки и просмотр журнальных файлов
zh_tw: 使用 Shell 查看記錄

source: There is an <guimenuitem>Execute a Shell</guimenuitem> item on the menu. If the menu is not available when you need to use the shell, press <keycombo><keycap>Left Alt</keycap> <keycap>F2</keycap></keycombo> (on a Mac keyboard, <keycombo><keycap>Option</keycap> <keycap>F2</keycap> </keycombo>) to switch to the second <emphasis>virtual console</emphasis>. That's the <keycap>Alt</keycap> key on the left-hand side of the <keycap>space bar</keycap>, and the <keycap>F2</keycap> function key, at the same time. This is a separate window running a Bourne shell clone called <command>ash</command>.
ru: В меню есть пункт <guimenuitem>Войти в режим командной строки</guimenuitem>. Если меню недоступно, а вам нужна командная строка, нажмите <keycombo><keycap>левый Alt</keycap> <keycap>F2</keycap></keycombo> (на клавиатурах Mac, <keycombo><keycap>Option</keycap> <keycap>F2</keycap> </keycombo>) чтобы перейти на вторую <emphasis>вирутальную консоль</emphasis>. Надо нажать клавишу <keycap>Alt</keycap> слева от клавиши <keycap>пробела</keycap> и функциональную клавишу <keycap>F2</keycap> одновременно. В новом отдельном окне запустится клон интерпретатора командной строки Bourne, называемый <command>ash</command>.
zh_tw: 選單上有個<guimenuitem>呼叫 shell</guimenuitem> 選單項。如果沒有選單，想使用介殼請按 <keycombo><keycap>左 Alt</keycap> <keycap>F2</keycap></keycombo> (在 Mac 鍵盤上，<keycombo><keycap>Option</keycap> <keycap>F2</keycap> </keycombo>) 以切換到第二個<emphasis>虛擬控制台</emphasis>。就是同時按下 <keycap>Alt</keycap> 鍵，它位於 <keycap>空格鍵</keycap>的左邊，和 <keycap>F2</keycap> 功能鍵。這個獨立視窗執行 Bourne shell 的複製版 <command>ash</command>。

source: At this point you are booted from the RAM disk, and there is a limited set of Unix utilities available for your use. You can see what programs are available with the command <command>ls /bin /sbin /usr/bin /usr/sbin</command> and by typing <command>help</command>. The text editor is <command>nano</command>. The shell has some nice features like autocompletion and history.
ru: В данный момент, вы загрузились с RAM диска и имеете ограниченный набор Unix утилит. Вы можете выяснить какие утилиты доступны с помощью команды <command>ls /bin /sbin /usr/bin /usr/sbin</command> или набрав <command>help</command>. Текстовый редактор называется <command>nano</command>. Интерпретатор командной строки имеет некоторые полезные свойства,такие как автодополнение и история команд.
zh_tw: 因為這時您是從 RAM 磁碟啟動，只有有限的 Unix 工具可以使用。您可以透過指令 <command>ls /bin /sbin /usr/bin /usr/sbin</command> 和鍵入 <command>help</command> 查看哪些程式可以使用。文字編輯器是 <command>nano</command>。該 shell 有一些好用的特性，如自動完成與歷史紀錄。

source: Use the menus to perform any task that they are able to do &mdash; the shell and commands are only there in case something goes wrong. In particular, you should always use the menus, not the shell, to activate your swap partition, because the menu software can't detect that you've done this from the shell. Press <keycombo><keycap>Left Alt</keycap> <keycap>F1</keycap></keycombo> to get back to menus, or type <command>exit</command> if you used a menu item to open the shell.
ru: Для выполнения любой задачи используйте меню &mdash; режимом командной строки нужно пользоваться только в крайнем случае, если что-то идёт не так. В частности, вы всегда должны использовать меню, а не интерпретатор командной строки для активизации раздела подкачки, так как программа меню не сможет определить, что вы это сделали из командной строки. Нажмите <keycombo><keycap>левый Alt</keycap> <keycap>F1</keycap></keycombo>, чтобы вернуться в меню, или наберите <command>exit</command>, если использовали меню для входа в режим командной строки.
zh_tw: 使用選單完成它們能完成的工作 &mdash; shell 和指令只在出錯的時候使用。尤其要使用選單，而不是 shell 去啟動您的置換分割區，因為選單軟體無法偵測到您在介殼下做的工作。按下 <keycombo><keycap>左 Alt</keycap> <keycap>F1</keycap></keycombo> 返回選單，或者您是在從選單打開的介殼下，鍵入 <command>exit</command> 指令。

source: Installation Over the Network
ru: Установка по сети

source: One of the more interesting components is <firstterm>network-console</firstterm>. It allows you to do a large part of the installation over the network via SSH. The use of the network implies you will have to perform the first steps of the installation from the console, at least to the point of setting up the networking. (Although you can automate that part with <xref linkend="automatic-install"/>.)
ru: Одной из наиболее интересных компонент является <firstterm>network-console</firstterm>. Она позволяет выполнить огромную часть процесса установки через сеть по протоколу SSH. Чтобы использовать сеть, вам нужно выполнить первые шаги установки из консоли, по крайней мере настройку сети. (Хотя вы можете автоматизировать и эту часть с помощью <xref linkend="automatic-install"/>.)

source: This component is not loaded into the main installation menu by default, so you have to explicitly ask for it. If you are installing from CD, you need to boot with medium priority or otherwise invoke the main installation menu and choose <guimenuitem>Load installer components from CD</guimenuitem> and from the list of additional components select <guimenuitem>network-console: Continue installation remotely using SSH</guimenuitem>. Successful load is indicated by a new menu entry called <guimenuitem>Continue installation remotely using SSH</guimenuitem>.
ru: По умолчанию данная компонента не загружается в главное меню установки, поэтому вам потребуется явно указать это. Если для установки используется CD, вам нужно загрузиться со средним приоритетом или как-то иначе получить главное меню установки и выбрать <guimenuitem>Загрузка компонентов программы установки с компакт-диска</guimenuitem> и в списке дополнительных компонент выбрать <guimenuitem>network-console: Continue installation remotely using SSH</guimenuitem>. При успешной загрузке в меню появится новый пункт <guimenuitem>Продолжение установки через SSH</guimenuitem>.

source: For installations on &arch-title;, this is the default method after setting up the network.
ru: Для установки на &arch-title;, данный метод является методом по умолчанию после настройки сети.

source: <phrase arch="not-s390">After selecting this new entry, you</phrase> <phrase arch="s390">You</phrase> will be asked for a new password to be used for connecting to the installation system and for its confirmation. That's all. Now you should see a screen which instructs you to login remotely as the user <emphasis>installer</emphasis> with the password you just provided. Another important detail to notice on this screen is the fingerprint of this system. You need to transfer the fingerprint securely to the <quote>person who will continue the installation remotely</quote>.
ru: Далее <phrase arch="not-s390">после выбора данного пункта, </phrase> <phrase arch="s390">вас</phrase> попросят ввести новый пароль для подключения к устанавливаемой системе. Для проверки нужно будет ввести его ещё раз.Это всё. Теперь вы должны увидеть инструкции по удалённому подключению в качестве пользователя <emphasis>installer</emphasis> с только что введённым паролем. Также здесь будет показан идентификатор (fingerprint) системы. Вам нужно передать этот идентификатор безопасным образом <quote>человеку, который будет продолжать установку удалённо</quote>.

source: Should you decide to continue with the installation locally, you can always press &enterkey;, which will bring you back to the main menu, where you can select another component.
ru: Если вы решите продолжить установку локально, то всегда можете нажать клавишу &enterkey; и вернуться обратно в меню чтобы выбрать другую компоненту.

source: Now let's switch to the other side of the wire. As a prerequisite, you need to configure your terminal for UTF-8 encoding, because that is what the installation system uses. If you do not, remote installation will be still possible, but you may encounter strange display artefacts like destroyed dialog borders or unreadable non-ascii characters. Establishing a connection with the installation system is as simple as typing: <informalexample><screen> <prompt>$</prompt> <userinput>ssh -l installer <replaceable>install_host</replaceable></userinput> </screen></informalexample> Where <replaceable>install_host</replaceable> is either the name or IP address of the computer being installed. Before the actual login the fingerprint of the remote system will be displayed and you will have to confirm that it is correct.
ru: Теперь давайте перейдём на другую сторону соединения. Здесь вам потребуется настроить терминал для работы с кодировкой UTF-8, потомучто её использует устанавливаемая система. Если вы не можете этого сделать, удалённая установка всё ещё возможна, но в этом случае вы будете наблюдать на экране странные закорючки вместо границ окон и не-ascii символов. Чтобы установить соединение с удалённой системой просто наберите: <informalexample><screen> <prompt>$</prompt> <userinput>ssh -l installer <replaceable>install_host</replaceable></userinput> </screen></informalexample> где <replaceable>install_host</replaceable> это имя или IP адрес компьютера с запущенной программой установки. Перед приглашением в систему будет показан идентификатор машины (fingerprint), чтобы вы смогли убедиться, что это именно тот компьютер.

source: If you install several computers in turn and they happen to have the same IP address or hostname, <command>ssh</command> will refuse to connect to such host. The reason is that it will have different fingerprint, which is usually a sign of a spoofing attack. If you are sure this is not the case, you will need to delete the relevant line from <filename>~/.ssh/known_hosts</filename> and try again.
ru: Если вы производите установку на несколько компьютеров последовательно и так получилось, что они имеют одинаковый IP адрес или имя, то <command>ssh</command> не будет подключаться к таким машинам. Причина в том, что они имеют разные идентификаторы, что обычно указывает на спуфинг атаку. Если вы уверены, что это не так, то вам нужно удалить соответствующую строку из <filename>~/.ssh/known_hosts</filename> и попробовать подключиться ещё раз.

source: After you have started the installation remotely over SSH, you should not go back to the installation session running on the local console. Doing so may corrupt the database that holds the configuration of the new system. This in turn may result in a failed installation or problems with the installed system.
ru: После запуска установки через SSH, вы не должны возвращаться к установке с консоли, так как это может привести к порче базы данных, которая содержит настройки новой системы. Это, в свую очередь, может привести к неудачному завершению установки или проблемам в установленной системой.

source: Also, if you are running the SSH session from an X terminal, you should not resize the window as that will result in the connection being terminated.
ru: Также, если SSH сессия запускается из X терминала, вы не должны изменять размеры окна, так как это приведёт к разрыву соединения.

source: Running <command>base-config</command> From Within &d-i;
ru: Запуск <command>base-config</command> из &d-i;
zh_tw: 在 &d-i; 下執行 <command>base-config</command>

source: It is possible to configure the base system within the first stage installer (before rebooting from the hard drive), by running <command>base-config</command> in a <firstterm>chroot</firstterm> environment. This is mainly useful for testing the installer and should normally be avoided.
ru: Можно настроить базовую систему на первой стадии программы установки (перед перезагрузкой с жёсткого диска), запустив <command>base-config</command> в <firstterm>chroot</firstterm> среде. В основном, это полезно при отладке программы установки и большинству людей не нужно так делать.
