Repository: xobs/debian-installer
Catalog: doc/manual/po/*/using-d-i.po
Languages: ru, zh_tw

source: RAID5 has similar setup procedure as RAID1 with the exception that you need to use at least <emphasis>three</emphasis> active partitions.
ru: Создание RAID5 напоминает процедуру RAID1 за исключением того, что вам нужно использовать как минимум <emphasis>три</emphasis> активных раздела.
zh_tw: RAID5 的設定過程類似於 RAID1，只是您至少需要<emphasis>三個</emphasis>活動分區。

source: It is perfectly possible to have several types of MD at once. For example if you have three 200 GB hard drives dedicated to MD, each containing two 100 GB partitions, you can combine first partitions on all three disk into the RAID0 (fast 300 GB video editing partition) and use the other three partitions (2 active and 1 spare) for RAID1 (quite reliable 100 GB partition for <filename>/home</filename>).
ru: Может быть создано несколько типов MD одновременно. Например, если вы имеете три 200ГБ жёстких диска выделенных под MD, каждый из которых разбит на два 100ГБ раздела, можно объединить первые разделы трёх дисков в RAID0 (быстрый 300ГБ раздел для редактирования видео) и использовать оставшиеся три раздела (2 активных и 1 запасной) для RAID1 (вполне надёжный 100ГБ раздел для <filename>/home</filename>).
zh_tw: 完美的解決方案或許是同時使用不同的 MD 類型。例如，您有三個 200 GB 的硬碟打算用於 MD，每個硬碟含有兩個 100 GB 的分割區，您可以將三塊硬碟上的第一組分割區組成 RAID0 (高速的視頻編輯分割區)，其餘的三個分割區 (兩個活動一個備用) 用於 RAID1 (相當可靠的 100 GB 分割區用於 <filename>/home</filename>)。

source: After you setup MD devices to your liking, you can <guimenuitem>Finish</guimenuitem> <command>mdcfg</command> to return back to the <command>partman</command> to create filesystems on your new MD devices and assign them the usual attributes like mountpoints.
ru: После настройки MD устройств в соответствии с вашими желаниями, вы можете выбрать <guimenuitem>Закончить</guimenuitem> <command>mdcfg</command> и вернуться в <command>partman</command>, чтобы создать файловые системы на новых MD устройствах и назначить им обычные атрибуты типа точек монтирования.
zh_tw: 按您的需要設定 MD 設備之後，您可以 <guimenuitem>結束</guimenuitem> <command>mdcfg</command> 返回到 <command>partman</command> 去建立 MD 設備的檔案系統並分配掛載點。

source: Installing the Base System
ru: Установка базовой системы
zh_tw: 安裝基本系統

source: Although this stage is the least problematic, it consumes most time of the install because it downloads, verifies and unpacks the whole base system. If you have a slow computer or network connection, this could take some time.
ru: Хотя эта стадия наименее проблематична, она занимает наибольшую часть времени установки, потому что загружается, проверяется и распаковывается вся базовая система. Если у вас медленный компьютер или сетевое соединение, это может занять какое-то время.
zh_tw: 儘管這一階段少有問題，但卻需要大量時間用於整個基本系統的下載、檢驗和解開套件。如果您用較慢的電腦或網路連接，這要花費好一會兒時間。

source: Base System Installation
ru: Установка базовой системы
zh_tw: 基本系統安裝

source: During the Base installation, package unpacking and setup messages are redirected to <userinput>tty3</userinput>. You can access this terminal by pressing <keycombo><keycap>Left Alt</keycap><keycap>F3</keycap></keycombo>; get back to the main installer process with <keycombo><keycap>Left Alt</keycap><keycap>F1</keycap></keycombo>.
ru: Во время установки базовой системы, происходит распаковка пакетов, а сообщения о настройке переправляются на <userinput>tty3</userinput>. Вы можете перейти на этот терминал, нажав <keycombo><keycap>левый Alt</keycap><keycap>F3</keycap></keycombo>; чтобы вернуться обратно в основной процесс установки нажмите <keycombo><keycap>левый Alt</keycap><keycap>F1</keycap></keycombo>.
zh_tw: 在基本系統安裝期間，解開軟體套件和安裝的資訊被重新導向到 <userinput>tty3</userinput>。您可以透過按下 <keycombo><keycap>左 Alt</keycap><keycap>F3</keycap></keycombo> 來切換到該終端畫面﹔返回主安裝進程使用 <keycombo><keycap>左 Alt</keycap><keycap>F1</keycap></keycombo>。

source: The unpack/setup messages generated by the base installation are saved in <filename>/var/log/messages</filename> when the installation is performed over a serial console.
ru: Если установка выполняется через консоль на последовательном порту, то сообщения распаковки/настройки, создаваемые базовой установкой сохраняются в файле <filename>/var/log/messages</filename>.
zh_tw: 當安裝程式透過序列埠控制台執行時，基本到建的解開套件/安裝訊息儲存在 <filename>/var/log/messages</filename>。

source: As part of the installation, a Linux kernel will be installed. At the default priority, the installer will choose one for you that best matches your hardware. In lower priority modes, you will be able to choose from a list of available kernels.
ru: Ядро Linux будет установлено как один из пакетов. С приоритетом по умолчанию программа установки выберет ядро наиболее подходящее для вашего оборудования. В режимах с низким приоритетом, это предложат сделать вам из списка доступных ядер.
zh_tw: 作為安裝的一部分，Linux 核心也會被安裝。在預設的優先等級下，安裝程式會選擇一個與您硬體最匹配的核心。在較低的優先級下，您可以從列表中選擇一個有效的核心。

source: Making Your System Bootable
ru: Установка и настройка системного загрузчика
zh_tw: 使系統可開機

source: If you are installing a diskless workstation, obviously, booting off the local disk isn't a meaningful option, and this step will be skipped. <phrase arch="sparc">You may wish to set the OpenBoot to boot from the network by default; see <xref linkend="boot-dev-select-sun"/>.</phrase>
ru: Если вы устанавливаете бездисковую рабочую станцию, очевидно, что загрузка с локального диска не нужна, и этот шаг можно пропустить. <phrase arch="sparc">Возможно, вы захотите настроить OpenBoot на загрузку из сети по умолчанию; смотрите <xref linkend="boot-dev-select-sun"/>.</phrase>
zh_tw: 如果您是安裝無磁碟工作站，從本機啟動顯然是沒有意義的選項，這一步可以跳過。<phrase arch="sparc">您也許希望預設 OpenBoot 為網路啟動﹔請參閱 <xref linkend="boot-dev-select-sun"/>。</phrase>

source: Note that multiple operating systems booting on a single machine is still something of a black art. This document does not even attempt to document the various boot managers, which vary by architecture and even by subarchitecture. You should see your boot manager's documentation for more information.
ru: Надо заметить, что загрузка множества операционных систем на одной машине всё ещё напоминает чёрную магию. В этом документе даже не делается попытка описать всё разнообразие менеджеров загрузки, которые различны на разных архитектурах и даже субархитектурах. Более подробную информацию можно найти в документации по менеджеру загрузки.
zh_tw: 注意，從單機上啟動多個作業系統仍然是種魔術。本文件無意描寫各種 boot-loader， 它們會依硬體架構甚至是子架構而變化。您應該參考 boot-loader 的文件以瞭解更多資訊。

source: Detecting other operating systems
ru: Обнаружение операционных систем
zh_tw: 偵測其他的作業系統

source: Before a boot loader is installed, the installer will attempt to probe for other operating systems which are installed on the machine. If it finds a supported operating system, you will be informed of this during the boot loader installation step, and the computer will be configured to boot this other operating system in addition to Debian.
ru: Перед установкой системного загрузчика программа установки попытается обнаружить другие операционные системы, установленные на машине. Если она обнаружит поддерживаемую операционную систему, то это будет отражено на этапе установки системного загрузчика, и компьютер сможет загружать эту операционную систему в дополнении к Debian.
zh_tw: 在啟動開機器安裝之前，安裝程式會試著偵測已經安裝到電腦上的其他作業系統。如果它找到支援的作業系統，您將在啟動開機器安裝步驟裡得到提示，與 Debian 一起，電腦也將設定為可以啟動其他作業系統。

source: Note that multiple operating systems booting on a single machine is still something of a black art. The automatic support for detecting and setting up boot loaders to boot other operating systems varies by architecture and even by subarchitecture. If it does not work you should consult your boot manager's documentation for more information.
ru: Надо заметить, что загрузка множества операционных систем на одной машине всё ещё напоминает чёрную магию. Автоматическая поддержка обнаружения и настройки системных загрузчиков на загрузку различных операционных систем различается на разных архитектурах и даже субархитектурах. Более подробную информацию можно найти в документации по менеджеру загрузки.
zh_tw: 注意，從單機上啟動多個作業系統仍然是種魔術。自動偵測和設定 boot-loader 啟動其他作業系統的功能會依硬體架構甚至是子架構而不同。如果它不能運作，您應該參考 boot-loader 的文件以瞭解更多資訊。

source: The installer may fail to detect other operating systems if the partitions on which they reside are mounted when the detection takes place. This may occur if you select a mountpoint (e.g. /win) for a partition containing another operating system in <command>partman</command>, or if you have mounted partitions manually from a console.
ru: Программа установки может не обнаружить операционные системы, если разделы на которых они расположены, смонтированы до процедуры обнаружения. Такое может произойти, если в <command>partman</command> вы выбрали точку монтирования (например /win) для раздела с другой операционной системой, или если вы смонтировали разделы вручную из консоли.
zh_tw: 安裝程式偵測作業系統的時候，如果分割區已經掛載，偵測可能會失敗。這可能是由於您使用 <command>partman</command> 選擇的掛載點 (如 /win) 包含其他作業系統，或者透過控制台手動掛載一個分割區。

source: Install <command>aboot</command> on a Hard Disk
ru: Установка <command>aboot</command> на жёсткий диск
zh_tw: 安裝 <command>aboot</command> 到硬碟上

source: If you have booted from SRM, if you select this option, the installer will write <command>aboot</command> to the first sector of the disk on which you installed Debian. Be <emphasis>very</emphasis> careful &mdash; it is <emphasis>not</emphasis> possible to boot multiple operating systems (e.g. GNU/Linux, Free/Open/NetBSD, OSF/1 a.k.a. Digital Unix a.k.a. Tru64 Unix, or OpenVMS) from the same disk. If you also have a different operating system installed on the disk where you have installed Debian, you will have to boot GNU/Linux from a floppy instead.
ru: Если вы загружаетесь из SRM и выберете этот параметр, то программа установки запишет <command>aboot</command> в первый сектор жёсткого диска на котором установлен Debian. Будьте <emphasis>предельно</emphasis> осторожны &mdash; это <emphasis>сделает невозможным</emphasis> загрузку нескольких операционных систем (например, GNU/Linux, Free/Open/NetBSD, OSF/1 также называемый как Digital Unix или Tru64 Unix, или OpenVMS) с того же диска. Если у вас уже есть другие операционные системы на том же диске где установлен Debian, то используйте загрузку GNU/Linux с дискеты.
zh_tw: 如果您從 SRM 啟動，如果您選取該項，安裝程式將寫入 <command>aboot</command> 到您安裝 Debian 磁碟的第一個磁區。要<emphasis>特別</emphasis>小心 &mdash; 它也許<emphasis>不能</emphasis>從同一個磁碟上啟動多個作業系統 (如，GNU/Linux，Free/Open/NetBSD，OSF/1 又名 Digital Unix 又名 Tru64 Unix，或 OpenVMS)。如果您在安裝 Debian 的磁碟上裝有不同的作業系統，您將不得不從軟碟啟動 GNU/Linux。

source: <command>palo</command>-installer
ru: Системный загрузчик <command>palo</command>

source: The bootloader on PA-RISC is <quote>palo</quote>. <command>PALO</command> is similar in configuration and usage to <command>LILO</command>, with a few exceptions. First of all, <command>PALO</command> allows you to boot any kernel image on your boot partition. This is because <command>PALO</command> can actually read Linux partitions.
ru: Системный загрузчик на PA-RISC называется <quote>palo</quote>. <command>PALO</command> по настройке и использованию, за несколькими исключениями, похож на <command>LILO</command>. Прежде всего, <command>PALO</command> позволяет загружать любой образ ядра с загрузочного раздела. То есть <command>PALO</command> умеет работать с разделами Linux.
zh_tw: PA-RISC 上的 boot-loader 是 <quote>palo</quote>。 <command>PALO</command> 的設定用法類似 <command>LILO</command>，只有一些地方不同。首先， <command>PALO</command> 允許您從開機分割區啟動任何核心映像。這是因為 <command>PALO</command> 能真正地讀 Linux 分割區。

source: hppa FIXME ( need more info )
ru: hppa FIXME (нужно больше информации)

source: Install the <command>Grub</command> Boot Loader on a Hard Disk
ru: Установка системного загрузчика <command>Grub</command> на жёсткий диск
zh_tw: 安裝 <command>Grub</command> Boot Loader 到硬碟上

source: The main &architecture; boot loader is called <quote>grub</quote>. Grub is a flexible and robust boot loader and a good default choice for newbies and old hands alike.
ru: Основной системный загрузчик для &architecture; называется <quote>grub</quote>. Grub &mdash; гибкий и понятный системный загрузчик и является хорошим выбором по умолчанию для новичков и опытных пользователей.
zh_tw: &architecture; 上主要的 boot-loader 是 <quote>grub</quote>。Grub 是個靈活和穩定的 boot-loader，它對新手來說是個不錯的預設選擇。對老鳥來說，它也同樣適合。

source: By default, grub will be installed into the Master Boot Record (MBR), where it will take over complete control of the boot process. If you prefer, you can install it elsewhere. See the grub manual for complete information.
ru: По умолчанию, grub будет установлен в главную загрузочную запись (MBR), где будет полностью контролировать процесс загрузки. Если хотите, можете установить его в другое место. Полную информацию смотрите в руководстве по grub.
zh_tw: 預設狀況下，grub 會被裝在主開機區 (MBR)。如果裝在那裡的話，它將會完全控制啟動的整個過程。如果您喜歡的話，您可以把 grub 裝在其他地方。若要全面和完整的資訊，請參閱 grub 的手冊。

source: If you do not want to install grub at all, use the Back button to get to the main menu, and from there select whatever bootloader you would like to use.
ru: Если вы не хотите устанавливать grub, нажмите кнопку Назад, чтобы перейти в главное меню, и там выберите системный загрузчик, который вы хотите использовать.
zh_tw: 預設況下，grub 會被裝在主開機區 (MBR)。如果裝在那裡的話，它將會完全控制啟動的整個過程。如果您喜歡的話，您可以把 grub 裝在其他地方。若要全面和完整的資訊，請參閱 grub 的手冊。

source: Install the <command>LILO</command> Boot Loader on a Hard Disk
ru: Установка системного загрузчика <command>LILO</command> на жёсткий диск
zh_tw: 安裝 <command>LILO</command> Boot Loader 到硬碟上

source: The second &architecture; boot loader is called <quote>LILO</quote>. It is an old complex program which offers lots of functionality, including DOS, Windows, and OS/2 boot management. Please carefully read the instructions in the directory <filename>/usr/share/doc/lilo/</filename> if you have special needs; also see the <ulink url="&url-lilo-howto;">LILO mini-HOWTO</ulink>.
ru: Второй системный загрузчик для &architecture; называется <quote>LILO</quote>. Это старая сложная программа с множеством функций, включая управление загрузкой DOS, Windows и OS/2. Внимательно прочитайте инструкции из каталога <filename>/usr/share/doc/lilo/</filename>, если вам нужны эти функции; также посмотрите <ulink url="&url-lilo-howto;">LILO mini-HOWTO</ulink>.
zh_tw: 第二個 &architecture; boot-loader 名叫 <quote>LILO</quote>。它是個老派的強大程式，提供很多功能，包括對 DOS、Windows 以及 OS/2 的開機管理。如果有特別的要求的話，請您仔細閱讀 <filename>/usr/share/doc/lilo/</filename> 目錄裡的提示和教學，同時，您也可以參閱 <ulink url="&url-lilo-howto;">LILO mini-HOWTO</ulink>。

source: Currently the LILO installation will only create menu entries for other operating systems if these can be <firstterm>chainloaded</firstterm>. This means you may have to manually add a menu entry for operating systems like GNU/Linux and GNU/Hurd after the installation.
ru: В данный момент установка LILO только создаст пункты меню для других операционных систем, если они могут <firstterm>быть загружены по цепочке</firstterm>. Это значит, что вы сможете вручную добавить пункты меню для операционных систем, например GNU/Linux и GNU/Hurd после установки.
zh_tw: 目前 LILO 安裝時只能為那些可以 <firstterm>chainloaded</firstterm> 的作業系統建立選單項。就是說您不得不在安裝之後手動添加 GNU/Linux 和 GNU/Hurd 這類作業系統。

source: &d-i; presents you three choices where to install the <command>LILO</command> boot loader:
ru: &d-i; предлагает три места куда можно установить системный загрузчик <command>LILO</command>:
zh_tw: &d-i; 提供給您三種選擇來安裝 <command>LILO</command> boot-loader：

source: Master Boot Record (MBR)
ru: Главная загрузочная запись (MBR)
zh_tw: 主開機區 (MBR)

source: This way the <command>LILO</command> will take complete control of the boot process.
ru: Отсюда <command>LILO</command> будет полностью контролировать процесс загрузки.
zh_tw: 這種方式 <command>LILO</command> 將完全控制開機過程。

source: new Debian partition
ru: раздел, созданный для Debian
zh_tw: 新 Debian 分割區

source: Choose this if you want to use another boot manager. <command>LILO</command> will install itself at the beginning of the new Debian partition and it will serve as a secondary boot loader.
ru: Выберите это место, если хотите использовать другой менеджер загрузки. <command>LILO</command> будет установлен в начало раздела, созданного для Debian и будет играть роль вторичного системного загрузчика.
zh_tw: 如果您想使用其它 boot-loader，選擇此方式。<command>LILO</command> 將安裝到新 Debian 分割區的起始位置，並能作為第二 boot loader。

source: Other choice
ru: Другой
zh_tw: 其它選擇

source: Useful for advanced users who want to install <command>LILO</command> somewhere else. In this case you will be asked for desired location. You can use devfs style names, such as those that start with <filename>/dev/ide</filename>, <filename>/dev/scsi</filename>, and <filename>/dev/discs</filename>, as well as traditional names, such as <filename>/dev/hda</filename> or <filename>/dev/sda</filename>.
ru: Полезен для опытных пользователей, которые хотят установить <command>LILO</command> куда-то ещё. Вас попросят указать желаемое размещение. Вы можете использовать имена в стиле devfs, то есть те, которые начинаются с <filename>/dev/ide</filename>, <filename>/dev/scsi</filename> и <filename>/dev/discs</filename>, а также традиционные имена, <filename>/dev/hda</filename> или <filename>/dev/sda</filename>.
zh_tw: 這對於想把 <command>LILO</command> 安裝到其它地方的進階使用者很有用。這種方式下，會詢問您希望的安裝位置。您可以採用 devfs 風格的名稱，例如起始是 <filename>/dev/ide</filename>，<filename>/dev/scsi</filename>，和 <filename>/dev/discs</filename>，還可以用傳統的名稱，如 <filename>/dev/hda</filename> 或 <filename>/dev/sda</filename>。

source: If you can no longer boot into Windows 9x (or DOS) after this step, you'll need to use a Windows 9x (MS-DOS) boot disk and use the <userinput>fdisk /mbr</userinput> command to reinstall the MS-DOS master boot record &mdash; however, this means that you'll need to use some other way to get back into Debian! For more information on this please read <xref linkend="reactivating-win"/>.
ru: Если вы не смогли загрузить Windows 9x (или DOS) после этого шага, то вам нужно воспользоваться загрузочной дискетой с Windows 9x (MS-DOS) и запустить команду <userinput>fdisk /mbr</userinput> для переустановки всей главной загрузочной записи MS-DOS &mdash; однако, это означает, что вам придётся искать какой-то другой способ чтобы попасть обратно в Debian! Более подробно читайте в <xref linkend="reactivating-win"/>.
zh_tw: 如果您在此步之後無法啟動 Windows 9x (或 DOS)，您需要使用 Windows 9x (MS-DOS) 開機磁片，並用 <userinput>fdisk /mbr</userinput> 指令重新安裝 MS-DOS 開機檔案 &mdash; 但這也意味著您要使用其他方式才能啟動 Debian！更多相關資訊請參閱 <xref linkend="reactivating-win"/>。

source: Install the <command>ELILO</command> Boot Loader on a Hard Disk
ru: Установка системного загрузчика <command>ELILO</command> на жёсткий диск
zh_tw: 安裝 <command>ELILO</command> Boot Loader 到硬碟

source: The &architecture; boot loader is called <quote>elilo</quote>. It is modeled on the <quote>lilo</quote> boot loader for the x86 architecture and uses a similar configuration file. However, instead of writing an MBR or partition boot record to the disk, it copies the necessary files to a separate FAT formatted disk partition and modifies the <guimenuitem>EFI Boot Manager</guimenuitem> menu in the firmware to point to the files in the EFI partition. The <command>elilo</command> boot loader is really in two parts. The <filename>/usr/sbin/elilo</filename> command manages the partition and copies file into it. The <filename>elilo.efi</filename> program is copied into the EFI partition and then run by the <quote>EFI Boot Manager</quote> to actually do the work of loading and starting the Linux kernel.
ru: Для архитектуры &architecture; системный загрузчик называется <quote>elilo</quote>. Он сделан по образу системного загрузчика <quote>lilo</quote> для архитектуры x86 и использует похожий конфигурационный файл. Однако, вместо установки в MBR или загрузочную запись раздела, необходимые файлы копируются в отдельный дисковый раздел с файловой системой FAT и модифицируется меню <guimenuitem>EFI Boot Manager</guimenuitem> в микропрограмме, указывая на файлы в разделе EFI. Системный загрузчик <command>elilo</command> состоит из двух частей. Команда <filename>/usr/sbin/elilo</filename> управляет разделом и копирует на него файлы. Программа <filename>elilo.efi</filename> копируется в раздел EFI и затем запускается <quote>менеджером загрузки EFI</quote>, чтобы загрузить и выполнить ядро Linux.
zh_tw: &architecture; boot loader 稱為 <quote>elilo</quote>。 它模仿 x86 架構上的 <quote>lilo</quote> boot loader 並使用類似的設定檔。然而，不同於寫入 MBR 或分區開機記錄到磁碟，它將必要的檔案複製到單獨的 FAT 格式磁碟分割區，並修改 <guimenuitem>EFI Boot Manager</guimenuitem> 韌體裡的選單指向 EFI 分割區的檔案。<command>elilo</command> boot loader 實際上有兩個部分。<filename>/usr/sbin/elilo</filename> 指令用來管理分割區和複製檔案。<filename>elilo.efi</filename> 程式被複製到 EFI 分割區，然後被 <quote>EFI Boot Manager</quote> 執行以掛載和啟動 Linux 核心。

source: The <quote>elilo</quote> configuration and installation is done as the last step of installing the packages of the base installation. &d-i; will present you with a list of potential disk partitions that it has found suitable for an EFI partition. Select the partition you set up earlier in the installation, typically a partition on the same disk that contains your <emphasis>root</emphasis> filesystem.
ru: Настройка и установка <quote>elilo</quote> завершится на последнем шаге установки базовых пакетов. &d-i; предложит вам список дисковых разделов, которые он сочтёт подходящими для раздела EFI. Выберите раздел, который вы создали программой установки ранее; обычно этот раздел находится на том же диске что и <emphasis>корневая</emphasis> файловая система.
zh_tw: <quote>elilo</quote> 設定與安裝在基本系統安裝軟體套件的最後一步完成。&d-i; 會列出適合 EFI 分割區的磁碟分割區列表。選擇您安裝前期設定的分割區，典型的分割區是與 <emphasis>root</emphasis> 檔案系統相同的磁碟。

source: Choose the correct partition!
ru: Выберите правильный раздел!
zh_tw: 選擇正確的分割區！

source: The criteria for selecting a partition is that it is FAT format filesystem with its <emphasis>boot</emphasis> flag set. &d-i; may show multiple choices depending on what it finds from scanning all of the disks of the system including EFI partitions of other system disks and EFI diagnostic partitions. Remember, the <command>elilo</command> may format the partition during the installation, erasing any previous contents!
ru: Критерии выбора раздела: должен иметь файловую систему FAT и установленный флаг <emphasis>boot</emphasis>. &d-i; может показать несколько вариантов, в зависимости от того, что найдётся при сканировании всех дисков системы, включая разделы EFI других системных дисков и разделов диагностики EFI. Помните, <command>elilo</command> может отформатировать раздел во время установки, стерев его содержимое!
zh_tw: 選擇分割區的準則是格式化為 FAT 的檔案系統並有 <emphasis>boot</emphasis> 旗標。&d-i; 可能會顯示多個選擇，這取決於所有磁碟上被掃瞄到的分割區，包含 EFI 分割區和 EFI 診斷分割區。切記，<command>elilo</command> 可能會在安裝時格式化分割區，這將清除以前的所有內容！

source: EFI Partition Contents
ru: Содержимое EFI раздела
zh_tw: EFI 分割區內容
