Repository: xobs/debian-installer
Catalog: doc/manual/po/*/using-d-i.po
Languages: ru, zh_tw

source: To avoid the described situation you can use Logical Volume Manager (LVM). Simply said, with LVM you can combine your partitions (<firstterm>physical volumes</firstterm> in LVM lingo) to form a virtual disc (so called <firstterm>volume group</firstterm>), which can then be divided into virtual partitions (<firstterm>logical volumes</firstterm>). The point is that logical volumes (and of course underlying volume groups) can span across several physical discs.
ru: Чтобы избежать описанной ситуации вы можете воспользоваться менеджером логических томов (LVM). Проще говоря, с помощью LVM вы можете объединить разделы (<firstterm>физические тома</firstterm> в терминах LVM) в виртуальный диск (так называемую <firstterm>группу томов</firstterm>), который затем можно поделить на виртуальные разделы (<firstterm>логические тома</firstterm>). Выгода в том, что логические тома (и, конечно, содержащие их группы томов) можно распределить по нескольким физическим дискам.
zh_tw: 為了避免上面描述的情況，您可以採用邏輯容量管理(LVM)。簡而言之，使用 LVM 您可以組合您的分割區 (<firstterm>物理容量(physical volumes)</firstterm>，LVM 術語) 形成一個虛擬磁碟( 稱為 <firstterm>容量群組</firstterm>)，它可以被分割成虛擬分割區 (<firstterm>邏輯容量</firstterm>)。邏輯容量 (當然下面是容量群組) 的優點在於它可以跨越多個物理磁碟。

source: Now when you realize you need more space for your old 160GB <filename>/home</filename> partition, you can simply add a new 300GB disc to the computer, join it with your existing volume group and then resize the logical volume which holds your <filename>/home</filename> filesystem and voila &mdash; your users have some room again on their renewed 460GB partition. This example is of course a bit oversimplified. If you haven't read it yet, you should consult the <ulink url="&url-lvm-howto;">LVM HOWTO</ulink>.
ru: Теперь, когда вы поняли, что вам нужно ещё место на имеющемся 160ГБ <filename>/home</filename> разделе, вы можете просто добавить новый 300ГБ диск в компьютер, объединить его с существующей группой томов и затем изменить размер логического тома, который содержит файловую систему с <filename>/home</filename> и вуаля, ваши пользователи имеют дополнительное место на новом 460ГБ разделе. Этот пример, конечно, сильно упрощён. Дополнительную информацию вы найдёте в <ulink url="&url-lvm-howto;">LVM HOWTO</ulink>.
zh_tw: 當您發現您需要給更多的空間給已有的 160 GB <filename>/home</filename> 分割區時，您只需加裝一個新的 300GB 磁碟到電腦，加入已經存在的容量組，然後為<filename>/home</filename> 分割區的邏輯容量重新設置大小，然後 voila &mdash; 您的使用者在更新的 460GB 分割區上又有了更多可用空間。這個例子當然有點簡單。如果您還沒有讀過，您應該查閱 <ulink url="&url-lvm-howto;">LVM HOWTO</ulink>。

source: LVM setup in &d-i; is quite simple. At first, you have to mark your partitions to be used as physical volumes for LVM. (This is done in <command>partman</command> in the <guimenu>Partition settings</guimenu> menu where you should select <menuchoice> <guimenu>Use as:</guimenu> <guimenuitem>physical volume for LVM</guimenuitem> </menuchoice>.) Then start the <command>lvmcfg</command> module (either directly from <command>partman</command> or from the &d-i;'s main menu) and combine physical volumes to volume group(s) under the <guimenuitem>Modify volume groups (VG)</guimenuitem> menu. After that, you should create logical volumes on the top of volume groups from the menu <guimenuitem>Modify logical volumes (LV)</guimenuitem>.
ru: Настройка LVM в &d-i; очень проста. Во-первых, вы помечаете разделы, которые будут использоваться как физические тома для LVM. (Это выполняется с помощью <command>partman</command> в меню <guimenu>Настройка разделов</guimenu>, где вы должны выбрать <menuchoice> <guimenu>Использовать как: </guimenu> <guimenuitem>физический том для LVM</guimenuitem> </menuchoice>.) Затем, запустите модуль <command>lvmcfg</command> (прямо из <command>partman</command> или из главного меню &d-i;) и объедините физические тома в группу томов в меню <guimenuitem>Изменение группы томов (VG)</guimenuitem>. После этого, вы должны создать логические тома в верхней группе томов из меню <guimenuitem>Изменение логических томов (LV)</guimenuitem>.
zh_tw: 在 &d-i; 裡面設置 LVM 很簡單。首先，您必須為 LVM 標記您的分割區為物理容量。(這由 <command>partman</command> 在 <guimenu>分割區設定：</guimenu>選單完成，那裡您應該選擇 <menuchoice> <guimenu>用途：</guimenu> <guimenuitem>LVM 的物理容量</guimenuitem> </menuchoice>。)接著啟動 <command>lvmcfg</command> 模組 (可以直接從 <command>partman</command> 或從 &d-i; 的主選單啟動) 然後組合物理容量到容量群組，它位於<guimenuitem>修改容量群組 (VG) </guimenuitem>選單。之後，您應該為容量群組建立邏輯容量，這是從選單 <guimenuitem>修改邏輯容量 (LV) </guimenuitem>。

source: There is no widely accepted standard to identify partitions containing LVM data on Apple Power Macintosh hardware. On this particular hardware, the above procedure for creating physical volumes and volume groups will not work. There is a good workaround for this limitation, provided you are familiar with the underlying LVM tools.
ru: На машинах Apple Power Macintosh не существует широко распространённого стандарта для определения разделов, содержащих данные LVM. Для них не сработает процедура создания физических томов и групп томов приведённая выше. В данном случае вы можете решить проблему, если только хорошо знакомы с утилитами LVM.
zh_tw: 在 Apple Power Macintosh 硬體上，還沒有一個被廣為接受的標準以存放 LVM 資料到分割區上。在這種硬體上，將不能執行以上建立物理容量和容量群組的步驟。假如您熟悉底層的 LVM 工具，有一種突破這種限制的方法。

source: To install using logical volumes on Power Macintosh hardware you should create all the disk partitions for your logical volumes as usual. In the <guimenu>Partition settings</guimenu> menu you should choose <menuchoice><guimenu>Use as:</guimenu> <guimenuitem>Do Not Use</guimenuitem></menuchoice> for these partitions (you will not be offered the option to use the partition as a physical volume). When you are done with creating all your partitions, you should start the logical volume manager as usual. However, since no physical volumes have been created you must now access the command shell available on the second virtual terminal (see <xref linkend="shell"/>) and create them manually.
ru: Для установки с логическими томами на машины Power Macintosh, сначала вы должны создать все дисковые разделы для логических томов как обычно. В меню <guimenu>Partition settings</guimenu> для этих разделов выберите <menuchoice><guimenu>Use as:</guimenu> <guimenuitem>Do Not Use</guimenuitem></menuchoice> (чтобы вам не предлагали использовать раздел как физический том). После завершения создания нужных разделов, запустите менеджер логических томов.Однако, так как физические тома ещё не созданы, вы должны переключиться на вторую виртуальную консоль (смотрите <xref linkend="shell"/>) и создать их вручную из командной строки.
zh_tw: 為了在 Power Macintosh 硬體上安裝使用邏輯容量，您應該按通常方式建立所有的磁碟分區。在 <guimenu>分割區設定：</guimenu>選單裡，您應該選擇 <menuchoice><guimenu>用途：</guimenu> <guimenuitem>不使用</guimenuitem></menuchoice>對那些分割區 (您將不會被要求使用這些分割區作為物理容量)。當您建立完所有的分割區，您可以正常啟動邏輯容量管理員。然而，因為沒有建立物理容量，您現在必須透過第二虛擬終端機打開命令介殼 (參閱 <xref linkend="shell"/>) 並且手動建立它們。

source: Use the <command>pvcreate</command> command at the shell command prompt to create a physical volume on each of your chosen partitions. Then use the <command>vgcreate</command> command to create each volume group you want. You can safely ignore any errors about incorrect metadata area header checksums and fsync failures while doing this. When you have finished creating all your volume groups, you should go back to the first virtual terminal and skip directly to the <command>lvmcfg</command> menu items for logical volume management. You will see your volume groups and you can create the logical volumes you need as usual.
ru: Воспользуйтесь командой <command>pvcreate</command> из командной строки для создания физического тома на каждый из выбранных разделов. Затем выполните команду <command>vgcreate</command>, чтобы создатьгруппу томов. Во время этого процесса вы можете спокойно игнорировать ошибки о неправильной контрольной сумме области заголовка метаданных и ошибки fsync. После создания всех групп томов, вы должны вернуться обратно на первый виртуальный терминал и перейти к элементам меню <command>lvmcfg</command> менеджера логических томов. Теперь вы должны увидеть группы томов и можете создавать нужные логические тома обычным образом.
zh_tw: 在命令列提示符號下使用 <command>pvcreate</command> 指令為您選擇的分割區建立物理容量。然後使用 <command>vgcreate</command> 指令建立您需要的容量群組。在此過程中，您可以安全地忽略有關 incorrect metadata area header checksums 和 fsync failures 這些錯誤資訊。當您建立完所有的容量群組，您可以返回到第一虛擬終端，然後直接跳到 <command>lvmcfg</command> 邏輯容量管理選單項。您將看到容量群組，並可以像平常那樣建立邏輯容量。

source: After returning from <command>lvmcfg</command> back to <command>partman</command>, you will see any created logical volumes in the same way as ordinary partitions (and you should treat them like that).
ru: После возвращения из <command>lvmcfg</command> в <command>partman</command>, вы должны увидеть все созданные логические тома, как обычные разделы (и настраиваются они одинаково).
zh_tw: 從 <command>lvmcfg</command> 返回 <command>partman</command>之後，您可以看到與其他普通分割區一樣的新建的邏輯容量 (您也應該這樣看待它們)。

source: Configuring Multidisk Device (Software RAID)
ru: Настройка устройства Multidisk (программный RAID)
zh_tw: 配置多磁碟設備 (Software RAID)

source: If you have more than one harddrive<footnote><para> To be honest, you can construct MD device even from partitions residing on single physical drive, but that won't bring you anything useful. </para></footnote> in your computer, you can use <command>mdcfg</command> to setup your drives for increased performance and/or better reliability of your data. The result is called <firstterm>Multidisk Device</firstterm> (or after its most famous variant <firstterm>software RAID</firstterm>).
ru: Если у вас более одного жёсткого диска<footnote><para> Если честно, вы можете собрать MD устройство даже из обычных разделов, расположенных на одном физическом жёстком диске, но это не даст никакой выгоды. </para></footnote> в компьютере, то можно воспользоваться программой <command>mdcfg</command> для увеличения производительности дисков и/или повышения надёжности данных. В результате получается так называемое <firstterm>устройство Multidisk </firstterm> (или другое, более известное название, <firstterm>программный RAID</firstterm>).
zh_tw: 如果您有一個以上的硬碟 <footnote><para> 其實，您可以從不同硬碟上的不同分割區建立多磁碟(Multidisk, MD)設備，但這樣做不會給您帶來任何好處。</para></footnote> 安裝在您的電腦上，您可以用 <command>mdcfg</command> 配置硬碟以提升效能和 (或) 更好的資料可靠性。這種結果稱為 <firstterm>多磁碟設備</firstterm> (或者更有名的 <firstterm>software RAID</firstterm>)。

source: MD is basically a bunch of partitions located on different disks and combined together to form a <emphasis>logical</emphasis> device. This device can then be used like an ordinary partition (i.e. in <command>partman</command> you can format it, assign a mountpoint, etc.).
ru: Основу MD составляют группы разделов, расположенные на различных дисках и объединённые вместе в <emphasis>логическое</emphasis> устройство. Затем это устройство можно использовать как обычный раздел (то есть в <command>partman</command> вы можете отформатировать его, назначить ему точку монтирования и т.д.).
zh_tw: MD 本質上是一組位於部分磁碟上的分割區，組合在一起形成一個 <emphasis>邏輯</emphasis>設備。該設備可以像正常的分割區一樣使用 (例如可以用 <command>partman</command> 格式化，分配掛載點，等等)。

source: The benefit you gain depends on a type of a MD device you are creating. Currently supported are: <variablelist> <varlistentry> <term>RAID0</term><listitem><para> Is mainly aimed at performance. RAID0 splits all incoming data into <firstterm>stripes</firstterm> and distributes them equally over each disk in the array. This can increase the speed of read/write operations, but when one of the disks fails, you will loose <emphasis>everything</emphasis> (part of the information is still on the healthy disk(s), the other part <emphasis>was</emphasis> on the failed disk). </para><para> The typical use for RAID0 is a partition for video editing. </para></listitem> </varlistentry> <varlistentry> <term>RAID1</term><listitem><para> Is suitable for setups where reliability is the first concern. It consists of several (usually two) equally sized partitions where every partition contains exactly the same data. This essentially means three things. First, if one of your disks fails, you still have the data mirrored on the remaining disks. Second, you can use only a fraction of the available capacity (more precisely, it is the size of the smallest partition in the RAID). Third, file reads are load balanced among the disks, which can improve performance on a server, such as a file server, that tends to be loaded with more disk reads than writes. </para><para> Optionally you can have a spare disk in the array which will take the place of the failed disk in the case of failure. </para></listitem> </varlistentry> <varlistentry> <term>RAID5</term><listitem><para> Is a good compromise between speed, reliability and data redundancy. RAID5 splits all incomming data into stripes and distributes them equally on all but one disks (similar to RAID0). Unlike RAID0, RAID5 also computes <firstterm>parity</firstterm> information, which gets written on the remaining disk. The parity disk is not static (that would be called RAID4), but is changing periodically, so the parity information is distributed equally on all disks. When one of the disks fails, the missing part of information can be computed from remaining data and its parity. RAID5 must consist of at least three active partitions. Optionally you can have a spare disk in the array which will take the place of the failed disk in the case of failure. </para><para> As you can see, RAID5 has similar degree of reliability like RAID1 while achieving less redundancy. On the other hand it might be a bit slower on write operation than RAID0 due to computation of parity information. </para></listitem> </varlistentry> </variablelist> To sum it up:
ru: Получаемые преимущества зависят от типа создаваемого MD устройства. В данный момент поддерживаются: <variablelist> <varlistentry> <term>RAID0</term><listitem><para> Применяется где нужна производительность. RAID0 разбивает все входящие данные на <firstterm>полосы</firstterm> и распределяет их равномерно по дискам в массиве. Это может увеличить скорость операций чтения/записи, но если один из дисков сломается, вы потеряете <emphasis>всё</emphasis> (часть информации всё ещё на исправных дисках(е), другая часть <emphasis>хранилась</emphasis> на сломавшемся диске). </para> <para> Обычно, разделы RAID0 используют для редактирования видео. </para></listitem> </varlistentry> <varlistentry> <term>RAID1</term><listitem><para> Используется там, где надёжность превыше всего. Он состоит из нескольких (обычно двух) одинаковых по размеру разделов, и на каждом разделе храняться одинаковые данные. В сущности, это означает три вещи. Первое: если один из дисков сломается, вы не теряете данные, так как они продублированы на оставшихся дисках. Второе: вам доступна только часть имеющегося объёма (более точно, размер самого маленького раздела в RAID). Третье: нагрузка при чтении файла сбалансированно распределяется по всем дискам, что может повысить производительность, например файлового сервера, на котором операций чтения больше чем операций записи. </para><para> Также, вы можете иметь в массиве запасной диск, который включится в работу в случае неисправности одного из дисков. </para></listitem> </varlistentry> <varlistentry> <term>RAID5</term><listitem><para> Хороший компромис между скоростью, надёжностью и избыточностью. RAID5 разделяет все входящие данные на полосы и распределяет их пропорционально на все диски кроме одного ( как и RAID0). В отличие от RAID0, RAID5 вычисляет <firstterm>контрольную сумму</firstterm>, которую записывает на оставшийся диск. Диск с контрольной суммой не статичен (тогда это был бы RAID4), а периодически изменяется, так что контрольная сумма распределяется по всем дискам. Когда один из дисков ломается, потерянную часть информации можно вычислить из оставшихся данных и её контрольной суммы. RAID5 должен состоять, как минимум из трёх активных разделов. Также, вы можете иметь в массиве запасной диск, который включится в работу в случае неисправности одного из дисков. </para><para> Как видите, RAID5 имеет немного надёжности от RAID1, но достигает этого с меньшей избыточностью. С другой стороны, он немного медленнее на операциях записи чем RAID0 из-за вычислений контрольной суммы. </para></listitem> </varlistentry> </variablelist> Итог:
zh_tw: 隨著建立不同類型的 MD，您可享受不同的好處。目前支援：<variablelist> <varlistentry> <term>RAID0</term><listitem><para> 它的主要目標是效能。RAID0 將進來的資料分割成 <firstterm>stripes</firstterm> 然後平均分配到陣列裡面的每個硬碟上。這樣可以提升讀/寫操作速度，不過一旦其中的一個硬碟損壞，您將丟失<emphasis>一切</emphasis>資料 (部分資訊在好的磁碟上，其他的<emphasis>曾經</emphasis>在壞的磁碟上)。</para><para> 典型的 RAID0 應用於影像編輯分割區。</para></listitem> </varlistentry> <varlistentry> <term>RAID1</term><listitem><para> 適用於以可靠性為優先考慮的狀況。它由多個 (通常兩個) 相同大小的分割區組成，每個分割區儲存相同的資量。這意味著三件事。第一，如果其中的一個損壞，您仍然有資料鏡像在其餘的磁碟上。第二，您只能使用現有容量中的碎片 (更精確的說，它是 RAID 中大小最小的磁碟分割區)。第三，讀取檔案時，負載會被自動平衡到各個磁碟，這可以提升伺服器的性能，如檔案次服器，它讀取的負載可能比寫多。</para><para> 您可以選用備用的磁碟放在陣列中，用於頂替故障損壞的磁碟。</para></listitem> </varlistentry> <varlistentry> <term>RAID5</term><listitem><para> 這是一個速度、可靠性和資料冗餘的折衷方案。RAID5 將資料分割成 strips (類似於RAID0) 但只平均分配到一個磁碟上。與 RAID0 不同的是，RAID5 還會計算<firstterm>奇偶檢驗</firstterm>資訊，並將之寫入其他磁碟。奇偶檢驗磁碟不是靜態的 (那被稱為 RAID4)，而會週期性的修改，所以奇偶檢驗資訊平均分配到所有磁碟。當其中的一個磁碟損壞，失去的資料可以從其他資料以及奇偶檢驗資訊計算出來。RAID5 最少需要三個可用的分割區。您可以選用備用的磁碟放在陣列中，用於替代故障損壞的磁碟。 </para><para> 如您所見，RAID5 的可靠性接近 RAID1 並具有較少的資料冗余。另一方面，它只比 RAID0 在寫入的時候慢，這是因為要計算校驗資訊。 </para></listitem> </varlistentry> </variablelist> 總結：

source: Type
ru: Тип
zh_tw: 類型

source: Minimum Devices
ru: Минимум устройств
zh_tw: 最少設備

source: Spare Device
ru: Запасное устройство
zh_tw: 備用設備

source: Survives disk failure?
ru: Сохранятся ли данные при отказе диска?
zh_tw: 倖免於磁碟損壞？

source: Available Space
ru: Доступное пространство
zh_tw: 可用空間

source: <entry>no</entry>
ru: <entry>нет</entry>
zh_tw: <entry>否</entry>

source: Size of the smallest partition multiplied by number of devices in RAID
ru: Размер самого маленького раздела умноженный на число устройств в RAID
zh_tw: 容量為最小分割區容量乘以 RAID 設備數

source: optional
ru: необязательно
zh_tw: 可選

source: <entry>yes</entry>
ru: <entry>да</entry>
zh_tw: <entry>是</entry>

source: Size of the smallest partition in RAID
ru: Размер самого маленького раздела в RAID
zh_tw: 容量為 RAID 中的最小分割區

source: Size of the smallest partition multiplied by (number of devices in RAID minus one)
ru: Размер самого маленького раздела умноженный на (число устройств в RAID минус один)
zh_tw: 容量為最小分割區乘以 (RAID 設備數量減一)

source: If you want to know the whole truth about Software RAID, have a look at <ulink url="&url-software-raid-howto;">Software RAID HOWTO</ulink>.
ru: Если вы хотите узнать больше о программном RAID, смотрите <ulink url="&url-software-raid-howto;">Software RAID HOWTO</ulink>.
zh_tw: 如果您想真正全面瞭解 Software RAID，請參閱 <ulink url="&url-software-raid-howto;">Software RAID HOWTO</ulink>。

source: There is no widely accepted standard to identify partitions containing RAID data on Apple Power Macintosh hardware. This means that &d-i; currently does not support setting up RAID on this platform.
ru: На машинах Apple Power Macintosh не существует широко распространённого стандарта для определения разделов, содержащих данные RAID. Поэтому на данный момент, &d-i; не поддерживает настройку raid на этой платформе.

source: To create a MD device, you need to have the desired partitions it should consist of marked for use in a RAID. (This is done in <command>partman</command> in the <guimenu>Partition settings</guimenu> menu where you should select <menuchoice> <guimenu>Use as:</guimenu> <guimenuitem>physical volume for RAID</guimenuitem> </menuchoice>.)
ru: Для создания MD устройства нужно пометить желаемые разделы как используемые в RAID. (Это делается в <command>partman</command> из меню <guimenu>Настройки раздела</guimenu>, где вы должны выбрать <menuchoice> <guimenu>Использовать как:</guimenu> <guimenuitem>Использовать раздел как устройство RAID</guimenuitem> </menuchoice>.)
zh_tw: 為了建立 MD 設備，您需要將欲參與陣列的分割區標記為供 RAID 使用。(透過 <command>partman</command> 命令中的 <guimenu>分割區設定：</guimenu> 選單完成，您應該選擇 <menuchoice> <guimenu>用途：</guimenu> <guimenuitem>RAID 的物理容量 </guimenuitem> </menuchoice>。)

source: Support for MD is a relatively new addition to the installer. You may experience problems for some RAID levels and in combination with some bootloaders if you try to use MD for the root (<filename>/</filename>) filesystem. For experienced users, it may be possible to work around some of these problems by executing some configuration or installation steps manually from a shell.
ru: Поддержка MD в программе установки появилась относительно недавно. У вас могут возникнуть проблемы с некоторыми уровнями RAID и в сочетании с некоторыми системными загрузчиками, если вы пытаетесь использовать MD в качестве корневой файловой системы (<filename>/</filename>). Опытные пользователи, возможно, могут обойти некоторые из этих проблем, выполнив некоторую настройку или шаги установки вручную из командной строки.
zh_tw: 在安裝程式中支援 MD 是較新的功能。如果您嘗試將某些類型的 RAID 與 boot-loader 結合，並將 MD 用於根 (<filename>/</filename>) 檔案系統，您也許會遇到問題。對於有經驗的使用者，從介殼手動地處理一些配置和安裝步驟，也許能避開這些問題

source: Next, you should choose <guimenuitem>Configure software RAID</guimenuitem> from the main <command>partman</command> menu. On the first screen of <command>mdcfg</command> simply select <guimenuitem>Create MD device</guimenuitem>. You will be presented with a list of supported types of MD devices, from which you should choose one (e.g. RAID1). What follows depends on the type of MD you selected.
ru: Далее, вы должны выбрать <guimenuitem>Настройка программного RAID</guimenuitem> из главного меню <command>partman</command>. На первом экране <command>mdcfg</command> просто выберите <guimenuitem>Создать MD устройство</guimenuitem>. Вам будет предложен список поддерживаемых типов MD устройств, из которого вы должны выбрать один (например, RAID1). Дальнейшие действия зависят от типа выбранного MD.
zh_tw: 下一步，您應該從 <command>partman</command> 主選單選擇 <guimenuitem>設定 software RAID</guimenuitem>。在 <command>mdcfg</command> 第一個畫面選擇 <guimenuitem>建立 MD device</guimenuitem>。您將看到被支援的 MD 設備列表，您應從其中選擇一項 (如 RAID1)。後續操作會根據您選擇的 MD 類型而定。

source: RAID0 is simple &mdash; you will be issued with the list of available RAID partitions and your only task is to select the partitions which will form the MD.
ru: RAID0 очень прост &mdash; вам предложат список доступных разделов RAID, а вашей задачей будет выбор разделов, из которых вы хотите сформировать MD.
zh_tw: RAID0 是簡單的 &mdash; 您會看到可用的 RAID 分割區，然後您的任務僅是選擇那些想要組成 MD 的分割區。

source: RAID1 is a bit more tricky. First, you will be asked to enter the number of active devices and the number of spare devices which will form the MD. Next, you need to select from the list of available RAID partitions those that will be active and then those that will be spare. The count of selected partitions must be equal to the number provided few seconds ago. Don't worry. If you make a mistake and select different number of partitions, the &d-i; won't let you continue until you correct the issue.
ru: С RAID1 немного сложнее. Во-первых, вас попросят ввести число активных устройств и число запасных устройств, из которых будет формироваться MD. Далее, вам потребуется выбрать из списка доступных разделов RAID те, которые будут активными и затем, те которые будут запасными. Число выбранных разделов должно быть равно числу, введённому несколькими секундами ранее. Не волнуйтесь. Если вы ошибётесь и выберите неверное число разделов, &d-i; не позволит вам продолжить, пока вы не исправите ошибку.
zh_tw: RAID1 需要一些技巧。首先，您將要求輸入組成 MD 的活動設備和備用設備數量。其次，您需要從 RAID 可用分割區列表中選擇哪些是活動分割區，哪些是備用的。選擇的分割區總數必須與之前提供的數目相同。不必擔心，如果您選擇了不同的分割區數， &d-i; 將不會允許您繼續下去，直到錯誤被改正為止。
