Repository: xobs/debian-installer
Catalog: doc/manual/po/*/using-d-i.po
Languages: ru, zh_tw

source: Let's assume the Debian Installer has booted and you are facing its first screen. At this time, the capabilities of &d-i; are still quite limited. It doesn't know much about your hardware, preferred language, or even the task it should perform. Don't worry. Because &d-i; is quite clever, it can automatically probe your hardware, locate the rest of its components and upgrade itself to a capable installation system. However, you still need to help &d-i; with some information it can't determine automatically (like selecting your preferred language, keyboard layout or desired network mirror).
ru: Давайте представим, что программа установки Debian загрузилась и вы видите её первый экран. В этот момент возможности &d-i; всё ещё немного ограничены. Она многого не знает о вашем оборудовании, предпочитаемом языке или даже о задачах, которые она должна выполнить. Не беспокойтесь. Поскольку &d-i; немножко умная, она может автоматически определить ваше оборудование, найти свои остальные компоненты и обновить себя до очень умелой системы установки. Однако, вы должны помочь &d-i; некоторой информацией, которую она не сможет определить автоматически (например, выбрать предпочитаемый вами язык, раскладку клавиатуры или необходимый сетевой сервер-зеркало).
zh_tw: 假設 Debian 安裝程式已經啟動，然後您看到了初始畫面。此時， &d-i; 的能力還很有限。它還不瞭解您的硬體、語言、甚至不知道要執行什麼任務。不用擔心，因為 &d-i; 相當聰明，它能自動探測您的硬體，尋找其餘的元件，並更新自己以具備安裝系統的能力。但您仍然要協助 &d-i;，不能自動決定的內容 (例如選擇語言，鍵盤配置或網路鏡像站)。

source: You will notice that &d-i; performs <firstterm>hardware detection</firstterm> several times during this stage. The first time is targeted specifically at the hardware needed to load installer components (e.g. your CD-ROM or network card). As not all drivers may be available during this first run, hardware detection needs to be repeated later in the process.
ru: Заметим, что &d-i; выполняет <firstterm>определение оборудования</firstterm> несколько раз во время установки. На первом этапе определяется оборудование, необходимое для загрузки компонентов программы установки (т.е. ваш CD-ROM или сетевая карта). Поскольку не все драйверы могут быть доступны во время этого первого запуска, определение оборудования надо будет повторить позже по ходу установки.
zh_tw: 您會留意到 &d-i; 在本階段執行<firstterm>硬體偵測</firstterm> 多次。第一次目的是指定哪些硬體需要安裝 (例如，您的 CD-ROM 或者網卡)。在第一次執行的時候並不是所有的驅動程式都就緒，硬體偵測會在後續過程裡面多次重複。

source: Check available memory
ru: Определение доступной памяти
zh_tw: 檢測有效的記憶體

source: One of the first things &d-i; does, is to check available memory. If the available memory is limited, this component will make some changes in the installation process which hopefully will allow you to install &debian; on your system.
ru: Одну из первых вещей, которую делает &d-i;, это проверка размера доступной памяти. Если размер ограничен, то эта компонента делает некоторые изменения процесса установки, которые, будем надеяться, позволят установить &debian; на вашу машину.
zh_tw: &d-i; 首先要做的一件事是檢測有效的記憶體。如果記憶體有限，該元件將修改後續的安裝進程，使您可以將 &debian; 安裝到您的系統上。

source: During a low memory install, not all components will be available. One of the limitations is that you won't be able to choose a language for the installation.
ru: В случае установки с малым количеством памяти, не все компоненты будут доступны. Одним из ограничений является невозможность выбора языка установки.
zh_tw: 在小記憶體的安裝下，只有部分元件有效。其中的一個限制是您無法在安裝過程中選擇語言。

source: Language selection
ru: Выбор языка
zh_tw: 選擇語言

source: As the first step of the installation, select the language in which you want the installation process to proceed. The language names are listed in both English (left side) and in the language itself (right side); the names on the right side are also shown in the proper script for the language. The list is sorted on the English names.
ru: На первом этапе установки выберите язык, на котором будет проходить весь процесс установки. Названия языков написаны на английском(слева) и на самом языке (справа); названия справа также показаны в правильном написании для этого языка. Список отсортирован по английским названиям.
zh_tw: 安裝的第一步，選擇您希望安裝過程使用的語言。語言列表使用英文 (左側) 和該語言本身 (右側) 顯示﹔右側的語言可以用正確的形態表現出來。該列表以英文名稱排序。

source: The language you choose will be used for the rest of the installation process, provided a translation of the different dialogs is available. If no valid translation is available for the selected language, the installer will default to English. The selected language will also be used to help select a suitable keyboard layout.
ru: Выбранный язык будет использован в дальнейшем процессе установки, предлагая переводы различных диалогов если возможно. Если перевод для выбранного языка недоступен, по умолчанию используется английский язык. Выбранный язык также будет использован при выборе подходящей раскладки клавиатуры.
zh_tw: 您選擇的語言將用於接下來的安裝過程，對話框已經有各種語言翻譯的版本。如果選擇的語言沒有對應翻譯的版本，安裝將預設使用英文。選擇的語言也將助於選擇一個合適的鍵盤配置。

source: Country selection
ru: Выбор страны
zh_tw: 選擇國家

source: If you selected a language in <xref linkend="lang-chooser"/> which has more than one country associated with it (true for Chinese, English, French, and many other languages), you can specify the country here. If you choose <guimenuitem>Other</guimenuitem> at the bottom of the list, you will be presented with a list of all countries, grouped by continent.
ru: Если вы выбрали язык (<xref linkend="lang-chooser"/>), на котором говорят более чем в одной стране (например, китайский, английский, французский и многие другие языки), здесь вы можете указать страну. Если вы выберите <guimenuitem>Другая</guimenuitem> в конце списка, то вам будет предложен список всех стран, сгруппированных по континентам.
zh_tw: 如果您選擇的語言 <xref linkend="lang-chooser"/>與多個國家關聯 (存在於中文，英文，法文，以及其它語言)，您可以在這裡選擇國家。如果您選擇列表底部的 <guimenuitem>其它</guimenuitem>，您將看到按各洲分組的全部國家。

source: This selection will be used later in the installation process to pick the default timezone and a Debian mirror appropriate for your geographic location. If the defaults proposed by the installer are not suitable, you can make a different choice. The selected country, together with the selected language, may also affect locale settings for your new Debian system.
ru: Этот значение будет использовано позднее в процессе установки для выбора часового пояса по умолчанию и ближайшего к вам территориально сервера-зеркала Debian. Если предложенные по умолчанию установки не подходят, то вы можете изменить их. Выбранная страна вместе с выбранным языком могут повлиять на настройку локали вашей новой системы Debian.
zh_tw: 在安裝過程的後面，這個選項還會被用於設定預設的時區和您所處地理位置的 Debian 鏡像站。如果安裝程式預設的建議不合適，您可以做其它選擇。選擇國家，還有選擇語言，都會影響您新 Debian 系統的本地化設定。

source: Selecting Localization Options
ru: Выбор параметров локализации
zh_tw: 選擇區域化選項

source: In most cases the first questions you will be asked concern the selection of localization options to be used both for the installation and for the installed system. The localization options consist of language, country and locales.
ru: В большинстве случаев сначала вас попросят указать параметры локализации, которые будут использованы в программе установки и в будущей системе. В параметры локализации входят язык, страна и локали.
zh_tw: 在大部分情況下，第一個問您的問題將會是安裝程式以及安裝好之後的系統所要使用的本地化選項。選項包括了語言、國家以及地區設定。

source: The language you choose will be used for the rest of the installation process, provided a translation of the different dialogs is available. If no valid translation is available for the selected language, the installer will default to English.
ru: Выбранный язык будет использован в процессе установки, предлагая переводы различных диалогов если возможно. Если перевод для выбранного языка недоступен, по умолчанию используется английский язык.
zh_tw: 您選擇的語言將用於接下來的安裝過程，對話框已經有各種語言翻譯的版本。如果選擇的語言沒有對應翻譯的版本，安裝將預設使用英文。選擇的語言也將助於選擇一個合適的鍵盤配置。

source: The selected country will be used later in the installation process to pick the default timezone and a Debian mirror appropriate for your geographic location. Language and country together will be used to set the default locale for your system and to help select your keyboard.
ru: Выбранное значение для страны будет использовано позднее в процессе установки для выбора часового пояса по умолчанию и ближайшего к вам территориально сервера-зеркала Debian. Значения страны и языка будутиспользованы для настройки локали вашей системы и помогут при выборе раскладки клавиатуры.
zh_tw: 在安裝過程的後面，這個選項還會被用於設置預設的時區和您所處地理位置的 Debian 鏡像站。如果安裝程式預設的建議不合適，您可以做其它選擇。選擇國家，還有選擇語言，都會影響您新 Debian 系統的本地化設置。

source: You will first be asked to select your preferred language. The language names are listed in both English (left side) and in the language itself (right side); the names on the right side are also shown in the proper script for the language. The list is sorted on the English names. At the top of the list is an extra option that allows you to select the <quote>C</quote> locale instead of a language. Choosing the <quote>C</quote> locale will result in the installation proceding in English; the installed system will have no localization support as the <classname>locales</classname> package will not be installed.
ru: Сначала вас попросят выбрать предпочитаемый язык. Названия языков написаны на английском(слева) и на самом языке (справа); названия справа также показаны в правильном написании для этого языка. Список отсортирован по английским названиям. Вверху списка есть дополнительный пункт, который вместо языка позволяет выбрать <quote>C</quote> локаль. При выборе <quote>C</quote> локали установка будет производиться на английском; установленная система не будет иметь поддержку локализации, так как пакет <classname>locales</classname> в данном случае установлен не будет.
zh_tw: 首先您將會被要求選擇您偏好的語言。語言清單中，各語言名稱將以英文列出 (左邊)，而語言本身將以適當的文字則列於右邊。清單以英文名稱排序。清單的頂端是一個額外的 <quote>C</quote> 地區選項，選擇 <quote>C</quote> 將使得安裝程序以英文進行；<classname>locales</classname> 軟體套件將不會安裝在安裝好的系統中，因此系統也不會支援任何地區設定。

source: If you selected a language that is recognized as an official language for more than one country<footnote> <para> In technical terms: where multiple locales exist for that language with differing country codes. </para> </footnote>, you will next be asked to select a country. If you choose <guimenuitem>Other</guimenuitem> at the bottom of the list, you will be presented with a list of all countries, grouped by continent. If the language has only one country associated with it, that country will be selected automatically.
ru: Если вы выбрали язык, на котором говорят более чем в одной стране<footnote> <para> Технически говоря: когда для языка существует несколько локалей с различными кодами стран. </para> </footnote> далее вас попросят указать страну. Если вы выберите <guimenuitem>Другая</guimenuitem> в конце списка, то вам будет предложен список всех стран, сгруппированных по континентам. Если с выбранном языком связана только одна страна, то она будет выбрана автоматически.
zh_tw: 如果您選擇的語言屬於多個國家的官方語言(存在於中文，英文，法文，以及其它語言)，您可以在這裡選擇國家。如果您選擇列表底部的 <guimenuitem>其它</guimenuitem>，您將看到按大洲分組的全部國家。

source: A default locale will be selected based on the selected language and country. If you are installing at medium or low priority, you will have the option of selecting a different default locale and of selecting additional locales to be generated for the installed system.
ru: На основании выбранного языка и страны будет настроена локаль по умолчанию. Если установка проходит со средним или низким приоритетом, вы сможете выбрать другую локаль по умолчанию и настроить дополнительные локали, которые будут созданы для устанавливаемой системы.
zh_tw: 預設的地區設定會根據您選擇的語言和國家決定。如果您以中等或是低優先序安裝系統，您將可以選擇預設地區設定以外的設定，並且可以決定系統額外支援的地區設定。

source: Choosing a Keyboard
ru: Выбор клавиатуры
zh_tw: 選擇鍵盤

source: Keyboards are often tailored to the characters used in a language. Select a layout that conforms to the keyboard you are using, or select something close if the keyboard layout you want isn't represented. Once the system installation is complete, you'll be able to select a keyboard layout from a wider range of choices (run <command>kbdconfig</command> as root after you have completed the installation).
ru: Клавиатуры часто приспосабливают к алфавиту определённого языка. Выберите раскладку, которая подходит к вашей клавиатуре, или выберите наиболее подходящую, если таковой не имеется. После завершения установки вы сможете выбрать раскладку из большего количества вариантов (запустите <command>kbdconfig</command> с правами суперпользователя после завершения установки).
zh_tw: 鍵盤經常因不同語言使用的字元不同而有不同的配置。選擇一個適合您鍵盤的配置，或者為沒出現的配置選擇一個接近的。一旦系統安裝完畢，您可以從更大的範圍您選擇鍵盤配置 (在安裝完之後用 root 執行 <command>kbdconfig</command>)。

source: Move the highlight to the keyboard selection you desire and press &enterkey;. Use the arrow keys to move the highlight &mdash; they are in the same place in all national language keyboard layouts, so they are independent of the keyboard configuration. An 'extended' keyboard is one with <keycap>F1</keycap> through <keycap>F10</keycap> keys along the top row.
ru: Выберите нужную клавиатуру и нажмите &enterkey;. Для перемещения используйте клавиши стрелок &mdash; они находятся в одном и том же месте во всех национальных клавиатурных раскладках, поэтому не зависят от конфигурации клавиатуры. 'Расширенная' клавиатура &mdash; это клавиатура с клавишами от <keycap>F1</keycap> до <keycap>F10</keycap> в самом верхнем ряду клавиш.
zh_tw: 將反白移動到您選擇的鍵盤，然後按下 &enterkey;。用箭頭移動反白區 &mdash; 在所有國家鍵盤配置裡，它們都位於相同的地方，因此獨立於鍵盤配置。'延伸的'鍵盤是在鍵盤上端有一排 <keycap>F1</keycap>到<keycap>F10</keycap> 按鍵。

source: On DECstations there is currently no loadable keymap available, so you have to skip the keyboard selection and keep the default kernel keymap (LK201 US). This may change in the future as it depends on further Linux/MIPS kernel development.
ru: На машинах DECstation в настоящий момент загрузка клавиатурной раскладки невозможна, поэтому вы можете пропустить выбор клавиатуры и оставить раскладку, которую по умолчанию предлагает ядро (LK201 US). Это может измениться в будущем, в зависимости от того как будет разрабатываться в дальнейшем ядро Linux/MIPS.
zh_tw: 目前 DEC 工作站上沒有可以載入的 keymap， 因此您不得不跳過鍵盤選項，保持預設的核心 keymap (LK201 US)。隨著 Linux/MIPS 核心的開發，將來也許會改變。

source: There are two keyboard layouts for US keyboards; the qwerty/mac-usb-us (Apple USB) layout will place the Alt function on the <keycap>Command/Apple</keycap> key (in the keyboard position next to the <keycap>space</keycap> key similar to <keycap>Alt</keycap> on PC keyboards), while the qwerty/us (Standard) layout will place the Alt function on the <keycap>Option</keycap> key (engraved with 'alt' on most Mac keyboards). In other respects the two layouts are similar.
ru: Есть две раскладки для клавиатур US: раскладка qwerty/mac-usb-us (Apple USB) закрепляет функцию Alt за клавишей <keycap>Command/Apple</keycap> (на клавиатуре это следующая клавиша после <keycap>space</keycap> подобна <keycap>Alt</keycap> PC клавиатурах), а раскладка qwerty/us (Standard) закрепляет функцию Alt за клавишей <keycap>Option</keycap> (на большинстве Mac клавиатур клавиша с надписью 'alt'). В остальном раскладки ничем не отличаются.
zh_tw: 有兩種 US 鍵盤配置﹔qwerty/mac-usb-us (Apple USB) 將 Alt 功能放在 <keycap>Command/Apple</keycap> 按鍵 (處於鍵盤的 <keycap>空格</keycap> 按鍵旁，類似於 PC 鍵盤的 <keycap>Alt</keycap> )，另外 qwerty/us (Standard) 配置將 Alt 功能放在 <keycap>Option</keycap> 按鍵上 (在大多數 Mac 鍵盤上標明 'alt')。其餘地方這兩種配置相似。

source: If you are installing on a system that has a Sun USB keyboard and have booted the installer with the default 2.4 kernel, the keyboard will not be identified correctly by the installation system. The installer will show you a list of Sun type keymaps to choose from, but selecting one of these will result in a non-working keyboard. If you are installing with the 2.6 kernel, there is no problem.
ru: Если вы устанавливаете систему на машину с USB клавиатурой Sun и загружаете программу установки с ядром по умолчанию версии 2.4, то клавиатура находится неправильно. Программа установки предложит список клавиатурных раскладок Sun, но выбор любой из них приведёт к неработоспособной клавиатуре. Если вы производите установку с ядром версии 2.6, то этой проблемы нет.
zh_tw: 如果您的系統上使用 Sun USB 鍵盤，並且使用預設的 2.4 核心啟動，該鍵盤將無法被安裝系統識別。 安裝程式會提供 Sun 類型的 keymap 列表供選擇，但是選擇了其中一個會導致鍵盤無法使用。 如果您使用 2.6 核心安裝，便不會有問題。

source: To get a working keyboard, you should boot the installer with parameter <userinput>debconf/priority=medium</userinput>. When you get to keyboard selection<footnote> <para> If you are installing at default priority you should use the <userinput>Go Back</userinput> button to return to the installer menu when you are shown the list of Sun type keymaps. </para> </footnote>, choose <quote>No keyboard to configure</quote> if you have a keyboard with an American (US) layout, or choose <quote>USB keyboard</quote> if you have a keyboard with a localized layout. Selecting <quote>No keyboard to configure</quote> will leave the kernel keymap in place, which is correct for US keyboards.
ru: Чтобы клавиатура работала, нужно загрузить программу установки с параметром <userinput>debconf/priority=medium</userinput>. Когда вам предложат выбор клавиатуры <footnote> <para> Если вы производите установку с приоритетом по умолчанию нужно использовать кнопку <userinput>Вернуться</userinput>, чтобы вернуться в меню программы установки, когда будет предложен список клавиатурных раскладок Sun. </para> </footnote>, выберите <quote>Настраиваемая клавиатура отсутствует</quote> если у вас клавиатура с американской (US) раскладкой, или выберите <quote>Клавиатура USB</quote>, если у вас клавиатура с национальными символами. Выбор <quote>Настраиваемая клавиатура отсутствует</quote> является корректной и для US клавиатур.
zh_tw: 為了讓鍵盤可以工作，您應該為開機程式加上參數 <userinput>debconf/priority=medium</userinput>。 當您看到鍵盤選擇項<footnote> <para> 如果您使用預設的優先級安裝，在顯示 Sun 類型 keymap 之後，您應該使用 <userinput>Go Back</userinput> 按鈕返回安裝選單。</para> </footnote>，如果您使用美式 (US) 鍵盤配置，請選 <quote>No keyboard to configure</quote>，如果您使用本地化鍵盤配置，請選 <quote>USB keyboard</quote>。選擇 <quote>No keyboard to configure</quote> 會使核心 keympa 放在合適的地方，這對美式鍵盤是正確的做法。

source: Looking for the Debian Installer ISO Image
ru: Поиск ISO образа программы установки Debian
zh_tw: 尋找 Debian 安裝程式 ISO 映像

source: When installing via the <emphasis>hd-media</emphasis> method, there will be a moment where you need to find and mount the Debian Installer iso image in order to get the rest of the installation files. The component <command>iso-scan</command> does exactly this.
ru: Если установка производится с помощью метода <emphasis>hd-media</emphasis>, настанет момент, когда вам нужно будет найти и смонтировать ISO образ программы установки Debian, чтобы получить оставшиеся файлы установки. Для этого существует компонента <command>iso-scan</command>.
zh_tw: 當使用 <emphasis>hd-media</emphasis> 方式安裝，將會有尋找和掛載 Debian 安裝程式 iso 映像的動作，用於取得其它的安裝檔案。元件 <command>iso-scan</command> 正是用來完成此任務。

source: At first, <command>iso-scan</command> automatically mounts all block devices (e.g. partitions) which have some known filesystem on them and sequentially searches for filenames ending with <filename>.iso</filename> (or <filename>.ISO</filename> for that matter). Beware that the first attempt scans only files in the root directory and in the first level of subdirectories (i.e. it finds <filename>/<replaceable>whatever</replaceable>.iso</filename>, <filename>/data/<replaceable>whatever</replaceable>.iso</filename>, but not <filename>/data/tmp/<replaceable>whatever</replaceable>.iso</filename>). After an iso image has been found, <command>iso-scan</command> checks its content to determine if the image is a valid Debian iso image or not. In the former case we are done, in the latter <command>iso-scan</command> seeks for another image.
ru: Сначала <command>iso-scan</command> автоматически смонтирует все блочные устройства (т.е. разделы), на которых есть распознанная файловая система и последовательно будет искать на них файлы с именами, оканчивающимися на <filename>.iso</filename> (или <filename>.ISO</filename>, это важно). Обратите внимание, ищутся файлы только в корневом каталоге и подкаталогах первого уровня (то есть найдутся файлы <filename>/<replaceable>имя</replaceable>.iso</filename>, <filename>/data/<replaceable>имя</replaceable>.iso</filename>, но не <filename>/data/tmp/<replaceable>имя</replaceable>.iso</filename>). После нахождения iso образа, <command>iso-scan</command> проверит его содержимое чтобы выяснить, является ли образ правильным iso образом Debian или нет. В первом случае поиск завершается, в последнем <command>iso-scan</command> будет искать другой образ.
zh_tw: 首先，<command>iso-scan</command> 自動掛載具有已知檔案系統的資料塊 (block) 設備 (例如，分割區)，然後按序搜索檔案副檔名是 <filename>.iso</filename> (或 <filename>.ISO</filename> 之類)。注意，第一次只嘗試掃瞄位於根目錄和第一層子目錄的檔案 (例如，它找到 <filename>/<replaceable>whatever</replaceable>.iso</filename>, <filename>/data/<replaceable>whatever</replaceable>.iso</filename>， 而不是 <filename>/data/tmp/<replaceable>whatever</replaceable>.iso</filename>)。在 iso 映像檔案找到後，<command>iso-scan</command> 會檢查它包含的內容，確定該映像檔是不是有效的 Debian iso 映像。 如為前者，任務結束﹔如果是後者，<command>iso-scan</command> 會搜索其它的映像檔案。

source: In case the previous attempt to find an installer iso image fails, <command>iso-scan</command> will ask you whether you would like to perform a more thorough search. This pass doesn't just look into the topmost directories, but really traverses whole filesystem.
ru: Если найти ISO образ с программой установки не удалось, <command>iso-scan</command> спросит, хотите ли вы чтобы был выполнен более тщательный поиск. В этом случае будет произведён поиск по всей файловой системе.
zh_tw: 萬一前面嘗試尋找 iso 映像失敗，<command>iso-scan</command> 會詢問您是否原意進行完整的搜索。這次不只查看最上級目錄，而是真正地搜尋整個檔案系統。

source: If <command>iso-scan</command> does not discover your installer iso image, reboot back to your original operating system and check if the image is named correctly (ending in <filename>.iso</filename>), if it is placed on a filesystem recognizable by &d-i;, and if it is not corrupted (verify the checksum). Experienced Unix users could do this without rebooting on the second console.
ru: Если <command>iso-scan</command> не нашла ISO образ программы установки, перезагрузитесь в первоначальную операционную систему и проверьте правильность имени (должно оканчиваться на <filename>.iso</filename>), если файл находится на распознаваемой &d-i; файловой системе, и что образ не повреждён (проверьте контрольную сумму). Опытные пользователи Unix могут это сделать со второй консоли без перезагрузки.
zh_tw: 如果 <command>iso-scan</command> 找不到您的安裝 iso 映像檔，請重新啟動返回到您以前的作業系統，檢查映像檔名是否正確 (以 <filename>.iso</filename>結尾)，是否放在一個能被 &d-i; 識別的檔案系統上，是否損壞 (用 checksum 校驗)。有經驗的 Unix 使用者可以在第二個控制台上完成這些動作，而毋須重新啟動。

source: Configuring Network
ru: Настройка сети
zh_tw: 設定網路
