Repository: xobs/debian-installer
Catalog: doc/manual/po/*/welcome.po
Languages: ko, pt, ru

source: Linus Torvalds continues to coordinate the work of several hundred developers with the help of a few trusty deputies. An excellent weekly summary of discussions on the <userinput>linux-kernel</userinput> mailing list is <ulink url="&url-kernel-traffic;">Kernel Traffic</ulink>. More information about the <userinput>linux-kernel</userinput> mailing list can be found on the <ulink url="&url-linux-kernel-list-faq;">linux-kernel mailing list FAQ</ulink>.
ko: Linus Torvalds는 신뢰할 수 있는 소수 협력자들의 도움으로 수백명이나 되는 개발자들의 일을 조정하고 있습니다. <ulink url="&url-kernel-traffic;">Kernel Traffic</ulink>은 <userinput>linux-kernel</userinput> 메일링 리스트의 토론을 주단위로 훌륭하게 요약해 놓았습니다. <userinput>linux-kernel</userinput> 메일링 리스트에 대한 자세한 정보는 <ulink url="&url-linux-kernel-list-faq;">linux-kernel mailing list FAQ</ulink>에서 찾아 보기 바랍니다.
pt: Linus Torvalds continua a coordenar o trabalho de várias centenas de programadores com a ajuda de alguns ajudantes de confiança. Um excelente sumário semanal das discussões na mailing list <userinput>linux-kernel</userinput> é o <ulink url="&url-kernel-traffic;">Kernel Traffic</ulink>. Mais informação acerca da mailing list <userinput>linux-kernel</userinput> pode ser encontrada no <ulink url="&url-linux-kernel-list-faq;">linux-kernel mailing list FAQ</ulink>.
ru: Линус Торвальдс продолжает координировать работу нескольких сотен разработчиков с помощью нескольких доверенных лиц. Отличный еженедельный обзор дискуссий из списка рассылки <userinput>linux-kernel</userinput> можно почитать на веб-странице <ulink url="&url-kernel-traffic;">Kernel Traffic</ulink>. Дополнительную информацию о списке рассылки <userinput>linux-kernel</userinput> можно найти в <ulink url="&url-linux-kernel-list-faq;">FAQ списка рассылки linux-kernel</ulink>.

source: Linux users have immense freedom of choice in their software. For example, Linux users can choose from a dozen different command line shells and several graphical desktops. This selection is often bewildering to users of other operating systems, who are not used to thinking of the command line or desktop as something that they can change.
ko: Linux 사용자는 소프트웨어 선택에 있어서 상당한 자유를 갖고 있습니다. 예를 들어, Linux 사용자는 12개의 다른 커맨드 라인 쉘과 다수의 그래픽 데스크 탑을 선택할 수 있습니다. 이와 같은 다양한 선택의 폭 때문에, 쉘이나 데스크탑 같이 자신들이 변경할 수 있는 것에 대하여 전혀 생각하지 못 했던 사용자들이 당황스러워 하기도 합니다.
pt: Os utilizadores de GNU/Linux têm uma imensa liberdade de escolha no seu software. Por exemplo, utilizadores de GNU/Linux podem escolher de entre uma dúzia de shells de linha de comandos e vários ambientes gráficos. Esta selecção é muitas vezes confusa para os utilizadores de outros sistemas operativos, que não estão habituados a pensarem na linha de comandos ou no ambiente de trabalho em algo que possam substituir.
ru: Пользователи Linux имеют огромную свободу в выборе программного обеспечения. Например, пользователи Linux могут выбирать из дюжины различных оболочек командной строки и нескольких графических рабочих столов. Этот выбор часто удивляет пользователей других операционных систем, которые и не думали, что командные оболочки или рабочий стол можно заменить.

source: Linux is also less likely to crash, better able to run more than one program at the same time, and more secure than many operating systems. With these advantages, Linux is the fastest growing operating system in the server market. More recently, Linux has begun to be popular among home and business users as well.
ko: 또한 여타 운영체계에 비해 Linux는 시스템이 죽는 경우가 적으며, 동시에 하나 이상의 프로그램을 실행할 수 있는 성능이 월등하고, 보안성이 강합니다.
pt: É também menos provável que Linux bloqueie, que corra melhor mais de um programa ao mesmo tempo, e mais seguro que muitos sistemas operativos. Com estas vantagens, Linux é o sistema operativo que cresce mais rapidamente no mercado de servidores. Mais recentemente, Linux passou a ser popular entre os utilizadores domésticos e empresariais.
ru: Linux также менее подвержен сбоям, лучше приспособлен для одновременного выполнения более чем одной программы и более защищён, чем многие другие системы. Благодаря этим преимуществам, Linux быстро завоёвывает рынок серверных операционных систем. С недавних пор, Linux начал становиться популярным среди домашних пользователей и в корпоративной среде.

source: What is &debian;?
ko: &debian;이란?
pt: O que é &debian;?
ru: Что такое &debian;?

source: The combination of Debian's philosophy and methodology and the GNU tools, the Linux kernel, and other important free software, form a unique software distribution called &debian;. This distribution is made up of a large number of software <emphasis>packages</emphasis>. Each package in the distribution contains executables, scripts, documentation, and configuration information, and has a <emphasis>maintainer</emphasis> who is primarily responsible for keeping the package up-to-date, tracking bug reports, and communicating with the upstream author(s) of the packaged software. Our extremely large user base, combined with our bug tracking system ensures that problems are found and fixed quickly.
ko: Debian의 철학 및 방법론과 GNU 도구, Linux 커널, 그리고 여타 중요한 자유소프트웨어의 조합은 &debian;이라 불리는 독특한 배포판을 형성합니다. 이 배포판은 수많은 소프트웨어 <emphasis>패키지</emphasis>로 구성됩니다. 배포판의 각 패키지는 실행화일, 스크립트, 문서, 그리고 설정 정보를 포함하며, 메인터너가 관리합니다. <emphasis>메인터너</emphasis>는 각 패키지를 항상 최진으로 유지하고, 버그 리포트를 추적하고, 패키징된 소프트웨어의 원저자들과 연락을 하고 있습니다. 버그 추적 시스템과 조합된 거대한 사용자 기반으로 인해 문제를 빨리 찾아 내고 수정하는 것이 빠르게 이루어 집니다.
pt: A combinação da filosofia e metodologia Debian e as ferramentas GNU, o kernel Linux, e outro importante software livre, formam uma distribuição de software única chamada &debian;. Esta distribuição é feita de um grande número de <emphasis>pacotes</emphasis> de software. Cada pacote da distribuição contém executáveis, scripts, documentação, e informação de configuração, e tem um <emphasis>maintainer</emphasis> que é o primeiro responsável por manter o pacote actualizado, perseguir relatórios de bugs, e comunicar com o(s) autor(es) do software original do pacote. A nossa extremamente grande base de utilizadores, combinada com o nosso sistema de seguimento de bugs assegura que os problemas são encontrados e resolvidos rapidamente.
ru: Комбинация философии и методологии Debian, средств GNU, ядра Linux и других важных программ, составляют уникальный дистрибутив под названием &debian;. Этот дистрибутив собран из большого количества <emphasis>пакетов</emphasis> программ. Каждый пакет в дистрибутиве содержит исполняемые файлы, скрипты, документацию, конфигурационную информацию и имеет <emphasis>сопровождающего</emphasis>, который отвечает за поддержание пакета в актуальном состоянии, отслеживает сообщения об ошибках (bug reports) и общается с основными авторами программы. Огромная база наших пользователей в сочетании с нашей системой отслеживания сообщений об ошибках гарантируют, что проблемы будут быстро обнаружены и устранены.

source: Debian's attention to detail allows us to produce a high-quality, stable, and scalable distribution. Installations can be easily configured to serve many roles, from stripped-down firewalls to desktop scientific workstations to high-end network servers.
ko: 양질의 안정되고 scaleable한 배포판은 데비안의 세세한 관심때문입니다. 설치도구를 이용하여 방화벽부터 데스크탑 워크스테이션, 네트워크 서버까지 다양한 기능을 하는 서버를 간단히 구성할 수 있습니다.
pt: A atenção de Debian para os detalhes permite-nos produzir uma distribuição de alta qualidade, estável e escalável. As instalações podem ser facilmente configuradas para servirem vários papéis, desde firewalls dedicadas a ambientes de trabalho de estações de trabalho científico a servidores de rede de elevada gama.
ru: Внимание Debian к деталям позволило создать высококачественный, стабильный и расширяемый дистрибутив. Установленные системы могут быть легко настроены на выполнение самых различных задач: от упрощённого межсетевого экрана (firewall), рабочей станции учёного, до высокопроизводительного сетевого сервера.

source: Debian is especially popular among advanced users because of its technical excellence and its deep commitment to the needs and expectations of the Linux community. Debian also introduced many features to Linux that are now commonplace.
ko: 데비안은 고급사용자들에게 상당히 인기가 있으며, 그 이유는 데비안의 기술적 장점과 필요에 의한 참여, 그리고 리눅스 공동체의 기대 때문입니다. 또한 데비안은 이제는 평범해진 리눅스에 다양한 기능을 제공했습니다.
pt: Debian é especialmente popular entre utilizadores mais avançados devido à sua excelência técnica e ao seu profundo compromisso com as necessidades e expectativas da comunidade Linux. Debian também introduziu muitas funcionalidade a Linux que agora são lugar-comum.
ru: Debian особенно популярен среди опытных пользователей из-за его технического совершенства и глубокого понимания нужд и ожиданий сообщества Linux. Debian также добавил много новых свойств в Linux, которые теперь повсеместно используются.

source: For example, Debian was the first Linux distribution to include a package management system for easy installation and removal of software. It was also the first Linux distribution that could be upgraded without requiring reinstallation.
ko: 예를 들어보면, 소프트웨어의 설치와 제거를 쉽게할 수 있는 패키지 관리 시스템을 포함한 최초의 리눅스 배포판이 데비안입니다. 또한, 재설치하지 않고 업그레이드 할 수 있는 최초의 배포판입니다.
pt: Por exemplo, Debian foi a primeira distribuição a incluir um sistema de gestão de pacotes para fácil instalação e remoção de software. Foi também a primeira distribuição de Linux a poder ser substituída por uma versão mais recente sem necessitar de reinstalação.
ru: Например, Debian был первым дистрибутивом Linux, который имел систему управления пакетами для более лёгкой установки и удаления программ. Также он был первым дистрибутивом Linux, который можно обновить до последней версии без переустановки.

source: Debian continues to be a leader in Linux development. Its development process is an example of just how well the Open Source development model can work &mdash; even for very complex tasks such as building and maintaining a complete operating system.
ko: 데비안은 리눅스 개발에 있어 여전히 지도자 역할을 하고 있습니다. 데비안의 개발 과정은 오픈 소스 개발 모델, 심지어 완전한 운영체제의 개발 및 관리 같은 복잡한 일이 얼마나 잘 진행되는 지를 보여주는 한 예입니다.
pt: Debian continua a ser líder no desenvolvimento de Linux. O seu processo de desenvolvimento é um exemplo de como pode o modelo de desenvolvimento Open Source funcionar bem &mdash; mesmo para tarefas muito complexas tais como construir e manter um sistema operativo completo.
ru: Debian продолжает быть лидером в разработке Linux. Его процесс разработки является примером того, как хорошо может работать модель Открытых Исходников (Open Source) &mdash; даже для очень сложных задач, таких как построение и сопровождение целой операционной системы.

source: The feature that most distinguishes Debian from other Linux distributions is its package management system. These tools give the administrator of a Debian system complete control over the packages installed on that system, including the ability to install a single package or automatically update the entire operating system. Individual packages can also be protected from being updated. You can even tell the package management system about software you have compiled yourself and what dependencies it fulfills.
ko: 데비안과 다른 리눅스 배포판을 구분하는 가장 큰 특징은 패키지 관리 시스템입니다. 이러한 도구를 이용하여, 데비안 시스템의 관리자는 단 한개의 패키지를 설치하거나 전체 운영체제를 자동으로 업데이트할 수 있는 능력을 포함하여, 시스템에 설치된 패키지에 대한 완벽한 제어권을 얻을 수 있습니다.
pt: A funcionalidade que mais distingue Debian de outras distribuições de Linux é o sistema de gestão de pacotes. Estas ferramentas dão ao administrador de um sistema Debian o controlo completo sobre os pacotes instalados nesse sistema, incluindo a possibilidade de instalar um único pacote ou actualizar automaticamente todo o sistema operativo. Pacotes individuais podem também ser protegidos para não serem actualizados. Você pode mesmo dizer ao sistema de gestão de pacotes que software compilou você mesmo e que dependências satisfaz.
ru: Наиболее отличительной особенностью Debian от других дистрибутивов Linux является его система управления пакетами. Она даёт администратору системы Debian полный контроль над пакетами, установленными в системе, будь это установка одного пакета или автоматическое обновление всей операционной системы. Также, отдельные пакеты могут быть защищены от обновления. Вы даже можете указать системе управления пакетами программы, которые вы собрали сами и о том, от каких программ она зависит.

source: To protect your system against <quote>Trojan horses</quote> and other malevolent software, Debian's servers verify that uploaded packages come from their registered Debian maintainers. Debian packagers also take great care to configure their packages in a secure manner. When security problems in shipped packages do appear, fixes are usually available very quickly. With Debian's simple update options, security fixes can be downloaded and installed automatically across the Internet.
ko: 여러분의 시스템을 <quote>트로이 목마</quote>및 여타 악의적인 소프트웨어로 부터 보호하기 위하여, 데비안의 서버는 해당 패키지에 등록된 데비안 메인터너들이 업로드한 패키지를 검사합니다. 데비안 패키저들은 안전한 방법으로 자신들의 패키지를 설정하기 위하여 상당한 주의를 기울입니다. 배포된 패키지에 보안 문제가 발생하면, 상당히 빨리 수정판이 나옵니다. 데비안의 간단한 업데이트 옵션을 이용하여, 인터넷을 통하여 보안 수정판을 자동으로 다운로드하고 설치할 수 있습니다.
pt: Para proteger o seu sistema contra <quote>Cavalos de Tróia</quote> e outro software malévolo, os servidores Debian verificam se os pacotes lá colocados provêm dos seus maintainers Debian registados. Os empacotadores Debian também têm bastante cuidado a configurar os seus pacotes de uma forma segura. Quando aparecem problemas de segurança em pacotes lançados, as correcções geralmente estão disponíveis muito rapidamente. Com a simplicidade das opções de actualização, as correcções de segurança podem ser obtidas e instaladas automaticamente a partir da Internet.
ru: Для защиты вашей системы от <quote>троянских коней</quote> и других вредоносных программ, на серверах Debian выполняется проверка, что поступающие пакеты получены только от зарегистрированных сопровождающих Debian. Также, разработчики Debian заботятся о настройке безопасности программ в своих пакетах. Когда случаются проблемы с безопасностью в выпущенном пакете, обычно очень быстро выходят исправления. С помощью простой системы обновлений Debian исправления безопасности можно загружать и установливать автоматически через Интернет.

source: The primary, and best, method of getting support for your &debian; system and communicating with Debian Developers is through the many mailing lists maintained by the Debian Project (there are more than &num-of-debian-maillists; at this writing). The easiest way to subscribe to one or more of these lists is visit <ulink url="&url-debian-lists-subscribe;"> Debian's mailing list subscription page</ulink> and fill out the form you'll find there.
ko: 여러분의 &debian; 시스템에 대하여 지원을 받고 데비안 개발자들과 연락을 할 수 있는 원시적이고 또 최상의 방법은 데비안 프로젝트에서 관리하는 많은 메일링 리스트(글이 작성된 시점에서 약 &num-of-debian-maillists; 이상)를 이용하는 것입니다. 하나 이상의 메일링 리스트에 가입하는 가장 쉬운 방법은 <ulink url="&url-debian-lists-subscribe;">데비안 메일링 리스트 가입 페이지</ulink>를 방문하여 거기에 나타난 양식을 채우면 됩니다.
pt: O principal, e melhor, método para obter suporte para o seu sistema &debian; é comunicar com Debian Developers através das muitas mailing lists mantidas pelo Debian Project (existem mais de &num-of-debian-maillists; quando isto foi escrito). A forma mais fácil de subscrever uma ou mais destas mailing lists é visitar a <ulink url="&url-debian-lists-subscribe;"> página de subscrição de mailing lists Debian</ulink> e preencher o formulário que vai lá encontrar.
ru: Основным и самым лучшим способом получения поддержки системы &debian; и общения с разработчиками Debian является множество списков рассылки проекта Debian (на момент написания этих строк их было более &num-of-debian-maillists;). Самый простой способ подписаться на один из этих списков &mdash; посетить <ulink url="&url-debian-lists-subscribe;"> страницу подписки на списки рассылки Debian</ulink> и заполнить форму.

source: What is Debian GNU/Hurd?
ko: 데비안 GNU/Hurd란?
pt: O que é Debian GNU/Hurd?
ru: Что такое Debian GNU/Hurd?

source: Debian GNU/Hurd is a Debian GNU system that replaces the Linux monolithic kernel with the GNU Hurd &mdash; a set of servers running on top of the GNU Mach microkernel. The Hurd is still unfinished, and is unsuitable for day-to-day use, but work is continuing. The Hurd is currently only being developed for the i386 architecture, although ports to other architectures will be made once the system becomes more stable.
ko: 데비안 GNU/Hurd는 리눅스 모노리딕 커널을 GNU Hurd로 대치하는 데비안 GNU 시스템으로, GNU 마크 마이크로 커널에서 동작하는 서버의 모음입니다. Hurd는 아직까지 개발이 끝나지 않았고, 매일 사용하기에는 적합하지 않습니다만, 개발은 계속 진행 중입니다. 현재 Hurd는 i386 아키텍춰를 대상으로만 개발중입니다만, 일단 시스템이 더 안정되면 다른 아키텍춰로 포팅될 것입니다.
pt: Debian GNU/Hurd é um sistema Debian GNU que substitui o kernel monolítico Linux pelo GNU Hurd &mdash; um conjunto de servidores que correm em cima do microkernel GNU Mach. O Hurd ainda não está terminado e não é por isso adequado para o uso do dia-a-dia, mas o trabalho continua. Actualmente, o Hurd está apenas a ser desenvolvido para a arquitectura i386, no entanto a conversão para outras arquitecturas será feita assim que o sistema se tornar mais estável.
ru: Debian GNU/Hurd &mdash; это система Debian GNU, в которой монолитное ядро Linux заменено на микроядро GNU Hurd, представляющее собой множество серверов, работающих поверх микроядра GNU Mach. Проект Hurd пока незавершён и непригоден для повседневного использования, но работа продолжается. Сейчас Hurd разработан только для архитектуры i386, однако портирование на другие архитектуры будет сделано как только система станет более стабильной.

source: For more information, see the <ulink url="http://www.debian.org/ports/hurd/"> Debian GNU/Hurd ports page</ulink> and the <email>debian-hurd@lists.debian.org</email> mailing list.
ko: 보다 자세한 정보는 <ulink url="http://www.debian.org/ports/hurd/">Debian GNU/Hurd ports page</ulink>와 <email>debian-hurd@lists.debian.org</email> 메일링 리스트를 참고하시기 바랍니다.
pt: Para mais informações, veja a <ulink url="http://www.debian.org/ports/hurd/">Página do port Debian GNU/Hurd</ulink> e <email>debian-hurd@lists.debian.org</email> que é a mailing list correspondente.
ru: Подробности смотрите на <ulink url="http://www.debian.org/ports/hurd/"> странице Debian GNU/Hurd</ulink> и в списке рассылки проекта <email>debian-hurd@lists.debian.org</email>.

source: Getting Debian
ko: 데비안을 구하는 방법
pt: Obter Debian
ru: Получение Debian

source: For information on how to download &debian; from the Internet or from whom official Debian CDs can be purchased, see the <ulink url="&url-debian-distrib;">distribution web page</ulink>. The <ulink url="&url-debian-mirrors;">list of Debian mirrors</ulink> contains a full set of official Debian mirrors, so you can easily find the nearest one.
ko: 인터넷 또는 공식적인 데비안 CD 판매처로 부터 &debian;을 다운로드하는 방법에 대해서는 <ulink url="&url-debian-distrib;">배포판 웹 페이지</ulink>를 참고하시기 바랍니다. <ulink url="&url-debian-mirrors;">list of Debian mirrors</ulink>에 공식적인 데비안 미러 사이트가 모두 망라되어 있으니, 여러분에게 가장 가까운 곳을 쉽게 찾을 수 있을 것입니다.
pt: Para informação de como fazer o download de &debian; através da Internet ou ainda para saber onde pode comprar os CDs Debian oficiais, veja <ulink url="&url-debian-distrib;">a página da distribuição</ulink>. A <ulink url="&url-debian-mirrors;">lista de mirrors Debian</ulink> contém a lista completa dos mirrors Debian oficiais para que possa facilmente encontrar o mais próximo de si.
ru: Информацию о том, как загрузить &debian; из Интернет или у кого можно купить официальные компакт-диски с Debian, смотрите на <ulink url="&url-debian-distrib;">странице распространения</ulink>. <ulink url="&url-debian-mirrors;">Список серверов-зеркал Debian</ulink> содержит полный перечень официальных зеркал Debian, так что вы можете легко найти ближайший к вам.

source: Debian can be upgraded after installation very easily. The installation procedure will help set up the system so that you can make those upgrades once installation is complete, if need be.
ko: 데비안은 설치 후에도 쉽게 업그레이드 할 수 있습니다. 설치 과정은 시스템 셋업을 도울 것이므로 설치가 완정히 끝나더라도 필요한 경우에는 업그레이드할 수 있습니다.
pt: Debian pode ser facilmente actualizado após a sua instalação. O próprio procedimento de instalação vai ajudar a configurar o sistema para que, caso seja necessário, possam ser feitas essas mesmas actualizações após a instalação estar completa.
ru: После установки Debian может быть легко обновлён. Процедура установки поможет настроить систему так, чтобы вы смогли сделать это обновление после завершения установки, если нужно.

source: Getting the Newest Version of This Document
ko: 이 문서의 최신 버전을 얻는 방법
pt: Obter a Versão Mais Recente Deste Documento
ru: Получение последней версии этого документа

source: This document is constantly being revised. Be sure to check the <ulink url="&url-release-area;"> Debian &release; pages</ulink> for any last-minute information about the &release; release of the &debian; system. Updated versions of this installation manual are also available from the <ulink url="&url-install-manual;">official Install Manual pages</ulink>.
ko: 이 문서는 수시로 교정됩니다. &debian; 시스템의 &release; 릴리즈에 대한 최신 정보에 대해서는 <ulink url="&url-release-area;">Debian &release; pages</ulink>를 확인하기 바랍니다. 이 설치문서의 최신 버전은 <ulink url="&url-install-manual;">official Install Manual pages</ulink>을 통해서도 구할 수 있습니다.
pt: Este documento está constantemente a ser revisto. Assegure-se de que verifica as <ulink url="&url-release-area;">páginas de Debian &release;</ulink> para verificar a existência de informação de última hora acerca do lançamento do sistema &debian; &release;. Versões mais actualizadas deste manual estão também disponíveis nas <ulink url="&url-install-manual;">páginas do Manual de Instalação oficial</ulink>.
ru: Этот документ постоянно обновляется. На <ulink url="&url-release-area;"> странице Debian &release;</ulink> вы найдёте самую свежую информацию о последних изменениях в выпуске &release; системы &debian;. Обновлённые версии этого руководства по установке также доступны на <ulink url="&url-install-manual;">официальных страницах руководства по установке</ulink>.

source: Organization of This Document
ko: 이 문서의 구성
pt: Organização Deste Documento
ru: Структура этого документа

source: This document is meant to serve as a manual for first-time Debian users. It tries to make as few assumptions as possible about your level of expertise. However, we do assume that you have a general understanding of how the hardware in your computer works.
ko: 이 문서는 데비안을 처음 사용하는 분들에게 설명서로 제공하고자 하는 것입니다. 여러분의 경험 수준에 대해서는 가능한 최소한의 가정을 하고자 했습니다. 하지만, 여러분들이 여러분 컴푸터에 장착된 하드웨어가 동작하는 방법에 대해 보편적인 이해를 하고 있다고 가정했습니다.
pt: Este documento tem o propósito de servir como um manual para os que utilizam Debian pela primeira vez. Tenta fazer o mínimo de suposições quanto possível acerca do seu nível de conhecimentos. No entanto, nós assumimos que você tem um bom entendimento geral acerca de como trabalha o hardware no seu computador.
ru: Этот документ может служить руководством для начинающих пользователей Debian. В нём делается несколько предположений о вашем уровне знаний. Однако, мы надеемся, что вы в целом понимаете, как работает апаратная часть (hardware) вашего компьютера.
