Repository: xobs/debian-installer
Catalog: doc/manual/po/*/welcome.po
Languages: ko, pt, ru

source: Expert users may also find interesting reference information in this document, including minimum installation sizes, details about the hardware supported by the Debian installation system, and so on. We encourage expert users to jump around in the document.
ko: 숙련된 사용자들도 이 문서에서 최소 설치 크기나 데비안 설치 시스템에서 지원하는 하드웨어 정보 등등 흥미로운 정보를 찾을 수도 있습니다.
pt: Os utilizadores mais experientes podem também encontrar uma interessante referência de informação neste documento, incluindo os tamanhos para a instalação minima, detalhes acerca do hardware suportado pelo sistema de instalação Debian, e etc. Nós encorajamos os nossos utilizadores avançados a dar uma vista de olhos neste documento.
ru: Опытные пользователи в этом документе смогут найти ссылки на интересную справочную информацию, например минимальные размеры установки, детали о поддержке аппаратных средств системой установки Debian и так далее. Мы призываем опытных пользователей хотя бы пробежаться глазами по документу.

source: In general, this manual is arranged in a linear fashion, walking you through the installation process from start to finish. Here are the steps in installing &debian;, and the sections of this document which correlate with each step:
ko: 전반적으로 이 문서는 설치과정을 거쳐 처음부터 끝까지 따라하도록 구성되어 있습니다. 다음은 &debian;을 설치하는 과정, 그리고 각 단계에 관련한 이 문서의 각 절을 보인 것입니다.
pt: Genericamente, este manual está disposto numa forma linear, acompanhando-o ao longo do processo de instalação desde o início até ao fim. Aqui estão as etapas da instalação de &debian;, e as secções deste documento relacionadas com cada etapa:
ru: Это руководство построено последовательно, оно проведёт вас через процесс установки от начала и до конца. Вот шаги установки &debian; и соответствующие им разделы документа:

source: Determine whether your hardware meets the requirements for using the installation system, in <xref linkend="hardware-req"/>.
ko: 설치 시스템을 사용함에 있어 여러분의 하드웨어가 요구사항을 만족하는 여부를 <xref linkend="hardware-req"/>에서 판단하십시오.
pt: Determinar se o seu hardware cumpre os requisitos para utilizar o sistema de instalação, no <xref linkend="hardware-req"/>.
ru: Определите, соответствует ли ваше аппаратное обеспечение требованиям системы установки (<xref linkend="hardware-req"/>).

source: Backup your system, perform any necessary planning and hardware configuration prior to installing Debian, in <xref linkend="preparing"/>. If you are preparing a multi-boot system, you may need to create partition-able space on your hard disk for Debian to use.
ko: <xref linkend="preparing"/>에서, 데비안을 설치하기에 앞서 여러분의 시스템을 백업하고, 필요한 계획을 세우고 하드웨어를 설정하십시오. 멀티 부팅을 생각하고 있다면, 데비안을 사용하고자 하는 하드디스크에 파티션 가능한 공간을 만들어야 할 수도 있습니다.
pt: Fazer cópias de segurança do seu sistema, executar o planeamento e configuração de hardware necessário antes de instalar Debian, no <xref linkend="preparing"/>. Se você estiver a preparar um sistema multi-boot, pode necessitar de criar espaço particionável no seu disco rígido para ser utilizado por Debian.
ru: Сделайте резервную копию вашей системы, выполните необходимое планирование и настройку аппаратного обеспечения перед установкой Debian (<xref linkend="preparing"/>). Если вы подготавливаете мульти-загрузочную систему, то вам, возможно, понадобится выделить место на жёстком диске под раздел Debian.

source: In <xref linkend="install-methods"/>, you will obtain the necessary installation files for your method of installation.
ko: <xref linkend="install-methods"/>에서 여러분이 결정한 설치 방법에 필요한 설치 화일을 구하게 됩니다.
pt: No <xref linkend="install-methods"/>, você irá obter os ficheiros necessários para o seu método da instalação.
ru: Выбрав способ установки, получите необходимые файлы (<xref linkend="install-methods"/>).

source: describes booting into the installation system. This chapter also discusses troubleshooting procedures in case you have problems with this step.
ko: 설치 시스템으로 부팅하는 방법을 설명합니다. 이 과정에서 문제가 발생한 경우, 문제 해결과정에 대해서도 이 장에서 논의할 것입니다.
pt: descreve o arranque para o sistema de instalação. Este capítulo também discute procedimentos no caso de problemas com esta etapa.
ru: описывает загрузку системы установки. В этом разделе также обсуждается процедура поиска неисправностей при возникновении проблем.

source: Perform the actual installation according to <xref linkend="d-i-intro"/>. This involves choosing your language, configuring peripheral driver modules, configuring your network connection, so that remaining installation files can be obtained directly from a Debian server (if you are not installing from a CD), partitioning your hard drives and installation of minimal working system. (Some background about setting up the partitions for your Debian system is explained in <xref linkend="partitioning"/>.)
ko: <xref linkend="d-i-intro"/>에 따라 실제 설치를 진행합니다. 이 과정은 여러분이 사용하는 언어의 선택, 주변장치 드라이버 모듈 설정, 네트워크 설정, 하드 디스크 분할 과정 그리고 최소 동작 시스템의 설치 과정을 포함합니다. 특히 네트웍이 설정되면, 나머지 설치 화일을 CD로 설치하지 않는 경우 해당하는 화일을 모두 데비안 서버로부터 직접 얻을 수 있습니다. 여러분의 데비안 시스템에 대한 파티션 설정에 관한 것은 <xref linkend="partitioning"/>에 있습니다.
pt: Fazer a instalação de acordo com o <xref linkend="d-i-intro"/>. Isto envolve escolher o seu idioma, configurar módulos de controladores de periféricos, configurar a ligação de rede, de modo que os restantes ficheiros de instalação possam ser obtidos directamente de um servidor Debian (isto se não estiver a instalar por CD), particionar os seus discos rígidos e instalar um sistema minimamente funcional. (Algumas noções de como fazer o particionamento no sistema Debian são explicadas no <xref linkend="partitioning"/>.)
ru: Выполните саму установку (<xref linkend="d-i-intro"/>). Сюда входит выбор языка установки, настройка драйверов периферийных устройств, настройка сетевых соединений для загрузки оставшихся установочных файлов прямо с сервера Debian (если установка производится не с компакт-диска), создание разделов на жёстком диске и установка минимальной работающей системы. (Некоторые советы по настройке разделов для системы Debian можно найти в <xref linkend="partitioning"/>.)

source: Boot into your newly installed base system and run through some additional configuration tasks, from <xref linkend="boot-new"/>.
ko: 새로 설치된 베이스 시스템으로 부팅하고 난 후 <xref linkend="boot-new"/>를 통해 일부 추가 설정 작업을 하십시오.
pt: Arrancar para o seu sistema base acabado de instalar e correr uma série de tarefas de configuração adicionais, a partir do <xref linkend="boot-new"/>.
ru: Загрузитесь в вашу только что установленную базовую систему и выполните несколько дополнительных задач по настройке (<xref linkend="boot-new"/>).

source: Install additional software in <xref linkend="install-packages"/>.
ko: <xref linkend="install-packages"/>에서 부가적인 소프트웨어를 설치하십시오.
pt: Instalar software adicional com a <xref linkend="install-packages"/>.
ru: Установите дополнительные программы (<xref linkend="install-packages"/>).

source: Once you've got your system installed, you can read <xref linkend="post-install"/>. That chapter explains where to look to find more information about Unix and Debian, and how to replace your kernel.
ko: 일단 시스템이 설치되었으면, <xref linkend="post-install"/>를 읽으셔도 됩니다. 이 장은 유닉스와 데비안에 대하여 더 많은 정보을 얻을 수 있는 곳과, 커널을 교체하는 방법을 설명하고 있습니다.
pt: Assim que tiver o seu sistema instalado, você pode ler o <xref linkend="post-install"/>. Esse capítulo explica onde pode encontrar mais informações acerca de Debian e de Unix, e como substituir o seu kernel.
ru: После установки системы вы можете почитать <xref linkend="post-install"/>. В ней рассказывается о том, где найти дополнительную информации о Unix и Debian, и как заменить ядро.

source: Finally, information about this document and how to contribute to it may be found in <xref linkend="administrivia"/>.
ko: 마지막으로, 이 문서에 대한 정보와 기여방법에 대해서는 <xref linkend="administrivia"/>에서 찾을 수 있습니다.
pt: Finalmente, informação acerca deste documento e de como contribuir para ele pode ser encontrada no <xref linkend="administrivia"/>.
ru: И наконец, информацию об этом документе и как помочь его развитию, можно найти в <xref linkend="administrivia"/>.

source: Your Documentation Help is Welcome
ko: 문서에 대한 여러분의 도움은 언제라도 환영합니다.
pt: A Sua Ajuda na Documentação é Bem-vinda
ru: Помогите нам с документацией!

source: Any help, suggestions, and especially, patches, are greatly appreciated. Working versions of this document can be found at <ulink url="&url-d-i-alioth-manual;"></ulink>. There you will find a list of all the different architectures and languages for which this document is available.
ko: 어떤 형태의 도움, 제안, 그리고 특히 패치에 대하여 깊이 감사드립니다. 이 문서의 작업 버전은 <ulink url="&url-d-i-alioth-manual;"></ulink>에 있습니다. 여기서 다른 아키텍춰와 다른 언어에 대한 이 문서의 리스트도 찾을 수 있습니다.
pt: Qualquer ajuda, sugestões, e especialmente, correcções, são muito apreciadas. Versões de trabalho deste documento podem ser encontradas no <ulink url="&url-d-i-alioth-manual;"></ulink>. Lá você irá encontrar uma lista de diferentes arquitecturas e idiomas para os quais está disponível este documento.
ru: Мы с радостью примем любого рода помощь, предложения и особенно поправки. Рабочая версия этого документа находится по адресу <ulink url="&url-d-i-alioth-manual;"></ulink>. Там же вы найдёте список всех архитектур, для которых существует этот документ и переводы на другие языки.

source: Source is also available publicly; look in <xref linkend="administrivia"/> for more information concerning how to contribute. We welcome suggestions, comments, patches, and bug reports (use the package &d-i-manual; for bugs, but check first to see if the problem is already reported).
ko: 소스 역시 개방되어 있으며, <xref linkend="administrivia"/>를 보시면 기여하는 방법에 관하여 더 많은 정보를 얻을 수 있습니다. 제안, 조언, 패치 그리고 버그 리포트는 항상 환영합니다. 버그에 대해서는 &d-i-manual;을 이용하시고, 해당 문제가 이미 보고된 것인지 먼저 확인하시기 바랍니다.
pt: O código fonte também está disponível publicamente; veja em <xref linkend="administrivia"/> para mais informação sobre como contribuir. Nós agradecemos sugestões, comentários, patches, e relatórios de erros (utilize o pacote &d-i-manual; para bugs, mas verifique primeiro se o erro já foi relatado).
ru: Исходный текст этого документа доступен любому желающему. <xref linkend="administrivia"/> содержит информацию о возможном содействии. Если у вас есть предложения, комментарии, конкретные корректировки или сообщения об ошибках, сообщайте нам! Все ошибки желательно заносить в систему отслеживания ошибок на имя пакета &d-i-manual;, но сначала проверьте, что об этой ошибке уже не сообщил кто-то другой.

source: About Copyrights and Software Licenses
ko: 저작권과 소프트웨어 라이선스에 대하여
pt: Acerca de Direitos de Cópia e Licenças de Software
ru: Об авторских правах и лицензиях на программы

source: We're sure that you've read some of the licenses that come with most commercial software &mdash; they usually say that you can only use one copy of the software on a single computer. This system's license isn't like that at all. We encourage you to put a copy of on every computer in your school or place of business. Lend your installation media to your friends and help them install it on their computers! You can even make thousands of copies and <emphasis>sell</emphasis> them &mdash; albeit with a few restrictions. Your freedom to install and use the system comes directly from Debian being based on <emphasis>free software</emphasis>.
ko: 여러분들은 대부분의 상용 소프트웨어에 따라오는 라이선스를 읽어 본 적이 있을 것입니다. 그런 라이선스들은 보통 하나의 컴퓨터에 한 카피만 사용하도록 규정하고 있습니다. 데비안 시스템의 라이선스는 이들과 전혀 다릅니다. 여려분의 학교나 회사의 모든 컴퓨터에 설치할 것을 권장합니다. 설치 미디어를 여러분들의 친구에게 빌려주고 컴퓨터에 설치하는 것을 도와주십시오! 수천장을 복사하고, <emphasis>판매</emphasis>하십시오 &mdash; 약간 제한이 있습니다. <emphasis>자유 소프트웨어</emphasis>를 기반으로 하는 데비안이기 때문에 여러분들은 시스템을 설치하고 사용함에 있어 자유롭습니다.
pt: Nós temos a certeza que você já leu algumas das licenças que vêm com a maioria do software comercializado &mdash; estas geralmente dizem que você só pode utilizar uma cópia do software num único computador. A licença deste sistema não é mesmo nada como essas. Nós encorajamo-lo a colocar uma cópia em cada computador da sua escola ou local de trabalho. Empreste o meio de instalação aos seus amigos e ajude-os a instalar nos seus computadores! Você pode mesmo fazer milhares de cópias e <emphasis>vendê-las</emphasis>&mdash; embora com algumas restrições. A sua liberdade de instalar e utilizar o sistema vem directamente de Debian ser baseado em <emphasis>software livre</emphasis>.
ru: Мы уверены, что вы читали некоторые лицензии, на условиях которых распространяется большинство коммерческих программ &mdash; обычно в них говорится, что вы можете использовать только одну копию программы на одном компьютере. Лицензия этой системы совсем не такая. Мы предлагаем вам установить копию на каждый компьютер в вашей школе или на работе. Дайте ваши установочные носители друзьям и помогите им поставить систему на их компьютеры! Вы даже можете сделать тысячи копий и <emphasis>продавать</emphasis> их &mdash; хотя и с некоторыми ограничениями. Ваша свобода ставить и использовать систему происходит непосредственно из-за того, что Debian основан на <emphasis>свободном программном обеспечении</emphasis>.

source: Calling software <emphasis>free</emphasis> doesn't mean that the software isn't copyrighted, and it doesn't mean that CDs containing that software must be distributed at no charge. Free software, in part, means that the licenses of individual programs do not require you to pay for the privilege of distributing or using those programs. Free software also means that not only may anyone extend, adapt, and modify the software, but that they may distribute the results of their work as well.
ko: 소프트웨어를 <emphasis>자유</emphasis>라고 부르는 것은 소프트웨어의 저작권이 없다는 것이 아니며, 자유 소프트웨어를 배포하는 CD는 반드시 무료라는 것이 아닙니다. 자유소프트웨어는 개개의 프로그램의 라이선스가 배포나 사용에 대하여 대가를 지불할 필요가 없다는 것을 부분적으로 의미합니다. 자유 소스트웨어는 누구라도 소프트웨어를 확장하고, 개작하고, 수정할 수 있을 뿐만 아니라, 그 결과를 배포할 수 있다는 것을 의미합니다.
pt: Chamar ao software <emphasis>livre</emphasis> não significa que o software não tem direitos de cópia, e não significa que os CDs que contêm o software tenham de ser distribuídos sem encargos. Software livre, em parte, significa que as licenças dos programas individuais não necessitam que você pague pelo privilégio de distribuir e correr esses programas. Software livre também significa que qualquer um pode estender, adaptar, e modificar o software, mas eles podem também distribuir os resultados do seu trabalho.
ru: Хотя программы и называются <emphasis>свободными</emphasis>, это не означает, что программы не защищены авторскими правами, и это не означает, что компакт-диски, содержащие эти программы, должны распространяться бесплатно. Свободное программное обеспечение, в частности, означает, что лицензии отдельных программ не требуют оплаты за привилегию распространять или использовать эти программы. Свободное программное обеспечение также означает, что кто угодно может не только расширять, адаптировать и изменять программы, но также и распространять результаты своей работы.

source: The Debian project, as a pragmatic concession to its users, does make some packages available that do not meet our criteria for being free. These packages are not part of the official distribution, however, and are only available from the <userinput>contrib</userinput> or <userinput>non-free</userinput> areas of Debian mirrors or on third-party CD-ROMs; see the <ulink url="&url-debian-faq;">Debian FAQ</ulink>, under <quote>The Debian FTP archives</quote>, for more information about the layout and contents of the archives.
ko: 데비아 사용자의 실질적인 사용권에 있어, 자유라고 하는 데비안 범주에 맞지 않는 일부 패키지를 데비안 프로젝트에 포함했다는 것을 알려 드립니다. 하지만, 이런 패키지는 공식적인 배포에 포함된 것은 아니므로, 데비안 미러나 제3자 CD의 <userinput>contrib</userinput>이나 <userinput>non-free</userinput>에서 찾을 수 있습니다. 아카이브의 구성과 내용에 대해서는 <quote>The Debian FTP archives</quote>의 <ulink url="&url-debian-faq;">Debian FAQ</ulink>를 참고하기 바랍니다.
pt: O projecto Debian, como concessão pragmática aos seus utilizadores, torna disponíveis alguns pacotes que não preenchem os nossos critérios para serem livres. Esses pacotes não são parte da distribuição oficial, no entanto, estão apenas disponíveis das áreas <userinput>contrib</userinput> ou <userinput>non-free</userinput> dos mirrors Debian ou em CDs de terceiros; veja o <ulink url="&url-debian-faq;">Debian FAQ</ulink>, sob <quote>os arquivos FTP de Debian</quote>, para mais informação acerca da disposição e conteúdo dos arquivos.
ru: Заметьте, что проект Debian, уступая требованиям пользователей, сделал некоторые пакеты доступными, хотя они и не отвечают нашим критериям свободы. Однако, эти пакеты не являются частью официального дистрибутива, и доступны только из областей <userinput>contrib</userinput> или <userinput>non-free</userinput> серверов-зеркал Debian или на неофициальных компакт-дисках; более подробную информацию о расположении и содержании архивов смотрите в разделе <quote>FTP-архивы Debian</quote> в <ulink url="&url-debian-faq;">Debian FAQ</ulink>.

source: Many of the programs in the system are licensed under the <emphasis>GNU</emphasis> <emphasis>General Public License</emphasis>, often simply referred to as <quote>the GPL</quote>. The GPL requires you to make the <emphasis>source code</emphasis> of the programs available whenever you distribute a binary copy of the program; that provision of the license ensures that any user will be able to modify the software. Because of this provision, the source code<footnote> <para> For information on how to locate, unpack, and build binaries from Debian source packages, see the <ulink url="&url-debian-faq;">Debian FAQ</ulink>, under <quote>Basics of the Debian Package Management System</quote>. </para> </footnote> for all such programs is available in the Debian system.
ko: 시스템의 다수의 프로그램은 흔히 <quote>GPL</quote>로 알려진 <emphasis>GNU</emphasis> <emphasis> General Public License</emphasis>를 따릅니다. GPL은 프로그램의 바이너리를 배포할 때 <quote>소스</quote>를 같이 제공할 것을 요구합니다. 즉, 누구라도 소프트웨어를 수정할 수 있도록 하고자 하는 것이 이 라이선스의 규정입니다. 데비안 시스템에서 사용가능한 모든 프로그램을 위한 <footnote><para>데비안 소스 패키지를 찾고 압축을 풀고, 바이너리 를 생성하는 방법에 대한 정보는 <quote>데비안 패키지 관리 시스템의 기초</quote>에 있는 <ulink url="&url-debian-faq;">Debian FAQ</ulink>를 보십시오</para></footnote>
pt: Muitos dos programas no sistema são licenciados sob a <emphasis>GNU</emphasis> <emphasis>General Public License</emphasis>, muitas vezes referida como a <quote>GPL</quote>. A GPL requer que você torne o <emphasis>código fonte</emphasis> dos programas disponível quando você distribuir uma cópia do binário do programa; essa medida da licença assegura que qualquer utilizador possa modificar o software. Devido a esta medida, o código fonte <footnote> <para> Para informação acerca de como localizar, desempacotar, e construir binários a partir de pacotes Debian de código fonte, veja o <ulink url="&url-debian-faq;">Debian FAQ</ulink>, sob <quote>Basics of the Debian Package Management System</quote>. </para> </footnote> para todos esses programas estão disponíveis no sistema Debian.
ru: Большинство программ в системе выпущено под <emphasis>Стандартной Общественной Лицензией</emphasis> <emphasis>GNU</emphasis> , часто называемой просто <quote>GPL</quote>. Лицензия GPL требует от вас сделать <emphasis>исходный код</emphasis> программ доступным, если вы распространяете бинарную копию программы; это условие лицензии даёт гарантию, того что любой пользователь сможет изменять программу. Согласно этому положению, в системе Debian доступен исходный код<footnote> <para> Информацию о том как найти, распаковать и собрать бинарные программы из исходных кодов Debian, смотрите в <ulink url="&url-debian-faq;">Debian FAQ</ulink>, в разделе <quote>Основы системы управления пакетами Debian</quote>. </para> </footnote> всех таких программ доступен.

source: There are several other forms of copyright statements and software licenses used on the programs in Debian. You can find the copyrights and licenses for every package installed on your system by looking in the file <filename>/usr/share/doc/<replaceable>package-name</replaceable>/copyright </filename> once you've installed a package on your system.
ko: 데비안의 프로그램에 사용한 사용권리와 소프트웨어 라이선스는 몇가지 다른 형태가 있습니다. 여러분의 시스템에 패키지가 설치되면 <filename>/usr/share/doc/<replaceable>package-name</replaceable>/copyright</filename>을 보면 해당 패키지의 권리와 라이선스를 찾을 수 있습니다.
pt: Existem algumas outras formas de afirmação de direitos de cópia e licenças de software utilizadas nos programas em Debian. Você pode encontrar os direitos de cópia e licenças para cada pacote instalado no seu sistema simplesmente vendo o ficheiro <filename>/usr/share/doc/<replaceable>nome-do-pacote</replaceable>/copyright</filename> depois de instalar um pacote no seu sistema.
ru: Программы в Debian доступны по нескольким соглашениям об авторских правах и программных лицензий. Сразу после установки в систему, лицензия на пакет сохраняется в файле <filename>/usr/share/doc/<replaceable>имя-пакета</replaceable>/copyright </filename>.

source: For more information about licenses and how Debian determines whether software is free enough to be included in the main distribution, see the <ulink url="&url-dfsg;">Debian Free Software Guidelines</ulink>.
ko: 라이선스와, 소프트웨가 메인 배포판에 포함할 수 있을 정도로 자유로운 지를 결정하는 방법에 대해서는, <ulink url="&url-dfsg;">데비안 자유소프트웨어 지침서</ulink>를 참고하시기 바랍니다.
pt: Para mais informação acerca das licenças e de como Debian determina se o software é suficientemente livre para ser incluído na distribuição principal, veja as <ulink url="&url-dfsg;">Debian Free Software Guidelines</ulink>.
ru: Более полную информацию о лицензиях и о том, как Debian определяет, является ли программа достаточно свободной, чтобы быть включённой в основную (main) часть дистрибутива, смотрите в <ulink url="&url-dfsg;">критериях Debian для свободного программного обеспечения</ulink>.

source: The most important legal notice is that this software comes with <emphasis>no warranties</emphasis>. The programmers who have created this software have done so for the benefit of the community. No guarantee is made as to the suitability of the software for any given purpose. However, since the software is free, you are empowered to modify that software to suit your needs &mdash; and to enjoy the benefits of the changes made by others who have extended the software in this way.
ko: 가장 중요한 법적인 고지는, 자유소프트웨어는 <emphasis>어떠한 보증도 하지 않는다</emphasis>는 것입니다. 이런 소프트웨어를 만든 프로그래머는 공동체의 이익을 위해 만든 것입니다. 어떤 목적에 대해서도 소프트웨어의 적합성을 보장하지 않습니다. 하지만, 소프트웨어가 자유이기 때문에 여러분에 목적에 맞게 포스트웨어를 수정하는 권리는 여러분에 있습니다. 또한 이런 방법으로 다른 사람이 소프트웨어를 확장하여 생긴 변화로 얻은 이익을 누릴 권리도 여러분에게 있습니다.
pt: O aviso legal mais importante é que o software vem <emphasis>sem nenhuma garantia</emphasis>. Os programadores que criaram este software fizeram-no em benefício da comunidade. Nenhumas garantias são feitas acerca da adequação do software para um determinado propósito. No entanto, como o software é livre, você está autorizado a modificar o software para adaptá-lo às suas necessidades &mdash; e para gozar dos benefícios das alterações feitas por outros que estenderam o software dessa forma.
ru: Самое важное юридическое замечание &mdash; программное обеспечение поставляется <emphasis>без гарантий</emphasis>. Программисты, создавшие программу, сделали это на пользу обществу. Не даётся никаких гарантий о пригодности поставляемого программного обеспечения для каких-то определённых целей. Однако, поскольку программное обеспечение свободно, вы вольны модицифировать программу для достижения необходимых вам целей &mdash; и наслаждаться выгодами изменений, сделанных другими людьми, которые расширили возможности программы тем же путем.
