Repository: xobs/debian-installer
Catalog: doc/manual/po/*/welcome.po
Languages: ko, pt, ru

source: Welcome to Debian
ko: 데비안에 오신 것을 환영합니다.
pt: Bem-vindo a Debian
ru: Добро пожаловать в Debian

source: This chapter provides an overview of the Debian Project and &debian;. If you already know about the Debian Project's history and the &debian; distribution, feel free to skip to the next chapter.
ko: 이 장에서는 데비안 프로젝트와 &debian;에 대하여 간략히 설명하려고 합니다. 데비안 프로젝트와 &debian; 배포판에 대하여 이미 알고 있는 분들은 다음 장을 읽으셔도 됩니다.
pt: Este capítulo pretende dar a conhecer, de uma forma geral, o Debian Project e &debian;. Se já conhece a história do Debian Project e a distribuição &debian;, pode tomar a liberdade de avançar para o próximo capítulo.
ru: Эта глава посвящена обзору проекта Debian и &debian;. Если вы уже знаете историю проекта Debian и дистрибутива &debian;, спокойно переходите к следующей главе.

source: What is Debian?
ko: 데비안이란?
pt: O que é Debian?
ru: Что такое Debian?

source: Debian is an all-volunteer organization dedicated to developing free software and promoting the ideals of the Free Software Foundation. The Debian Project began in 1993, when Ian Murdock issued an open invitation to software developers to contribute to a complete and coherent software distribution based on the relatively new Linux kernel. That relatively small band of dedicated enthusiasts, originally funded by the <ulink url="&url-fsf-intro;">Free Software Foundation</ulink> and influenced by the <ulink url="&url-gnu-intro;">GNU</ulink> philosophy, has grown over the years into an organization of around &num-of-debian-developers; <firstterm>Debian Developers</firstterm>.
ko: 데비안은 자유소프트웨어를 개발하고 자유 소프트웨어 재단(FSF)의 이상을 실현하기 위하여 전념하는 자원 봉사 조직입니다. 데비안 프로젝트는 1993년, Ian Murdock이 비교적 새로운 리눅스 커널에 기반을 둔 완전하고 일관된 소프트웨어 배포에 공헌할 수 있도록 소프트웨어 개발자들을 공개적으로 모으면서 시작되었습니다.최초에는 FSF의 지원을 받고 GNU 철학에 영향을 받은 비교적 소수의 열정적인 집단이었지만, 해를 거듭할 수록 &num-of-debian-developers;여 명의 <firstterm>Debian Developer(DD:데비안 개발자)</firstterm>가 참여하는조직으로 성장해 왔습니다.
pt: Debian é uma organização exclusivamente de voluntários dedicada ao desenvolvimento de software livre e a promover os ideais da Free Software Foundation. O Debian Project começou em 1993, quando Ian Murdock lançou um convite aberto a programadores de software para contribuírem para uma distribuição de software completa e coerente baseada no relativamente novo kernel Linux. Esse relativamente pequeno grupo de entusiastas dedicados, originalmente com fundos da <ulink url="&url-fsf-intro;">Free Software Foundation</ulink> e influenciados pela filosofia <ulink url="&url-gnu-intro;">GNU</ulink>, cresceu com o passar dos anos para uma organização com cerca de &num-of-debian-developers; <firstterm>Debian Developers</firstterm>.
ru: Debian &mdash; это полностью добровольная организация, посвятившая себя разработке свободного программного обеспечения и распространению идеалов Фонда Свободного Программного Обеспечения (Free Software Foundation). Проект Debian начался в 1993 году, когда Иэн Мэрдок (Ian Murdock) выпустил открытое приглашение к разработчикам программ внести свой вклад в полноценный программный дистрибутив, основанный на относительно новом ядре Linux. Небольшая группа энтузиастов, на которых повлияла философия <ulink url="&url-gnu-intro;">GNU</ulink>, изначально поддерживаемая <ulink url="&url-fsf-intro;">Фондом Свободного Программного Обеспечения</ulink>, с годами выросла в организацию, насчитывающую приблизительно &num-of-debian-developers; <firstterm>разработчиков Debian</firstterm>.

source: Debian Developers are involved in a variety of activities, including <ulink url="&url-debian-home;">Web</ulink> and <ulink url="&url-debian-ftp;">FTP</ulink> site administration, graphic design, legal analysis of software licenses, writing documentation, and, of course, maintaining software packages.
ko: 데비안 개발자는 <ulink url="&url-debian-home;">Web</ulink>과 <ulink url="&url-debian-ftp;">FTP</ulink> 사이트 관리, 그래픽 디자인, 소프트웨어 라이선스의 법률적 해석, 문서 작성, 및 소프트웨어 패키지 관리를 포함하여 다양한 활동에 참여합니다.
pt: Os Debian Developers estão envolvidos numa série de actividades, incluindo a administração do site <ulink url="&url-debian-home;">Web</ulink> e do arquivo <ulink url="&url-debian-ftp;">FTP</ulink>, design gráfico, análise legal de licenças de software, escrever documentação, e, claro, manter pacotes de software.
ru: Разработчики Debian выполняют различные задачи, включая администрирование <ulink url="&url-debian-home;">Web</ulink> и <ulink url="&url-debian-ftp;">FTP</ulink> сайтов, графический дизайн, юридический анализ программных лицензий, написание документации и, конечно же, сопровождение пакетов.

source: In the interest of communicating our philosophy and attracting developers who believe in the principles that Debian stands for, the Debian Project has published a number of documents that outline our values and serve as guides to what it means to be a Debian Developer:
ko: 우리의 철학을 전하고 데비안이 지지하는 원칙을 믿는 개발자들을 끌어 모으기 위하여, 데비안 프로젝트는 다수의 문서를 발표하였으며 이는 우리의 가치에 대하여 개략적으로 서술하고 데비안 개발자가 되는 것이 무엇을 말하는 것인지에 대한 지침이 됩니다.
pt: No interesse de comunicar a nossa filosofia e atrair developers que acreditem nos princípios que Debian defende, o Debian Project publicou uma série de documentos que sublinham os nossos valores e servem de guia ao que significa ser um Debian Developer:
ru: В интересах распространения нашей философии и привлечения разработчиков, которые верят в принципы Debian, проект Debian выпустил множество документов, которые подчёркивают наши ценности и рассказывают, что значит быть разработчиком Debian:

source: The <ulink url="&url-social-contract;">Debian Social Contract</ulink> is a statement of Debian's commitments to the Free Software Community. Anyone who agrees to abide to the Social Contract may become a <ulink url="&url-new-maintainer;">maintainer</ulink>. Any maintainer can introduce new software into Debian &mdash; provided that the software meets our criteria for being free, and the package follows our quality standards.
ko: <ulink url="&url-social-contract;">Debian Social Contract(데비안 사회 규약)</ulink>이라고 하는 것은 자유소프트웨어 공동체(Free Software Community)에 대한 데비안의 관여를 지칭하는 것입다. 사회규약을 지키기로 동의한 사람은 누구나 <ulink url="&url-new-maintainer;">maintainer(메인터너)</ulink>가 될 수있습니다. 어떤 메인터너든지 새로운 소프트웨어를 데비안에 추가할 수 있습니다. &mdash; 그 소프트웨어가 자유이고, 패키지가 우리의 품질 기준에 적합해야 한다는 기준을 만족해야 합니다.
pt: O <ulink url="&url-social-contract;">Debian Social Contract</ulink> é um comunicado do que Debian se compromete perante a comunidade de software livre. Quem quer que aceite seguir o Social Contract pode tornar-se um <ulink url="&url-new-maintainer;">maintainer</ulink>. Qualquer maintainer pode introduzir novo software em Debian &mdash; desde que o software siga os nossos critérios acerca de ser livre, e o pacote siga os nossos standards de qualidade.
ru: <ulink url="&url-social-contract;">Общественный Договор Debian</ulink> &mdash; это утверждение обязательств Debian перед Сообществом Свободного Программного Обеспечения. Любой, кто соглашается следовать Общественному Договору Debian может стать <ulink url="&url-new-maintainer;">сопровождающим</ulink>. Любой сопровождающий может добавить новые программы в Debian &mdash; при условии, что программы соответствуют нашим критериям свободы, а пакеты следуют нашим стандартам качества.

source: The <ulink url="&url-dfsg;">Debian Free Software Guidelines</ulink> are a clear and concise statement of Debian's criteria for free software. The DFSG is a very influential document in the Free Software Movement, and was the foundation of the <ulink url="&url-osd;">The Open Source Definition</ulink>.
ko: <ulink url="&url-dfsg;">Debian Free Software Guidelines</ulink>는 자유소프트웨어에 대한 데비안의 기준을 단순명료하게 서술한 것입니다. DFSG는 자유소프트웨어 운동에 있어서 매우 영향력 있는 문서로, <ulink url="&url-osd;">The Open Source Definition(오픈 소스의 정의)</ulink>에 대한 근간이 되었습니다.
pt: As <ulink url="&url-dfsg;">Debian Free Software Guidelines</ulink> são uma afirmação clara e concisa acerca dos critérios de Debian para o software livre. A DFSG é um documento muito influente no movimento de software livre, e foi a fundação para a <ulink url="&url-osd;">The Open Source Definition</ulink>.
ru: <ulink url="&url-dfsg;"> Критерии Debian по определению Свободного Программного Обеспечения (DFSG)</ulink> &mdash; это краткие и ясные определения критериев Debian к свободным программам. DFSG является очень влиятельным документом в Движении Свободного Программного Обеспечения и взят за основу <ulink url="&url-osd;"> Определения Открытых Исходных Текстов</ulink>.

source: The <ulink url="&url-debian-policy;">Debian Policy Manual</ulink> is an extensive specification of the Debian Project's standards of quality.
ko: <ulink url="&url-debian-policy;">데비안 정책 매뉴얼</ulink>은 데비안 프로젝트의 품질 표준을 상세하게 정의한 것입니다.
pt: O <ulink url="&url-debian-policy;">Debian Policy Manual</ulink> é uma especificação extensiva dos standards de qualidade do Debian Project.
ru: <ulink url="&url-debian-policy;">Руководство по политике Debian</ulink> &mdash; это обширная спецификация стандартов качества проекта Debian.

source: Debian developers are also involved in a number of other projects; some specific to Debian, others involving some or all of the Linux community. Some examples include:
ko: DD는 다수의 프로젝트에 참가할 수 있습니다. 즉, 일부는 데비안 고유에, 또 다른 사람들은 일부 또는 모든 리눅스 공동체에 참가하기도 합니다. 예를 들어 보면,
pt: Os Debian Developers também estão envolvidos num número de outros projectos; alguns específicos de Debian, outros envolvendo alguma ou toda a comunidade Linux. Alguns exemplos incluem:
ru: Разработчики Debian также вовлечены и в другие проекты, некоторые из которых созданы специально для Debian, другие выполняются для части или для всего сообщества Linux. Вот несколько примеров:

source: The <ulink url="&url-lsb-org;">Linux Standard Base</ulink> (LSB) is a project aimed at standardizing the basic GNU/Linux system, which will enable third-party software and hardware developers to easily design programs and device drivers for Linux-in-general, rather than for a specific GNU/Linux distribution.
ko: <ulink url="&url-lsb-org;">Linux Standard Base(LSB)</ulink>는 기본 GNU/Linux 시스템을 표준화하기 위한 프로젝트로, 3rd party 소프트웨어와 하드웨어 개발자들이 특정 GNU/Linux 배포판이 아닌 일반적인 Linux에 대한 프로그램과 디바이스 드라이버를 쉽게 설계하도록 하기 위한 것입니다.
pt: A <ulink url="&url-lsb-org;">Linux Standard Base</ulink> (LSB) é um projecto orientado para a estandardização do sistema básico GNU/Linux, a qual permite a outros criadores de software e de hardware facilmente desenhar programas e controladores de dispositivos para Linux em geral, em vez de o fazerem para uma distribuição específica de GNU/Linux.
ru: Проект <ulink url="&url-lsb-org;">База Стандартов Linux</ulink> (LSB) нацелен на стандартизацию базовой системы GNU/Linux, что позволит сторонним разработчикам программного обеспечения и оборудования легко разрабатывать программы и драйверы устройств для Linux в целом, а не для конкретного дистрибутива GNU/Linux.

source: The <ulink url="&url-fhs-home;">Filesystem Hierarchy Standard</ulink> (FHS) is an effort to standardize the layout of the Linux file system. The FHS will allow software developers to concentrate their efforts on designing programs, without having to worry about how the package will be installed in different GNU/Linux distributions.
ko: <ulink url="&url-fhs-home;">Filesystem Hierarchy Standard(FHS)</ulink>는 리눅스 화일 시스템의 레이아웃을 표준화하기 위한 것으로, 소프트웨어 개발자들이 개발한 패키지가 서로 다른 GNU/Linux 배포판에 어떻게 설치되는 지에 대해 고민할 필요 없이 개발자 자신은 프로그램 설계에만 전념할 수 있도록 하기 위한 것입니다.
pt: O <ulink url="&url-fhs-home;">Filesystem Hierarchy Standard</ulink> (FHS) é um esforço para estandardizar a organização do sistema de ficheiros em Linux. O FHS vai permitir aos criadores de software concentrarem os seus esforços em problemas de design, sem terem de se preocupar como o pacote irá ser instalado nas diferentes distribuições de GNU/Linux.
ru: <ulink url="&url-fhs-home;">Стандарт Иерархии Файловой Системы</ulink> (FHS) &mdash; это попытка стандартизировать организацию файловой системы Linux. Стандарт FHS позволит разработчикам программ сконцентрировать свои усилия на создании программы и не беспокоиться о том, как пакет будет устанавливаться в различные дистрибутивы GNU/Linux.

source: <ulink url="&url-debian-jr;">Debian Jr.</ulink> is an internal project, aimed at making sure Debian has something to offer to our youngest users.
ko: <ulink url="&url-debian-jr;">Debian Jr.</ulink>는 내부 프로젝트로 어린 사용자들에게 제공하기 위한 것입니다.
pt: <ulink url="&url-debian-jr;">Debian Jr.</ulink> é um projecto interno, que se destina a assegurar que Debian tem algo a oferecer aos nossos utilizadores mais novos.
ru: Внутренний проект <ulink url="&url-debian-jr;">Debian для детей</ulink>, его цель &mdash; уверенность в том, что Debian'у есть что предложить нашим младшим пользователям.

source: For more general information about Debian, see the <ulink url="&url-debian-faq;">Debian FAQ</ulink>.
ko: 데비안에 대하여 보다 일반적인 것은 <ulink url="&url-debian-faq;">데비안 FAQ</ulink>를 참고하기 바랍니다.
pt: Para mais informações gerais sobre Debian, veja o <ulink url="&url-debian-faq;">Debian FAQ</ulink>.
ru: Для более общей информации о Debian, смотрите <ulink url="&url-debian-faq;">Debian FAQ</ulink>.

source: What is GNU/Linux?
ko: GNU/Linux라는 것은?
pt: O que é GNU/Linux?
ru: Что такое GNU/Linux?

source: Linux is an operating system: a series of programs that let you interact with your computer and run other programs.
ko: 리눅스는 운영 체계로, 사용자가 자신의 컴퓨터와 상호작용을 하도록 하며 또, 다른 프로그램을 실행시키는 일련의 프로그램입니다.
pt: Linux é um sistema operativo: uma série de programas que o deixam interagir com o seu computador e correr outros programas.
ru: Linux &mdash; это операционная система: набор программ, которые позволяют вам работать с вашим компьютером и запускать другие программы.

source: An operating system consists of various fundamental programs which are needed by your computer so that it can communicate and receive instructions from users; read and write data to hard disks, tapes, and printers; control the use of memory; and run other software. The most important part of an operating system is the kernel. In a GNU/Linux system, Linux is the kernel component. The rest of the system consists of other programs, many of which were written by or for the GNU Project. Because the Linux kernel alone does not form a working operating system, we prefer to use the term <quote>GNU/Linux</quote> to refer to systems that many people casually refer to as <quote>Linux</quote>.
ko: 운영체계는 사용자의 컴퓨터에 필요한 다수의 기본적인 프로그램으로 구성되어 있기 때문에, 사용자와 의사소통을 하거나 사용자로부터 지시를 받습니다. 이를 테면, 하드 디스크, 테이프 또는 프린터로 데이터를 내보내거나 읽어들이며, 메모리의 사용을 제어하며, 다른 프로그램을 기동시킵니다. 이러한 운영체제의 가장 중요한 부분이 바로 커널이며, GNU/Linux 시스템에 있어서 Linux는 커널입니다. 시스템의 나머지 부분은 다른 프로그램으로 구성되며, 대부분 GNU 프로젝트에 의해 작성된 것들입니다. Linux 커널 그 자체로는 시스템을 구성할 수 없기 때문에, 흔히들 Linux라고 호칭하는 시스템을 GNU/Linux라는 명칭으로 사용하시기를 바랍니다.
pt: O seu sistema operativo consiste em vários programas fundamentais que são necessários ao seu computador de modo a que possa comunicar e receber instruções dos utilizadores; ler e escrever dados em discos rígidos, tapes, e impressoras; controlar a utilização da memória; e correr outro software. A parte mais importante de um sistema operativo é o kernel. Num sistema GNU/Linux, o componente do kernel é o Linux. O resto do sistema consiste noutros programas, muitos dos quais escritos por ou para o GNU Project. Por o kernel sozinho não formar um sistema operativo utilizável, nós preferimos utilizar o termo <quote>GNU/Linux</quote> para nos referirmos aos sistemas a que muitas pessoas vulgarmente chamam de <quote>Linux</quote>.
ru: Операционная система (ОС) состоит из нескольких основных программ, которые нужны вашему компьютеру, чтобы он мог общаться и получать инструкции от пользователей; читать и записывать данные на жёсткие диски, ленты и принтеры; контролировать использование памяти; запускать другие программы. Самая важная часть ОС &mdash; ядро. В системе GNU/Linux ядром является Linux. Оставшаяся часть системы состоит из других программ, многие из которых написаны проектом GNU или для проекта GNU. Поскольку одно ядро Linux &mdash; это ещё не вся работающая ОС, мы предпочитаем использовать термин <quote>GNU/Linux</quote> для обозначения систем, которые многие люди ошибочно называют <quote>Linux</quote>.

source: Linux is modelled on the Unix operating system. From the start, Linux was designed to be a multi-tasking, multi-user system. These facts are enough to make Linux different from other well-known operating systems. However, Linux is even more different than you might imagine. In contrast to other operating systems, nobody owns Linux. Much of its development is done by unpaid volunteers.
ko: Linux는 Unix 운영체계를 모델로 한 것으로, 애초부터 리눅스는 멀티 태스킹, 멀티 유저 시스템으로 설계되었습니다. 이러한 사실로 리눅스를 여타의 유명한 운영체계와 충분히 차별화 시킬 수 있습니다. 그러나, Linux는 여러분이 생각하는 것보다 훨씬 다릅니다. 다른 운영체계와 달리, 어느 누구도 Linux를 소유하지 않으며 그 대부분이 자원 봉사자들에 의해 개발되었습니다.
pt: Linux rwm como modelo o sistema operativo Unix. Desde o inicio, Linux foi desenhado para ser um sistema multi-tarefa, multi-utilizador. Estes factos são suficientes para tornar Linux diferente de outros sistemas operativos bem conhecidos. No entanto, Linux é mesmo mais diferente do que você possa imaginar. Em contraste com outros sistemas operativos, ninguém é dono de Linux. Muito do seu desenvolvimento é feito por voluntários não pagos.
ru: Linux сделана по образцу операционной системы Unix. С самого начала Linux разрабатывалась как многозадачная, многопользовательская система. Этих факторов достаточно, чтобы сделать Linux отличной от других широко известных операционных систем. Однако, Linux отличается намного сильнее, чем вы можете себе представить. В отличие от других операционных систем, Linux никому не принадлежит. Значительная часть системы разработана добровольцами бесплатно.

source: Development of what later became GNU/Linux began in 1984, when the <ulink url="http://www.gnu.org/">Free Software Foundation</ulink> began development of a free Unix-like operating system called GNU.
ko: 후에 GNU/Linux라고 불리게 된 시스템의 개발은 1984년에 시작되었으며, 이 때, <ulink url="http://www.gnu.org/">자유 소프트웨어 재단(FSF)</ulink>은 Unix와 유사한 운영체계의 개발을 시작하면서 이를 GNU라고 명명하였습니다.
pt: O desenvolvimento do que mais tarde se tornou GNU/Linux começou em 1984, quando a <ulink url="http://www.gnu.org/">Free Software Foundation</ulink> iniciou o desenvolvimento de um sistema operativo livre, ao estilo Unix, chamado GNU.
ru: Разработка того, что позже станет GNU/Linux, началась в 1984 году, когда <ulink url="http://www.gnu.org/">Фонд Свободного Программного обеспечения</ulink> начал разработку свободной Unix-подобной операционной системы, названной GNU.

source: The GNU Project has developed a comprehensive set of free software tools for use with Unix&trade; and Unix-like operating systems such as Linux. These tools enable users to perform tasks ranging from the mundane (such as copying or removing files from the system) to the arcane (such as writing and compiling programs or doing sophisticated editing in a variety of document formats).
ko: GNU 프로젝트는 Unix&trade; 그리고 Linux처럼 Unix와 유사한 운영체계에서 공통으로 사용하기 위한 일련의 자유 소프트웨어 도구를 개발해 왔습니다. 이러한 도구를 이용하여 사용자는 화일을 복사 또는 삭제하는 아주 일상적인 작업부터, 프로그램을 작성하고 컴파일하거나 여러 형태의 문서에 대한 편집에 이르기까지 다양한 작업을 할 수 있습니다.
pt: O GNU Project desenvolveu uma extensa lista de ferramentas de software livre para utilizar com Unix&trade; e sistemas operativos do tipo Unix como o Linux. Estas ferramentas permitem aos utilizadores executar tarefas que vão desde o mundano (como copiar ou remover ficheiros do sistema) ao arcano (como escrever e compilar programas ou editar de forma sofisticada numa variedade de formatos de documentos).
ru: Проект GNU разработал всеобъемлющий набор свободного программного обеспечения для использования в Unix&trade; и Unix-подобных операционных системах, таких как Linux. Эти программы позволяют пользователям выполнять задачи широкого спектра, от простых (копирование или удаление файлов из системы) до сложных (написание и компилирование программ или выполнение сложного редактирования в различных форматах документов).

source: While many groups and individuals have contributed to Linux, the largest single contributor is still the Free Software Foundation, which created not only most of the tools used in Linux, but also the philosophy and the community that made Linux possible.
ko: 수 많은 그룹과 개인들이 Linux에 공헌했지만, 최대의 단독 공헌자는 자유소프트웨어 재단으로, Linux에서 사용하는 도구의 대부분을 개발하고 동시에 Linux라는 것이 가능하도록 한 철학과 공동체를 만들어낸 자유소프트웨어 재단입니다.
pt: Enquanto que muitos grupos e indivíduos contribuíram para GNU/Linux, o maior contribuidor individual continua a ser a Free Software Foundation, que criou não só a maioria das ferramentas utilizadas em GNU/Linux, mas também a filosofia e a comunidade que tornaram GNU/Linux possível.
ru: Хотя многие группы и люди внесли свой вклад в Linux, самым большим из вкладчиков всё ещё является Фонд Свободного Программного Обеспечения, который создал не только большинство инструментов, используемых в Linux, но а также философию и сообщество, которое сделало создание Linux возможным.

source: The <ulink url="&url-kernel-org;">Linux kernel</ulink> first appeared in 1991, when a Finnish computing science student named Linus Torvalds announced an early version of a replacement kernel for Minix to the Usenet newsgroup <userinput>comp.os.minix</userinput>. See Linux International's <ulink url="&url-linux-history;">Linux History Page</ulink>.
ko: <ulink url="&url-kernel-org;">Linux kernel</ulink>은, Linuz Torvalds라는 핀란드의 컴퓨터 공학과 학생이 유즈넷 뉴스그룹인 <userinput>comp.os.minix</userinput>에 Minix를 위한 대체 커널의 초기 버전을 발표한 1991년 처음으로 세상에 그 모습을 나타냈습니다. 자세한 것은 Linux International의 <ulink url="&url-linux-history;">Linux History Page</ulink>를 참고하기 바랍니다.
pt: O <ulink url="&url-kernel-org;">kernel Linux</ulink> apareceu pela primeira vez em 1991, quando um estudante Finlandês de ciência computacional anunciou uma versão prévia de um kernel de substituto para o Minix num newsgroup Usenet <userinput>comp.os.minix</userinput>. Veja a <ulink url="&url-linux-history;">Linux History Page</ulink> da Linux International.
ru: <ulink url="&url-kernel-org;">Ядро Linux</ulink> впервые появилось в 1991 году, когда финский студент-компьютерщик по имени Линус Торвальдс (Linus Torvalds) анонсировал первую версию замены ядра Minix в группе новостей <userinput>comp.os.minix</userinput>. Подробнее смотрите на сайте Linux Internationals <ulink url="&url-linux-history;">страничку истории Linux</ulink>.
